{"id": "d3embCdSYRautbBBoWBW_FxoW2eDL4mfJOv-eD11q3w", "title": "Curators All the Way Down", "body": "***cūrāre:*** **to attend to, to take care of.**\n\n### Introduction\nLast year, I published the piece [Curators are the New Creators](https://gabygoldberg.medium.com/curators-are-the-new-creators-the-business-model-of-good-taste-5852727d4b54), arguing in favor of a business model centered around “good taste.” This piece expands upon that previous work by putting a magnifying glass on the relationship between curation and commerce. I’m grateful and excited to be writing it with [Jesse Lee](https://www.bloomberg.com/news/features/2017-11-14/la-s-new-hype-king-has-cracked-how-millennials-spend) of [Basic.Space](https://basic.space), who’s helped to illuminate the unique relationship between goods and tastemakers.\n\n* * *\n### In 1997, Malcolm Gladwell published his piece The Coolhunt, investigating the process of looking for new fashion trends at street level.\nAccording to Gladwell, the coolhunter plays a [major social role in spreading trends](https://www.pbs.org/wgbh/pages/frontline/shows/cool/interviews/gladwell.html). Coolhunters were “the first to realize… that social status didn’t lay where Madison Avenue had said it lay in the 1950s and 1960s and 1970s — in people with the most education, the most money… [Coolhunters set] that paradigm aside” and placed value instead on personal influence. These were individuals who mastered their crafts by consuming large amounts of information — style, culture, behavior — and figuring out how to digest it all before anyone else. Gladwell argued that the rest of us “rely disproportionately” on these coolhunters when it comes to making decisions.\n\nWe’ll come back to Gladwell later in this piece. But to better connect the dots, let’s first jump to 2011, just over a decade later, when Marc Andreessen published [Why Software Is Eating The World](https://www.wsj.com/articles/SB10001424053111903480904576512250915629460) in a Wall Street Journal op-ed.\n\nAndreessen’s idea was prescient. At the time, many people thought [the future had already arrived](https://techcrunch.com/2016/06/07/software-is-eating-the-world-5-years-later/). The iPhone was four years old; Facebook had nearly [850 million users](https://www.sec.gov/Archives/edgar/data/1326801/000119312512034517/d287954ds1.htm). The Internet had changed everything; it seemed there was nowhere else we needed to go.\n\nOf course, Andreessen proved those people wrong. Uber launched its service in 2010, and Airbnb reached [1 million listings in 2014](https://twitter.com/bchesky/status/541655860271783937). Just as he had predicted, companies across just about every traditional, non-tech industry began [thinking and acting like a software company](https://techcrunch.com/2016/06/07/software-is-eating-the-world-5-years-later/).\n\nWhat Marc Andreessen understood at this tipping point was that technological innovations — like in transportation, with Uber, and hospitality, with Airbnb — often emerge when it seems we need them least.\n\n**So it’s fitting that exactly a decade later, we’ve come to another watershed moment. Software has eaten the world, and now it’s a commodity.** It’s not about the technology anymore. The era of the engineer has ended; the era of the curator has begun.\n* * *\n\nWe can combine the lessons learned from both Gladwell and Andreessen when we look at today’s consumer behavior and purchasing culture. The success of social networks like Tumblr and Instagram over the last two decades helped usher in a transformative shift in how people interact with information online.\n\nWhile [Web 1.0](https://www.techopedia.com/definition/27960/web-10) in the ’90s and early 2000s was static and read-only, Web 2.0 was social and interoperable. This new wave of the Internet emphasized user-generated content and participation across nodes of the network. In 2006, the growing influence of Web 2.0 was acknowledged by [TIME Magazine’s Person of The Year](http://content.time.com/time/specials/packages/0,28757,2019341,00.html):\n\n![](https://images.mirror-media.xyz/publication-images/cec2c8ff-c9fe-4949-9287-0ad841831429.jpg?height=533&width=400)\n\nThe magazine [told a story](http://content.time.com/time/magazine/article/0,9171,1570810,00.html) of “community and collaboration on a scale never seen before. It’s about the cosmic compendium of knowledge Wikipedia and the million-channel people’s network YouTube and the online Metropolis MySpace.” **And we were only scratching the surface.** In 2006, MySpace was the most visited website on the planet; by 2008, it was [eclipsed by Facebook](https://online.maryville.edu/blog/evolution-social-media/). Instagram and Pinterest came on the scene in 2010, and Snapchat in 2011. Five years later, in 2016, the term influencer was officially defined on [Dictionary.com](https://www.dictionary.com/e/influencer/) — and its prominence only went up from there.\n\n![](https://images.mirror-media.xyz/publication-images/fb935dc1-348f-4de4-9923-eebb72944e74.jpg?height=1160&width=2293)\n\nThe combination of all these factors helped lead to what we call today the creator economy, a growing segment made up of the “[independent businesses and side hustles launched by individuals who make money off of their knowledge, skills, or following](https://www.cbinsights.com/research/report/what-is-the-creator-economy/#definition).” New companies emerged across all verticals to fit these creators’ growing needs: [Cameo](https://www.cameo.com) for fan interactions, [Stir](https://www.usestir.com) for financial tooling, [Commsor](https://www.commsor.com) for community, [Maven](https://maven.com) and [Metafy](https://metafy.gg) for online courses, [Makersplace](https://makersplace.com) for NFTs, and a host of others. This year alone, [over $1.3B](https://www.cbinsights.com/research/report/what-is-the-creator-economy/#definition) has been invested into the space.\n\nThe shift to putting creators in the driver’s seat was a long-awaited one. But no good thing comes without unintended consequences. Users were uploading [300 hours of video to YouTube](https://blog.microfocus.com/how-much-data-is-created-on-the-internet-each-day/) every single minute; over 100 million photos were posted to Instagram each day. Even when we look today, it’s [impossible to keep up](https://www.internetlivestats.com) with the number of new Tweets, emails, blog posts, or Google searches every second.\n\n**In short, with democratized access, the web became more saturated than ever before, and as consumers, we began to spend more and more time trying to sort through it all. In a state of analysis paralysis, how do we disaggregate signal from noise?**\n\nThis problem of overabundance is why I wrote [my piece](https://gabygoldberg.medium.com/curators-are-the-new-creators-the-business-model-of-good-taste-5852727d4b54) last year. As consumption of digital media increased, we began to see a larger volume of curators — coolhunters, just like Gladwell had outlined in ’97, but this time in a digital space. On Tumblr, this looked like blogs of curated art or photography; on Pinterest, we saw well-crafted collections of clothing, recipes, or furniture. Even on Instagram, curated meme accounts like [@thefatjewish](https://www.instagram.com/thefatjewish/) and [@fuckjerry](https://www.instagram.com/fuckjerry/) exploded in popularity due to their easily digestible and shareable content.\n\nBut being a curator isn’t as simple as it might seem. In what we like to call the Social Media Paradox, there’s an often overlooked difference between following someone to be entertained and following someone to make a purchase. **Put simply, influence is not synonymous with taste.** This misunderstanding plays out in real-time: some influencers have large followings but still struggle to monetize, while others — oftentimes curators, or coolhunters — can successfully monetize without developing an image or personal brand. We’ve seen this particularly over the last few years, as a myriad of primarily anonymous Instagram accounts like [HIDDEN®](https://www.instagram.com/hidden.ny/), [Nineties Anxiety](https://www.instagram.com/90sanxiety/), [Furniture Archive](https://www.instagram.com/furniturearchive/), and [New Bottega](https://www.instagram.com/newbottega/) have risen in influence as prominent tastemakers for the next generation of fashion and culture.\n\n> “You have to be obsessed with the media to keep up. In my opinion, a constant stream of your favorite things is much more telling than photos of your day to day life… my followers know me much more intimately than a typical influencer.”\n>\n> — *HIDDEN® in [Highsnobiety](https://www.highsnobiety.com/p/hidden-ny-interview/)*\n\n![](https://images.mirror-media.xyz/publication-images/27203074-188c-45de-8515-2b5da3e83eb6.png?height=1365&width=2880)\n\nOf course, these Instagram accounts weren’t the first curators to reach the digital mainstream. **Kanye West’s impact in music and production helped pave the way in this domain, building a multi-billion dollar enterprise via fashion and design.** On the music front, Kanye directly influenced rappers like [Travis Scott](https://www.travisscott.com), [Kid Cudi](http://www.kidcudi.com), [Chance the Rapper](https://www.chanceraps.com), and [Big Sean](https://www.uknowbigsean.com). Even [Drake](https://drakerelated.com) and [the Weeknd](https://www.theweeknd.com) [come from Kanye’s lineage](https://www.latimes.com/entertainment/music/la-ca-ms-fall-arts-kanye-west-heartbreak-20150913-story.html) to some degree. And in terms of design, Kanye is not a technical designer as much as an arbiter of cool, with a team of creative talent to help realize his vision. Kanye continually pushes the curation flywheel forward: some of the people who worked on his team over the last decade are now wildly successful creatives and designers themselves, including the likes of [Virgil Abloh](https://canary---yellow.com), [Matthew Williams](https://www.instagram.com/matthewmwilliams/), [Heron Preston](https://www.heronpreston.com/en-us/), and [Jerry Lorenzo](https://www.instagram.com/jerrylorenzo/). Now, these people are the coolhunters, the ones searching on the ground floor for people like HIDDEN® and his counterparts.\n\nIn *The Coolhunt*, Gladwell wrote that fashion trends used to be set by the big couture houses — when cool was trickle-down. “[But sometime in the past few decades things got turned over, and fashion became trickle-up.](https://www.newyorker.com/magazine/1997/03/17/the-coolhunt)” **He was exactly right.**\n\nhttps://twitter.com/gaby_goldberg/status/1423483220763443201?s=20\n\n### Now, culture is more decentralized than it’s ever been.\nJust like we saw in TIME’s 2006 Person of the Year — if Web 2.0 was all about you, then Web 3.0 is all about us.\n\n![](https://images.mirror-media.xyz/publication-images/6e16ef4e-0250-4ab8-bffa-7363fc36ad28.jpg?height=640&width=480)\n\nWhen we look back over the past 100 years, traditional commerce (and the culture it indirectly endorsed) was primarily curated by a single person’s point-of-view. Even when commerce moved online, to places like Amazon or [Farfetch](https://www.farfetch.com), retailers still controlled the types of things consumers purchased. Online commerce didn’t innovate a new shopping experience; it just brought brick-and-mortar to online. This was an improvement in convenience, not fidelity. To be clear, this model didn’t include consumers in the equation, **because it didn’t need to.**\n\nNow, in today’s state of overabundance, this power dynamic has shifted. **Consumers are only getting smarter, and we want something better** — better sources, better designs, and better durability (both in value and sustainability). Today, it’s fidelity over convenience. And when curation is at the forefront of every purchasing decision, **trust is currency.**\n\nIt’s why we see success in companies like [Basic.Space](https://basic.space), which sits at the intersection of curation and commerce. By curating not just products but *sellers*, too, Basic Space celebrates the rugged individualists of tomorrow while simultaneously giving the rest of the world direct access. This is how curation scales.\n\n* * *\n\nAs Marc Andreessen told us in his 2011 op-ed, innovations in technology often occur when it seems we need them least. Today, buying products online has never been easier. Convenience is at an all-time high, and consumers have more options than ever before. It seems, once again, that there is nowhere else we need to go. And yet, this is precisely the problem.\n\nIn today’s oversaturated world, we need curators to help us separate signal from noise. Gladwell told us about coolhunters in ’97, and they’ve now emerged as a solution in digital space. **Culture is officially trickle-up; to tell us where to go, we believe it’ll be curators all the way down.**\n\n* * *\n\n*Cover artwork by [Ilya](https://twitter.com/ilya2x).*\n\n*Thank you to Tyler Angert, Alex Mahedy, Tony Lashley, Brian Flynn, Erik Torenberg, Jarrod Dicker, Adi Sidapara, Ian Kar, and Nick Sarath for their thoughts and feedback. Most of all, thank you to Jesse Lee for the opportunity to collaborate on such an energizing and forward-thinking piece.*", "timestamp": 1628517055, "digest": "qvnNJhylZz-w6t4ubZzHfxd5gP17zDAXa6ruwOyO7sc", "contributor": "0x01b7baA7baA864fEF3CD1C7bc118Cc97cEdCB33f"}
{"id": "0WDFC7gbWSCQVnUfzPsbiGWK-sVXUuxWGSttNyGjGiI", "title": "CRYPTOPILLED", "body": "## *How I went from knowing next to nothing about crypto to having a full-time job in web3, all in under 6 months*\n\nAt the beginning of this year I knew next to nothing about the world of web3 or crypto. Six months later, I quit my job to take a full-time position in the industry.\n\nWhat happened? \n\nThis is the story of some of the major moments within that half-year and the lessons I learned along the way.\n\nIn January of 2021 I felt dissatisfied with the web. I had been feeling this way for years. Don’t get me wrong, there’s a lot that I love about the internet and the communities that it creates. I would have had a *very* different pandemic lockdown experience without spaces like Twitter and the ability to connect with friends and family online.\n\nAnd yet! \n\nSomewhere along the way, the web began to feel stagnant. All technology grows in fits and starts, but it felt like our period of relative dullness had been going on for far too long. \n\nThen, just like that, everything changed.\n\nIn February of 2021 I started hearing rumblings about NFTs. People were saying that these ‘non-fungible tokens’ were a new way for artists to create work online while providing both provenance and patronage. Some of the most interesting people on my Twitter timeline began posting about their upcoming projects. My Clubhouse homepage shifted from conversations about influencers to conversations about cryptocurrency and ‘minting’ NFTs. I watched as internet friends began to sell the work they had created for amounts of money that seemed unfathomable. Thousands of dollars in profits, for digital art? What was happening?\n\nI'm a long-time believer that we need to bring value back to art, but that's definitely not what happened in web 2.0. In an internet where attention seems fleeting and follower counts matter more than anything else, profits have been squeezed out and we've reduced 'art' down to 'content'. \n\nBut the NFTs I saw being sold didn't look like 'content'. They looked like real art being taken seriously by a real community.\n\nI decided to dive in.\n\n### GETTING STARTED IN THE WORLD OF WEB3 - HOW TO SET UP A WALLET AND BUY ETH\n\nTo participate in web3, the first thing you have to do is set up a wallet. Two of the best and most used wallets are [Rainbow](https://rainbow.me/) and [MetaMask](https://metamask.io/), the former of which lives natively as an iOS app and the latter as a Chrome extension. I initially went with MetaMask and immediately recognized the striking difference from a traditional username and password. MetaMask gave me a ‘seed phrase’, a string of 12 words that I absolutely could *not* share or forget. It felt scary but also enticing; this high-stakes web intimidated me *because* of its potential. Most people aren’t that concerned with having their email or social platforms hacked. Why would they be when the worst case scenario is typically a spammy post about buying fake Raybans posted on their profile? You can change your password, delete the post, and forget it ever happened. In the web3 world, getting hacked has real ramifications. How exciting, the idea of a web that actually has the power to change your life, and a secret phrase that actually needs protecting!\n\nI purchased some Ethereum, the digital currency that NFTs run on, and added it to my wallet. A jarring in in seeing how ‘little’ trading your dollars for crypto gets you. Converting $500 and receiving a fraction of a whole number (.2 ETH at the time of this writing) can be hard to understand. Another part of the transaction that’s challenging to newcomers: Recognizing that making any move has a cost. Because everything is hosted 'on-chain' there's a transaction price (called a 'gas fee') attached to anything you might want to do. \n\nWant to buy ETH? Pay gas.\n\nWant to create an NFT? Pay gas. \n\nWant to bid on an NFT? Pay gas. \n\nWant to transfer your ETH back to USD? Pay gas.\n\nJust like gasoline, these fees fluctuate in price based on demand. In the early days these transactions were pennies. But with the popularity of web3 on the rise, they're often now in the $20 range. At the height of the NFT craze, they were in the $100s. Even though the transaction fees can be painful, they’re a vital part of the ecosystem. Not only do they prevent the type of spammy behavior that gets us fake Ray-Ban ads on Instagram, they also add a layer of security as thousands of computers all compete to process transactions accurately and include them in the blockchain ledger.\n\nWith ETH in my wallet, I began the process of creating my first NFT. \n\n### MINTING YOUR FIRST NFT - HOW IT WORKS AND UNDERSTANDING THE PLATFORMS\n\nOne of the first steps any prospective NFT creator has to make is determining which platform it will live on. When I first started, there were a few options open to me: [Foundation](https://foundation.app/), [Zora](https://zora.co/), and [OpenSea](https://opensea.io/). The former two were both invite-only, and I didn’t want to scoop up a precious invite from a friend only to realize that it wasn't for me. OpenSea (as the name might suggest) requires no invite and is open to all. They were also doing something that intrigued me that they called ‘gasless minting’. \n\nPublishing an NFT is called ‘minting’, and as I mentioned earlier, almost every move within the web3 world requires gas. On OpenSea your *first* NFT requires gas, but after that you can make as many as you want without paying that upfront fee. Instead, gas is collected later upon purchase by a collector.\n\nThinking about what type of art I wanted to create, this immediately appealed to me, as I didn't have a singular key piece of work that I wanted to upload. I intended to publish a collection that felt like it would fit nicely within the space. Years ago I had taken a series of photographs of cups of espresso, before and after drinking. The photos had always delighted me but they felt weird online — who actually wanted to see espresso cups on Instagram? \n\nI minted a set of 6 photos and listed them for .1 ETH each (at the time, about $150). Then I went to bed.\n\nhttps://twitter.com/drewcoffman/status/1364097164452892674?s=20\n\nI woke up, opened my computer, and realized that one had already sold. Over the next two days I watched as people snatched up my coffee photos, some of them new Twitter friends, others complete strangers or anonymous. \n\nI had been taking photos for 15 years and no one had ever bought my work. Now, I had sold half a dozen and made $1,000, all by pressing buttons on an online marketplace.\n\nI instantly began thinking about the next project I wanted to mint. I had been working on a video project months prior and abandoned it because I didn't know where it would belong. A short-form music video set to a friend’s music, it didn't fit on my YouTube channel and felt like way too much work to just post on Twitter or Instagram. Could this exist as an NFT? Maybe! I re-assessed the footage and, with my friend's blessing, finished the project over a weekend and minted it, this time to Foundation.\n\n[NFT](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/927)\n\nAnd…it didn't sell!\n\nTo this day, the NFT remains available on Foundation, unsold. And that's okay! **Part of the beauty of the world of NFTs is that the art you create should be just as valuable in your own wallet as it is in someone else's. **Further, because of the nature of the blockchain, this art is *permanent***. If you believe in the world of web3, there's value in letting your work exist on-chain for years to come, whether it sells or not. My NFT lives on the blockchain, future-proofed in a way that anything I host on a centralized platform like Instagram will simply never be.\n\n### FINDING COMMUNITY\n\nFully committed to web3 at this point, I began doing everything I could to find other people within the community. I set up my [ENS domain](https://ens.domains/) and changed my Twitter name to drewcoffman.eth. I followed web3 people on Twitter and joined web3 conversations on Clubhouse. Through a combination of both, I became connected to a group called [Tech0ptimist](https://techoptimist.xyz/) who had [just minted an NFT on Foundation](https://foundation.app/@optimist/cabbage-01-453). As the auction countdown ended, they created a Clubhouse room to cheer the sale and affirm the entire NFT ecosystem. Through the conversation I learned about a mysterious art collector and anonymous Twitter egg named [Aito](https://twitter.com/thisisaito) who was building a serious collection of NFTs. We celebrated Aito on Twitter and Clubhouse. As we joked about him being a 'patron saint' I created an NFT using a photo of a church statue I had taken and swapped out the face, replacing it with an egg. I minted it, posted it to Twitter, and in minutes watched as the NFT disappeared from my wallet — bought by Aito himself.\n\nhttps://twitter.com/drewcoffman/status/1365840718867046400?s=20\n\n[Vision of Aito](https://opensea.io/assets/0x495f947276749ce646f68ac8c248420045cb7b5e/90294439017461790840607179782906946497870244260757743588084955982996617297921) was the first piece of egg-based art to commemorate the patron, and a deluge quickly flooded the marketplaces as artists fought for Aito's attention. Like any art space, the world of NFTs responded to what works, with artists building off each other as they learned what fits. I experienced this myself as I played around with an idea for my next NFT and saw someone else in the community making something that I loved. An artist named [Kate the Cursed](https://twitter.com/katecursed) used a CRT television and a modded SNES to create [glitched-out Mario Paint masterpieces](https://foundation.app/@kate-the-cursed/gamma-ray-graffiti-7694). They were incredible, and seeing someone else make CRT-based art was all the affirmation I needed to go out and make my own. \n\nI once again collaborated with my musician friend and worked for 48 hours to create an NFT I called ‘[◇ 𖥂 ◇ // modular patch](https://foundation.app/@drewcoffman/modular-patch-10266)’, a vaguely ominous looping video of kaleidoscopic visuals set to a synth score, all playing out within a CRT television screen. I felt *extremely* proud of it, not only because I loved what I made but because it felt web3 native. Where in the world of web 2.0 could something like this possibly thrive? Vine existed as a brief paradise for this type of work, but quickly sunsetted and never let the artists actually profit from what they created. To post a looping video on a social platform like Instagram or Twitter just felt underwhelming, and to put it on your own personal site typically meant that it would languish, unseen by all. NFTs were doing something beyond offering a path forward for artists: They were offering a path forward for *art*.\n\n[NFT](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/10266)\n\nTo my surprise (especially since the last NFT I had made never sold), my piece received a bid almost immediately (from internet friend [Jstn](https://twitter.com/jstn) — thanks Jstn!!) and then before it could sell, received another bid. Then another. And another. And another. \n\nJust like my espresso photos were the first time I had ever sold art for profit, this was the first time I had ever seen people fight over something I made. It felt overwhelming to know that my work resonated with others.\n\nThe NFT sold for .8 ETH, a number that would have felt impossible hours before. Instead of cashing out, I used my newfound ETH within the web3 space. I bought an NFT from an avatar project that I loved. I bought another from an artist that seemed up and coming. That instantly proved to be the case, as I sold the same piece a single day later for four times as much as I paid for it. \n\nAnd in one of my best moves, I bought into FWB, a token-gated community.\n\n### GETTING INVOLVED - SOCIAL TOKENS, DAOs, AND GOVERNANCE\n\n[FWB](https://www.fwb.help/) (Friends with Benefits) is a community that you can only access if you’re holding a certain amount of their token in your wallet. Once you hold that amount and apply to join, you get access to the Discord and the insights of the people within. \n\nThat's it! Mostly. Since I joined, FWB has created new initiatives to add more value for owners. They’ve held in-person parties, created city guides, and now send out a weekly TL;DR newsletter to catch people up on the most important news in and around web3. \n\nAt the time of joining, it cost me approximately $500 to enter (and at the time of this writing, entry is valued at around $1,750) which is an incredible price to pay to enter a chatroom — but web3 solves this in a way that web 2.0 never could. I’ve always been wary of gated courses, cohorts, and communities that tell you that by paying a certain amount of money you'll gain access to knowledge and people in a way that you otherwise couldn’t. These, in my experience, almost always disappoint.\n\nThey look enticing from the outside, but once you're in you realize that it's just a structured version of what you could have learned on your own — and of course, there's no refunds. In web3, if you join a token-gated community like FWB and realize that it isn't for you, you can *just sell the coins back and walk away*. This means that a community can't rely on shady tactics and an enticing outer wall to get you to join. It actually has to be good!\n\nFWB, it turns out, was *very, very good*. Accustomed to the cryptobro and wallstreetbets types of communities that often pop up in these spaces, I worried that this group might prove to be toxic at worst and unintentionally exclusionary at best. Instead, I found a friendly, extremely welcoming, diverse, and inclusive crowd. And the channels listed in the Discord weren't just about NFTs and crypto, there were lifestyle channels that included thoughtful conversations about not only music and books but more surprising topics like food and skincare! The people in FWB were truly *friends with benefits*, they had insights and understanding about each of these spaces that I began to pore over, learning not just about the web3 world but the *world as a whole* in ways that I’m very thankful for. And to top it all off, there were geolocated channels, with one of the most active centered in LA. That’s where I am!\n\nSoon after I joined some people from the group began planning one of their initial IRL meetups post-COVID. I went, meeting web3 people in person. FWB felt like the first opportunity that I had to really get *involved* at a community level with something that interested me. And they were still figuring out what they wanted to become in ways that made making meaningful contributions possible. Many web3 organizations and communities have ‘governance’ which allows for decision-making to be decentralized and democratized. Instead of a single person at the top of the food chain making all of the decisions (for better or worse), decisions can be brought to vote. In communities like FWB, if you hold the token, you get to vote. Easy! The challenge (as in IRL situations) lies in *getting people to actually vote*, as most simply don’t bother.\n\nSo, FWB set up a governance committee responsible for ensuring that, among other things, proposals were being understood and seen by members. I quickly began to see more and more governance opportunities and communities pop up. Many of these call themselves DAOs, ‘Decentralized Autonomous Organizations’, a web3 equivalent of an LLC that can take collective action quickly. Some of these, like [PleasrDAO](https://pleasr.org/), focus on purchasing important NFTs. Others, like [Aave Grants](https://twitter.com/aavegrants?lang=en), push an organization’s purpose forward and democratize its future. Others, like [CityDAO](https://city.mirror.xyz/mZOpFWkTi0M2lVE1PsT1e2sJwdUT4PdgetHw_S4hS5A) organize to buy land in the real world.\n\nFWB posted an application form for members to join their governance committee. I clicked it, and then…closed the tab. I’d never been on a governance committee in my life. What could I possibly contribute? Then I realized that being interested in governance and not knowing how to contribute made me the *ideal* candidate for a committee dedicated to moving members from ‘interested’ to ‘activated’. I applied. A few days later, my application got accepted.\n\nOn the governance committee I began helping run monthly FWB Town Halls and set the agenda. I also kept tabs on the dedicated Governance channel and answered any questions people had, making sure that feedback (especially the negative stuff) got seen by staff so that they could course-correct and ensure that people were being heard. As in much of life, certain decisions which were making people grumpy weren't coming from a place of malice, but messiness. So much was so new *so fast* that things were slipping through the cracks. The governance committee helped fix this, leading to a more positive and engaged community overall.\n\nThe governance committee came with a stipend, making it my first paid role in web3 — and they paid in *crypto*, not US dollars. This change fascinated me. Up until this point everything I had done had been funded by that initial deposit in my wallet from USD and the sales from my subsequent NFTs.\n\nNow, after being paid for my art, I was being paid for my participation. \n\n### GOING FULL-TIME\n\nAs the months flew by, I became more and more invested. I met [Justin Boreta](https://twitter.com/boreta) and worked to release [The Song That Owns Itself](https://stoi.org/) (STOI for short), an experiment in ownership where social tokens were given away,  representing ownership in the song itself. I learned about [CabinDAO](https://creators.mirror.xyz/20Eyc57rknNJYL9vJa11zvupU_MXP7NZJUADTzTlCjQ), which crowdfunded resources to create artist residencies, offering up physical space on 30 acres of Texas countryside. As I spent more and more time thinking about web3, I realized how much I wanted to spend *all* of my time thinking about web3. Up to this point, I had been working a full-time job as a Community Manager for a web 2.0 company. Though I loved that work, it became obvious that I felt passionate about pushing this new technology forward. \n\nAn internet friend, [Jackson Dame](https://twitter.com/jacksondame), had just quit their job and taken a role at Rainbow.  I sent them a DM saying that I was interested in doing the same thing. They told me they’d keep an eye out for openings, and to my surprise I began hearing from *many* companies with *many* openings. I realized that a background in Community and Marketing was a major strength in this industry. Tons of projects had momentum behind them and developers were in desperate need of people who could take the reins of these burgeoning audiences. \n\nI interviewed with half-a-dozen web3 organizations until I found one that felt both like a perfect fit and a beautiful closed loop: I joined Aito’s team to work on building out his vision for web3.\n\nSix months ago, I never would have imagined that my life would look so different, centered on a world that I knew nothing about. I couldn’t be happier. Reflecting back, one of the main characteristics of web3 that made me dive in so quickly was its deep value for community. Though the crypto world is unfortunately equated in some people’s minds with get-rich-quick schemes, that simply hasn’t been my experience at all. Instead I’ve found a community of creators who want to push art forward and build a better internet that harkens back to the internet's best days. I think that my desire to be a part of that community is a big part of what made my journey successful. I wasn't focused on selling as many NFTs as possible or networking for networking’s sake; I was investing myself into a community of builders, and now I’m excited to be building right alongside them. \n\nEvery day I wake up looking forward to being a part of the future of web3.\n\nHere's to the next six months.", "timestamp": 1628519378, "digest": "Hu10Kv89stQ16ix6CS4k73tCpVhlY_r3dwE2L1-uZo0", "contributor": "0xc7A0D765C3aF6E2710bA05A56c5E2cA190C2E11e"}
{"id": "Ka7NU4EF3MMzvuqN3iwUU2aTEk3yuJ4LCsA0GeoATWY", "title": "CRYPTOPILLED", "body": "## *How I went from knowing next to nothing about crypto to taking a full-time job in web3, all in under 6 months*\n\nAt the beginning of this year I knew next to nothing about the world of web3 or crypto. Six months later, I quit my job to take a full-time position in the industry.\n\nWhat happened? \n\nThis is the story of some of the major moments within that half-year and the lessons I learned along the way.\n\nIn January of 2021 I felt dissatisfied with the web. I had been feeling this way for years. Don’t get me wrong, there’s a lot that I love about the internet and the communities that it creates. I would have had a *very* different pandemic lockdown experience without spaces like Twitter and the ability to connect with friends and family online.\n\nAnd yet! \n\nSomewhere along the way, the web began to feel stagnant. All technology grows in fits and starts, but it felt like our period of relative dullness had been going on for far too long. \n\nThen, just like that, everything changed.\n\nIn February of 2021 I started hearing rumblings about NFTs. People were saying that these ‘non-fungible tokens’ were a new way for artists to create work online while providing both provenance and patronage. Some of the most interesting people on my Twitter timeline began posting about their upcoming projects. My Clubhouse homepage shifted from conversations about influencers to conversations about cryptocurrency and ‘minting’ NFTs. I watched as internet friends began to sell the work they had created for amounts of money that seemed unfathomable. Thousands of dollars in profits, for digital art? What was happening?\n\nI'm a long-time believer that we need to bring value back to art, but that's definitely not what happened in web 2.0. In an internet where attention seems fleeting and follower counts matter more than anything else, profits have been squeezed out and we've reduced 'art' down to 'content'. \n\nBut the NFTs I saw being sold didn't look like 'content'. They looked like real art being taken seriously by a real community.\n\nI decided to dive in.\n\n### GETTING STARTED IN THE WORLD OF WEB3 - HOW TO SET UP A WALLET AND BUY ETH\n\nTo participate in web3, the first thing you have to do is set up a wallet. Two of the best and most used wallets are [Rainbow](https://rainbow.me/) and [MetaMask](https://metamask.io/), the former of which lives natively as an iOS app and the latter as a Chrome extension. I initially went with MetaMask and immediately recognized the striking difference from a traditional username and password. MetaMask gave me a ‘seed phrase’, a string of 12 words that I absolutely could *not* share or forget. It felt scary but also enticing; this high-stakes web intimidated me *because* of its potential. Most people aren’t that concerned with having their email or social platforms hacked. Why would they be when the worst case scenario is typically a spammy post about buying fake Raybans posted on their profile? You can change your password, delete the post, and forget it ever happened. In the web3 world, getting hacked has real ramifications. How exciting, the idea of a web that actually has the power to change your life, and a secret phrase that actually needs protecting!\n\nI purchased some Ethereum, the digital currency that NFTs run on, and added it to my wallet. A jarring in in seeing how ‘little’ trading your dollars for crypto gets you. Converting $500 and receiving a fraction of a whole number (.2 ETH at the time of this writing) can be hard to understand. Another part of the transaction that’s challenging to newcomers: Recognizing that making any move has a cost. Because everything is hosted 'on-chain' there's a transaction price (called a 'gas fee') attached to anything you might want to do. \n\nWant to buy ETH? Pay gas.\n\nWant to create an NFT? Pay gas. \n\nWant to bid on an NFT? Pay gas. \n\nWant to transfer your ETH back to USD? Pay gas.\n\nJust like gasoline, these fees fluctuate in price based on demand. In the early days these transactions were pennies. But with the popularity of web3 on the rise, they're often now in the $20 range. At the height of the NFT craze, they were in the $100s. Even though the transaction fees can be painful, they’re a vital part of the ecosystem. Not only do they prevent the type of spammy behavior that gets us fake Ray-Ban ads on Instagram, they also add a layer of security as thousands of computers all compete to process transactions accurately and include them in the blockchain ledger.\n\nWith ETH in my wallet, I began the process of creating my first NFT. \n\n### MINTING YOUR FIRST NFT - HOW IT WORKS AND UNDERSTANDING THE PLATFORMS\n\nOne of the first steps any prospective NFT creator has to make is determining which platform it will live on. When I first started, there were a few options open to me: [Foundation](https://foundation.app/), [Zora](https://zora.co/), and [OpenSea](https://opensea.io/). The former two were both invite-only, and I didn’t want to scoop up a precious invite from a friend only to realize that it wasn't for me. OpenSea (as the name might suggest) requires no invite and is open to all. They were also doing something that intrigued me that they called ‘gasless minting’. \n\nPublishing an NFT is called ‘minting’, and as I mentioned earlier, almost every move within the web3 world requires gas. On OpenSea your *first* NFT requires gas, but after that you can make as many as you want without paying that upfront fee. Instead, gas is collected later upon purchase by a collector.\n\nThinking about what type of art I wanted to create, this immediately appealed to me, as I didn't have a singular key piece of work that I wanted to upload. I intended to publish a collection that felt like it would fit nicely within the space. Years ago I had taken a series of photographs of cups of espresso, before and after drinking. The photos had always delighted me but they felt weird online — who actually wanted to see espresso cups on Instagram? \n\nI minted a set of 6 photos and listed them for .1 ETH each (at the time, about $150). Then I went to bed.\n\nhttps://twitter.com/drewcoffman/status/1364097164452892674?s=20\n\nI woke up, opened my computer, and realized that one had already sold. Over the next two days I watched as people snatched up my coffee photos, some of them new Twitter friends, others complete strangers or anonymous. \n\nI had been taking photos for 15 years and no one had ever bought my work. Now, I had sold half a dozen and made $1,000, all by pressing buttons on an online marketplace.\n\nI instantly began thinking about the next project I wanted to mint. I had been working on a video project months prior and abandoned it because I didn't know where it would belong. A short-form music video set to a friend’s music, it didn't fit on my YouTube channel and felt like way too much work to just post on Twitter or Instagram. Could this exist as an NFT? Maybe! I re-assessed the footage and, with my friend's blessing, finished the project over a weekend and minted it, this time to Foundation.\n\n[NFT](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/927)\n\nAnd…it didn't sell!\n\nTo this day, the NFT remains available on Foundation, unsold. And that's okay! **Part of the beauty of the world of NFTs is that the art you create should be just as valuable in your own wallet as it is in someone else's. **Further, because of the nature of the blockchain, this art is *permanent***. If you believe in the world of web3, there's value in letting your work exist on-chain for years to come, whether it sells or not. My NFT lives on the blockchain, future-proofed in a way that anything I host on a centralized platform like Instagram will simply never be.\n\n### FINDING COMMUNITY\n\nFully committed to web3 at this point, I began doing everything I could to find other people within the community. I set up my [ENS domain](https://ens.domains/) and changed my Twitter name to drewcoffman.eth. I followed web3 people on Twitter and joined web3 conversations on Clubhouse. Through a combination of both, I became connected to a group called [Tech0ptimist](https://techoptimist.xyz/) who had [just minted an NFT on Foundation](https://foundation.app/@optimist/cabbage-01-453). As the auction countdown ended, they created a Clubhouse room to cheer the sale and affirm the entire NFT ecosystem. Through the conversation I learned about a mysterious art collector and anonymous Twitter egg named [Aito](https://twitter.com/thisisaito) who was building a serious collection of NFTs. We celebrated Aito on Twitter and Clubhouse. As we joked about him being a 'patron saint' I created an NFT using a photo of a church statue I had taken and swapped out the face, replacing it with an egg. I minted it, posted it to Twitter, and in minutes watched as the NFT disappeared from my wallet — bought by Aito himself.\n\nhttps://twitter.com/drewcoffman/status/1365840718867046400?s=20\n\n[Vision of Aito](https://opensea.io/assets/0x495f947276749ce646f68ac8c248420045cb7b5e/90294439017461790840607179782906946497870244260757743588084955982996617297921) was the first piece of egg-based art to commemorate the patron, and a deluge quickly flooded the marketplaces as artists fought for Aito's attention. Like any art space, the world of NFTs responded to what works, with artists building off each other as they learned what fits. I experienced this myself as I played around with an idea for my next NFT and saw someone else in the community making something that I loved. An artist named [Kate the Cursed](https://twitter.com/katecursed) used a CRT television and a modded SNES to create [glitched-out Mario Paint masterpieces](https://foundation.app/@kate-the-cursed/gamma-ray-graffiti-7694). They were incredible, and seeing someone else make CRT-based art was all the affirmation I needed to go out and make my own. \n\nI once again collaborated with my musician friend and worked for 48 hours to create an NFT I called ‘[◇ 𖥂 ◇ // modular patch](https://foundation.app/@drewcoffman/modular-patch-10266)’, a vaguely ominous looping video of kaleidoscopic visuals set to a synth score, all playing out within a CRT television screen. I felt *extremely* proud of it, not only because I loved what I made but because it felt web3 native. Where in the world of web 2.0 could something like this possibly thrive? Vine existed as a brief paradise for this type of work, but quickly sunsetted and never let the artists actually profit from what they created. To post a looping video on a social platform like Instagram or Twitter just felt underwhelming, and to put it on your own personal site typically meant that it would languish, unseen by all. NFTs were doing something beyond offering a path forward for artists: They were offering a path forward for *art*.\n\n[NFT](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/10266)\n\nTo my surprise (especially since the last NFT I had made never sold), my piece received a bid almost immediately (from internet friend [Jstn](https://twitter.com/jstn) — thanks Jstn!!) and then before it could sell, received another bid. Then another. And another. And another. \n\nJust like my espresso photos were the first time I had ever sold art for profit, this was the first time I had ever seen people fight over something I made. It felt overwhelming to know that my work resonated with others.\n\nThe NFT sold for .8 ETH, a number that would have felt impossible hours before. Instead of cashing out, I used my newfound ETH within the web3 space. I bought an NFT from an avatar project that I loved. I bought another from an artist that seemed up and coming. That instantly proved to be the case, as I sold the same piece a single day later for four times as much as I paid for it. \n\nAnd in one of my best moves, I bought into FWB, a token-gated community.\n\n### GETTING INVOLVED - SOCIAL TOKENS, DAOs, AND GOVERNANCE\n\n[FWB](https://www.fwb.help/) (Friends with Benefits) is a community that you can only access if you’re holding a certain amount of their token in your wallet. Once you hold that amount and apply to join, you get access to the Discord and the insights of the people within. \n\nThat's it! Mostly. Since I joined, FWB has created new initiatives to add more value for owners. They’ve held in-person parties, created city guides, and now send out a weekly TL;DR newsletter to catch people up on the most important news in and around web3. \n\nAt the time of joining, it cost me approximately $500 to enter (and at the time of this writing, entry is valued at around $1,750) which is an incredible price to pay to enter a chatroom — but web3 solves this in a way that web 2.0 never could. I’ve always been wary of gated courses, cohorts, and communities that tell you that by paying a certain amount of money you'll gain access to knowledge and people in a way that you otherwise couldn’t. These, in my experience, almost always disappoint.\n\nThey look enticing from the outside, but once you're in you realize that it's just a structured version of what you could have learned on your own — and of course, there's no refunds. In web3, if you join a token-gated community like FWB and realize that it isn't for you, you can *just sell the coins back and walk away*. This means that a community can't rely on shady tactics and an enticing outer wall to get you to join. It actually has to be good!\n\nFWB, it turns out, was *very, very good*. Accustomed to the cryptobro and wallstreetbets types of communities that often pop up in these spaces, I worried that this group might prove to be toxic at worst and unintentionally exclusionary at best. Instead, I found a friendly, extremely welcoming, diverse, and inclusive crowd. And the channels listed in the Discord weren't just about NFTs and crypto, there were lifestyle channels that included thoughtful conversations about not only music and books but more surprising topics like food and skincare! The people in FWB were truly *friends with benefits*, they had insights and understanding about each of these spaces that I began to pore over, learning not just about the web3 world but the *world as a whole* in ways that I’m very thankful for. And to top it all off, there were geolocated channels, with one of the most active centered in LA. That’s where I am!\n\nSoon after I joined some people from the group began planning one of their initial IRL meetups post-COVID. I went, meeting web3 people in person. FWB felt like the first opportunity that I had to really get *involved* at a community level with something that interested me. And they were still figuring out what they wanted to become in ways that made making meaningful contributions possible. Many web3 organizations and communities have ‘governance’ which allows for decision-making to be decentralized and democratized. Instead of a single person at the top of the food chain making all of the decisions (for better or worse), decisions can be brought to vote. In communities like FWB, if you hold the token, you get to vote. Easy! The challenge (as in IRL situations) lies in *getting people to actually vote*, as most simply don’t bother.\n\nSo, FWB set up a governance committee responsible for ensuring that, among other things, proposals were being understood and seen by members. I quickly began to see more and more governance opportunities and communities pop up. Many of these call themselves DAOs, ‘Decentralized Autonomous Organizations’, a web3 equivalent of an LLC that can take collective action quickly. Some of these, like [PleasrDAO](https://pleasr.org/), focus on purchasing important NFTs. Others, like [Aave Grants](https://twitter.com/aavegrants?lang=en), push an organization’s purpose forward and democratize its future. Others, like [CityDAO](https://city.mirror.xyz/mZOpFWkTi0M2lVE1PsT1e2sJwdUT4PdgetHw_S4hS5A) organize to buy land in the real world.\n\nFWB posted an application form for members to join their governance committee. I clicked it, and then…closed the tab. I’d never been on a governance committee in my life. What could I possibly contribute? Then I realized that being interested in governance and not knowing how to contribute made me the *ideal* candidate for a committee dedicated to moving members from ‘interested’ to ‘activated’. I applied. A few days later, my application got accepted.\n\nOn the governance committee I began helping run monthly FWB Town Halls and set the agenda. I also kept tabs on the dedicated Governance channel and answered any questions people had, making sure that feedback (especially the negative stuff) got seen by staff so that they could course-correct and ensure that people were being heard. As in much of life, certain decisions which were making people grumpy weren't coming from a place of malice, but messiness. So much was so new *so fast* that things were slipping through the cracks. The governance committee helped fix this, leading to a more positive and engaged community overall.\n\nThe governance committee came with a stipend, making it my first paid role in web3 — and they paid in *crypto*, not US dollars. This change fascinated me. Up until this point everything I had done had been funded by that initial deposit in my wallet from USD and the sales from my subsequent NFTs.\n\nNow, after being paid for my art, I was being paid for my participation. \n\n### GOING FULL-TIME\n\nAs the months flew by, I became more and more invested. I met [Justin Boreta](https://twitter.com/boreta) and worked to release [The Song That Owns Itself](https://stoi.org/) (STOI for short), an experiment in ownership where social tokens were given away,  representing ownership in the song itself. I learned about [CabinDAO](https://creators.mirror.xyz/20Eyc57rknNJYL9vJa11zvupU_MXP7NZJUADTzTlCjQ), which crowdfunded resources to create artist residencies, offering up physical space on 30 acres of Texas countryside. As I spent more and more time thinking about web3, I realized how much I wanted to spend *all* of my time thinking about web3. Up to this point, I had been working a full-time job as a Community Manager for a web 2.0 company. Though I loved that work, it became obvious that I felt passionate about pushing this new technology forward. \n\nAn internet friend, [Jackson Dame](https://twitter.com/jacksondame), had just quit their job and taken a role at Rainbow.  I sent them a DM saying that I was interested in doing the same thing. They told me they’d keep an eye out for openings, and to my surprise I began hearing from *many* companies with *many* openings. I realized that a background in Community and Marketing was a major strength in this industry. Tons of projects had momentum behind them and developers were in desperate need of people who could take the reins of these burgeoning audiences. \n\nI interviewed with half-a-dozen web3 organizations until I found one that felt both like a perfect fit and a beautiful closed loop: I joined Aito’s team to work on building out his vision for web3.\n\nSix months ago, I never would have imagined that my life would look so different, centered on a world that I knew nothing about. I couldn’t be happier. Reflecting back, one of the main characteristics of web3 that made me dive in so quickly was its deep value for community. Though the crypto world is unfortunately equated in some people’s minds with get-rich-quick schemes, that simply hasn’t been my experience at all. Instead I’ve found a community of creators who want to push art forward and build a better internet that harkens back to the internet's best days. I think that my desire to be a part of that community is a big part of what made my journey successful. I wasn't focused on selling as many NFTs as possible or networking for networking’s sake; I was investing myself into a community of builders, and now I’m excited to be building right alongside them. \n\nEvery day I wake up looking forward to being a part of the future of web3.\n\nHere's to the next six months.", "timestamp": 1628519620, "digest": "Hu10Kv89stQ16ix6CS4k73tCpVhlY_r3dwE2L1-uZo0", "contributor": "0xc7A0D765C3aF6E2710bA05A56c5E2cA190C2E11e"}
{"id": "Ew0WB5ykb0XtX3seLbtNO1NHVmw-4iPR_jYWTOuRp08", "title": "CRYPTOPILLED", "body": "## *How I went from knowing next to nothing about crypto to having a full-time job in web3, all in under 6 months*\n\nAt the beginning of this year I knew next to nothing about the world of web3 or crypto. Six months later, I quit my job to take a full-time position in the industry.\n\nWhat happened? \n\nThis is the story of some of the major moments within that half-year and the lessons I learned along the way.\n\nIn January of 2021 I felt dissatisfied with the web. I had been feeling this way for years. Don’t get me wrong, there’s a lot that I love about the internet and the communities that it creates. I would have had a *very* different pandemic lockdown experience without spaces like Twitter and the ability to connect with friends and family online.\n\nAnd yet! \n\nSomewhere along the way, the web began to feel stagnant. All technology grows in fits and starts, but it felt like our period of relative dullness had been going on for far too long. \n\nThen, just like that, everything changed.\n\nIn February of 2021 I started hearing rumblings about NFTs. People were saying that these ‘non-fungible tokens’ were a new way for artists to create work online while providing both provenance and patronage. Some of the most interesting people on my Twitter timeline began posting about their upcoming projects. My Clubhouse homepage shifted from conversations about influencers to conversations about cryptocurrency and ‘minting’ NFTs. I watched as internet friends began to sell the work they had created for amounts of money that seemed unfathomable. Thousands of dollars in profits, for digital art? What was happening?\n\nI'm a long-time believer that we need to bring value back to art, but that's definitely not what happened in web 2.0. In an internet where attention seems fleeting and follower counts matter more than anything else, profits have been squeezed out and we've reduced 'art' down to 'content'. \n\nBut the NFTs I saw being sold didn't look like 'content'. They looked like real art being taken seriously by a real community.\n\nI decided to dive in.\n\n### GETTING STARTED IN THE WORLD OF WEB3 - HOW TO SET UP A WALLET AND BUY ETH\n\nTo participate in web3, the first thing you have to do is set up a wallet. Two of the best and most used wallets are [Rainbow](https://rainbow.me/) and [MetaMask](https://metamask.io/), the former of which lives natively as an iOS app and the latter as a Chrome extension. I initially went with MetaMask and immediately recognized the striking difference from a traditional username and password. MetaMask gave me a ‘seed phrase’, a string of 12 words that I absolutely could *not* share or forget. It felt scary but also enticing; this high-stakes web intimidated me *because* of its potential. Most people aren’t that concerned with having their email or social platforms hacked. Why would they be when the worst case scenario is typically a spammy post about buying fake Raybans posted on their profile? You can change your password, delete the post, and forget it ever happened. In the web3 world, getting hacked has real ramifications. How exciting, the idea of a web that actually has the power to change your life, and a secret phrase that actually needs protecting!\n\nI purchased some Ethereum, the digital currency that NFTs run on, and added it to my wallet. A jarring in in seeing how ‘little’ trading your dollars for crypto gets you. Converting $500 and receiving a fraction of a whole number (.2 ETH at the time of this writing) can be hard to understand. Another part of the transaction that’s challenging to newcomers: Recognizing that making any move has a cost. Because everything is hosted 'on-chain' there's a transaction price (called a 'gas fee') attached to anything you might want to do. \n\nWant to buy ETH? Pay gas.\n\nWant to create an NFT? Pay gas. \n\nWant to bid on an NFT? Pay gas. \n\nWant to transfer your ETH back to USD? Pay gas.\n\nJust like gasoline, these fees fluctuate in price based on demand. In the early days these transactions were pennies. But with the popularity of web3 on the rise, they're often now in the $20 range. At the height of the NFT craze, they were in the $100s. Even though the transaction fees can be painful, they’re a vital part of the ecosystem. Not only do they prevent the type of spammy behavior that gets us fake Ray-Ban ads on Instagram, they also add a layer of security as thousands of computers all compete to process transactions accurately and include them in the blockchain ledger.\n\nWith ETH in my wallet, I began the process of creating my first NFT. \n\n### MINTING YOUR FIRST NFT - HOW IT WORKS AND UNDERSTANDING THE PLATFORMS\n\nOne of the first steps any prospective NFT creator has to make is determining which platform it will live on. When I first started, there were a few options open to me: [Foundation](https://foundation.app/), [Zora](https://zora.co/), and [OpenSea](https://opensea.io/). The former two were both invite-only, and I didn’t want to scoop up a precious invite from a friend only to realize that it wasn't for me. OpenSea (as the name might suggest) requires no invite and is open to all. They were also doing something that intrigued me that they called ‘gasless minting’. \n\nPublishing an NFT is called ‘minting’, and as I mentioned earlier, almost every move within the web3 world requires gas. On OpenSea your *first* NFT requires gas, but after that you can make as many as you want without paying that upfront fee. Instead, gas is collected later upon purchase by a collector.\n\nThinking about what type of art I wanted to create, this immediately appealed to me, as I didn't have a singular key piece of work that I wanted to upload. I intended to publish a collection that felt like it would fit nicely within the space. Years ago I had taken a series of photographs of cups of espresso, before and after drinking. The photos had always delighted me but they felt weird online — who actually wanted to see espresso cups on Instagram? \n\nI minted a set of 6 photos and listed them for .1 ETH each (at the time, about $150). Then I went to bed.\n\nhttps://twitter.com/drewcoffman/status/1364097164452892674?s=20\n\nI woke up, opened my computer, and realized that one had already sold. Over the next two days I watched as people snatched up my coffee photos, some of them new Twitter friends, others complete strangers or anonymous. \n\nI had been taking photos for 15 years and no one had ever bought my work. Now, I had sold half a dozen and made $1,000, all by pressing buttons on an online marketplace.\n\nI instantly began thinking about the next project I wanted to mint. I had been working on a video project months prior and abandoned it because I didn't know where it would belong. A short-form music video set to a friend’s music, it didn't fit on my YouTube channel and felt like way too much work to just post on Twitter or Instagram. Could this exist as an NFT? Maybe! I re-assessed the footage and, with my friend's blessing, finished the project over a weekend and minted it, this time to Foundation.\n\n[NFT](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/927)\n\nAnd…it didn't sell!\n\nTo this day, the NFT remains available on Foundation, unsold. And that's okay! **Part of the beauty of the world of NFTs is that the art you create should be just as valuable in your own wallet as it is in someone else's. **Further, because of the nature of the blockchain, this art is *permanent***. If you believe in the world of web3, there's value in letting your work exist on-chain for years to come, whether it sells or not. My NFT lives on the blockchain, future-proofed in a way that anything I host on a centralized platform like Instagram will simply never be.\n\n### FINDING COMMUNITY\n\nFully committed to web3 at this point, I began doing everything I could to find other people within the community. I set up my [ENS domain](https://ens.domains/) and changed my Twitter name to drewcoffman.eth. I followed web3 people on Twitter and joined web3 conversations on Clubhouse. Through a combination of both, I became connected to a group called [Tech0ptimist](https://techoptimist.xyz/) who had [just minted an NFT on Foundation](https://foundation.app/@optimist/cabbage-01-453). As the auction countdown ended, they created a Clubhouse room to cheer the sale and affirm the entire NFT ecosystem. Through the conversation I learned about a mysterious art collector and anonymous Twitter egg named [Aito](https://twitter.com/thisisaito) who was building a serious collection of NFTs. We celebrated Aito on Twitter and Clubhouse. As we joked about him being a 'patron saint' I created an NFT using a photo of a church statue I had taken and swapped out the face, replacing it with an egg. I minted it, posted it to Twitter, and in minutes watched as the NFT disappeared from my wallet — bought by Aito himself.\n\nhttps://twitter.com/drewcoffman/status/1365840718867046400?s=20\n\n[Vision of Aito](https://opensea.io/assets/0x495f947276749ce646f68ac8c248420045cb7b5e/90294439017461790840607179782906946497870244260757743588084955982996617297921) was the first piece of egg-based art to commemorate the patron, and a deluge quickly flooded the marketplaces as artists fought for Aito's attention. Like any art space, the world of NFTs responded to what works, with artists building off each other as they learned what fits. I experienced this myself as I played around with an idea for my next NFT and saw someone else in the community making something that I loved. An artist named [Kate the Cursed](https://twitter.com/katecursed) used a CRT television and a modded SNES to create [glitched-out Mario Paint masterpieces](https://foundation.app/@kate-the-cursed/gamma-ray-graffiti-7694). They were incredible, and seeing someone else make CRT-based art was all the affirmation I needed to go out and make my own. \n\nI once again collaborated with my musician friend and worked for 48 hours to create an NFT I called ‘[◇ 𖥂 ◇ // modular patch](https://foundation.app/@drewcoffman/modular-patch-10266)’, a vaguely ominous looping video of kaleidoscopic visuals set to a synth score, all playing out within a CRT television screen. I felt *extremely* proud of it, not only because I loved what I made but because it felt web3 native. Where in the world of web 2.0 could something like this possibly thrive? Vine existed as a brief paradise for this type of work, but quickly sunsetted and never let the artists actually profit from what they created. To post a looping video on a social platform like Instagram or Twitter just felt underwhelming, and to put it on your own personal site typically meant that it would languish, unseen by all. NFTs were doing something beyond offering a path forward for artists: They were offering a path forward for *art*.\n\n[NFT](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/10266)\n\nTo my surprise (especially since the last NFT I had made never sold), my piece received a bid almost immediately (from internet friend [Jstn](https://twitter.com/jstn) — thanks Jstn!!) and then before it could sell, received another bid. Then another. And another. And another. \n\nJust like my espresso photos were the first time I had ever sold art for profit, this was the first time I had ever seen people fight over something I made. It felt overwhelming to know that my work resonated with others.\n\nThe NFT sold for .8 ETH, a number that would have felt impossible hours before. Instead of cashing out, I used my newfound ETH within the web3 space. I bought an NFT from an avatar project that I loved. I bought another from an artist that seemed up and coming. That instantly proved to be the case, as I sold the same piece a single day later for four times as much as I paid for it. \n\nAnd in one of my best moves, I bought into FWB, a token-gated community.\n\n### GETTING INVOLVED - SOCIAL TOKENS, DAOs, AND GOVERNANCE\n\n[FWB](https://www.fwb.help/) (Friends with Benefits) is a community that you can only access if you’re holding a certain amount of their token in your wallet. Once you hold that amount and apply to join, you get access to the Discord and the insights of the people within. \n\nThat's it! Mostly. Since I joined, FWB has created new initiatives to add more value for owners. They’ve held in-person parties, created city guides, and now send out a weekly TL;DR newsletter to catch people up on the most important news in and around web3. \n\nAt the time of joining, it cost me approximately $500 to enter (and at the time of this writing, entry is valued at around $1,750) which is an incredible price to pay to enter a chatroom — but web3 solves this in a way that web 2.0 never could. I’ve always been wary of gated courses, cohorts, and communities that tell you that by paying a certain amount of money you'll gain access to knowledge and people in a way that you otherwise couldn’t. These, in my experience, almost always disappoint.\n\nThey look enticing from the outside, but once you're in you realize that it's just a structured version of what you could have learned on your own — and of course, there's no refunds. In web3, if you join a token-gated community like FWB and realize that it isn't for you, you can *just sell the coins back and walk away*. This means that a community can't rely on shady tactics and an enticing outer wall to get you to join. It actually has to be good!\n\nFWB, it turns out, was *very, very good*. Accustomed to the cryptobro and wallstreetbets types of communities that often pop up in these spaces, I worried that this group might prove to be toxic at worst and unintentionally exclusionary at best. Instead, I found a friendly, extremely welcoming, diverse, and inclusive crowd. And the channels listed in the Discord weren't just about NFTs and crypto, there were lifestyle channels that included thoughtful conversations about not only music and books but more surprising topics like food and skincare! The people in FWB were truly *friends with benefits*, they had insights and understanding about each of these spaces that I began to pore over, learning not just about the web3 world but the *world as a whole* in ways that I’m very thankful for. And to top it all off, there were geolocated channels, with one of the most active centered in LA. That’s where I am!\n\nSoon after I joined some people from the group began planning one of their initial IRL meetups post-COVID. I went, meeting web3 people in person. FWB felt like the first opportunity that I had to really get *involved* at a community level with something that interested me. And they were still figuring out what they wanted to become in ways that made making meaningful contributions possible. Many web3 organizations and communities have ‘governance’ which allows for decision-making to be decentralized and democratized. Instead of a single person at the top of the food chain making all of the decisions (for better or worse), decisions can be brought to vote. In communities like FWB, if you hold the token, you get to vote. Easy! The challenge (as in IRL situations) lies in *getting people to actually vote*, as most simply don’t bother.\n\nSo, FWB set up a governance committee responsible for ensuring that, among other things, proposals were being understood and seen by members. I quickly began to see more and more governance opportunities and communities pop up. Many of these call themselves DAOs, ‘Decentralized Autonomous Organizations’, a web3 equivalent of an LLC that can take collective action quickly. Some of these, like [PleasrDAO](https://pleasr.org/), focus on purchasing important NFTs. Others, like [Aave Grants](https://twitter.com/aavegrants?lang=en), push an organization’s purpose forward and democratize its future. Others, like [CityDAO](https://city.mirror.xyz/mZOpFWkTi0M2lVE1PsT1e2sJwdUT4PdgetHw_S4hS5A) organize to buy land in the real world.\n\nFWB posted an application form for members to join their governance committee. I clicked it, and then…closed the tab. I’d never been on a governance committee in my life. What could I possibly contribute? Then I realized that being interested in governance and not knowing how to contribute made me the *ideal* candidate for a committee dedicated to moving members from ‘interested’ to ‘activated’. I applied. A few days later, my application got accepted.\n\nOn the governance committee I began helping run monthly FWB Town Halls and set the agenda. I also kept tabs on the dedicated Governance channel and answered any questions people had, making sure that feedback (especially the negative stuff) got seen by staff so that they could course-correct and ensure that people were being heard. As in much of life, certain decisions which were making people grumpy weren't coming from a place of malice, but messiness. So much was so new *so fast* that things were slipping through the cracks. The governance committee helped fix this, leading to a more positive and engaged community overall.\n\nThe governance committee came with a stipend, making it my first paid role in web3 — and they paid in *crypto*, not US dollars. This change fascinated me. Up until this point everything I had done had been funded by that initial deposit in my wallet from USD and the sales from my subsequent NFTs.\n\nNow, after being paid for my art, I was being paid for my participation. \n\n### GOING FULL-TIME\n\nAs the months flew by, I became more and more invested. I met [Justin Boreta](https://twitter.com/boreta) and worked to release [The Song That Owns Itself](https://stoi.org/) (STOI for short), an experiment in ownership where social tokens were given away,  representing ownership in the song itself. I learned about [CabinDAO](https://creators.mirror.xyz/20Eyc57rknNJYL9vJa11zvupU_MXP7NZJUADTzTlCjQ), which crowdfunded resources to create artist residencies, offering up physical space on 30 acres of Texas countryside. As I spent more and more time thinking about web3, I realized how much I wanted to spend *all* of my time thinking about web3. Up to this point, I had been working a full-time job as a Community Manager for a web 2.0 company. Though I loved that work, it became obvious that I felt passionate about pushing this new technology forward. \n\nAn internet friend, [Jackson Dame](https://twitter.com/jacksondame), had just quit their job and taken a role at Rainbow.  I sent them a DM saying that I was interested in doing the same thing. They told me they’d keep an eye out for openings, and to my surprise I began hearing from *many* companies with *many* openings. I realized that a background in Community and Marketing was a major strength in this industry. Tons of projects had momentum behind them and developers were in desperate need of people who could take the reins of these burgeoning audiences. \n\nI interviewed with half-a-dozen web3 organizations until I found one that felt both like a perfect fit and a beautiful closed loop: I joined Aito’s team to work on building out his vision for web3.\n\nSix months ago, I never would have imagined that my life would look so different, centered on a world that I knew nothing about. I couldn’t be happier. Reflecting back, one of the main characteristics of web3 that made me dive in so quickly was its deep value for community. Though the crypto world is unfortunately equated in some people’s minds with get-rich-quick schemes, that simply hasn’t been my experience at all. Instead I’ve found a community of creators who want to push art forward and build a better internet that harkens back to the internet's best days. I think that my desire to be a part of that community is a big part of what made my journey successful. I wasn't focused on selling as many NFTs as possible or networking for networking’s sake; I was investing myself into a community of builders, and now I’m excited to be building right alongside them. \n\nEvery day I wake up looking forward to being a part of the future of web3.\n\nHere's to the next six months.", "timestamp": 1628519326, "digest": "Hu10Kv89stQ16ix6CS4k73tCpVhlY_r3dwE2L1-uZo0", "contributor": "0xc7A0D765C3aF6E2710bA05A56c5E2cA190C2E11e"}
{"id": "7fk32C010Jf6tMOE3LV0u0-lpx2pWJweiWQdJYGqBxA", "title": "Find this buriedtreasure.eth ", "body": "\n![](https://images.mirror-media.xyz/publication-images/c676e2fa-6cc2-43f1-801b-87b35ddb908d.jpg?height=3024&width=4032)\n\nThis is a treasure chest: it contains the only copy of the private key to an ETH wallet, stamped into a sheet of metal. Over time, we will release clues about the location of this chest. Here is the first one: it's buried somewhere in the Texas Hill Country.\n \nSo what's in the wallet? To start, we've put a 1/1 NFT treasure inside, created by Cabin DAO collaborators [@DugDaniels](https://twitter.com/DugDaniels) and [@mel_being](https://twitter.com/mel_being): \n\n[Buried Treasure](ethereum://0xabefbc9fd2f806065b4f3c237d4b59d9a97bcac7/4340)\n\nBut what makes this treasure chest special is that, even though it's already buried, you can still add things into it. Think of it like contributing to a time capsule. Our hope is that one day in the future it will contain a gold mine of old NFTs and tokens and will lead to great adventures among treasure hunters. \n\nFeel free to deposit anything you'd like into the treasure chest at this address: \n\n```\n0x9293db81d208814cB7F23F4DeDeEd0dBEc35D1A0\n```\n\nThe treasure chest is also accessible at **buriedtreasure.eth** (the ENS domain is registered for the next 100 years; hopefully someone finds it by then). \n\nTo get the game kicked off, you can become a Treasure Hunter by collecting this NFT (also made by [@DugDaniels](https://twitter.com/DugDaniels) and [@mel_being](https://twitter.com/mel_being)): \n\n[Treasure Hunter](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=147)\n\nSome clues will be released publicly. Others may be token-gated for Treasure Hunters. Proceeds from the sale of the Treasure Hunter NFTs will be split: 50% of the ETH will be deposited directly into the treasure chest, and the other 50% will go to Cabin DAO to support the [Creator Cabins residency program](https://www.creatorcabins.com/programs) & the artists that made this project possible.  \n\nHappy hunting!\n \n\n### FAQs\n\n- Who knows where the treasure chest is buried?\n    - Just me, Jonathan Hillis. I went to great lengths to leave no trace of where I buried it & I will tell no one where it is.  \n- How long will the treasure chest last?\n    - Until someone finds it, the stamped metal plate corrodes, or ETH ceases to exist, whichever comes first. \n- Why didn't you use a hardware wallet?\n    - Common hardware wallets rely on a USB connection and additional layers of abstraction from the underlying wallet. The goal of this project was to make a treasure chest with the greatest chance of surviving for a very long time. Hardware wallets are great, but you can't beat keys stamped directly on metal for longevity. \n- Why didn't you use a BIP-39 seed phrase as the password?\n    - I wanted to rely on as few protocols as possible, provide the most direct and root-level access to the wallet, and avoid accidentally remembering words from the seed phrase. To accomplish this, I generated the ETH address and public/private keys using a random seed, stamped them into a piece of metal by hand, and saved no other records. \n- Why did you register the buriedtreasure.eth domain and then assign control to the chest's wallet, instead of just having the chest's wallet register the ENS address directly? \n    - To maintain a maniacal level of security. Registering the ENS domain directly using the wallet would have required using wallet software, a security risk I didn't want to take. This trades off slightly worse security for the ENS domain buriedtreasure.eth in order to maintain the strictest security for the underlying wallet: 0x9293db81d208814cB7F23F4DeDeEd0dBEc35D1A0. There is no possible way for anyone (including me!) to access the contents held at this address without finding the treasure chest. \n\n\n\n\n\n\n\n\n", "timestamp": 1628521146, "digest": "5heGuW5JIkDp67D4j4DtRpAi4ToiJzCeNFunU4cjkBw", "contributor": "0xbeC26FFa12c90217943D1b2958f60A821aE6E549"}
{"id": "8y6sZ4rCcwfiU2e3x1hikrTdOZYo92GV8y6QlJXIfBU", "title": "CRYPTOPILLED", "body": "## *How I went from knowing next to nothing about crypto to taking a full-time job in web3, all in under 6 months*\n\nAt the beginning of this year I knew next to nothing about the world of web3 or crypto. Six months later, I quit my job to take a full-time position in the industry.\n\nWhat happened? \n\nThis is the story of some of the major moments within that half-year and the lessons I learned along the way.\n\nIn January of 2021 I felt dissatisfied with the web. I had been feeling this way for years. Don’t get me wrong, there’s a lot that I love about the internet and the communities that it creates. I would have had a *very* different pandemic lockdown experience without spaces like Twitter and the ability to connect with friends and family online.\n\nAnd yet! \n\nSomewhere along the way, the web began to feel stagnant. All technology grows in fits and starts, but it felt like our period of relative dullness had been going on for far too long. \n\nThen, just like that, everything changed.\n\nIn February of 2021 I started hearing rumblings about NFTs. People were saying that these ‘non-fungible tokens’ were a new way for artists to create work online while providing both provenance and patronage. Some of the most interesting people on my Twitter timeline, like [the incredible Jon Gold](https://twitter.com/jongold), began [posting about their projects](https://twitter.com/jongold/status/1357034613613367298?s=20). My Clubhouse homepage shifted from conversations about influencers to conversations about cryptocurrency and ‘minting’ NFTs. I watched as internet friends began to sell the work they had created for amounts of money that seemed unfathomable. Thousands of dollars in profits, for digital art? What was happening?\n\nI'm a long-time believer that we need to bring value back to art, but that's definitely not what happened in web 2.0. In an internet where attention seems fleeting and follower counts matter more than anything else, profits have been squeezed out and we've reduced 'art' down to 'content'. \n\nBut the NFTs I saw being sold didn't look like 'content'. They looked like real art being taken seriously by a real community.\n\nI decided to dive in.\n\n### GETTING STARTED IN THE WORLD OF WEB3 - HOW TO SET UP A WALLET AND BUY ETH\n\nTo participate in web3, the first thing you have to do is set up a wallet. Two of the best and most used wallets are [Rainbow](https://rainbow.me/) and [MetaMask](https://metamask.io/), the former of which lives natively as an iOS app and the latter as a Chrome extension. I initially went with MetaMask and immediately recognized the striking difference from a traditional username and password. MetaMask gave me a ‘seed phrase’, a string of 12 words that I absolutely could *not* share or forget. It felt scary but also enticing; this high-stakes web intimidated me *because* of its potential. Most people aren’t that concerned with having their email or social platforms hacked. Why would they be when the worst case scenario is typically a spammy post about buying fake Raybans posted on their profile? You can change your password, delete the post, and forget it ever happened. In the web3 world, getting hacked has real ramifications. How exciting, the idea of a web that actually has the power to change your life, and a secret phrase that actually needs protecting!\n\nI purchased some Ethereum, the digital currency that NFTs run on, and added it to my wallet. A jarring in in seeing how ‘little’ trading your dollars for crypto gets you. Converting $500 and receiving a fraction of a whole number (.2 ETH at the time of this writing) can be hard to understand. Another part of the transaction that’s challenging to newcomers: Recognizing that making any move has a cost. Because everything is hosted 'on-chain' there's a transaction price (called a 'gas fee') attached to anything you might want to do. \n\nWant to buy ETH? Pay gas.\n\nWant to create an NFT? Pay gas. \n\nWant to bid on an NFT? Pay gas. \n\nWant to transfer your ETH back to USD? Pay gas.\n\nJust like gasoline, these fees fluctuate in price based on demand. In the early days these transactions were pennies. But with the popularity of web3 on the rise, they're often now in the $20 range. At the height of the NFT craze, they were in the $100s. Even though the transaction fees can be painful, they’re a vital part of the ecosystem. Not only do they prevent the type of spammy behavior that gets us fake Ray-Ban ads on Instagram, they also add a layer of security as thousands of computers all compete to process transactions accurately and include them in the blockchain ledger.\n\nWith ETH in my wallet, I began the process of creating my first NFT. \n\n### MINTING YOUR FIRST NFT - HOW IT WORKS AND UNDERSTANDING THE PLATFORMS\n\nOne of the first steps any prospective NFT creator has to make is determining which platform it will live on. When I first started, there were a few options open to me: [Foundation](https://foundation.app/), [Zora](https://zora.co/), and [OpenSea](https://opensea.io/). The former two were both invite-only, and I didn’t want to scoop up a precious invite from a friend only to realize that it wasn't for me. OpenSea (as the name might suggest) requires no invite and is open to all. They were also doing something that intrigued me that they called ‘gasless minting’. \n\nPublishing an NFT is called ‘minting’, and as I mentioned earlier, almost every move within the web3 world requires gas. On OpenSea your *first* NFT requires gas, but after that you can make as many as you want without paying that upfront fee. Instead, gas is collected later upon purchase by a collector.\n\nThinking about what type of art I wanted to create, this immediately appealed to me, as I didn't have a singular key piece of work that I wanted to upload. I intended to publish a collection that felt like it would fit nicely within the space. Years ago I had taken a series of photographs of cups of espresso, before and after drinking. The photos had always delighted me but they felt weird online — who actually wanted to see espresso cups on Instagram? \n\nI minted a set of 6 photos and listed them for .1 ETH each (at the time, about $150). Then I went to bed.\n\nhttps://twitter.com/drewcoffman/status/1364097164452892674?s=20\n\nI woke up, opened my computer, and realized that one had already sold. Over the next two days I watched as people snatched up my coffee photos, some of them new Twitter friends, others complete strangers or anonymous. \n\nI had been taking photos for 15 years and no one had ever bought my work. Now, I had sold half a dozen and made $1,000, all by pressing buttons on an online marketplace.\n\nI instantly began thinking about the next project I wanted to mint. I had been working on a video project months prior and abandoned it because I didn't know where it would belong. A short-form music video set to a friend’s music, it didn't fit on my YouTube channel and felt like way too much work to just post on Twitter or Instagram. Could this exist as an NFT? Maybe! I re-assessed the footage and, with my friend's blessing, finished the project over a weekend and minted it, this time to Foundation.\n\n[NFT](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/927)\n\nAnd…it didn't sell!\n\nTo this day, the NFT remains available on Foundation, unsold. And that's okay! **Part of the beauty of the world of NFTs is that the art you create should be just as valuable in your own wallet as it is in someone else's. **Further, because of the nature of the blockchain, this art is *permanent***. If you believe in the world of web3, there's value in letting your work exist on-chain for years to come, whether it sells or not. My NFT lives on the blockchain, future-proofed in a way that anything I host on a centralized platform like Instagram will simply never be.\n\n### FINDING COMMUNITY\n\nFully committed to web3 at this point, I began doing everything I could to find other people within the community. I set up my [ENS domain](https://ens.domains/) and changed my Twitter name to drewcoffman.eth. I followed web3 people on Twitter and joined web3 conversations on Clubhouse. Through a combination of both, I became connected to a group called [Tech0ptimist](https://techoptimist.xyz/) who had [just minted an NFT on Foundation](https://foundation.app/@optimist/cabbage-01-453). As the auction countdown ended, they created a Clubhouse room to cheer the sale and affirm the entire NFT ecosystem. Through the conversation I learned about a mysterious art collector and anonymous Twitter egg named [Aito](https://twitter.com/thisisaito) who was building a serious collection of NFTs. We celebrated Aito on Twitter and Clubhouse. As we joked about him being a 'patron saint' I created an NFT using a photo of a church statue I had taken and swapped out the face, replacing it with an egg. I minted it, posted it to Twitter, and in minutes watched as the NFT disappeared from my wallet — bought by Aito himself.\n\nhttps://twitter.com/drewcoffman/status/1365840718867046400?s=20\n\n[Vision of Aito](https://opensea.io/assets/0x495f947276749ce646f68ac8c248420045cb7b5e/90294439017461790840607179782906946497870244260757743588084955982996617297921) was the first piece of egg-based art to commemorate the patron, and a deluge quickly flooded the marketplaces as artists fought for Aito's attention. Like any art space, the world of NFTs responded to what works, with artists building off each other as they learned what fits. I experienced this myself as I played around with an idea for my next NFT and saw someone else in the community making something that I loved. An artist named [Kate the Cursed](https://twitter.com/katecursed) used a CRT television and a modded SNES to create [glitched-out Mario Paint masterpieces](https://foundation.app/@kate-the-cursed/gamma-ray-graffiti-7694). They were incredible, and seeing someone else make CRT-based art was all the affirmation I needed to go out and make my own. \n\nI once again collaborated with my musician friend and worked for 48 hours to create an NFT I called ‘[◇ 𖥂 ◇ // modular patch](https://foundation.app/@drewcoffman/modular-patch-10266)’, a vaguely ominous looping video of kaleidoscopic visuals set to a synth score, all playing out within a CRT television screen. I felt *extremely* proud of it, not only because I loved what I made but because it felt web3 native. Where in the world of web 2.0 could something like this possibly thrive? Vine existed as a brief paradise for this type of work, but quickly sunsetted and never let the artists actually profit from what they created. To post a looping video on a social platform like Instagram or Twitter just felt underwhelming, and to put it on your own personal site typically meant that it would languish, unseen by all. NFTs were doing something beyond offering a path forward for artists: They were offering a path forward for *art*.\n\n[NFT](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/10266)\n\nTo my surprise (especially since the last NFT I had made never sold), my piece received a bid almost immediately (from internet friend [Jstn](https://twitter.com/jstn) — thanks Jstn!!) and then before it could sell, received another bid. Then another. And another. And another. \n\nJust like my espresso photos were the first time I had ever sold art for profit, this was the first time I had ever seen people fight over something I made. It felt overwhelming to know that my work resonated with others.\n\nThe NFT sold for .8 ETH, a number that would have felt impossible hours before. Instead of cashing out, I used my newfound ETH within the web3 space. I bought an NFT from an avatar project that I loved. I bought another from an artist that seemed up and coming. That instantly proved to be the case, as I sold the same piece a single day later for four times as much as I paid for it. \n\nAnd in one of my best moves, I bought into FWB, a token-gated community.\n\n### GETTING INVOLVED - SOCIAL TOKENS, DAOs, AND GOVERNANCE\n\n[FWB](https://www.fwb.help/) (Friends with Benefits) is a community that you can only access if you’re holding a certain amount of their token in your wallet. Once you hold that amount and apply to join, you get access to the Discord and the insights of the people within. \n\nThat's it! Mostly. Since I joined, FWB has created new initiatives to add more value for owners. They’ve held in-person parties, created city guides, and now send out a weekly TL;DR newsletter to catch people up on the most important news in and around web3. \n\nAt the time of joining, it cost me approximately $500 to enter (and at the time of this writing, entry is valued at around $1,750) which is an incredible price to pay to enter a chatroom — but web3 solves this in a way that web 2.0 never could. I’ve always been wary of gated courses, cohorts, and communities that tell you that by paying a certain amount of money you'll gain access to knowledge and people in a way that you otherwise couldn’t. These, in my experience, almost always disappoint.\n\nThey look enticing from the outside, but once you're in you realize that it's just a structured version of what you could have learned on your own — and of course, there's no refunds. In web3, if you join a token-gated community like FWB and realize that it isn't for you, you can *just sell the coins back and walk away*. This means that a community can't rely on shady tactics and an enticing outer wall to get you to join. It actually has to be good!\n\nFWB, it turns out, was *very, very good*. Accustomed to the cryptobro and wallstreetbets types of communities that often pop up in these spaces, I worried that this group might prove to be toxic at worst and unintentionally exclusionary at best. Instead, I found a friendly, extremely welcoming, diverse, and inclusive crowd. And the channels listed in the Discord weren't just about NFTs and crypto, there were lifestyle channels that included thoughtful conversations about not only music and books but more surprising topics like food and skincare! The people in FWB were truly *friends with benefits*, they had insights and understanding about each of these spaces that I began to pore over, learning not just about the web3 world but the *world as a whole* in ways that I’m very thankful for. And to top it all off, there were geolocated channels, with one of the most active centered in LA. That’s where I am!\n\nSoon after I joined some people from the group began planning one of their initial IRL meetups post-COVID. I went, meeting web3 people in person. FWB felt like the first opportunity that I had to really get *involved* at a community level with something that interested me. And they were still figuring out what they wanted to become in ways that made making meaningful contributions possible. Many web3 organizations and communities have ‘governance’ which allows for decision-making to be decentralized and democratized. Instead of a single person at the top of the food chain making all of the decisions (for better or worse), decisions can be brought to vote. In communities like FWB, if you hold the token, you get to vote. Easy! The challenge (as in IRL situations) lies in *getting people to actually vote*, as most simply don’t bother.\n\nSo, FWB set up a governance committee responsible for ensuring that, among other things, proposals were being understood and seen by members. I quickly began to see more and more governance opportunities and communities pop up. Many of these call themselves DAOs, ‘Decentralized Autonomous Organizations’, a web3 equivalent of an LLC that can take collective action quickly. Some of these, like [PleasrDAO](https://pleasr.org/), focus on purchasing important NFTs. Others, like [Aave Grants](https://twitter.com/aavegrants?lang=en), push an organization’s purpose forward and democratize its future. Others, like [CityDAO](https://city.mirror.xyz/mZOpFWkTi0M2lVE1PsT1e2sJwdUT4PdgetHw_S4hS5A) organize to buy land in the real world.\n\nFWB posted an application form for members to join their governance committee. I clicked it, and then…closed the tab. I’d never been on a governance committee in my life. What could I possibly contribute? Then I realized that being interested in governance and not knowing how to contribute made me the *ideal* candidate for a committee dedicated to moving members from ‘interested’ to ‘activated’. I applied. A few days later, my application got accepted.\n\nOn the governance committee I began helping run monthly FWB Town Halls and set the agenda. I also kept tabs on the dedicated Governance channel and answered any questions people had, making sure that feedback (especially the negative stuff) got seen by staff so that they could course-correct and ensure that people were being heard. As in much of life, certain decisions which were making people grumpy weren't coming from a place of malice, but messiness. So much was so new *so fast* that things were slipping through the cracks. The governance committee helped fix this, leading to a more positive and engaged community overall.\n\nThe governance committee came with a stipend, making it my first paid role in web3 — and they paid in *crypto*, not US dollars. This change fascinated me. Up until this point everything I had done had been funded by that initial deposit in my wallet from USD and the sales from my subsequent NFTs.\n\nNow, after being paid for my art, I was being paid for my participation. \n\n### GOING FULL-TIME\n\nAs the months flew by, I became more and more invested. I met [Justin Boreta](https://twitter.com/boreta) and worked to release [The Song That Owns Itself](https://stoi.org/) (STOI for short), an experiment in ownership where social tokens were given away,  representing ownership in the song itself. I learned about [CabinDAO](https://creators.mirror.xyz/20Eyc57rknNJYL9vJa11zvupU_MXP7NZJUADTzTlCjQ), which crowdfunded resources to create artist residencies, offering up physical space on 30 acres of Texas countryside. As I spent more and more time thinking about web3, I realized how much I wanted to spend *all* of my time thinking about web3. Up to this point, I had been working a full-time job as a Community Manager for a web 2.0 company. Though I loved that work, it became obvious that I felt passionate about pushing this new technology forward. \n\nAn internet friend, [Jackson Dame](https://twitter.com/jacksondame), had just quit their job and taken a role at Rainbow.  I sent them a DM saying that I was interested in doing the same thing. They told me they’d keep an eye out for openings, and to my surprise I began hearing from *many* companies with *many* openings. I realized that a background in Community and Marketing was a major strength in this industry. Tons of projects had momentum behind them and developers were in desperate need of people who could take the reins of these burgeoning audiences. \n\nI interviewed with half-a-dozen web3 organizations until I found one that felt both like a perfect fit and a beautiful closed loop: I joined Aito’s team to work on building out his vision for web3.\n\nSix months ago, I never would have imagined that my life would look so different, centered on a world that I knew nothing about. I couldn’t be happier. Reflecting back, one of the main characteristics of web3 that made me dive in so quickly was its deep value for community. Though the crypto world is unfortunately equated in some people’s minds with get-rich-quick schemes, that simply hasn’t been my experience at all. Instead I’ve found a community of creators who want to push art forward and build a better internet that harkens back to the internet's best days. I think that my desire to be a part of that community is a big part of what made my journey successful. I wasn't focused on selling as many NFTs as possible or networking for networking’s sake; I was investing myself into a community of builders, and now I’m excited to be building right alongside them. \n\nEvery day I wake up looking forward to being a part of the future of web3.\n\nHere's to the next six months.", "timestamp": 1628521037, "digest": "Hu10Kv89stQ16ix6CS4k73tCpVhlY_r3dwE2L1-uZo0", "contributor": "0xc7A0D765C3aF6E2710bA05A56c5E2cA190C2E11e"}
{"id": "-SsmERqFmZEmGyjQge-l4jVynTze4WGkjbqZjD_k5w8", "title": "The metaverse needs its own exhibition themes", "body": "![](https://images.mirror-media.xyz/publication-images/d14c8130-e9bf-4905-965f-71ce159033ba.jpg?height=1280&width=2560)\n\n*First Supper via Async Art*\n\nThe metaverse isn’t a replacement to traditional galleries but rather **extends** and **complements** the possibilities of traditional galleries. We’re using the new tools of our times (e.g. VR, NFTs) to advance and explore creativity and our existences in new ways, just as all generations of artists and innovators have done before us.\n \nYet every era has its own unique cultural zeitgeist: as humans our fundamental approach to creating may be timeless, but **what we talk about in our creations always changes with the times**. Ultimately, all we have is the creations and stories we give ourselves, so those who come after us will have only what we leave them with — it’s incumbent on us as contemporary pioneers, then, **to shape and bring meaning** to our current zeitgeist.  \n\n![](https://images.mirror-media.xyz/publication-images/35538530-d941-4e78-a4a7-9ca4c06ae5a3.jpg?height=244&width=700)\n\n*Image via Max Osiris*\n\nOur current zeitgeist, or the one we can all see beginning to form right in front of us, is **metaversal**, and it’s increasingly being fostered by [Ethereum, Web3, and NFTs](https://metaversal.banklesshq.com/p/connecting-metagalaxies-with-ethereum). \n\nThis **metaverse zeitgeist** and these aforementioned technologies are in primordial states, relatively speaking — they will undoubtedly evolve considerably from here, meaning we’re all still actively fashioning our day’s culture and our new tools. \n\nThis brings us to **curation**. For example, curating an NFT exhibit in the metaverse is second-order creation; curation complements and extends creation, it is storytelling in its own right. If we are *bricoleurs*, curation is our *[bricolage](https://en.wikipedia.org/wiki/Bricolage#Philosophy)*. And recently we’ve begun to see curation start to seriously bloom across Ethereum-based VR worlds like Cryptovoxels, Decentraland, Somnium Space, and beyond. \n\nCurating per historical themes, e.g. Baroque-inspired or Cubist-inspired NFTs, is always fair game. Yet there’s undeniably **a need for the metaverse’s curators to further cultivate their own unique exhibition themes** — we’ve got to round out and keep adding to these amazing new creations and stories we’ve begun to give ourselves; we are the shapers and that task’s in our hands. \n\n![](https://images.mirror-media.xyz/publication-images/88108361-4daa-4906-ad01-2e2f0b21f8fc.png?height=3200&width=3200)\n\n*Art via Avid Lines*\n\nSo while the metaverse isn’t a replacement for traditional galleries, its exhibitions also need not be skeuomorphic either. The young metaverse’s curators are in the middle of a new kind of frontier, and therein **the opportunities for new creative and cultural explorations are vast**. We should lean into this newness to keep shaping our zeitgeist as innovative and thoughtful creatives. \n\nAnd that’s as much for ourselves as it is for those to come: “The constellation of objects via people = curation / **The constellation of people via objects = community**,” as JPG co-founder Sam Spike [recently put it](https://twitter.com/_samspike_/status/1415827877950640134). And ultimately this *is* what JPG's all about, i.e. offering new ways for us to create and connect!\n\n*******\n\n*Enjoyed this post? Consider also subscribing to [JPG's Substack newsletter](https://jpg100.substack.com/) to stay up-to-date on everything JPG has going on!*\n\n\n", "timestamp": 1628533529, "digest": "S3RWubTzxbkOeUltd-FauMN9NT1RI85WfGfEx8CF82E", "contributor": "0x08cEb8Bba685ee708C9c4c65576837cbE19B9dea"}
{"id": "NaesNAfS8Vw7lHjxdqRDn0lbwO2QasQjwSDrrxUz3Rs", "title": "Become the First Citizen of CityDAO and name our first city parcel", "body": "When Augustus restored the republic of Rome, he himself retained the title “first citizen” of Rome.\n\nWe are releasing citizen NFTs to our early backers, starting with an exclusive edition for the First Citizen. This NFT memorializes the CityDAO Articles of Incorporation as one of the first DAO LLCs in history, showcasing the Articles overlaid on the state of Wyoming and its 23 counties.\n\n**The holder of the CityDAO First Citizen NFT gets:**\n• To name the first parcel, subject to a community approval vote\n• Read access to internal CityDAO team channels\n• Governance and voting rights\n• Pre-sale access to land NFT release\n\n\n[Token #4299](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=4299&auctionId=0x292ac9a2f5751b247fc66dc1f46265ba0f519344ad65f0f705b1452b74032df6)", "timestamp": 1628535326, "digest": "CmZyzy3tuOu4TPUnfsYaR1Zoub1yiej6ZoOEuoayDQM", "contributor": "0x33eD481F752f05A292346C71E16aFbB0fE548656"}
{"id": "DCcI9L444a0REXRZxolqgNXQJbMKvUdhkb8y0Y5n3B4", "title": "Science To The Rescue", "body": "It would be easy to get depressed reading the morning news. Climate change is happening more quickly. The Covid pandemic shows no signs of abating. And there are all sorts of other things that are challenging our way of life.\n\nBut on days like today, I find it helpful to remember that science and technology helps us address these challenges.\n\nWe understand the carbon cycle and how far it is out of equilibrium. We also have many of the technologies we need to bring it back to equilibrium. And more are being invented every day.\n\nWe also understand the Covid virus and how to create vaccines that reduce its severity. And scientists have developed and continue to develop therapies that will do even more to reduce its severity.\n\nOver the course of history, mankind has leveraged science and technology to meet big challenges and overcome them. And we can continue to do that. We simply need the will to make the required investments and societal changes that go along with them.\n", "timestamp": 1628539073, "digest": "vf4l44QK-ZtLRmt3stfHn0OPQMLzwzvq7El2jPcLKOQ", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "16qlIop_iHh924kJryVRJW0hqrYxZ289hce24-ylDI4", "title": "CityDAO July Community Roundup #2", "body": "It has been a jam-packed last few weeks around the CityDAO community. Grab a beverage of your choice and dive in! 🍹 ☕️\n\n### What is CityDAO?\n\nThe vision of CityDAO is to build the city of the future on the Ethereum blockchain by tokenizing land, rights, and governance.\n\nSee the landing page below for more information.\n\n## 🔈News & Updates\n\n### 🔥 So...CityDAO is officially registered as an LLC in Wyoming!\n\n![](https://chance.ghost.io/content/images/2021/08/image-4.png)\n\n### 🔥 We got voted onto Mirror via the $WRITE RACE (as you can see 😉 )!\n\n![](https://chance.ghost.io/content/images/2021/08/image-3.png)\n\nCheck us out here:\n\n[CityDAO](https://city.mirror.xyz/)\n\n\n### 🔥 We also did our first parcel raise with the First Citizen NFT!  \n\n95% goes towards the purchase of our first parcel, 5% goes to the artist, community member @casey.\n\nHUGE shout-out & congratulations to [Justin Kalland](https://twitter.com/JustinKalland) who purchased the First Citizen NFT. The NFT sold for 6.52 ETH giving us a great first step in our mission to put land on chain! 🥳\n\nAnd thanks so much to @casey who created the NFT art 🖼 - it is glorious.\n\n[Become the First Citizen of CityDAO and name our first city parc… — Mirror](https://city.mirror.xyz/CmZyzy3tuOu4TPUnfsYaR1Zoub1yiej6ZoOEuoayDQM)\n\n### My goodness, that's a whole LOT OF PROGRESS!!! 🌆 🌃 🏙\n\n![](https://chance.ghost.io/content/images/2021/08/9DKyb3nXKD.gif)\n\nLet's keep the progress rolling!\n\n### Do you want to contribute but currently don't know how?\n\nI want to make sure everyone who wants to contribute can get more involved! If this is you please send me a DM @chance and let me know what you want to work on what skillsets you have.\n\nIn the next month we're going to focus on how we can get more community members actively involved to take the CityDAO project to the next level. Also, if you have any ideas on how to best facilitate this, let us know! Feel free to message in one of the public chats or shoot me a DM in Discord. 🙏\n\n***\n\n## Shout-outs & showcases\n\n### 🔥\n\nMassive shout-out to @casey who has been helping out with the CityDAO community in SO MANY ways, including crafting the Community-Call badges (among other creations):\n\n[](https://twitter.com/acartoonclub/status/1420507410951725056?s=20)\n\nHere's another example:\n\n[#501 - City Watcher - Blitmap | OpenSea](https://opensea.io/assets/0x8d04a8c79ceb0889bdd12acdf3fa9d207ed3ff63/501)\n\nCasey was instrumental in helping us acquire the Night Watch Blitmap as a logo asset for CityDAO. Now the DAO owns it. 😁  \n\n\n### 🔥\n\nI recommend checking out this article by @armchairsafari:\n\n[An Alternative Rent-to-Own Housing Model](https://alex-staircase.medium.com/an-alternative-rent-to-own-housing-model-e44dfd241aa9)\n\n### 🔥\n\n@build\\_\\_ is cooking up something super exciting!!\n\n> A global coworking DAO.\n\nHere's the whitepaper (includes discord invite link as well):\n\n[build_whitepaper v0.1 (Open-source commenting enabled)](https://docs.google.com/document/d/17ing2UFnhEN5M3Bzi9gVfNKw4HjQiRwFzW4LdKgPsWE/edit#heading=h.r6hkjb5qlla)\n\n\nAlso as a sidenote, if you ever get the opportunity to chat with @build\\_\\_ I highly recommend it – such intriguing perspectives based on unique experiences. You'll know what I mean when you do it. 😉\n\n### 🔥\n\nBig shout-out to @JonathanHollis and @CreatorCabins for continued to do awesome things!\n\n[](https://twitter.com/CityDao/status/1420777425256861707?s=20)\n\n### 🔥\n\nMassive shout-out to @bpetes who has been instrumental in keeping things flowing at CityDAO and takes initiative to help wherever it is needed!\n\n@bpetes is also co-founder of Sobol (leading the way for decentralized and humanistic work).\n\nCheck Sobol out here 💎 :\n\n[Sobol - The Organizational Accountability Platform](https://sobol.io/)\n\n\n### 🔥\n\nHere is a Mirror post by community member @danconway who wrote \"I used amazing energy of CityDAO as an example in my latest Mirror post\":\n\n> How do I know what DAOs are capable of? Quick example. I was one of the first people to join CityDAO. I'd seen a tweet by Scott Fitsimones. Scott's a nice guy, smart and hard working, but he's not superhuman. Following his tweet, he simply opened a Discord channel, and populated it with a few basic ideas. Almost immediately, like magic, a DAO materialized with the powers of a genie. More than a thousand people joined in no time and immediately began collaborating. Teams were set, governance began forming, outside partners were identified and engaged, the $WriteRace was won (on their first try), and real land was evaluated in preparation for acquisition in the future. All this before a token that could further align incentives was even distributed. These DAO collaborators were fueled by the joy of working on an interesting project for a good cause with others who share the mission, and the promise of future ownership of the outcome.\n\n[DAO’s to find missing people? $$ for your best ideas — Mirror](https://danconway.mirror.xyz/r6fadqo3KF_ndkllf0iJfbOVwmk-kXF4dH-C_z-moaQ)\n\n### 🔥\n\nDefinitely check out CommonLands by community member @rlamis!\n\n> Working to close the generational wealth gap through community-owned affordable, permanent housing using innovative tech.\n\n[CommonLands - Coming Soon](https://www.commonlands.us/)\n\np.s. will have some more updates on CommonLands in the future as they are up to some BIG things! 😉\n\n### 🔥\n\n@Phil Levin was a founding team member of Culdesac, whose ambition is to build a car-free city in the US. Super cool idea! Check it out below:\n\n![](https://chance.ghost.io/content/images/2021/08/Screen-Shot-2021-08-09-at-12.16.14-PM.png)\n\n[Culdesac | Experience Someplace Better](https://culdesac.com/)\n\n### 🔥\n\nBig shout-out to @scottfits (and everyone who has helped with suggestions / edits) for the first two CityDAO Mirror posts!! Here are the posts so far:\n\n[Announcing CityDAO - a city built on Ethereum — Mirror](https://city.mirror.xyz/mZOpFWkTi0M2lVE1PsT1e2sJwdUT4PdgetHw_S4hS5A)\n\n[Become the First Citizen of CityDAO and name our first city parcel](https://city.mirror.xyz/CmZyzy3tuOu4TPUnfsYaR1Zoub1yiej6ZoOEuoayDQM)\n\n### 🔥\n\nSome recent tweets we love:\n\n[](https://twitter.com/m_j_rossman/status/1421629107117428749?s=20)\n\n[](https://twitter.com/SyndicateDAO/status/1422703077929361412?s=20)\n\n[](https://twitter.com/CityDao/status/1423365937353216000?s=20)\n\n[](https://twitter.com/NpappaG/status/1422323969718427650?s=20)\n\n[](https://twitter.com/thesidsridhar/status/1421157994197364736?s=20)\n\n***\n\n## Overheard in CityDAO\n\n> Viva la Wyoming\n\n> Vision of a DAO city is fascinating to me\n\n> So much innovation happening in portugal wow\n\n> Cause it’s crypto-tax free lol\n\n> Even with influencers, there should be a balance. The ape community is dragging the devs there on Twitter as we speak bc of the shift to hyper focusing on influencers rather than nurturing the current community.\n\n> Someone say BaconDAO?\n\n> imagining a parcel map like google maps with ENS addresses. so you can see who owns each and make requests to them. interesting concept for sure\n\n> the DAO has been officially incorporated\n\n> 🏡 Creator Cabins is here to support City DAO for $WRITE RACE\n\n> The possibilities are endless, and the stakes are extremely high\n\n> I’m new here and confirming I’m not a bot. My expertise is in building great financial products that users love. I think we can do that with CityDAO!\n\n> 3D printing houses in general is such an awesome concept/industry, esp. for creating affordable housing.  Also looks like they are primed for when CityDAO expands to the moon/Mars 🙃\n\n> I'm a former urban planner and now work on streamlining multifamily and condominium development\n\n> currently in law school, planning on working with daos + nfts + web3 once I graduate. Fascinated by this project!\n\n> Love the mission here, and excited to get involved!\n\n> Have just voted for our City! on fire 🔥\n\n> I much prefer modular homes to Tiny Homes and love this community being built near Austin\n\n> My 'day job' is creating intergenerational co-living communities, where older and younger people together and support each other.  Also a real estate investor of niche asset classes like co-living, co-working and government-leased properties.  I'm fascinated by the intersection of DeFi and Real Estate, particularly as a means to re-invent the way we value and underwrite real estate.\n\n> Hello folks. Fed here. I am interested in restoring \"true community\" to our lives.\n\n> I went down the NFT and DAO rabbit hole at the start of 2021 and I don’t want to come out. I’m currently a member of FingerPrintsDAO, SquiggleDAO amd Muse0. I joined this group as I’m really interested in how a DAO community can come together to impact the real world, particularly in land ownership models.\n\n> Love the Wyoming area - Love the concept of a DAO holding onto land - so I must love CityDAO! A bit about me: Work at a cryptocurrency exchange in the US. Helped co-found a charitable endowment platform/DAO on Terra.\n\n> BaconDAO is realeasing a member rewards system in the coming weeks to identify contributions through mee6 levels and significant contributions through recognition through team members\n\n> Imagine as a land owner receiving messages of offers to join a DAO to use adjacent parcels together (without revealing their personal contact information to the offerer), or a camper who wants to lease a spot next Wednesday for a week, or an owner of an adjacent parcel who wants explicit permission to walk across your parcel when accessing theirs (if that wasn't baked into the original parcel NFT head-lease.), or...\n\n> Wow, interesting points here about rural zoning and hostility\n\n> Nice community call!\n\n> Tell me why I live in austin and this is my first time hearing about this lol\n\n> WE'RE TOP 10! KEEP GOING!!!!!\n\n***\n\n### 🔊\n\nThanks to @Justin1066 who shared this awesome twitter thread re: insights on challenges of assembling land and purchasing as a group of people\n\n[](https://twitter.com/zachklein/status/1422293114480250880?s=20)\n\n### 🔊\n\nThanks to @R3sist who shared this interesting overview of Coordinape:\n\n[Decentralized payroll management for DAOs](https://medium.com/iearn/decentralized-payroll-management-for-daos-b2252160c543)\n\n\n## Memes to go\n\nHere's a couple of gem-stone memes by @bpetes:\n\n![](https://chance.ghost.io/content/images/2021/08/image-6.png)\n\n![](https://chance.ghost.io/content/images/2021/08/image-7.png)\n\n![](https://chance.ghost.io/content/images/2021/08/image-8.png)\n\nThat's all for this roundup!\n\nSee y'all next time,\n\n\\-- Chance Taken\n\n![](https://chance.ghost.io/content/images/2021/08/image-5.png)\n", "timestamp": 1628542837, "digest": "jTi0-xQOMadDgvP_KgMOoHZaYvWJY6D7YK4bcdFz-f4", "contributor": "0x77aA943A365161e499eaFF59E936a799e6051e15"}
{"id": "LFVrJVq7NksRHXn0b3mGdbrTDWbMr89CXU1ZY_eMPZ8", "title": "CityDAO July Community Roundup", "body": "It has been a jam-packed last few weeks around the CityDAO community. Grab a beverage of your choice and dive in! 🍹 ☕️\n\n### What is CityDAO?\n\nThe vision of CityDAO is to build the city of the future on the Ethereum blockchain by tokenizing land, rights, and governance.\n\nSee the landing page below for more information.\n\n## 🔈News & Updates\n\n### 🔥 So...CityDAO is officially registered as an LLC in Wyoming!\n\n![](https://chance.ghost.io/content/images/2021/08/image-4.png)\n\n### 🔥 We got voted onto Mirror via the $WRITE RACE (as you can see 😉 )!\n\n![](https://chance.ghost.io/content/images/2021/08/image-3.png)\n\nCheck us out here:\n\n[CityDAO](https://city.mirror.xyz/)\n\n\n### 🔥 We also did our first parcel raise with the First Citizen NFT!  \n\n95% goes towards the purchase of our first parcel, 5% goes to the artist, community member @casey.\n\nHUGE shout-out & congratulations to [Justin Kalland](https://twitter.com/JustinKalland) who purchased the First Citizen NFT. The NFT sold for 6.52 ETH giving us a great first step in our mission to put land on chain! 🥳\n\nAnd thanks so much to @casey who created the NFT art 🖼 - it is glorious.\n\n[Become the First Citizen of CityDAO and name our first city parc… — Mirror](https://city.mirror.xyz/CmZyzy3tuOu4TPUnfsYaR1Zoub1yiej6ZoOEuoayDQM)\n\n### My goodness, that's a whole LOT OF PROGRESS!!! 🌆 🌃 🏙\n\n![](https://chance.ghost.io/content/images/2021/08/9DKyb3nXKD.gif)\n\nLet's keep the progress rolling!\n\n### Do you want to contribute but currently don't know how?\n\nI want to make sure everyone who wants to contribute can get more involved! If this is you please send me a DM @chance and let me know what you want to work on what skillsets you have.\n\nIn the next month we're going to focus on how we can get more community members actively involved to take the CityDAO project to the next level. Also, if you have any ideas on how to best facilitate this, let us know! Feel free to message in one of the public chats or shoot me a DM in Discord. 🙏\n\n***\n\n## Shout-outs & showcases\n\n### 🔥\n\nMassive shout-out to @casey who has been helping out with the CityDAO community in SO MANY ways, including crafting the Community-Call badges (among other creations):\n\n[](https://twitter.com/acartoonclub/status/1420507410951725056?s=20)\n\nHere's another example:\n\n[#501 - City Watcher - Blitmap | OpenSea](https://opensea.io/assets/0x8d04a8c79ceb0889bdd12acdf3fa9d207ed3ff63/501)\n\nCasey was instrumental in helping us acquire the Night Watch Blitmap as a logo asset for CityDAO. Now the DAO owns it. 😁  \n\n\n### 🔥\n\nI recommend checking out this article by @armchairsafari:\n\n[An Alternative Rent-to-Own Housing Model](https://alex-staircase.medium.com/an-alternative-rent-to-own-housing-model-e44dfd241aa9)\n\n### 🔥\n\n@build\\_\\_ is cooking up something super exciting!!\n\n> A global coworking DAO.\n\nHere's the whitepaper (includes discord invite link as well):\n\n[build_whitepaper v0.1 (Open-source commenting enabled)](https://docs.google.com/document/d/17ing2UFnhEN5M3Bzi9gVfNKw4HjQiRwFzW4LdKgPsWE/edit#heading=h.r6hkjb5qlla)\n\n\nAlso as a sidenote, if you ever get the opportunity to chat with @build\\_\\_ I highly recommend it – such intriguing perspectives based on unique experiences. You'll know what I mean when you do it. 😉\n\n### 🔥\n\nBig shout-out to @JonathanHollis and @CreatorCabins for continued to do awesome things!\n\n[](https://twitter.com/CityDao/status/1420777425256861707?s=20)\n\n### 🔥\n\nMassive shout-out to @bpetes who has been instrumental in keeping things flowing at CityDAO and takes initiative to help wherever it is needed!\n\n@bpetes is also co-founder of Sobol (leading the way for decentralized and humanistic work).\n\nCheck Sobol out here 💎 :\n\n[Sobol - The Organizational Accountability Platform](https://sobol.io/)\n\n\n### 🔥\n\nHere is a Mirror post by community member @danconway who wrote \"I used amazing energy of CityDAO as an example in my latest Mirror post\":\n\n> How do I know what DAOs are capable of? Quick example. I was one of the first people to join CityDAO. I'd seen a tweet by Scott Fitsimones. Scott's a nice guy, smart and hard working, but he's not superhuman. Following his tweet, he simply opened a Discord channel, and populated it with a few basic ideas. Almost immediately, like magic, a DAO materialized with the powers of a genie. More than a thousand people joined in no time and immediately began collaborating. Teams were set, governance began forming, outside partners were identified and engaged, the $WriteRace was won (on their first try), and real land was evaluated in preparation for acquisition in the future. All this before a token that could further align incentives was even distributed. These DAO collaborators were fueled by the joy of working on an interesting project for a good cause with others who share the mission, and the promise of future ownership of the outcome.\n\n[DAO’s to find missing people? $$ for your best ideas — Mirror](https://danconway.mirror.xyz/r6fadqo3KF_ndkllf0iJfbOVwmk-kXF4dH-C_z-moaQ)\n\n### 🔥\n\nDefinitely check out CommonLands by community member @rlamis!\n\n> Working to close the generational wealth gap through community-owned affordable, permanent housing using innovative tech.\n\n[CommonLands - Coming Soon](https://www.commonlands.us/)\n\np.s. will have some more updates on CommonLands in the future as they are up to some BIG things! 😉\n\n### 🔥\n\n@Phil Levin was a founding team member of Culdesac, whose ambition is to build a car-free city in the US. Super cool idea! Check it out below:\n\n![](https://chance.ghost.io/content/images/2021/08/Screen-Shot-2021-08-09-at-12.16.14-PM.png)\n\n[Culdesac | Experience Someplace Better](https://culdesac.com/)\n\n### 🔥\n\nBig shout-out to @scottfits (and everyone who has helped with suggestions / edits) for the first two CityDAO Mirror posts!! Here are the posts so far:\n\n[Announcing CityDAO - a city built on Ethereum — Mirror](https://city.mirror.xyz/mZOpFWkTi0M2lVE1PsT1e2sJwdUT4PdgetHw_S4hS5A)\n\n[Become the First Citizen of CityDAO and name our first city parcel](https://city.mirror.xyz/CmZyzy3tuOu4TPUnfsYaR1Zoub1yiej6ZoOEuoayDQM)\n\n### 🔥\n\nSome recent tweets we love:\n\n[](https://twitter.com/m_j_rossman/status/1421629107117428749?s=20)\n\n[](https://twitter.com/SyndicateDAO/status/1422703077929361412?s=20)\n\n[](https://twitter.com/CityDao/status/1423365937353216000?s=20)\n\n[](https://twitter.com/NpappaG/status/1422323969718427650?s=20)\n\n[](https://twitter.com/thesidsridhar/status/1421157994197364736?s=20)\n\n***\n\n## Overheard in CityDAO\n\n> Viva la Wyoming\n\n> Vision of a DAO city is fascinating to me\n\n> So much innovation happening in portugal wow\n\n> Cause it’s crypto-tax free lol\n\n> Even with influencers, there should be a balance. The ape community is dragging the devs there on Twitter as we speak bc of the shift to hyper focusing on influencers rather than nurturing the current community.\n\n> Someone say BaconDAO?\n\n> imagining a parcel map like google maps with ENS addresses. so you can see who owns each and make requests to them. interesting concept for sure\n\n> the DAO has been officially incorporated\n\n> 🏡 Creator Cabins is here to support City DAO for $WRITE RACE\n\n> The possibilities are endless, and the stakes are extremely high\n\n> I’m new here and confirming I’m not a bot. My expertise is in building great financial products that users love. I think we can do that with CityDAO!\n\n> 3D printing houses in general is such an awesome concept/industry, esp. for creating affordable housing.  Also looks like they are primed for when CityDAO expands to the moon/Mars 🙃\n\n> I'm a former urban planner and now work on streamlining multifamily and condominium development\n\n> currently in law school, planning on working with daos + nfts + web3 once I graduate. Fascinated by this project!\n\n> Love the mission here, and excited to get involved!\n\n> Have just voted for our City! on fire 🔥\n\n> I much prefer modular homes to Tiny Homes and love this community being built near Austin\n\n> My 'day job' is creating intergenerational co-living communities, where older and younger people together and support each other.  Also a real estate investor of niche asset classes like co-living, co-working and government-leased properties.  I'm fascinated by the intersection of DeFi and Real Estate, particularly as a means to re-invent the way we value and underwrite real estate.\n\n> Hello folks. Fed here. I am interested in restoring \"true community\" to our lives.\n\n> I went down the NFT and DAO rabbit hole at the start of 2021 and I don’t want to come out. I’m currently a member of FingerPrintsDAO, SquiggleDAO amd Muse0. I joined this group as I’m really interested in how a DAO community can come together to impact the real world, particularly in land ownership models.\n\n> Love the Wyoming area - Love the concept of a DAO holding onto land - so I must love CityDAO! A bit about me: Work at a cryptocurrency exchange in the US. Helped co-found a charitable endowment platform/DAO on Terra.\n\n> BaconDAO is realeasing a member rewards system in the coming weeks to identify contributions through mee6 levels and significant contributions through recognition through team members\n\n> Imagine as a land owner receiving messages of offers to join a DAO to use adjacent parcels together (without revealing their personal contact information to the offerer), or a camper who wants to lease a spot next Wednesday for a week, or an owner of an adjacent parcel who wants explicit permission to walk across your parcel when accessing theirs (if that wasn't baked into the original parcel NFT head-lease.), or...\n\n> Wow, interesting points here about rural zoning and hostility\n\n> Nice community call!\n\n> Tell me why I live in austin and this is my first time hearing about this lol\n\n> WE'RE TOP 10! KEEP GOING!!!!!\n\n***\n\n### 🔊\n\nThanks to @Justin1066 who shared this awesome twitter thread re: insights on challenges of assembling land and purchasing as a group of people\n\n[](https://twitter.com/zachklein/status/1422293114480250880?s=20)\n\n### 🔊\n\nThanks to @R3sist who shared this interesting overview of Coordinape:\n\n[Decentralized payroll management for DAOs](https://medium.com/iearn/decentralized-payroll-management-for-daos-b2252160c543)\n\n\n## Memes to go\n\nHere's a couple of gem-stone memes by @bpetes:\n\n![](https://chance.ghost.io/content/images/2021/08/image-6.png)\n\n![](https://chance.ghost.io/content/images/2021/08/image-7.png)\n\n![](https://chance.ghost.io/content/images/2021/08/image-8.png)\n\nThat's all for this roundup!\n\nSee y'all next time,\n\n\\-- Chance Taken\n\n![](https://chance.ghost.io/content/images/2021/08/image-5.png)\n", "timestamp": 1628542957, "digest": "jTi0-xQOMadDgvP_KgMOoHZaYvWJY6D7YK4bcdFz-f4", "contributor": "0x77aA943A365161e499eaFF59E936a799e6051e15"}
{"id": "Ix6K9S33fPYu208VFCcOIj9TlHfHFxVt1mjHs3i-NTk", "title": "A music service based on collective bids on NFTs (aka fractional NFT ownership)", "body": "This week hundreds of people pooled money to collectively place a bid on NFTs and attain fractional ownership using a tool called **PartyBid**. They succeeded. 478 people teamed up to form the [Party Of The Living Dead](https://www.partybid.app/party/0x2912F57F93dD69FBbF477B616D6f8C34C49bb282) and secured one of the highly popular (and expensive) NFT collectible **CryptoPunks**. 25 people acquired an NFT released by music x web3 project **Songcamp Elektra**, calling themselves [Elektranauts](https://www.partybid.app/party/0x7761882047C76B7814f8528EeF13f2681a4c2D40).\n\nhttps://twitter.com/songcamp_/status/1424395306796560390\n\nAfter purchasing the NFT (of which there exists 1), buyers get ERC-20 tokens which represent the fractional ownership (of which there exist proportional amounts for each buyer). In my recent piece about [data autonomy & the creator economy](https://musicx.mirror.xyz/9vQBJYreH45m7uZh2MyyvZsr_XL-FYGyrXjYqH-bplg) I explained how tokens on blockchains can be used to create platform-independent social groups. This is an example of it: **the fractional ownership of the NFT represents group membership**. In the case of the Party of the Living Dead that membership is signified through 1,201,725 [$DEAD](https://etherscan.io/token/0x0c7060bf06a78aaaab3fac76941318a52a3f4613) tokens and in the case of the Elektranauts through 2,100 [$SQUAD](https://etherscan.io/token/0xe63c36b2f38445f5559276e3d5e38329c313a80c) tokens, a reference to a term used by the Songcamp DAO. What if certain privileges were given to those group members?\n\n## From whales to swarms\nThe NFT boom that happened over the past year saw so-called 'whales', people with a lot of (crypto)currency to spend, place huge bids in auctions. As the usability layer of the web3 evolves, we see groups of people (often organised in DAOs) come up with tools like PartyBid to be able to compete with whales.\n\nIt is early days for the web3. It may feel differently if you're out of the loop, but new ideas, interfaces, protocols, tools, improvements, standards are being proposed, shipped and adopted on a daily basis. So what can build upon PartyBid? What can build upon fractionalized ownership of music NFTs?\n\n## A Bandcamp for Fan DAOs?\n\nFans can now come together to place collective bids on music NFTs. Afterwards, they receive tokens to signify their status as a fractional holder of that NFT. What if there was a service that offered extra perks based on the (fractional) ownership of music NFTs?\n\nI buy music on Bandcamp for 3 reasons: 1) to support artists (for the brave: [here's my collection](https://bandcamp.com/bas)), 2) to get the audio files in order to DJ, 3) to offline sync the music into the Bandcamp app. The music may also be available on large streaming platforms, but I like the idea of ownership & supporting financially - it's a win-win. So I stream my purchases from the app, or play from the offline cache. Could similar dynamics be utilized for a next-gen music service?\n\nEach fractional NFT token you hold could unlock things like offline playback, although it may take a few years for the music licensing landscape to catch up with the web3. So let's look at two other scenarios:\n\n### Fan chat\nCommunication tools for mini-fan clubs, e.g. a group chat. You login with your crypto-wallet, the service reads your tokens and 🪄✨ like magic ✨🪄 you're connected to other fans. It would have to compete with other apps that may implement tokenized group chats, like **Telegram** (and I predict **Instagram**), so perhaps music-specific features should be included, initially by integrating with web2 platforms like **SoundCloud**, **Bandcamp**, **Spotify**, etc. A web3 route would mean empowering the group with tools specifically tailored towards [DAOs of music fans](https://www.musicxtechxfuture.com/2021/06/01/the-decentralized-autonomous-1000-true-fan-organisation/).\n\n### Fan galleries\n\nAs a fan you can show off your collection on a profile. A service might help people find holders of fractional tokens of NFTs minted by the same addresses. That means: if an artist created 2 NFTs, the token holders for those NFTs can find each other through the platform. \n\nThis could create an economy on its own. If other people want in on the fractional ownership, then a new community could organize and place a bid to buyout the original community. The original's members would be able to profit from the increased value of the NFT, plus would still be able to join the new community's bid, so they retain access after the sale. Importantly, the original artist would also be able to receive a % of resale money, if such a clause is contained in the smart contract.\n\n## And then...\n\nTo imagine what the space could look like, one should ask \"and then what?\" If a certain scenario plays out, what does it look like when people build from there? What would have to surround it? There's a whole lot of imagining going on right now and a lot of building. Some of it will follow patterns we're familiar with from the web2, but much of it will diverge. \n\nWhat's becoming clear to anyone paying attention: what makes NFTs is not the high auction sums - it's their functionality & use to underpin a new decentralized social web.\n\n-\n***MUSIC x is a regular [newsletter](http://musicx.email/) about innovation in music, subscribed to by thousands of people in music, entertainment & tech.***\n\n*Follow us on Twitter [@musicxnetwork](https://twitter.com/musicxnetwork).\nSupport us on [Patreon](https://patreon.com/musicx).*\n\n*Select previous writing:*\n\n*   *[Blockchain basics: how to start a DAO](https://www.musicxtechxfuture.com/2021/06/22/blockchain-basics-how-to-start-a-dao/)*\n*   *[The Decentralized Autonomous “1,000 True Fan” Organisation](https://www.musicxtechxfuture.com/2021/06/01/the-decentralized-autonomous-1000-true-fan-organisation/)*\n*   *[The community-owned rave: event organisers as DAOs](https://www.musicxtechxfuture.com/2021/06/08/the-community-owned-rave-event-organisers-as-daos/)*", "timestamp": 1628549010, "digest": "cbIYf_uJYcRWWbPHVEqhWBa0CCETbyFD7gwtrOtdqqA", "contributor": "0xe612d9C2a9bA0Ff4403F4f7Ea87D5bE4290aC7B9"}
{"id": "utZ7SLYFfGXGjTLAE8X3k7fn_Rr6M8KamPcGC0RYSq4", "title": "Collectivizing Finance: Why The Future of VC is Multiplayer", "body": "\n*Today’s piece was cowritten with [David Phelps](https://twitter.com/divine_economy). Two months in the works, it is about collectivizing finance, but it is also an experiment in collectivizing finance:*\n\n- *Collectively commissioned by 14 backers through [Ghost Knowledge](https://twitter.com/ghost_knowledge)*\n- *Collectively written with contributions by [Lila Shroff](https://twitter.com/LilaShroff) and [Julia Lipton](https://twitter.com/JuliaLipton)*\n- *Collectively sold—we hope—through a [PartyBid on Zora](https://www.partybid.app/party/0x6256C8C9957C43781109Bc02e9E4Dd716D32bbd0). Our hope is that a collective group will purchase it as a kind of meta-memento of this strange and wonderful era.*\n- *Collectively splitting the proceeds as a donation, with 1) the original commission in USD going to [All Raise](https://www.allraise.org/) & [BLCK VC](https://www.blckvc.org/) and 2) the NFT proceeds in ETH going to the patrons (40%), who have equity-of-a-kind in the piece, and to [Mint Fund](https://themint.fund/) (60%), an initiative to support BIPOC and LBTQIA+ NFT creators*\n\n*Want to play along? [Contribute to the PartyBid here](https://www.partybid.app/party/0x6256C8C9957C43781109Bc02e9E4Dd716D32bbd0).*\n\n*It’s worth noting that none of the tech that made this possible—Ghost Knowledge’s collective commissions, Party DAO’s collective purchases, or Mirror’s collective splits—existed a few months ago. That’s as good place as any, in fact, to start.*\n\n***\n\nIndulge us, if you will, by stepping back in time to a different era, two weeks ago. In that far-gone epoch, before [PartyDAO](https://www.partybid.app/) had enabled anyone with a crypto wallet to join in crowd-purchasing NFTs as part of makeshift collectives, multiplayer finance was already starting to signal its nascent power against incumbent investors.\n\nWhat happened? In practical terms, the token-holders of the decentralized finance platform [Sushiswap](https://sushi.com/) banded together to reject [a deal](https://forum.sushi.com/t/sushi-phantom-troupe-strategic-raise/4554) that would have given the powerful Venture Capital firm Lightspeed a discounted token price. But what does that story mean? You might imagine the story as one of how crypto-native everymen collectivized to insist that they receive the same terms as the richest investors: It’s a Wonderful Life as performed on Reddit, or if you prefer, the Wallstreetbets-Gamestop-Saga played out in a way that didn’t just benefit the big financiers who were handling the deal.\n\nOr, alternatively, you might imagine it as a story of how, in our overly-capitalized and increasingly democratized markets, the investors who matter most to protocols are those in the community who invest their time and work, rather than their money. \n\nYou might imagine it, then, as a story of how Venture Capital will soon be under siege by collective finance.\n\nIn contrast to [the democratization of finance](https://davidphelps.substack.com/p/against-the-democratization-of-finance), which leaves retail investors to their own devices, the collectivization of finance brings investors together to support each other and a project, and in so doing, to increase the probability of success. Collectivization is about the group working together towards a shared objective by giving each other opportunity, leverage, and education, rather than individuals going it alone.\n\nHow did we get here? And where are we going? To understand our story here—the story of how we’ve arrived at an inflection point in collectivizing finance—we need to go back to the beginning. That beginning lies long before the development of technologies and trends that have enabled collective finance. It lies in the ways that venture capital created the perfect opportunity for its own disruption.\n\nBelow, we’d like you to join us on our own multiplayer journey into a speculation on the history and future of collective finance. We’ll cover four pieces:\n\n- How Venture Capital created the conditions for its own disintermediation\n- Why syndicates are an important start for multiplayer finance—but not enough\n- How DAOs will empower collective finance through “work-to-play” models\n- The Lesson of SushiSwap: why tokenization enables collectivization \n\nThis piece itself emerged from the collective crowd-commission of [Ghost Knowledge](https://twitter.com/ghost_knowledge), with all commissioning proceeds going to [Blck VC](https://www.blckvc.org/) and [All Raise](https://www.allraise.org/). \n\nAs a fun experiment, we’ve also decided to put it on the market as an NFT with splits to (1) reimburse the patrons who graciously invested in this work via Ghost Knowledge (40%), and (2) to donate to Mint Fund. Our hope is that a collective group will purchase it as a kind of meta-memento of this strange and wonderful era.\n\n### **Venture Capital and The Great Missed Opportunity**\n\nOne way to understand this story is to show that it is like so many stories in business: a powerful incumbent is able to extract massive value from inefficiencies that it is incentivized not to solve. In this case, the powerful incumbent is Venture Capital, and its inefficiencies are, well, many, from the illiquidity of private company equity to closed-ecosystem information asymmetries.  There is one major solvable inefficiency, though, that traditional Venture Capital has refused to solve, despite the many benefits it could stand to gain. We’re referring to its treatment of its funders, the so-called “Limited Partners.”\n\nLet’s step back. We might understand Venture Capital as a two-sided marketplace that has to justify its own intermediation between investors and founders. The sundry justifications might include VCs’ ability to scout and source great deals, or perhaps their ability to get into these with their own contributions. The point, in any case, is that VCs might be considered the travel agents of Wealth Management, charging for the added layer of intermediation *between* the LPs and the startup as a curatorial service: just as a travel agent would help you find a nice hotel, a VC will put your money in a nice startup.\n\nThe comparison ends there, however. While a travel agent might help the buyer make a decision about their money, a VC in today’s market instead spends their time begging the business even to take the money in the first place. Imagine a travel agent who booked you into a hotel without consulting you while explaining that they only got the reservation because of their “value-add” to the resort, and you’ll have a picture of how a traditional VC presents to an LP.   \n\n![](https://images.mirror-media.xyz/publication-images/5de68e1e-1084-4aee-b1d8-1ac38ddde9d2.png?height=1956&width=2865)\n\nWe start to sense the problem. Venture Capitalists are ultimately proxies for their LP investors, but in an era of disintermediation, there is not a lot keeping savvy LPs from seeking out these deals themselves as angels if they want to.\n\nTo put that another way, Venture Capital has always treated LPs as their *customer* and their investments as their *product* while ignoring that in a two-sided marketplace, value can easily move the other way. What if the Limited Partners, the funders, were actually the product that Venture Capital could sell to founders at startups to win deals?\n\nYou can see where we’re going.\n\nFor let’s imagine an impossible Venture Capital firm—one that rewarded LPs not only for their capital, which is cheap anyway, but their own work as entrepreneurial figures who could help build the businesses they were funding. On the surface, this firm would offer a win-win to all parties. LPs, who often offer substantial strategic value, might be especially incentivized to work with funds that would reward their work rather than extract their capital. VCs in turn could leverage those relationships to win deals.\n\nBut that’s also why this win-win model is a tough sell in the context of traditional venture: the VCs would need to give up their value in supporting companies and protocols to their own LPs. This firm would have to offer a piece of returns and fees to LPs when they perform work, rather than taking a piece of their profits in exchange for doing work for them.\n\nThat said, there are three reasons why the win-win LP model might win anyway. The first is that it could generate far better returns for VCs if it helps them win deals and the actual work of the LPs helps their companies grow. The second is that it’s already starting to happen (see [Packy McCormick’s fund proposal](https://www.notboring.co/p/introducing-not-boring-capital)), and early-stage VCs stand to lose top funders and founders alike when a better model emerges to support them. And the third is simply that the incredible wealth creation of the past few years, between IPOs and the crypto boom, has led to LPs seeking yield outside of public markets and becoming more active investors.\n\nSo LP engagement is starting to change—both as VCs look for new and unique ways to compete in this venture-hot market, and as the profile and needs of this customer group shifts. With hungry, intellectually curious LPs coming to the table with a capability set that extends beyond just capital and an objective set that extends beyond just returns, we’re inching towards a world wherein Limited Partners are no longer, well, “limited.” In fact, they might become a powerful community in their own right.\n\nThe greatest opportunity, in other words, is multiplayer mode—which could not only bring about more compelling options for founders than ever before, but more compelling incentive structures for LPs who roll up their sleeves and jump into the game.\n\n### **The Problem With Syndicates**\n\nWhen we imagine a finance version of multiplayer mode, we might make the mistake of imagining something like an angel syndicate.\n\nSyndicates, which have skyrocketed in popularity through AngelList over the past decade, certainly get a lot right. Not to be confused with angel groups / networks, which typically are pay-to-play (membership fees to join) and provide startups with lots of small checks from individual angels, syndicates are groups which pool various angels’ money into special purpose vehicles (SPVs), allowing them to invest in companies as a single entity on the cap table. At their core, syndicates understand that LPs occasionally offer tremendous value to founders, that LP collectives can actually be sold as a value-add to companies to win deals, and, quite simply, that VCs can be disintermediated by cheaper models.\n\nIn theory, syndicates represent a Best of all Venture Capital Worlds. Syndicate leads mass small-check LPs to offer meaningful money to founders—a sort of grassroots leveraging-of-the-crowd that lets them enter deals they might never have gotten into otherwise. Those small-check LPs not only get to “win” otherwise inaccessible deals but maintain full control of their investment into companies of their own choosing; unlike a VC LP investment, Syndicate LPs get to select their investments on a deal-by-deal basis. And founders get to set the terms, beholden to nobody but benefitting from all: LPs cannot contact founders, but syndicate leads can connect them to each other if there’s a way for LPs to support. Rather than take money from a single VC, founders can effectively use syndicates to crowd-fund from hundreds of top operators who can only support their company but never adversely intervene.\n\nIn that sense, syndicates might be considered as contemporaries to two-sided marketplaces like Uber and Airbnb that disintermediate the traditional “quality controls” like travel agents and taxi permits. Just as major Web 2.0 aggregators like Airbnb have thrived off the insight that buyers would rather have open access to options than to pay for intermediation, syndicates give LPs greater control over their own money to invest as they please, sans the travel-agent-VC to pick the best options. Likewise, they bundle valuable LPs together and can offer their services to companies. \n\nIt’s tempting to think, then, that syndicates represent the best of multiplayer mode—a grassroots disintermediation of the traditionally consolidated power of top VCs. But syndicates also represent an awkward halfway point to disintermediation and collectivization. For they still limit options based on their own curation and take a cut for it. Meanwhile, LPs remain beholden to them to have options. So there is no truly open or disintermediated marketplace in venture like an Airbnb or, if you like, a New York Stock Exchange—though marketplaces for secondary shares are very much in the works.\n\nAnd in reality, syndicates often pit parties against each other to the detriment of all. Syndicate leads, required to put up very little of their own money, often invest the bare minimum on as many deals as possible in order to maximize their chances that *one* of these will be a unicorn with carry in the millions. To LPs, they practice investing as a type of virtue-signaling, extolling the billion-dollar opportunities of companies in which they have no desire to invest; among themselves, they practice investing as a kind of spray-and-pray, hitting as many deals as possible with borrowed money and zero downside in order to grease their own returns.\n\nUltimately, these kinds of syndicates are sub-optimal for all parties. Angels with expertise, savvy, and genuine value-adds for founders are unlikely to give up a share of profits for companies they need to diligence, can’t diligence, and could often just reach out to on their own. And since top angels are rarely part of syndicates, syndicate leads can’t leverage their individual talents to support founders and win deals. \n\n![](https://images.mirror-media.xyz/publication-images/69b652f8-6b96-407d-8c3f-12f7502d7b65.png?height=3060&width=2739)\n\nUltimately, a negative feedback loop ensues: top angels have little reason to work with syndicates that can’t get access to top companies, and top companies have little reason to work with syndicates that can’t support them as well as bigger players in the field. Imagine if Robinhood only gave you a limited selection of mostly mediocre stocks under the condition that it took 20% of your profit. This is what it can be like to be a member of some syndicates. \n\nOf course, there are exceptions, as well as plenty of syndicates whose dubious decisions are the product of questionable frameworks rather than malintent. But the question remains. What would a syndicate look like that could actually get great angels to join and leverage their talents to win competitive deals? Would it even look like a syndicate?\n\n### **DAOs and Work-to-Play**\n\nOne answer is what we might call a *work-to-play* model, in contrast with the traditional concept of ‘*pay-to-play*’. Instead of valuing LPs who can give the most money—an easy commodity for many founders in an overcapitalized environment—syndicates should work to value those who can actually contribute ideas, expertise, and work to support the companies they want to invest in. One way of incentivizing this could be to share the carry, which has traditionally been reserved for the syndicate leads, with LPs who bring in deals, perform diligence, and write memos. Some syndicates and funds do this today, but it’s still early days. Momentum here is starting to pick up, though: AngelList recently announced it was adding carry sharing as a feature. At scale, this could offer a way to collectivize the angels, even those with little money.\n\nBut an even more radical manifestation of the ‘work-to-play’ concept might be a completely headless model—that is, it might be [a DAO](https://coopahtroopa.mirror.xyz/_EDyn4cs9tDoOxNGZLfKL7JjLo5rGkkEfRa_a-6VEWw), a decentralized autonomous organization for investors to all share deals with one another. Investment DAOs already exist in crypto ([Duck DAO](https://duckdao.io/), [Flamingo](https://flamingodao.xyz/), [the LAO](https://www.thelao.io/)), though they often make various tradeoffs between the benefits of hierarchy, on the one hand, and exclusivity on the other. Is it better to have a few great leaders making decisions that anyone else can back—or to create a more equitable structure of those great leaders joining on the same level? The necessary (and not always incorrect) myth of great leaders is hard to abrogate, particularly in environments where it’s far more productive for members to learn from each other’s work than to replicate it. \n\n![](https://images.mirror-media.xyz/publication-images/eba27827-5219-4793-8ee7-7ae2b719a96f.JPG?height=459&width=1188)\n\nThat suggests that there might be another solution: work-to-play DAOs where members rotate as leaders, each agreeing to perform work in order to access each other’s work as well. (This is, presumably, what [Syndicate Protocol](https://www.syndicateprotocol.org/) is working on.) Members could be required to generate at least one deal a year in order to partake in each other’s deals, for example, and protocols could be set on the minimum viable quality of deals (i.e. that some percentage of the members agree to back, that it raises a certain amount, etc.). Others might contribute their talents doing audits, writing memos, diligencing data, or interviewing founders, and earning access rights as well. Smart contracts and tokenization might make all of this increasingly possible: imagine if completing certain actions automatically entitled LPs to tokens representing some share of the carry, for example. Of course in theory, there would be little need for carry since everyone would be supporting each other’s deals, but that doesn’t mean that carry is a bad idea: resourceful members who can offer great opportunities but little money, for example, might receive tremendous incentivization from getting carry on their deals. Inclusivity, rather than exclusivity, could optimize opportunity.\n\nEndless permutations are possible here, including fund-versions that would steadily deploy crowdsourced funding across deals, and not all would be fated to success. Like any collective, each DAO would face the challenge of balancing the homogeneity of members’ perspective (necessary to ensure adequate support for deals) against the heterogeneity of members’ perspective (necessary for each to learn and gain from one another and fruitfully challenge each other’s ideas). But the challenges of self-governance are the point—because they’re challenges that everyone should have. \n\n### **Tokenization Enables Collectivization**\n\nIn the past, we’ve written about the ways that tokenizing equity can turn [private markets into something akin to public markets](https://davidphelps.substack.com/p/user-generated-finances), open to all investors. But tokenization doesn’t just allow more investors into a project—it also incentivizes them to invest in wilder ideas. Let’s break down the ways that tokenization unlocks multiplayer investments that can accelerate development and even enhance the possibility of success in a way that simply couldn’t have been possible before.\n\nOn a recent [Acquired episode](https://www.acquired.fm/episodes/managing-a-crypto-fund-with-kyle-samani-from-multicoin-capital), Multicoin Capital VC Kyle Samani points out why VCs have far greater risk-tolerance to make moonshot bets with tokenized web3 companies than they do with non-tokenized web2 companies: web3 VCs can always sell off the tokens, typically after a vesting period of a year. Where traditional VCs see most of their struggling investments go to 0, web3 investors can cut their losses and vastly increase their chances of getting double-digit returns. Token incentivization is much easier (operationally and legally) than carry incentivization. That in turn enables investors to back any interesting project they like in a way they couldn’t before, even with the same risk profile. \n\nBut here’s where things get interesting. Investment in crypto projects is multiplayer, open to a community of retail investors as well as the VCs, so a massive investment in an interesting idea will not only pay for development to bring the idea to fruition, but draw attention to a rising token price that will in turn draw in retail investors to support the project as well. Crypto financing is extremely performative—the investment itself generating development and further investment, which also generates further development and investment in turn—that can turn wild ideas into realities in a short amount of time.\n\nSo a moonshot bet in a risky-but-tokenized project can actually help mitigate its own risk by eliciting a community, development, and further investment around an idea. It won’t always happen, of course, and communities and projects can easily fall apart when the cycle swings into reverse as major investors discard their coins. Still, the performativity of capital—the fact that risk mitigates risk and big bets increase their own odds of success—further incentivizes investors to support communities that they couldn’t have afforded to support before. The communities, in turn, support the investment.\n\nThere is, however, a catch—a familiar one by now. The VC must be beholden to the project and its community rather than the project and community being beholden to the VC, as they would have been in the past. That means the VC must give up power to extract concessions and become a team player, accepting the same terms as the rest of the community.\n\nRetail investors banding together to curtail the extractive power of a VC? It all sounds a bit like Wallstreetbets applied to private markets, Doge mania with a conscience. But it’s already begun. As we’ve seen, when Lightspeed proposed a massive investment in Sushiswap at discounted terms a few weeks ago, a standard operating procedure for VCs, the community of 60,000 token holders erupted in anger that the investors with the most money were getting the cheapest deals.\n\nIt is to Lightspeed VC Amy Wu’s great credit that she openly engaged the community on calls with a sharp understanding that alienating the community of a decentralized, tokenized project could destroy the investment entirely.\n\n![](https://images.mirror-media.xyz/publication-images/e9d50a78-6774-449b-8a9a-cccf08584609.JPG?height=578&width=1221)\n\nThe Sushi community is now debating a number of proposals, but two points are clear. Lightspeed will not be getting a discount; the power of the VC wanes. But Lightspeed will likely get a warrant or call option to buy further tokens at a much higher, pre-agreed-upon price in a couple years’ time. It is still a discount of sorts, but only if Sushi is successful—a discount, in other words, that rewards early believers for their cash and their efforts.\n\nWhat is more significant than the decision is the process by which it is occurring in a decentralized community that fervently debates issues of governance and equality as if they were a colonial assembly in 1775. That they speak of supporting the community is perhaps less significant than the fact they’re able to speak so loudly as a collective voice, far more powerful than any individual’s.\n\nAll of this could not happen without tokenization, which we expect to extend well beyond web3 companies to any project that wants greater power in raising money and building community. Even over the past couple days, for example, crypto creator [SIRSU](https://twitter.com/sirsuhayb) rallied for collective ownership of two Black Cryptopunk NFTs. The resulting collectivization of investors of all ethnicities, many of whom could never afford a Cryptopunk, leveraged tokenization of the fractionalized works to make investment accessible to anyone with a wallet—while raising the value of Black representation in NFTs.\n\nIn other words, tokenization enables collectivization. It enables community. If you assume Web3 is the future, then you have to assume that Web3 is the future of investing. And in Web3, multiplayer investing is the default. \n\nAll of this brings us back to the realization with which we started. Alongside investment DAOs and art communities investing jointly in single works, SushiSwap and PartyDAO mark an inflection point: the point where we’re starting to collectivize finance. If the traditional VC model is to maintain power and success, it will not be against but within this retail collectivization.\n\nThe collectivization of finance is not yet entirely inclusive in who it gives financial opportunity: it’s still just open to those with investment money, access to technology, and the gumption to co-invest with strangers, particularly from a token-gated Discord channel. But it is inclusive in how it gives opportunity through a town-hall operation of entertaining and voting on proposals for the shared use of capital. \n\nIt is, in other words, a start.\n\n*Edited by [Lila Shroff](https://twitter.com/LilaShroff). With contributions by [Julia Lipton](https://twitter.com/JuliaLipton).*\n\n*Particular thanks to the patrons of this piece, who had no idea what they were commissioning beyond a piece on “Multiplayer VC,” and without whom this would not exist: Roshan Abbas, Raji Al-Sherif, Sari Azout, Juanje FP, Mario Gabriele, Daniel Kok Ting Han, Gil Kruger, Julia Lipton, Clint Myers, Arvind Nagarajan, Sarah Noeckel, Christina Oshan, Tyler Tringas, @wacko_gabriel. With extreme gratitude as well for the kind technical support of SIRSU and Patrick Rivera.*", "timestamp": 1628607572, "digest": "Pj8N16OdD2MW6s8lE_Ex8TC7WLHJSRiLOp3Gz-lHZPg", "contributor": "0x894Aa5F1E45454677A8560ddE3B45Cb5C427Ef92"}
{"id": "vzESRYIWGFyInKHuL4zPcTby0piAp_DlSzZrsm6feek", "title": "Why the metaverse needs its own exhibition themes", "body": "The metaverse isn’t a replacement to traditional galleries but rather **extends** and **complements** the possibilities of traditional galleries. We’re using the new tools of our times (e.g. VR, NFTs) to advance and explore creativity and our existences in new ways, just as all generations of artists and innovators have done before us.\n \nYet every era has its own unique cultural zeitgeist: as humans our fundamental approach to creating may be timeless, but **what we talk about in our creations always changes with the times**. Ultimately, all we have is the creations and stories we give ourselves, so those who come after us will have only what we leave them with — it’s incumbent on us as contemporary pioneers, then, **to shape and bring meaning** to our current zeitgeist.  \n\n![](https://images.mirror-media.xyz/publication-images/35538530-d941-4e78-a4a7-9ca4c06ae5a3.jpg?height=244&width=700)\n\n*Image via Max Osiris*\n\nOur current zeitgeist, the one we can all see beginning to form right in front of us, is **metaversal**, and it’s increasingly being fostered by [Ethereum, Web3, and NFTs](https://metaversal.banklesshq.com/p/connecting-metagalaxies-with-ethereum). \n\nThis **metaverse zeitgeist** and these aforementioned technologies are in primordial states, relatively speaking — they will undoubtedly evolve considerably from here, meaning we’re all still actively fashioning our day’s culture and our new tools. \n\nThis brings us to **curation**. For example, curating an NFT exhibit in the metaverse is second-order creation; curation complements and extends creation, it is storytelling in its own right. If we are *bricoleurs*, curation is our *[bricolage](https://en.wikipedia.org/wiki/Bricolage#Philosophy)*. And recently we’ve begun to see curation start to seriously bloom across Ethereum-based VR worlds like Cryptovoxels, Decentraland, Somnium Space, and beyond. \n\nCurating per historical themes, e.g. Baroque-inspired or Cubist-inspired NFTs, is always fair game. Yet there’s undeniably **a need for the metaverse’s curators to further cultivate their own unique exhibition themes** — we’ve got to round out and keep adding to these amazing new creations and stories we’ve begun to give ourselves; we are the shapers and that task’s in our hands. \n\n![](https://images.mirror-media.xyz/publication-images/88108361-4daa-4906-ad01-2e2f0b21f8fc.png?height=3200&width=3200)\n\n*Art via Avid Lines*\n\nSo while the metaverse isn’t a replacement for traditional galleries, its exhibitions also need not be skeuomorphic either. The young metaverse’s curators are in the middle of a new kind of frontier, and therein **the opportunities for new creative and cultural explorations are vast**. We should lean into this newness to keep shaping our zeitgeist as innovative and thoughtful creatives. \n\nAnd that’s as much for ourselves as it is for those to come: “The constellation of objects via people = curation / **The constellation of people via objects = community**,” as JPG co-founder Sam Spike [recently put it](https://twitter.com/_samspike_/status/1415827877950640134). And ultimately *this* is what JPG's all about, i.e. offering new ways for us to create and connect!\n\n*******\n\n*Enjoyed this post? Consider also subscribing to [JPG's Substack newsletter](https://jpg100.substack.com/) to stay up-to-date on everything JPG has going on!*\n\n*Featured image is \"[First Supper](https://async.art/art/master/0xb6dae651468e9593e4581705a09c10a76ac1e0c8-0)\" by Alotta Money, Coldie, Hackatao, et al. via Async Art.*\n", "timestamp": 1628611160, "digest": "E4Mw_fm4Lm9QlM6cR4fEr21ZyaqhEP3ge104PlX-lQE", "contributor": "0x08cEb8Bba685ee708C9c4c65576837cbE19B9dea"}
{"id": "zfYFYQMuXuWm5lYx9dHVe8wtZ25AYLOPoVTooXFAKq4", "title": "The creator economy is in crisis. Now let's fix it.", "body": "![Illustration by Annie Zhao for Li’s Newsletter](https://images.mirror-media.xyz/publication-images/861231e7-7553-477c-8f88-4763c5a2392d.jpg?height=1080&width=1920)\n\n\nNearly two years ago, I published “[The Passion Economy and the Future of Work](https://a16z.com/2019/10/08/passion-economy/),” which laid out a vision for online work that was informed by and a reaction to the challenges of the gig economy. While the gig economy represented a major development in the evolution of online-enabled work—removing geographical constraints for work opportunities and offering greater flexibility—it also entailed risks that were disproportionately borne by workers: reduction of leverage, income instability, lack of rights and protections accorded to employees, and lack of autonomy. Through powerful network effects and ownership of data on customers and reputation, gig platforms serve as gatekeepers to their workers being able to access income. Some scholars argue that the gig economy—which encompasses 55 million Americans or 34% of the workforce—has [eroded](https://qz.com/1556194/the-gig-economy-is-quietly-undermining-a-century-of-worker-protections/) a century’s worth of hard-won worker protections.\n\nThe passion economy was envisioned as an evolution and alternative to the gig economy mode of online work, entailing the playbook of building an online audience, cultivating direct user relationships, and monetizing skills/knowledge, content, and other individualized services. (Note that while the passion economy is broader than the creator economy insofar as income is generated from offering a wider range of individualized services and products—not only from content creation—they are overlapping: passion economy workers leverage the tools of the creator economy in order to build an audience that can be monetized in a range of ways. Therefore, I will use the terms interchangeably in this post.)\n\nThe appeal and promise of the passion economy are readily apparent: creators can reach a global audience with just an internet connection and earn a living with only [1,000](https://kk.org/thetechnium/1000-true-fans/) or [100 true fans](https://a16z.com/2020/02/06/100-true-fans/). Some creators today are earning millions of dollars per year through engaging in brand deals, selling digital content, creating courses, and more. These online micro-entrepreneurs now number over [50 million](https://signalfire.com/blog/creator-economy/) in the US. At the same time, excitement from the tech industry around the creator/passion economy is at a fever pitch: nearly [every](https://newsroom.tiktok.com/en-gb/tiktok-creator-fund-your-questions-answered) [large](https://variety.com/2021/digital/news/instagram-creator-week-jojo-siwa-saweetie-50-cent-1234982465/) [social](https://newsroom.pinterest.com/en/creatorcode) [media](https://blog.youtube/inside-youtube/letter-from-susan-our-2021-priorities/) [platform](https://variety.com/2020/digital/news/snapchat-spotlight-pay-creators-1-million-daily-1234837976/) is rolling out new funds, programs, and features to attract and retain creators. And a multitude of [new startups](https://www.armthecreators.com/mapping-the-creator-economy/) seeks to serve creators and make it easier for them to earn a living.\n\n**But just as the gig economy mode of work brought about negative consequences, strong parallels are emerging between the gig economy and creator economy, rooted in the commoditization of work and erosion of worker leverage.** For online creators today, a handful of large social media platforms serve as gatekeepers for finding and connecting with audiences. While these platforms provide valuable services to creators, including the tools for content creation, hosting, and discovery, there is an immense power imbalance between platforms and creators, who are reliant on platforms for distribution.\n\nAs we’ve traveled up the [adoption S-curve](https://onezero.medium.com/why-decentralization-matters-5e3f79f7638e), social media platforms have shifted from supporting creator individuality to commoditizing creators in order to maintain their grasp on user attention, a necessary ingredient for advertising-based business models. This dynamic undermines creator success and independence, making the creator economy just as corr\nosive for online workers as the gig economy.\n\nNumerous startups are attempting to help creators set up their standalone, owned properties online; earn more from fewer, truer fans; and lessen their dependence on social media platforms. **But unless we radically change the foundation of the creator economy—how creators find and connect to a community in the first place—these solutions are incremental at best, and don’t create a fundamental unlock for the issues plaguing the current creator economy.**\n\nOnly by understanding how the creator economy is evolving and its risks can we be more thoughtful in moving it forward. My goal with this blog post is to help the tech community amplify their positive impact; help creators understand and take action to improve their situations; and prompt founders to balance the needs of all stakeholders in building platforms that influence the livelihoods of millions of users.\n\n## The new shape of capital\n\nIn a world where work is increasingly mediated by platforms, the relationship between workers and capital owners evolves. Historically, capital ownership revolved around physical capital, such as manufacturing equipment, raw materials, and buildings. During the Industrial Revolution, workers migrated en masse to cities to seek work at various centers of production, with the proportion of the population living in cities jumping from 17% to 72% between 1801 and 1891 in England and Wales. Since the late 20th century, capital has shifted and abstracted from production to finance, with financial services accounting for an increasing share of national income relative to other non-financial sectors.\n\n**Today, with the shift to platform-mediated work, capital is evolving once more, to ownership of data that enables productivity.**\n\nGig economy platforms’ lock-in isn’t predicated on controlling physical capital or manufacturing equipment. Instead, their capital is *data* that they gather and control—locations of every network participant, the record of all events and interactions, reputation and feedback scores, and market-clearing prices—all of which strengthens their network effects.\n\nSimilarly, the creator economy is marked by the rise of a small number of firms that have accumulated capital and effectively control the means of production and distribution. While online platforms have unlocked the traditional gatekeepers of the creative world, they also serve as the access chokepoints of a new type of capital. The dominant centralized creator platforms own the data, social graphs, and end user relationships—all of which creators need in order to access audiences and income. Furthermore, in the majority of cases, this type of capital cannot be easily ported over to external, creator-owned properties. In this way, creator labor is controlled and commoditized by platforms.\n\n## Parallel problems in the gig and creator economies\n\nAgainst this backdrop of creator platforms controlling the means of production, various risks are arising:\n\n### Over-supply and competition between creators\n\nAs in the gig economy, the creator economy is marked by the incentivization of over-supply: there is a multitude of creators willing to create content, and algorithmic feeds serve up a steady stream of alternatives. As a creator, one’s content is commoditized and substitutable with rival offerings. When there is one monolithic feed built with an algorithm that uses a preferential attachment model, a small set of creators rise to the top, and all creators compete with each other to capture the attention of audiences. The result is a zero-sum competition between creators that results in over-supply and devaluation of content. Though creators are trying to implement the playbook of leveraging social media platforms to build an audience before porting them elsewhere, the movement of one's audience is a non-trivial process that platforms are resistant to facilitating.\n\nA unique element that impedes organization and activism among creators is the intrinsic motivation behind online creative work: creating content often has the connotation of being a hobby or labor of love, which causes many new aspiring creators to join platforms and start creating content for free, without any expectation of compensation, benefits, or protections. This makes creative labor uniquely at risk of being undervalued and exploited.\n\n### Exploitation of creator labor\n\nWhile unpaid internships are still legal in many cases in the US, they are increasingly considered exploitative. The Fair Labor Standards Act of 1938 stipulates that any employee of a for-profit company must be paid for their work. In contrast, creators are effectively large-scale [unpaid workforces](https://research.cornell.edu/news-features/dream-work-unpaid-labor-gig-economy), uploading massive amounts of content that platforms have converted into billions of dollars of revenue and trillions of dollars of equity value. Sometimes, creators receive a share of the revenue that platforms earn from their content, but [lack enfranchisement](https://twitter.com/ljin18/status/1374162266287968257?lang=en) in how pay is determined or how monetization rules and thresholds are set. This is reminiscent of the compensation practices in the gig economy: ridesharing and delivery platforms shift their costs and risks onto drivers, who go unpaid when there are no rides or orders, resulting in [effective earnings](https://irle.berkeley.edu/files/2020/07/Parrott-Reich-Seattle-Report_July-2020.pdf) that are below minimum wage.\n\n### Insecurity and volatility\n\nCreator labor entails the same job and income insecurity as gig work. In the gig work world, clients can end contracts at any time, and providers can be swapped out easily. The same can be said for creators: if users are not satisfied with the content or offering, another creator is just a swipe away. Underscoring this job insecurity is a black-box algorithm that drives most social media discovery feeds: product design can change at a moment’s notice to favor different types of content, diverting potential prospective followers elsewhere. This insecurity and volatility is a direct contributor to [creator burnout](https://www.nytimes.com/2021/06/08/style/creator-burnout-social-media.html).\n\nIn a *New York Times* [article](https://www.nytimes.com/2021/06/08/style/creator-burnout-social-media.html) about creator burnout, a TikTok creator in Toronto says, “It almost feels like I’m getting a taste of celebrity, but it’s never consistent and as soon as you get it, it’s gone and you’re constantly trying to get it back.”\n\nLast summer, creators’ job insecurity came into focus during the [shutdown of Mixer](https://www.theverge.com/2020/6/22/21299032/microsoft-mixer-closing-facebook-gaming-partnership-xcloud-features) and, later, the threatened [ban of TikTok](https://www.nytimes.com/2020/08/02/style/tiktok-ban-threat-trump.html). Creators exhorted followers to follow their other social media accounts, and third-party products [arose](https://www.fyp.rip/) to let creators download a copy of their own content or [follower lists](https://www.goodbyemixer.com/). De-platforming—whether by a platform or by the state—means that creators can easily lose access to their audiences and past creations. In the gig economy, the parallel occurs when platforms deactivate worker accounts (for a variety of [reasons](https://www.uber.com/blog/new-york-appeals/)), and workers lose their ability to earn income, with no recourse for reaching previous customers.\n\n### Intermediation and taxation\n\nBecause creator platforms often own the relationship between creators and fans, they are also able to intermediate the economic relationship, with compensation determined by the platform. Just as gig workers are unable to negotiate their pay with platforms, creators are similarly price takers, with platforms deciding revenue share rates, monetization criteria, creator fund payouts, and other elements that drive creator income. Unilateral and often opaque monetization policies have resulted in widespread creator mistrust. A WIRED [article](https://www.wired.com/story/tiktok-creators-fund-revenue-sharing-complaints/) about the TikTok Creator Fund noted, “Three creators who spoke with WIRED say they noticed their views drop after they joined the fund, and they wondered whether TikTok was intentionally limiting their reach to cap how much they could earn. Two of them have since opted out of the program entirely.”\n\nThere can also be intermediation by other creators: because of the role that follower graphs and reputation play in surfacing content, influence and monetization flow to those who already have large audiences. The associated risks include [lack of attribution](https://www.nytimes.com/2021/06/25/style/black-tiktok-strike.html) to smaller creators for trends or withholding of earnings by [intermediaries](https://www.vox.com/the-goods/21459677/tiktok-house-la-hype-sway-girls-in-the-valley) purporting to represent creators.\n\n## How do we build a healthier creator economy?\n\nIn the face of increasingly commoditized creator labor, a few principles should be upheld to realize the vision of a better creator economy:\n\n### 1. Ownership and portability\n\nOwnership comes in different forms: creators are increasingly prioritizing owning a neutral channel of communication with their audiences (via email lists, RSS feed subscribers) and owning the direct monetization relationship with end users (Stripe account). Creators are also setting up their own websites, potentially self-hosted with their owned domains, as a way to build more direct fan relationships. Creator and user ownership of data, relationships, content, identities, and interactions would weaken platforms’ lock-in and entail a shift in power from platforms to their participants, enabling them to operate outside of a handful of platforms.\n\n**But we can go even further in enabling creators and users to control their own destiny: software itself can become community-owned and operated**. In crypto networks, that can entail a [distribution of tokens](https://a16z.com/2020/01/09/progressive-decentralization-crypto-product-management/) that confers governance rights; while in Web2 platforms, user ownership can take the form of engaging the community as investors and advisors (potentially enabled through tools like [Fairmint](http://fairmint.co/), [Republic](https://republic.co/), [Cabal](http://getcabal.com/), or [Stonks](http://stonks.com/)). For companies, engaging creators as shareholders can give creators more incentive to contribute to a company that they co-own, offers opportunities for creators to shape decisions that help the business succeed, and creates incentive alignment between the platform and its participants.\n\nOn content itself: while most Web2 platforms don’t claim ownership of users’ content, they grant the platform the right to use, distribute, and modify their work. Instagram’s Terms of Use states, “you hereby grant to us a non-exclusive, royalty-free, transferable, sub-licensable, worldwide license to host, use, distribute, modify, run, copy, publicly perform or display, translate, and create derivative works of your content.” In other words, users are essentially giving control to the platform as to how, where, when and under what circumstances the image can be reused—a loss of ownership and control that leads to their content being devalued and commoditized.\n\nFred Wilson has [written](https://avc.com/2021/03/mirror/) about ownership on his blog:\n\n“[I]t is important to me that I control the platform that I publish on. I use the open-source WordPress software for my content management system and run that on a hosted server. I use my own domain, AVC.com, to locate my writings on the Internet. That has served me well. No matter how horrible I become, nobody is going to take me down.\n\nBut we can go even further down this path of controlling our destiny. We can decentralize the entire thing; the content management system, the storage of the content, the domain name system.”\n\n### 2. Credibly neutral creator mechanisms\n\nVitalik Buterin wrote about the importance of building mechanisms that are credibly neutral, in which he [described](https://nakamoto.com/credible-neutrality), “a mechanism is credibly neutral if just by looking at the mechanism’s design, it is easy to see that the mechanism does not discriminate for or against any specific people.” The four elements of credible neutrality are: (1) Don’t write specific people or specific outcomes into the mechanism, (2) Open source and publicly verifiable execution, (3) Keep it simple, and (4) Don’t change it too often.\n\nAnother way to think about credible neutrality is the idea of the “[veil of ignorance](https://en.wikipedia.org/wiki/Original_position).” In this thought experiment, citizens making choices about their society are asked to make them from behind a \"veil of ignorance,\" without knowing their gender, race, abilities, tastes, wealth, or position in society. Correspondingly, applying the veil of ignorance to creator platforms allows us to test policies, monetization mechanisms, funds, and product mechanics for fairness and impartiality. For instance, would we design the TikTok Creator Fund as-is, if we were situated behind the veil of ignorance with no knowledge of which particular creator we would be on the platform?\n\nIt’s easy to see how today’s Web2 platforms lack credible neutrality and would fail veil-of-ignorance reasoning: algorithms that decide which content gets shown aren’t publicly verifiable, and removal of certain creators or content happens arbitrarily. Facebook’s [Oversight Board](https://oversightboard.com/) is an imperfect attempt at credible neutrality, comprised of 20 “independent” members (that Facebook selected) who review decisions about content moderation. Recently, with the ban of Donald Trump, the Board [argued](https://oversightboard.com/news/226612455899839-oversight-board-upholds-former-president-trump-s-suspension-finds-facebook-failed-to-impose-proper-penalty/) that indefinite suspension was an arbitrary punishment that was not supported by the company’s stated policies: “It is not permissible for Facebook to keep a user off the platform for an undefined period, with no criteria for when or whether the account will be restored.” It went on to say, “In applying a vague, standardless penalty and then referring this case to the Board to resolve, Facebook seeks to avoid its responsibilities.” More broadly, in response to the limited powers and questionable neutrality of the Facebook Oversight Board, an ad-hoc group of activists, researchers, and academics convened a “[Real Facebook Oversight Board](https://www.newyorker.com/tech/annals-of-technology/the-ad-hoc-group-of-activists-and-academics-convening-a-real-facebook-oversight-board)” to push for more accountability.\n\nIn contrast, the [Mirror $WRITE RACE](https://mirror.xyz/race) is a weekly open voting process in which the existing users of Mirror, a community-owned and operated publishing platform, decide on which new members to induct. The team [wrote](https://dev.mirror.xyz/vZxxUIeGMQK9NNLcrT0eDYZ6wXhXVr6vTQzztj1DaEA), “Are we, the Mirror team, the sole gatekeepers of the platform? Is that at all in line with our values? Do we even have time for that? The answer is no, no and no.” Though prospective members may not like the results, the process is open, neutral, and publicly verifiable.\n\n### 3. Creator-friendly business models\n\nBusiness models define incentives, and [incentives drive the content that users create](https://twitter.com/ljin18/status/1311487141931876353?lang=en). Offering more direct monetization models (where users pay creators) can encourage creators to align their content with what end users value, versus creating content that maximizes watch time or virality. Other monetization models can foster a [creator middle class](https://hbr.org/2020/12/the-creator-economy-needs-a-middle-class), for instance, allowing creators to capitalize on superfans to capture more of the area underneath their [demand curve](https://a16z.com/2021/02/27/nfts-and-a-thousand-true-fans/), or to earn more passive income (e.g. “create now, earn later,”), thus reducing the active effort needed to maintain financial success and mitigating creator burnout.\n\nIn addition, platforms should set take rates that are minimally extractive. Bill Gurley outlines the strategy behind platform take rates in his [post](https://abovethecrowd.com/2013/04/18/a-rake-too-far-optimal-platformpricing-strategy/): “In order for your platform to be the “definitive” place to transact, you want industry leading pricing – which is impossible if your rake is the de facto cause of excessive pricing.” He also outlines an example of Priceline Group enabling participants to [bid up](https://www.travelweekly.com/Travel-News/Hotel-News/Expedia-pay-for-positioning-program-riles-hotel-trade-group) their take rate for better placement. This is in contrast to most creator platforms today, which set take rates [unilaterally](https://twitter.com/ljin18/status/1374162266287968257?lang=en), and sometimes regressively (more successful creators pay less, e.g. on Twitch).\n\nAs outlined above, turning stakeholders into shareholders, as in creator- and user-owned platforms, can better align the interests of platforms with creators. Ownership can confer both economic and governance rights, meaning that creators and users decide on product strategy, leadership, and what to do with profits.\n\n### 4. Creator interdependence and solidarity\n\nToday’s creator economy, as it exists on centralized social platforms, pits creators in competition with each other in a constant battle for fleeting attention. Going forward, my hope is that we can build platforms and mechanisms that incentivize mutual support between creators, where one creator’s success does not come at the expense of another’s.\n\n[Creator DAOs](https://www.coindesk.com/nfts-daos-new-creator-economy) (decentralized autonomous organizations) are a way to turn a group of people with a shared mission (e.g. creating media about a certain topic) into a decentralized army with a treasury and governance tools that harness members’ collective intelligence. Today, we’re seeing lots of experimentation in creator DAOs: members vote on creative projects, co-create content, have all revenue flow to a treasury, and share in ownership (examples include [Songcamp’s Elektra](https://songcamp.mirror.xyz/mkb-m9GWUCLByETAvCigJ0JIpz4XH8bwNDBtUJBPeFc) or [DIRT](https://air.mirror.xyz/lmV9Dxeos9HvKSu0BKY9pqARK2vAlPXhrNMt68E4GkI)). Beyond creator DAOs, recent instances of large groups of people pooling together capital in order to buy NFT artwork, e.g. via [PartyBid](https://www.partybid.app/party/0x2912F57F93dD69FBbF477B616D6f8C34C49bb282), hints at how people can organize to reach a collective goal. These organizations hold glimpses of what this more cooperative future may look like, and I expect best practices to emerge for how creators can leverage DAOs. Perhaps one element of these DAOs could be [Universal Creative Income](https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g), funded by the community treasury, in order to broaden access for emerging, diverse creators. In contrast to today’s creator funds offered by social media platforms, the eligibility for funding could be based on independently verifiable data since all user metrics are on-chain.\n\nNote that it’s likely infeasible for existing platforms to adopt the principles above, as doing so would erode their current business models and weaken their network effects. Innovator’s dilemma suggests that new entrants are most likely going to be the ones building with these creator-friendly principles in mind, with new disruptive business models that align with creators’ interests.\n\n## Open questions to explore\n\n***What channels could exist to institutionalize creator voice?***\n\nStrengthening creators’ voice would not only benefit creators, but also help platforms themselves design and implement features with the buy-in of creators. I’m excited to see novel methods of incorporating worker voice into platform governance and decision-making (and balancing creator voice with those of investors who aren’t actively contributing labor). As a glimpse into what this future could look like, DeFi protocols allow token holders to vote on key decisions like the take rate (Uniswap), algorithms (Yearn), and integrations (Compound).\n\nAmong Web2 platforms, Twitter’s [open call for proposals](https://blog.twitter.com/en_us/topics/company/2020/help-us-shape-our-new-approach-to-verification) on how its verification program should work is a step in the right direction: “Calling for public feedback has become an important part of our policy development process because we want to ensure that, as an open service, our rules reflect the voices of the people who use Twitter.”\n\nAnother example is [Airbnb’s Host Advisory Board](https://www.airbnb.com/resources/hosting-homes/a/how-were-giving-hosts-a-seat-at-the-table-283), designed to serve as a voice for hosts with Airbnb’s leadership: “They’ll be a formal link between Airbnb hosts and Airbnb leadership, participating in monthly meetings with Airbnb and an official Advisory Board Forum each year to present hosts’ ideas.” However, the opacity with which the initial advisory board was chosen, and whether members are actually representative of the broader host community, has been met with scrutiny in the Airbnb [host forum](https://community.withairbnb.com/t5/Help/Host-Endowment-Fund-your-thoughts/td-p/1378753).\n\n***How can platforms be designed to mitigate creator anxiety and insecurity?***\n\nProduct design can have massive implications on creator burnout and anxiety. One common desire among creators is for more transparency on the part of platforms about how the discovery algorithm works and updates to how it is changing. The algorithm serves as a quasi-“manager” for online creative work, continuously influencing and assessing creators, yet is currently opaque. Hunter Walk also wrote a [post](https://hunterwalk.medium.com/instagram-youtube-tiktok-are-burning-out-their-creators-heres-how-to-fix-that-7298dcfbd055) with ideas for how creator wellness could be built fundamentally into the product, including seasoning of content, rate-limiting posts, and platforms offering paid time off to creators.\n\nAs an example of what this could look like, [Streamloots](https://www.streamloots.com/), a streamer monetization platform, offers a [mental health support program](https://venturebeat.com/2020/12/15/streamloots-strong-will-provide-mental-health-support-for-streaming-community/) for influencers on its platform.\n\nA fundamental driver of creator anxiety is economic insecurity. To that point, solving for the underlying financial precarity of creators, whether by providing creators with Universal Creative Income or enabling more creator cooperativism e.g. through DAOs, may address the actual root issues underlying creator mental health issues.\n\n***What forms of online collective action could emerge?***\n\nCreators ought to explore means of collectively expressing their voice, to bring their demands to bear upon platforms and clients. In 2015, 20 of the top 50 [Vine creators](https://www.mic.com/articles/157977/inside-the-secret-meeting-that-changed-the-fate-of-vine-forever) met with the app’s management team to propose product and monetization changes. Current examples of creators organizing to effect change include TikTok creators going on [strike](https://www.nytimes.com/2021/06/25/style/black-tiktok-strike.html), and [FYPM](https://www.fypm.vip/), a “Glassdoor for influencers” that aggregates creator reviews on working experiences with various brands.\n\n***How does discovery and distribution work in a post-social media platform world?***\n\nPlatforms today are double-edged swords for creators: creators rely on them to grow their audience, but also want to be able to reduce their dependence on them over time. Creators can’t forego creating content on social media platforms until they are widely popular and can grow from word-of-mouth. One solution is creator collectives and bundles, where those with larger audiences can boost emerging ones. As an example, [Every](https://every.to/) is a newsletter bundle that offers both distribution and ownership: “We give our writers financial upside in the work they do and the freedom to build their own creative vision, but we also support them with distribution to an audience, editorial support, and an advance on their subscription revenue if they need it.”\n\n------\n\nIn a recent post about creator compensation, I [wrote](https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g), “In the digital world, user rights are civic rights, and creator rights are worker rights.” The problems emerging in the online creator economy are the latest instantiations of the same broader political economy problems that afflict our society, with widespread worker vulnerability, a hollowed-out middle class, and externalized business risks that are shifted instead to private individuals.\n\nAs the economy undergoes a profound shift to platform-mediated work, the conditions around labor are rapidly changing. Creators may be a new class of workers, but the parallels to previous labor movements—including those in the gig economy—are clear. In centuries past, worker rights and worker-friendly company environments didn’t just emerge spontaneously, but were hard-won. Likewise, creator empowerment will be the product of concerted efforts by founders, investors, creators, and the broader tech community to craft structures and platforms that prioritize creator control and ownership.\n\n------\n\n*Thank you to Patrick Rivera, Jesse Walden, Sasha Hudzilin, Lindsey Lee Lugrin, Matt Lockyer, Lila Shroff, Alberto Martínez Guerrero, and Louis Giraux for reviewing drafts.*\n\n## **Further reading**\n\n[https://ez.substack.com/p/most-creator-economy-companies-just](https://ez.substack.com/p/most-creator-economy-companies-just)\n\n[https://www.newyorker.com/culture/infinite-scroll/what-the-creator-economy-promises-and-what-it-actually-does](https://www.newyorker.com/culture/infinite-scroll/what-the-creator-economy-promises-and-what-it-actually-does)\n\n[https://www.nytimes.com/2021/06/08/style/creator-burnout-social-media.html](https://www.nytimes.com/2021/06/08/style/creator-burnout-social-media.html)\n\n[https://hunterwalk.medium.com/instagram-youtube-tiktok-are-burning-out-their-creators-heres-how-to-fix-that-7298dcfbd055](https://hunterwalk.medium.com/instagram-youtube-tiktok-are-burning-out-their-creators-heres-how-to-fix-that-7298dcfbd055)\n\n[https://li.substack.com/p/uber-and-instacart-dont-represent](https://li.substack.com/p/uber-and-instacart-dont-represent)\n\n[https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g](https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g)\n\n[https://every.to/means-of-creation/apple-is-holding-back-the-creator-economy](https://every.to/means-of-creation/apple-is-holding-back-the-creator-economy)\n\n[https://hbr.org/2020/12/the-creator-economy-needs-a-middle-class](https://hbr.org/2020/12/the-creator-economy-needs-a-middle-class)\n", "timestamp": 1628611958, "digest": "Rgk2La8izmn5LaqAlRHne-N2g0CaAxWdaSXW8KE8-Ag", "contributor": "0x808a2adbD0a3fc679e3F7CD18d4f579BFCaaEC9C"}
{"id": "_FvH3klgVWNGP9RX7Z58hEN0u6SrCc6Gwrr24sXGR6w", "title": "The creator economy is in crisis. Now let's fix it.", "body": "![Illustration by Annie Zhao for Li’s Newsletter](https://images.mirror-media.xyz/publication-images/861231e7-7553-477c-8f88-4763c5a2392d.jpg?height=1080&width=1920)\n\n\nNearly two years ago, I published “[The Passion Economy and the Future of Work](https://a16z.com/2019/10/08/passion-economy/),” which laid out a vision for online work that was informed by and a reaction to the challenges of the gig economy. While the gig economy represented a major development in the evolution of online-enabled work—removing geographical constraints for work opportunities and offering greater flexibility—it also entailed risks that were disproportionately borne by workers: reduction of leverage, income instability, lack of rights and protections accorded to employees, and lack of autonomy. Through powerful network effects and ownership of data on customers and reputation, gig platforms serve as gatekeepers to their workers being able to access income. Some scholars argue that the gig economy—which encompasses 55 million Americans or 34% of the workforce—has [eroded](https://qz.com/1556194/the-gig-economy-is-quietly-undermining-a-century-of-worker-protections/) a century’s worth of hard-won worker protections.\n\nThe passion economy was envisioned as an evolution and alternative to the gig economy mode of online work, entailing the playbook of building an online audience, cultivating direct user relationships, and monetizing skills/knowledge, content, and other individualized services. (Note that while the passion economy is broader than the creator economy insofar as income is generated from offering a wider range of individualized services and products—not only from content creation—they are overlapping: passion economy workers leverage the tools of the creator economy in order to build an audience that can be monetized in a range of ways. Therefore, I will use the terms interchangeably in this post.)\n\nThe appeal and promise of the passion economy are readily apparent: creators can reach a global audience with just an internet connection and earn a living with only [1,000](https://kk.org/thetechnium/1000-true-fans/) or [100 true fans](https://a16z.com/2020/02/06/100-true-fans/). Some creators today are earning millions of dollars per year through engaging in brand deals, selling digital content, creating courses, and more. These online micro-entrepreneurs now number over [50 million](https://signalfire.com/blog/creator-economy/) in the US. At the same time, excitement from the tech industry around the creator/passion economy is at a fever pitch: nearly [every](https://newsroom.tiktok.com/en-gb/tiktok-creator-fund-your-questions-answered) [large](https://variety.com/2021/digital/news/instagram-creator-week-jojo-siwa-saweetie-50-cent-1234982465/) [social](https://newsroom.pinterest.com/en/creatorcode) [media](https://blog.youtube/inside-youtube/letter-from-susan-our-2021-priorities/) [platform](https://variety.com/2020/digital/news/snapchat-spotlight-pay-creators-1-million-daily-1234837976/) is rolling out new funds, programs, and features to attract and retain creators. And a multitude of [new startups](https://www.armthecreators.com/mapping-the-creator-economy/) seeks to serve creators and make it easier for them to earn a living.\n\n**But just as the gig economy mode of work brought about negative consequences, strong parallels are emerging between the gig economy and creator economy, rooted in the commoditization of work and erosion of worker leverage.** For online creators today, a handful of large social media platforms serve as gatekeepers for finding and connecting with audiences. While these platforms provide valuable services to creators, including the tools for content creation, hosting, and discovery, there is an immense power imbalance between platforms and creators, who are reliant on platforms for distribution.\n\nAs we’ve traveled up the [adoption S-curve](https://onezero.medium.com/why-decentralization-matters-5e3f79f7638e), social media platforms have shifted from supporting creator individuality to commoditizing creators in order to maintain their grasp on user attention, a necessary ingredient for advertising-based business models. This dynamic undermines creator success and independence, making the creator economy just as corrosive for online workers as the gig economy.\n\nNumerous startups are attempting to help creators set up their standalone, owned properties online; earn more from fewer, truer fans; and lessen their dependence on social media platforms. **But unless we radically change the foundation of the creator economy—how creators find and connect to a community in the first place—these solutions are incremental at best, and don’t create a fundamental unlock for the issues plaguing the current creator economy.**\n\nOnly by understanding how the creator economy is evolving and its risks can we be more thoughtful in moving it forward. My goal with this blog post is to help the tech community amplify their positive impact; help creators understand and take action to improve their situations; and prompt founders to balance the needs of all stakeholders in building platforms that influence the livelihoods of millions of users.\n\n## The new shape of capital\n\nIn a world where work is increasingly mediated by platforms, the relationship between workers and capital owners evolves. Historically, capital ownership revolved around physical capital, such as manufacturing equipment, raw materials, and buildings. During the Industrial Revolution, workers migrated en masse to cities to seek work at various centers of production, with the proportion of the population living in cities jumping from 17% to 72% between 1801 and 1891 in England and Wales. Since the late 20th century, capital has shifted and abstracted from production to finance, with financial services accounting for an increasing share of national income relative to other non-financial sectors.\n\n**Today, with the shift to platform-mediated work, capital is evolving once more, to ownership of data that enables productivity.**\n\nGig economy platforms’ lock-in isn’t predicated on controlling physical capital or manufacturing equipment. Instead, their capital is *data* that they gather and control—locations of every network participant, the record of all events and interactions, reputation and feedback scores, and market-clearing prices—all of which strengthens their network effects.\n\nSimilarly, the creator economy is marked by the rise of a small number of firms that have accumulated capital and effectively control the means of production and distribution. While online platforms have unlocked the traditional gatekeepers of the creative world, they also serve as the access chokepoints of a new type of capital. The dominant centralized creator platforms own the data, social graphs, and end user relationships—all of which creators need in order to access audiences and income. Furthermore, in the majority of cases, this type of capital cannot be easily ported over to external, creator-owned properties. In this way, creator labor is controlled and commoditized by platforms.\n\n## Parallel problems in the gig and creator economies\n\nAgainst this backdrop of creator platforms controlling the means of production, various risks are arising:\n\n### Over-supply and competition between creators\n\nAs in the gig economy, the creator economy is marked by the incentivization of over-supply: there is a multitude of creators willing to create content, and algorithmic feeds serve up a steady stream of alternatives. As a creator, one’s content is commoditized and substitutable with rival offerings. When there is one monolithic feed built with an algorithm that uses a preferential attachment model, a small set of creators rise to the top, and all creators compete with each other to capture the attention of audiences. The result is a zero-sum competition between creators that results in over-supply and devaluation of content. Though creators are trying to implement the playbook of leveraging social media platforms to build an audience before porting them elsewhere, the movement of one's audience is a non-trivial process that platforms are resistant to facilitating.\n\nA unique element that impedes organization and activism among creators is the intrinsic motivation behind online creative work: creating content often has the connotation of being a hobby or labor of love, which causes many new aspiring creators to join platforms and start creating content for free, without any expectation of compensation, benefits, or protections. This makes creative labor uniquely at risk of being undervalued and exploited.\n\n### Exploitation of creator labor\n\nWhile unpaid internships are still legal in many cases in the US, they are increasingly considered exploitative. The Fair Labor Standards Act of 1938 stipulates that any employee of a for-profit company must be paid for their work. In contrast, creators are effectively large-scale [unpaid workforces](https://research.cornell.edu/news-features/dream-work-unpaid-labor-gig-economy), uploading massive amounts of content that platforms have converted into billions of dollars of revenue and trillions of dollars of equity value. Sometimes, creators receive a share of the revenue that platforms earn from their content, but [lack enfranchisement](https://twitter.com/ljin18/status/1374162266287968257?lang=en) in how pay is determined or how monetization rules and thresholds are set. This is reminiscent of the compensation practices in the gig economy: ridesharing and delivery platforms shift their costs and risks onto drivers, who go unpaid when there are no rides or orders, resulting in [effective earnings](https://irle.berkeley.edu/files/2020/07/Parrott-Reich-Seattle-Report_July-2020.pdf) that are below minimum wage.\n\n### Insecurity and volatility\n\nCreator labor entails the same job and income insecurity as gig work. In the gig work world, clients can end contracts at any time, and providers can be swapped out easily. The same can be said for creators: if users are not satisfied with the content or offering, another creator is just a swipe away. Underscoring this job insecurity is a black-box algorithm that drives most social media discovery feeds: product design can change at a moment’s notice to favor different types of content, diverting potential prospective followers elsewhere. This insecurity and volatility is a direct contributor to [creator burnout](https://www.nytimes.com/2021/06/08/style/creator-burnout-social-media.html).\n\nIn a *New York Times* [article](https://www.nytimes.com/2021/06/08/style/creator-burnout-social-media.html) about creator burnout, a TikTok creator in Toronto says, “It almost feels like I’m getting a taste of celebrity, but it’s never consistent and as soon as you get it, it’s gone and you’re constantly trying to get it back.”\n\nLast summer, creators’ job insecurity came into focus during the [shutdown of Mixer](https://www.theverge.com/2020/6/22/21299032/microsoft-mixer-closing-facebook-gaming-partnership-xcloud-features) and, later, the threatened [ban of TikTok](https://www.nytimes.com/2020/08/02/style/tiktok-ban-threat-trump.html). Creators exhorted followers to follow their other social media accounts, and third-party products [arose](https://www.fyp.rip/) to let creators download a copy of their own content or [follower lists](https://www.goodbyemixer.com/). De-platforming—whether by a platform or by the state—means that creators can easily lose access to their audiences and past creations. In the gig economy, the parallel occurs when platforms deactivate worker accounts (for a variety of [reasons](https://www.uber.com/blog/new-york-appeals/)), and workers lose their ability to earn income, with no recourse for reaching previous customers.\n\n### Intermediation and taxation\n\nBecause creator platforms often own the relationship between creators and fans, they are also able to intermediate the economic relationship, with compensation determined by the platform. Just as gig workers are unable to negotiate their pay with platforms, creators are similarly price takers, with platforms deciding revenue share rates, monetization criteria, creator fund payouts, and other elements that drive creator income. Unilateral and often opaque monetization policies have resulted in widespread creator mistrust. A WIRED [article](https://www.wired.com/story/tiktok-creators-fund-revenue-sharing-complaints/) about the TikTok Creator Fund noted, “Three creators who spoke with WIRED say they noticed their views drop after they joined the fund, and they wondered whether TikTok was intentionally limiting their reach to cap how much they could earn. Two of them have since opted out of the program entirely.”\n\nThere can also be intermediation by other creators: because of the role that follower graphs and reputation play in surfacing content, influence and monetization flow to those who already have large audiences. The associated risks include [lack of attribution](https://www.nytimes.com/2021/06/25/style/black-tiktok-strike.html) to smaller creators for trends or withholding of earnings by [intermediaries](https://www.vox.com/the-goods/21459677/tiktok-house-la-hype-sway-girls-in-the-valley) purporting to represent creators.\n\n## How do we build a healthier creator economy?\n\nIn the face of increasingly commoditized creator labor, a few principles should be upheld to realize the vision of a better creator economy:\n\n### 1. Ownership and portability\n\nOwnership comes in different forms: creators are increasingly prioritizing owning a neutral channel of communication with their audiences (via email lists, RSS feed subscribers) and owning the direct monetization relationship with end users (Stripe account). Creators are also setting up their own websites, potentially self-hosted with their owned domains, as a way to build more direct fan relationships. Creator and user ownership of data, relationships, content, identities, and interactions would weaken platforms’ lock-in and entail a shift in power from platforms to their participants, enabling them to operate outside of a handful of platforms.\n\n**But we can go even further in enabling creators and users to control their own destiny: software itself can become community-owned and operated**. In crypto networks, that can entail a [distribution of tokens](https://a16z.com/2020/01/09/progressive-decentralization-crypto-product-management/) that confers governance rights; while in Web2 platforms, user ownership can take the form of engaging the community as investors and advisors (potentially enabled through tools like [Fairmint](http://fairmint.co/), [Republic](https://republic.co/), [Cabal](http://getcabal.com/), or [Stonks](http://stonks.com/)). For companies, engaging creators as shareholders can give creators more incentive to contribute to a company that they co-own, offers opportunities for creators to shape decisions that help the business succeed, and creates incentive alignment between the platform and its participants.\n\nOn content itself: while most Web2 platforms don’t claim ownership of users’ content, they grant the platform the right to use, distribute, and modify their work. Instagram’s Terms of Use states, “you hereby grant to us a non-exclusive, royalty-free, transferable, sub-licensable, worldwide license to host, use, distribute, modify, run, copy, publicly perform or display, translate, and create derivative works of your content.” In other words, users are essentially giving control to the platform as to how, where, when and under what circumstances the image can be reused—a loss of ownership and control that leads to their content being devalued and commoditized.\n\nFred Wilson has [written](https://avc.com/2021/03/mirror/) about ownership on his blog:\n\n“[I]t is important to me that I control the platform that I publish on. I use the open-source WordPress software for my content management system and run that on a hosted server. I use my own domain, AVC.com, to locate my writings on the Internet. That has served me well. No matter how horrible I become, nobody is going to take me down.\n\nBut we can go even further down this path of controlling our destiny. We can decentralize the entire thing; the content management system, the storage of the content, the domain name system.”\n\n### 2. Credibly neutral creator mechanisms\n\nVitalik Buterin wrote about the importance of building mechanisms that are credibly neutral, in which he [described](https://nakamoto.com/credible-neutrality), “a mechanism is credibly neutral if just by looking at the mechanism’s design, it is easy to see that the mechanism does not discriminate for or against any specific people.” The four elements of credible neutrality are: (1) Don’t write specific people or specific outcomes into the mechanism, (2) Open source and publicly verifiable execution, (3) Keep it simple, and (4) Don’t change it too often.\n\nAnother way to think about credible neutrality is the idea of the “[veil of ignorance](https://en.wikipedia.org/wiki/Original_position).” In this thought experiment, citizens making choices about their society are asked to make them from behind a \"veil of ignorance,\" without knowing their gender, race, abilities, tastes, wealth, or position in society. Correspondingly, applying the veil of ignorance to creator platforms allows us to test policies, monetization mechanisms, funds, and product mechanics for fairness and impartiality. For instance, would we design the TikTok Creator Fund as-is, if we were situated behind the veil of ignorance with no knowledge of which particular creator we would be on the platform?\n\nIt’s easy to see how today’s Web2 platforms lack credible neutrality and would fail veil-of-ignorance reasoning: algorithms that decide which content gets shown aren’t publicly verifiable, and removal of certain creators or content happens arbitrarily. Facebook’s [Oversight Board](https://oversightboard.com/) is an imperfect attempt at credible neutrality, comprised of 20 “independent” members (that Facebook selected) who review decisions about content moderation. Recently, with the ban of Donald Trump, the Board [argued](https://oversightboard.com/news/226612455899839-oversight-board-upholds-former-president-trump-s-suspension-finds-facebook-failed-to-impose-proper-penalty/) that indefinite suspension was an arbitrary punishment that was not supported by the company’s stated policies: “It is not permissible for Facebook to keep a user off the platform for an undefined period, with no criteria for when or whether the account will be restored.” It went on to say, “In applying a vague, standardless penalty and then referring this case to the Board to resolve, Facebook seeks to avoid its responsibilities.” More broadly, in response to the limited powers and questionable neutrality of the Facebook Oversight Board, an ad-hoc group of activists, researchers, and academics convened a “[Real Facebook Oversight Board](https://www.newyorker.com/tech/annals-of-technology/the-ad-hoc-group-of-activists-and-academics-convening-a-real-facebook-oversight-board)” to push for more accountability.\n\nIn contrast, the [Mirror $WRITE RACE](https://mirror.xyz/race) is a weekly open voting process in which the existing users of Mirror, a community-owned and operated publishing platform, decide on which new members to induct. The team [wrote](https://dev.mirror.xyz/vZxxUIeGMQK9NNLcrT0eDYZ6wXhXVr6vTQzztj1DaEA), “Are we, the Mirror team, the sole gatekeepers of the platform? Is that at all in line with our values? Do we even have time for that? The answer is no, no and no.” Though prospective members may not like the results, the process is open, neutral, and publicly verifiable.\n\n### 3. Creator-friendly business models\n\nBusiness models define incentives, and [incentives drive the content that users create](https://twitter.com/ljin18/status/1311487141931876353?lang=en). Offering more direct monetization models (where users pay creators) can encourage creators to align their content with what end users value, versus creating content that maximizes watch time or virality. Other monetization models can foster a [creator middle class](https://hbr.org/2020/12/the-creator-economy-needs-a-middle-class), for instance, allowing creators to capitalize on superfans to capture more of the area underneath their [demand curve](https://a16z.com/2021/02/27/nfts-and-a-thousand-true-fans/), or to earn more passive income (e.g. “create now, earn later,”), thus reducing the active effort needed to maintain financial success and mitigating creator burnout.\n\nIn addition, platforms should set take rates that are minimally extractive. Bill Gurley outlines the strategy behind platform take rates in his [post](https://abovethecrowd.com/2013/04/18/a-rake-too-far-optimal-platformpricing-strategy/): “In order for your platform to be the “definitive” place to transact, you want industry leading pricing – which is impossible if your rake is the de facto cause of excessive pricing.” He also outlines an example of Priceline Group enabling participants to [bid up](https://www.travelweekly.com/Travel-News/Hotel-News/Expedia-pay-for-positioning-program-riles-hotel-trade-group) their take rate for better placement. This is in contrast to most creator platforms today, which set take rates [unilaterally](https://twitter.com/ljin18/status/1374162266287968257?lang=en), and sometimes regressively (more successful creators pay less, e.g. on Twitch).\n\nAs outlined above, turning stakeholders into shareholders, as in creator- and user-owned platforms, can better align the interests of platforms with creators. Ownership can confer both economic and governance rights, meaning that creators and users decide on product strategy, leadership, and what to do with profits.\n\n### 4. Creator interdependence and solidarity\n\nToday’s creator economy, as it exists on centralized social platforms, pits creators in competition with each other in a constant battle for fleeting attention. Going forward, my hope is that we can build platforms and mechanisms that incentivize mutual support between creators, where one creator’s success does not come at the expense of another’s.\n\n[Creator DAOs](https://www.coindesk.com/nfts-daos-new-creator-economy) (decentralized autonomous organizations) are a way to turn a group of people with a shared mission (e.g. creating media about a certain topic) into a decentralized army with a treasury and governance tools that harness members’ collective intelligence. Today, we’re seeing lots of experimentation in creator DAOs: members vote on creative projects, co-create content, have all revenue flow to a treasury, and share in ownership (examples include [Songcamp’s Elektra](https://songcamp.mirror.xyz/mkb-m9GWUCLByETAvCigJ0JIpz4XH8bwNDBtUJBPeFc) or [DIRT](https://air.mirror.xyz/lmV9Dxeos9HvKSu0BKY9pqARK2vAlPXhrNMt68E4GkI)). Beyond creator DAOs, recent instances of large groups of people pooling together capital in order to buy NFT artwork, e.g. via [PartyBid](https://www.partybid.app/party/0x2912F57F93dD69FBbF477B616D6f8C34C49bb282), hints at how people can organize to reach a collective goal. These organizations hold glimpses of what this more cooperative future may look like, and I expect best practices to emerge for how creators can leverage DAOs. Perhaps one element of these DAOs could be [Universal Creative Income](https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g), funded by the community treasury, in order to broaden access for emerging, diverse creators. In contrast to today’s creator funds offered by social media platforms, the eligibility for funding could be based on independently verifiable data since all user metrics are on-chain.\n\nNote that it’s likely infeasible for existing platforms to adopt the principles above, as doing so would erode their current business models and weaken their network effects. Innovator’s dilemma suggests that new entrants are most likely going to be the ones building with these creator-friendly principles in mind, with new disruptive business models that align with creators’ interests.\n\n## Open questions to explore\n\n***What channels could exist to institutionalize creator voice?***\n\nStrengthening creators’ voice would not only benefit creators, but also help platforms themselves design and implement features with the buy-in of creators. I’m excited to see novel methods of incorporating worker voice into platform governance and decision-making (and balancing creator voice with those of investors who aren’t actively contributing labor). As a glimpse into what this future could look like, DeFi protocols allow token holders to vote on key decisions like the take rate (Uniswap), algorithms (Yearn), and integrations (Compound).\n\nAmong Web2 platforms, Twitter’s [open call for proposals](https://blog.twitter.com/en_us/topics/company/2020/help-us-shape-our-new-approach-to-verification) on how its verification program should work is a step in the right direction: “Calling for public feedback has become an important part of our policy development process because we want to ensure that, as an open service, our rules reflect the voices of the people who use Twitter.”\n\nAnother example is [Airbnb’s Host Advisory Board](https://www.airbnb.com/resources/hosting-homes/a/how-were-giving-hosts-a-seat-at-the-table-283), designed to serve as a voice for hosts with Airbnb’s leadership: “They’ll be a formal link between Airbnb hosts and Airbnb leadership, participating in monthly meetings with Airbnb and an official Advisory Board Forum each year to present hosts’ ideas.” However, the opacity with which the initial advisory board was chosen, and whether members are actually representative of the broader host community, has been met with scrutiny in the Airbnb [host forum](https://community.withairbnb.com/t5/Help/Host-Endowment-Fund-your-thoughts/td-p/1378753).\n\n***How can platforms be designed to mitigate creator anxiety and insecurity?***\n\nProduct design can have massive implications on creator burnout and anxiety. One common desire among creators is for more transparency on the part of platforms about how the discovery algorithm works and updates to how it is changing. The algorithm serves as a quasi-“manager” for online creative work, continuously influencing and assessing creators, yet is currently opaque. Hunter Walk also wrote a [post](https://hunterwalk.medium.com/instagram-youtube-tiktok-are-burning-out-their-creators-heres-how-to-fix-that-7298dcfbd055) with ideas for how creator wellness could be built fundamentally into the product, including seasoning of content, rate-limiting posts, and platforms offering paid time off to creators.\n\nAs an example of what this could look like, [Streamloots](https://www.streamloots.com/), a streamer monetization platform, offers a [mental health support program](https://venturebeat.com/2020/12/15/streamloots-strong-will-provide-mental-health-support-for-streaming-community/) for influencers on its platform.\n\nA fundamental driver of creator anxiety is economic insecurity. To that point, solving for the underlying financial precarity of creators, whether by providing creators with Universal Creative Income or enabling more creator cooperativism e.g. through DAOs, may address the actual root issues underlying creator mental health issues.\n\n***What forms of online collective action could emerge?***\n\nCreators ought to explore means of collectively expressing their voice, to bring their demands to bear upon platforms and clients. In 2015, 20 of the top 50 [Vine creators](https://www.mic.com/articles/157977/inside-the-secret-meeting-that-changed-the-fate-of-vine-forever) met with the app’s management team to propose product and monetization changes. Current examples of creators organizing to effect change include TikTok creators going on [strike](https://www.nytimes.com/2021/06/25/style/black-tiktok-strike.html), and [FYPM](https://www.fypm.vip/), a “Glassdoor for influencers” that aggregates creator reviews on working experiences with various brands.\n\n***How does discovery and distribution work in a post-social media platform world?***\n\nPlatforms today are double-edged swords for creators: creators rely on them to grow their audience, but also want to be able to reduce their dependence on them over time. Creators can’t forego creating content on social media platforms until they are widely popular and can grow from word-of-mouth. One solution is creator collectives and bundles, where those with larger audiences can boost emerging ones. As an example, [Every](https://every.to/) is a newsletter bundle that offers both distribution and ownership: “We give our writers financial upside in the work they do and the freedom to build their own creative vision, but we also support them with distribution to an audience, editorial support, and an advance on their subscription revenue if they need it.”\n\n------\n\nIn a recent post about creator compensation, I [wrote](https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g), “In the digital world, user rights are civic rights, and creator rights are worker rights.” The problems emerging in the online creator economy are the latest instantiations of the same broader political economy problems that afflict our society, with widespread worker vulnerability, a hollowed-out middle class, and externalized business risks that are shifted instead to private individuals.\n\nAs the economy undergoes a profound shift to platform-mediated work, the conditions around labor are rapidly changing. Creators may be a new class of workers, but the parallels to previous labor movements—including those in the gig economy—are clear. In centuries past, worker rights and worker-friendly company environments didn’t just emerge spontaneously, but were hard-won. Likewise, creator empowerment will be the product of concerted efforts by founders, investors, creators, and the broader tech community to craft structures and platforms that prioritize creator control and ownership.\n\n------\n\n*Thank you to Patrick Rivera, Jesse Walden, Sasha Hudzilin, Lindsey Lee Lugrin, Matt Lockyer, Lila Shroff, Alberto Martínez Guerrero, and Louis Giraux for reviewing drafts.*\n\n## **Further reading**\n\n[https://ez.substack.com/p/most-creator-economy-companies-just](https://ez.substack.com/p/most-creator-economy-companies-just)\n\n[https://www.newyorker.com/culture/infinite-scroll/what-the-creator-economy-promises-and-what-it-actually-does](https://www.newyorker.com/culture/infinite-scroll/what-the-creator-economy-promises-and-what-it-actually-does)\n\n[https://www.nytimes.com/2021/06/08/style/creator-burnout-social-media.html](https://www.nytimes.com/2021/06/08/style/creator-burnout-social-media.html)\n\n[https://hunterwalk.medium.com/instagram-youtube-tiktok-are-burning-out-their-creators-heres-how-to-fix-that-7298dcfbd055](https://hunterwalk.medium.com/instagram-youtube-tiktok-are-burning-out-their-creators-heres-how-to-fix-that-7298dcfbd055)\n\n[https://li.substack.com/p/uber-and-instacart-dont-represent](https://li.substack.com/p/uber-and-instacart-dont-represent)\n\n[https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g](https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g)\n\n[https://every.to/means-of-creation/apple-is-holding-back-the-creator-economy](https://every.to/means-of-creation/apple-is-holding-back-the-creator-economy)\n\n[https://hbr.org/2020/12/the-creator-economy-needs-a-middle-class](https://hbr.org/2020/12/the-creator-economy-needs-a-middle-class)\n", "timestamp": 1628613490, "digest": "Rgk2La8izmn5LaqAlRHne-N2g0CaAxWdaSXW8KE8-Ag", "contributor": "0x808a2adbD0a3fc679e3F7CD18d4f579BFCaaEC9C"}
{"id": "cCkTkItiz7ODoQYEvADr0bA1hHm8I8_Z8-jtKrC1LfU", "title": "For Trade: One $PAPER/$CLIP", "body": "In 2005, blogger Kyle MacDonald started with a paperclip and traded it for a pen, the first in an incredible series of trades that ended with him trading for a house. Items he traded for along the way include a hand-sculpted doorknob, a snowmobile, a year’s rent in Phoenix, and an afternoon with musician Alice Cooper.\n\nIt’s an amazing story and even an archetypal one---an old Buddhist folk tale tells of a man who traded from a single piece of straw until he had a rice field. The Legend of Zelda’s “trade up” quests took inspiration from this classic story, as have others.\n\n**With the incredible diversity of NFTs available today a similarly magical tale is possible. So let’s create it.** Come trade with us and let’s tell the story of some amazing NFTs along the way.  \n\n![](https://images.mirror-media.xyz/publication-images/a58d4f4c-47bd-41e8-b48d-c6fce513b9be.jpeg?height=1080&width=1920)\n\n**Today we are offering up our first trade which is, naturally, a paperclip.** More specifically it’s a “$Paper/$Clip” NFT for a *redeemed* Uniswap position. You can see it [here](https://opensea.io/assets/0xc36442b4a4522e871399cd717abdd847ab11fe88/103126). \n\nHere's how to trade with us: \n\n1. Check our twitter [@paperclipDAO](https://twitter.com/paperclipDAO) for the pinned tweet telling you what NFT we're offering for trade.\n\n2. Create an offer on [Sudoswap](https://sudoswap.xyz/) to exchange your NFT for our NFT. Sudoswap will generate a trade link.\n\n3. Tweet your trade link at [@paperclipDAO](https://twitter.com/paperclipDAO), proposing the trade. $CLIP holders will then vote on whether or not to accept your trade. \n\n4. If yes, we swap!\n\n**So about those $CLIP tokens...** anyone who successfully trades with us gets $CLIP tokens so they can join the DAO and continue to create the story. The first to trade with us will get the most $CLIP, and as the story becomes richer and the NFTs more innately valuable the amount of $CLIP given will decline (in an interesting way perhaps…) \n\nWhere will this journey end? We think it might be cool to rescue an unobtainable NFT, maybe one from another dimension, and make it available to the community. But only time will tell. \n\nLet’s start swapping and find out.\n", "timestamp": 1628619331, "digest": "QaEoyCiz2tsBBF58BN_vPulDXk3tuEKsQ4ttV9zCYvA", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "fP6WRPHs8nQ4qkzdOq8SCFUrRF74DIvB9DkRmJoXDmU", "error": {"message": "unknown error: "}}
{"id": "STFdEN1x8K2y_pjDKEnAbhggc9XR5WdRx3PbO7FPgcs", "title": "SuperRare Origin Stories", "body": "![](https://images.mirror-media.xyz/publication-images/f1715d12-2d00-4e2e-b085-f6749cedcbe3.png?height=1000&width=2000)\n\n## Recounting the early days of the NFT art market & peering ahead into the decentralized future with CEO, John Crain\n\nSuperRare was born from a simple idea: what if we could build an art market that put power into the hands of artists? This blog post is a window into SuperRare’s mission to transform this idea into a global artistic movement, as we reflect on our path so far, our community at large and our vision for the future.\n\n### The Before\n\nFor almost as long as computers have existed, artists have been using them to create art. Nowadays one could argue that we come across the work of digital creatives far more often than traditional artists, but, paradoxically, digital art still constitutes a very small subset of the overall art market. \n\nEarly on, we realized that this anomaly was largely due to the intangible nature of digital art. It lives everywhere and nowhere all at once, which makes it difficult to collect, own or resell. \n\nBefore SuperRare, and even before NFTs, there were murmurs of emerging internet art markets. There was [Pepe the Frog](https://www.buzzfeednews.com/article/katienotopoulos/what-is-the-market-value-of-a-rare-pepe), which, as early as 2015, had people thinking about meme markets and digital art ownership. Rare Pepe markets quickly sprung up on the colored coin protocol [Counterparty](https://counterparty.io/). The [Rare Pepe Wallet](https://rarepepewallet.com/) was built by [Joe Looney](https://twitter.com/wasthatawolf) for trading and collecting, and an entire ecosystem emerged around meme art. What previously occupied an obscure corner of the internet now started to grab hold of the collective zeitgeist. However, there still was no established way to verify ownership.\n\nThen, in the summer of 2017, Matt Hall and John Watkinson created [CryptoPunks](https://www.larvalabs.com/cryptopunks) – a generative art project on the Ethereum blockchain that utilized an early precursor to the ERC-721 standard for issuing NFTs. The Punk NFTs blew up (as did their cost), instilling the [ERC-721](https://eips.ethereum.org/EIPS/eip-721) standard as a reputable certificate of ownership, and pointing to a major non-financial use case for crypto networks. \n\nThe creation of a standard for unique tokens was a profound development, ushering in a new era of digital scarcity.\n\n### The Beginning \n\nWhen the ERC-721 standard was announced, we were working full time jobs and had barely enough free time to drink a beer, let alone start a company, but we were inextricably attracted to this incredible innovation. We were actually having a few beers and smoking some weed, enjoying a casual hack-a-thon, like, an excuse to hang out but we also felt sort of productive, because we were doing some coding as well. We were just talking about the existing things that were on Ethereum, and at some point we were like, oh man, they have these decentralized exchanges that are mostly geared towards different cryptocurrencies, but what if you had one of those that was dedicated to art? Then you’d have this globally-accessible art gallery, and a brand new art market. \n\nWe could not take our minds off of it. Here was an open-source, peer-to-peer technology that allowed anyone to issue a digital certificate of authenticity for a digitally native piece of content. Not only was this certificate cryptographically secure; the owner could trade it with anyone in the world, at any given time, with no middleman to say otherwise. Fuck. Yes.\n\nSo we started developing the SuperRare smart contracts. Beyond just certificates, we realized it was possible to enforce royalties on the secondary market using Ethereum smart contracts. Thus, we could usher in a new and long-overdue era of sustained income for artists following the initial sale of a given artwork. \n\nSix months into development, in April 2018, we launched the first version of SuperRare’s smart contracts on the Ethereum mainnet with built-in artist royalties. A couple of days later, Jason Bailey (aka Artnome) bought four AI generated artworks by young artist [Robbie Barrat](https://superrare.com/videodrome/creations).  These first sales number among the most memorable moments in our team's history.\n\n![](https://images.mirror-media.xyz/publication-images/ac85e14e-ee23-4219-b9d5-a3830daaebd5.png?height=400&width=1184)\n\nLater in 2018, we were given the opportunity to add an item to the attendee swag bags at Christie’s Art + Tech summit in London. Again, we teamed up with Jason and Robbie to program 300 tokens into 300 physical cards of “generated nude #7” which were dropped into those bags as giveaways. We were genuinely excited about the idea, only to find out the next day that literally no one understood what the tokenized card was for. To this day, we’re still unsure how many Lost Robbies there are in the wild. ¯\\_(ツ)_/¯\n\n![](https://images.mirror-media.xyz/publication-images/deda4147-bb1f-40bf-ab7b-6ede1bf08425.png?height=976&width=1182)\n\n### The Explosion\n\nAs more artists entered the space between the summer of 2018 and late 2019, the term \"CryptoArt\" – which had previously been used to describe artworks portraying artifacts of crypto culture – increasingly came to define any artwork minted on the Ethereum blockchain. Suddenly, the CryptoArt ecosystem was thriving, even if the volumes in the NFT market still remained small.\n\nBeyond just minting artworks on the blockchain, the CryptoArt community kept reinventing how art is distributed and collected. In early 2019 California-based crypto artist [Coldie](https://twitter.com/Coldie) came up with a type of reserve auction on Twitter that became known as the “Coldie Method,” to solve the issue caused by time zone discrepancies between collectors. \n\nPrior to that, bidders in an auction had to pay attention around the clock. But with this new method – first run by Coldie himself on Twitter and later implemented on SuperRare in December of 2020 – each new bid would extend the auction for another 24 hours, letting all parties involved catch up. As a new way to manage globally-distributed auctions, this method proved to be game-changing. It was quickly adopted by many artists on the platform.\n\n![](https://images.mirror-media.xyz/publication-images/0d9ff8b5-a632-4cec-be2c-2b8c1bcb91d7.png?height=1377&width=1939)\n\n\nIn parallel, the community was experimenting with new ways to display and socialize around cryptoart. Over the summer of 2019, one of the first Ethereum-based VR worlds, [Cryptovoxels](https://www.cryptovoxels.com/), launched. Soon after, people experimented with holding [events](https://www.youtube.com/watch?v=u7TBeKvqaA8) and even building entire [museums](https://somniumspace.com/parcel/3402) in the [metaverse](https://digiday.com/marketing/wtf-is-the-metaverse/) – laying the framework for the immense role art will play in the virtual environments of our near future, soon-to-be present.\n\nBut it hasn’t always been easy. There have been many moments when we thought SuperRare wasn’t going to work out. The first two years were like...slow. There were new people who would come in to join the community, new artists, new collectors, but it was slow. We did an accelerator program, raised a little bit of money. The whole point of accelerator programs is to prep you so that you can go do a more serious round of fundraising, and that was essentially a total failure. We did the accelerator and were unable to raise any money whatsoever. \n\nSo at the time, it was 2018. People were calling it the crypto winter. Everyone was super negative. People were like, “crypto is dead, so I don’t know why you’re doing a start-up in crypto.” And then they were like, “art, that’s not a thing, this isn’t going to work.” So yeah, many moments of questioning, wondering, we really love this and think it’s cool, but is it a terrible business idea? Are people actually going to do this? There were lots of ups and downs, but then a new collector would join and, you know, kind of slowly, sales were going up, we were slowly growing. It wasn’t like “holy fuck, this is going to be the future,” it was like, “I mean, maybe this can eventually pay the bills?”\n\n![](https://images.mirror-media.xyz/publication-images/a9a7b379-011a-41f6-97bb-402ea7dfa0b4.png?height=562&width=1404)\n\nGraph: Cumulative Marketplace Volume\n\nIn the early years, we kept building community and improving the product– more out of passion than anything– as it wasn’t until 2020 that the volume really picked up. \n\n![](https://images.mirror-media.xyz/publication-images/7c76b3d5-a51a-4a17-8b0b-7a12f278d1f3.png?height=457&width=369)\n\nEdward Snowden - Variant 02 - Decentral Eyes by Coldie\n\nAfter months of raw creativity from the community, the NFT market started to heat up. One night in early November 2019, we were camping with the team and we started receiving dozens of messages over Telegram. [Edward Snowden - Variant 02 - Decentral Eyes](https://superrare.com/artwork/edward-snowden---variant-02---decentral-eyes-4362) by Coldie had a crazy bidding war going on, but there was a bug on the website and bids weren’t showing up. Nonetheless, people were still making bids and checking them on Etherscan. Immediately, we rushed home to fix the issue and, in commemoration, someone on Telegram coined the moniker “Lord Charles” for our CTO Charles Crain. Of course the internet did what it does best, circulating tweets and memes for the occasion, and artist [Ilan Katin](https://superrare.com/ilan_katin) made this beautiful work of art.\n\n![](https://images.mirror-media.xyz/publication-images/c636b8b4-c9be-4c75-834d-5abceb66cb22.png?height=1772&width=3543)\n\nThis crazy bidding war was only the first in a series of record breaking – and sometimes controversial – auctions. A few  months later, “AI Generated Nude #1” sold [again](https://etherscan.io/tx/0xd96b7cc5817d2be673e45a40ce1604f00b89fdf48bee8e5a868f289089cbb7c8) for 75 ETH ($12k at the time). Robbie made nearly 10 times more on the secondary market royalty than he made on the primary sale. It was clear at that moment that programmatic royalties would change the art market forever. \n\n### The Now\nThen, in early 2021, the world went mad. The NFT art market suddenly spread its wings. Consecutive $100K+ sales came back to back, over and over and over. The media went wild. SNL made a skit. Your grandma Googled \"non-fungible token.” Things were happening in the space that no one could have even imagined just a couple of weeks prior.\n\n![](https://images.mirror-media.xyz/publication-images/5c5e1bc9-ee25-47d5-a0c6-d4cfc93dcad0.png?height=1104&width=1226)\n\nThe traditional art world took note too, with the likes of Christie’s and Sotheby’s holding numerous auctions of NFT art over the last 6 months. We partnered with Bonhams in June on the world’s first curated collaboration between a digital art platform and an auction house, presenting [CryptOGs: The Pioneers of CryptoArt](https://www.bonhams.com/online_auctions/27285/) featuring works from 9 OG artists including XCOPY, Sarah Zucker and Coldie. \n\nBut while CryptoArt OGs kept breaking records, the past months will certainly be remembered most as when NFTs and CryptoArt changed the lives of thousands of artists through the purchases of collectors excited to fuel their creativity. Half way into the year, the number of artists minting on SuperRare has already increased by more than 5 times, while the number of collectors has more than doubled.\n\nMore collectors means more artworks collected from this new wave of artists, and more artwork in the hands of more people. $46M has been distributed to artists on SuperRare through primary sales, and $3.5M was paid directly to artists through royalties on secondary sales. In this sense, 2021 is a window into what a 24/7 globally accessible art market with programmatically-enforced royalties could mean for artists all over the world. \n\n### The Future\n\nBeyond artist royalties, we recently announced [collector royalties](https://medium.com/superrare/the-art-royalty-revolution-6c0d13a6912a) as we aim to make the most of the possibilities enabled by blockchain technology. But it’s still very early in the market and there is much left to do. That’s why we want to collaborate more with the SuperRare community of artists, collectors, curators and builders while simultaneously inviting new artists and curators into the fold, so that the number of people who take art collecting seriously will go from a few thousand rich people scattered across the globe to millions and millions of people all over the world, who can find their own tribe, describe their tastes, and support the artists that they love.\n\nBut in order to scale SuperRare while preserving its current qualities, we’ll need more than just a core team. Fortunately there is almost unlimited talent in the community and we believe that it's just about providing the right opportunities.\n\nMoving forward, we will keep striving to embody the ethos of the ecosystem with each new feature and protocol improvement, as well as exploring ways to progressively decentralize curation on the platform. The CryptoArt community at large is the root, the trunk, the branches, and the future of this ecosystem. As a platform and network, we will continue to grow and evolve with (and for) the community.\n\n\nJohn Crain \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "timestamp": 1628620825, "digest": "V8dIGJdt2Ja_TvMrCFcjp5eHT5ePMp6ruaFwU9fjolQ", "contributor": "0x60E912290431D877489CDb74FA3C75A51575f57a"}
{"id": "pJjxb6MNd3rusiienPuBfRAHqKWni6FtNx0HJPPTjlw", "title": "SuperRare Origin Stories", "body": "![](https://images.mirror-media.xyz/publication-images/f1715d12-2d00-4e2e-b085-f6749cedcbe3.png?height=1000&width=2000)\n\n## Recounting the early days of the NFT art market & peering ahead into the decentralized future with SuperRare co-founder & CEO, John Crain\n\nSuperRare was born from a simple idea: what if we could build an art market that put power into the hands of artists? This blog post is a window into SuperRare’s mission to transform this idea into a global artistic movement, as we reflect on our path so far, our community at large and our vision for the future.\n\n### The Before\n\nFor almost as long as computers have existed, artists have been using them to create art. Nowadays one could argue that we come across the work of digital creatives far more often than traditional artists, but, paradoxically, digital art still constitutes a very small subset of the overall art market. \n\nEarly on, we realized that this anomaly was largely due to the intangible nature of digital art. It lives everywhere and nowhere all at once, which makes it difficult to collect, own or resell. \n\nBefore SuperRare, and even before NFTs, there were murmurs of emerging internet art markets. There was [Pepe the Frog](https://www.buzzfeednews.com/article/katienotopoulos/what-is-the-market-value-of-a-rare-pepe), which, as early as 2015, had people thinking about meme markets and digital art ownership. Rare Pepe markets quickly sprung up on the colored coin protocol [Counterparty](https://counterparty.io/). The [Rare Pepe Wallet](https://rarepepewallet.com/) was built by [Joe Looney](https://twitter.com/wasthatawolf) for trading and collecting, and an entire ecosystem emerged around meme art. What previously occupied an obscure corner of the internet now started to grab hold of the collective zeitgeist. However, there still was no established way to verify ownership.\n\nThen, in the summer of 2017, Matt Hall and John Watkinson created [CryptoPunks](https://www.larvalabs.com/cryptopunks) – a generative art project on the Ethereum blockchain that utilized an early precursor to the ERC-721 standard for issuing NFTs. The Punk NFTs blew up (as did their cost), instilling the [ERC-721](https://eips.ethereum.org/EIPS/eip-721) standard as a reputable certificate of ownership, and pointing to a major non-financial use case for crypto networks. \n\nThe creation of a standard for unique tokens was a profound development, ushering in a new era of digital scarcity.\n\n### The Beginning \n\nWhen the ERC-721 standard was announced, we were working full time jobs and had barely enough free time to drink a beer, let alone start a company, but we were inextricably attracted to this incredible innovation. We were actually having a few beers and smoking some weed, enjoying a casual hack-a-thon, like, an excuse to hang out but we also felt sort of productive, because we were doing some coding as well. We were just talking about the existing things that were on Ethereum, and at some point we were like, oh man, they have these decentralized exchanges that are mostly geared towards different cryptocurrencies, but what if you had one of those that was dedicated to art? Then you’d have this globally-accessible art gallery, and a brand new art market. \n\nWe could not take our minds off of it. Here was an open-source, peer-to-peer technology that allowed anyone to issue a digital certificate of authenticity for a digitally native piece of content. Not only was this certificate cryptographically secure; the owner could trade it with anyone in the world, at any given time, with no middleman to say otherwise. Fuck. Yes.\n\nSo we started developing the SuperRare smart contracts. Beyond just certificates, we realized it was possible to enforce royalties on the secondary market using Ethereum smart contracts. Thus, we could usher in a new and long-overdue era of sustained income for artists following the initial sale of a given artwork. \n\nSix months into development, in April 2018, we launched the first version of SuperRare’s smart contracts on the Ethereum mainnet with built-in artist royalties. A couple of days later, Jason Bailey (aka Artnome) bought four AI generated artworks by young artist [Robbie Barrat](https://superrare.com/videodrome/creations).  These first sales number among the most memorable moments in our team's history.\n\n![](https://images.mirror-media.xyz/publication-images/ac85e14e-ee23-4219-b9d5-a3830daaebd5.png?height=400&width=1184)\n\nLater in 2018, we were given the opportunity to add an item to the attendee swag bags at Christie’s Art + Tech summit in London. Again, we teamed up with Jason and Robbie to program 300 tokens into 300 physical cards of “generated nude #7” which were dropped into those bags as giveaways. We were genuinely excited about the idea, only to find out the next day that literally no one understood what the tokenized card was for. To this day, we’re still unsure how many Lost Robbies there are in the wild. ¯\\_(ツ)_/¯\n\n![](https://images.mirror-media.xyz/publication-images/deda4147-bb1f-40bf-ab7b-6ede1bf08425.png?height=976&width=1182)\n\n### The Explosion\n\nAs more artists entered the space between the summer of 2018 and late 2019, the term \"CryptoArt\" – which had previously been used to describe artworks portraying artifacts of crypto culture – increasingly came to define any artwork minted on the Ethereum blockchain. Suddenly, the CryptoArt ecosystem was thriving, even if the volumes in the NFT market still remained small.\n\nBeyond just minting artworks on the blockchain, the CryptoArt community kept reinventing how art is distributed and collected. In early 2019 California-based crypto artist [Coldie](https://twitter.com/Coldie) came up with a type of reserve auction on Twitter that became known as the “Coldie Method,” to solve the issue caused by time zone discrepancies between collectors. \n\nPrior to that, bidders in an auction had to pay attention around the clock. But with this new method – first run by Coldie himself on Twitter and later implemented on SuperRare in December of 2020 – each new bid would extend the auction for another 24 hours, letting all parties involved catch up. As a new way to manage globally-distributed auctions, this method proved to be game-changing. It was quickly adopted by many artists on the platform.\n\n![](https://images.mirror-media.xyz/publication-images/0d9ff8b5-a632-4cec-be2c-2b8c1bcb91d7.png?height=1377&width=1939)\n\n\nIn parallel, the community was experimenting with new ways to display and socialize around cryptoart. Over the summer of 2019, one of the first Ethereum-based VR worlds, [Cryptovoxels](https://www.cryptovoxels.com/), launched. Soon after, people experimented with holding [events](https://www.youtube.com/watch?v=u7TBeKvqaA8) and even building entire [museums](https://somniumspace.com/parcel/3402) in the [metaverse](https://digiday.com/marketing/wtf-is-the-metaverse/) – laying the framework for the immense role art will play in the virtual environments of our near future, soon-to-be present.\n\nBut it hasn’t always been easy. There have been many moments when we thought SuperRare wasn’t going to work out. The first two years were like...slow. There were new people who would come in to join the community, new artists, new collectors, but it was slow. We did an accelerator program, raised a little bit of money. The whole point of accelerator programs is to prep you so that you can go do a more serious round of fundraising, and that was essentially a total failure. We did the accelerator and were unable to raise any money whatsoever. \n\nSo at the time, it was 2018. People were calling it the crypto winter. Everyone was super negative. People were like, “crypto is dead, so I don’t know why you’re doing a start-up in crypto.” And then they were like, “art, that’s not a thing, this isn’t going to work.” So yeah, many moments of questioning, wondering, we really love this and think it’s cool, but is it a terrible business idea? Are people actually going to do this? There were lots of ups and downs, but then a new collector would join and, you know, kind of slowly, sales were going up, we were slowly growing. It wasn’t like “holy fuck, this is going to be the future,” it was like, “I mean, maybe this can eventually pay the bills?”\n\n![](https://images.mirror-media.xyz/publication-images/a9a7b379-011a-41f6-97bb-402ea7dfa0b4.png?height=562&width=1404)\n\nGraph: Cumulative Marketplace Volume\n\nIn the early years, we kept building community and improving the product– more out of passion than anything– as it wasn’t until 2020 that the volume really picked up. \n\n![](https://images.mirror-media.xyz/publication-images/7c76b3d5-a51a-4a17-8b0b-7a12f278d1f3.png?height=457&width=369)\n\nEdward Snowden - Variant 02 - Decentral Eyes by Coldie\n\nAfter months of raw creativity from the community, the NFT market started to heat up. One night in early November 2019, we were camping with the team and we started receiving dozens of messages over Telegram. [Edward Snowden - Variant 02 - Decentral Eyes](https://superrare.com/artwork/edward-snowden---variant-02---decentral-eyes-4362) by Coldie had a crazy bidding war going on, but there was a bug on the website and bids weren’t showing up. Nonetheless, people were still making bids and checking them on Etherscan. Immediately, we rushed home to fix the issue and, in commemoration, someone on Telegram coined the moniker “Lord Charles” for our CTO Charles Crain. Of course the internet did what it does best, circulating tweets and memes for the occasion, and artist [Ilan Katin](https://superrare.com/ilan_katin) made this beautiful work of art.\n\n![](https://images.mirror-media.xyz/publication-images/c636b8b4-c9be-4c75-834d-5abceb66cb22.png?height=1772&width=3543)\n\nThis crazy bidding war was only the first in a series of record breaking – and sometimes controversial – auctions. A few  months later, “AI Generated Nude #1” sold [again](https://etherscan.io/tx/0xd96b7cc5817d2be673e45a40ce1604f00b89fdf48bee8e5a868f289089cbb7c8) for 75 ETH ($12k at the time). Robbie made nearly 10 times more on the secondary market royalty than he made on the primary sale. It was clear at that moment that programmatic royalties would change the art market forever. \n\n### The Now\nThen, in early 2021, the world went mad. The NFT art market suddenly spread its wings. Consecutive $100K+ sales came back to back, over and over and over. The media went wild. SNL made a skit. Your grandma Googled \"non-fungible token.” Things were happening in the space that no one could have even imagined just a couple of weeks prior.\n\n![](https://images.mirror-media.xyz/publication-images/5c5e1bc9-ee25-47d5-a0c6-d4cfc93dcad0.png?height=1104&width=1226)\n\nThe traditional art world took note too, with the likes of Christie’s and Sotheby’s holding numerous auctions of NFT art over the last 6 months. We partnered with Bonhams in June on the world’s first curated collaboration between a digital art platform and an auction house, presenting [CryptOGs: The Pioneers of CryptoArt](https://www.bonhams.com/online_auctions/27285/) featuring works from 9 OG artists including XCOPY, Sarah Zucker and Coldie. \n\nBut while CryptoArt OGs kept breaking records, the past months will certainly be remembered most as when NFTs and CryptoArt changed the lives of thousands of artists through the purchases of collectors excited to fuel their creativity. Half way into the year, the number of artists minting on SuperRare has already increased by more than 5 times, while the number of collectors has more than doubled.\n\nMore collectors means more artworks collected from this new wave of artists, and more artwork in the hands of more people. $46M has been distributed to artists on SuperRare through primary sales, and $3.5M was paid directly to artists through royalties on secondary sales. In this sense, 2021 is a window into what a 24/7 globally accessible art market with programmatically-enforced royalties could mean for artists all over the world. \n\n### The Future\n\nBeyond artist royalties, we recently announced [collector royalties](https://medium.com/superrare/the-art-royalty-revolution-6c0d13a6912a) as we aim to make the most of the possibilities enabled by blockchain technology. But it’s still very early in the market and there is much left to do. That’s why we want to collaborate more with the SuperRare community of artists, collectors, curators and builders while simultaneously inviting new artists and curators into the fold, so that the number of people who take art collecting seriously will go from a few thousand rich people scattered across the globe to millions and millions of people all over the world, who can find their own tribe, describe their tastes, and support the artists that they love.\n\nBut in order to scale SuperRare while preserving its current qualities, we’ll need more than just a core team. Fortunately there is almost unlimited talent in the community and we believe that it's just about providing the right opportunities.\n\nMoving forward, we will keep striving to embody the ethos of the ecosystem with each new feature and protocol improvement, as well as exploring ways to progressively decentralize curation on the platform. The CryptoArt community at large is the root, the trunk, the branches, and the future of this ecosystem. As a platform and network, we will continue to grow and evolve with (and for) the community.\n\n\nJohn Crain \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "timestamp": 1628621095, "digest": "V8dIGJdt2Ja_TvMrCFcjp5eHT5ePMp6ruaFwU9fjolQ", "contributor": "0x60E912290431D877489CDb74FA3C75A51575f57a"}
{"id": "sACHD6QBZINDMH4Q0-hXlBEpGlnSkDKT8ILCi47WUoQ", "title": "For Trade: One $PAPER/$CLIP", "body": "In 2005, blogger Kyle MacDonald started with a paperclip and traded it for a pen, the first in an incredible series of trades that ended with him trading for a house. Items he traded for along the way include a hand-sculpted doorknob, a snowmobile, a year’s rent in Phoenix, and an afternoon with musician Alice Cooper.\n\nIt’s an amazing story and even an archetypal one---an old Buddhist folk tale tells of a man who traded from a single piece of straw until he had a rice field. The Legend of Zelda’s “trade up” quests took inspiration from this classic story, as have others.\n\n**With the incredible diversity of NFTs available today a similarly magical tale is possible. So let’s create it.** Come trade with us and let’s tell the story of some amazing NFTs along the way.  \n\n![](https://images.mirror-media.xyz/publication-images/a58d4f4c-47bd-41e8-b48d-c6fce513b9be.jpeg?height=1080&width=1920)\n\n**Today we are offering up our first trade which is, naturally, a paperclip.** More specifically it’s a “$Paper/$Clip” NFT for a *redeemed* Uniswap position. You can see it [here](https://opensea.io/assets/0xc36442b4a4522e871399cd717abdd847ab11fe88/103126). \n\nHere's how to trade with us: \n\n1. Check our twitter [@paperclipDAO](https://twitter.com/paperclipDAO) for the pinned tweet telling you what NFT we're offering for trade.\n\n2. Create an offer on [Sudoswap](https://sudoswap.xyz/) to exchange your NFT for our NFT. Sudoswap will generate a trade link.\n\n3. Tweet your trade link at [@paperclipDAO](https://twitter.com/paperclipDAO), proposing the trade. $CLIP holders will then vote on whether or not to accept your trade. \n\n4. If yes, we swap!\n\n**So about those $CLIP tokens...** anyone who successfully trades with us gets $CLIP tokens so they can join the DAO and continue to create the story. The first to trade with us will get the most $CLIP, and as the story becomes richer and the NFTs more innately valuable the amount of $CLIP given will decline (in an interesting way perhaps…) \n\nWhere will this journey end? We think it might be cool to rescue an unobtainable NFT, maybe one from another dimension, and make it available to the community. But only time will tell. \n\nLet’s start swapping and find out. \n\nTo keep up with this adventure, [join our Discord](https://discord.gg/6JbGUMDkMp) and follow us on [Twitter](https://twitter.com/paperclipDAO). \n", "timestamp": 1628621474, "digest": "QaEoyCiz2tsBBF58BN_vPulDXk3tuEKsQ4ttV9zCYvA", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "4L1oO1nPWK9trqClK8GqBDIbtv0WW6XVF4s6r-YUEqg", "title": "For Trade: One $PAPER/$CLIP", "body": "In 2005, blogger Kyle MacDonald started with a paperclip and traded it for a pen, the first in an incredible series of trades that ended with him trading for a house. Items he traded for along the way include a hand-sculpted doorknob, a snowmobile, a year’s rent in Phoenix, and an afternoon with musician Alice Cooper.\n\nIt’s an amazing story and even an archetypal one---an old Buddhist folk tale tells of a man who traded from a single piece of straw until he had a rice field. The Legend of Zelda’s “trade up” quests took inspiration from this classic story, as have others.\n\n**With the incredible diversity of NFTs available today a similarly magical tale is possible. So let’s create it.** Come trade with us and let’s tell the story of some amazing NFTs along the way.  \n\n![](https://images.mirror-media.xyz/publication-images/a58d4f4c-47bd-41e8-b48d-c6fce513b9be.jpeg?height=1080&width=1920)\n\n**Today we are offering up our first trade which is, naturally, a paperclip.** More specifically it’s a “$Paper/$Clip” NFT for a *redeemed* Uniswap position. You can see it [here](https://opensea.io/assets/0xc36442b4a4522e871399cd717abdd847ab11fe88/103126). \n\nHere's how to trade with us: \n\n1. Check our twitter [@paperclipDAO](https://twitter.com/paperclipDAO) for the pinned tweet telling you what NFT we're offering for trade.\n\n2. Create an offer on [Sudoswap](https://sudoswap.xyz/) to exchange your NFT for our NFT. Sudoswap will generate a trade link.\n\n3. Tweet your trade link at [@paperclipDAO](https://twitter.com/paperclipDAO), proposing the trade. $CLIP holders will then vote on whether or not to accept your trade. \n\n4. If yes, we swap!\n\n**So about those $CLIP tokens...** anyone who successfully trades with us gets $CLIP tokens so they can join the DAO and continue to create the story. The first to trade with us will get the most $CLIP, and as the story becomes richer and the NFTs more innately valuable the amount of $CLIP given will decline (in an interesting way perhaps…) \n\nWhere will this journey end? We think it might be cool to rescue an unobtainable NFT, maybe one from another dimension, and make it available to the community. But only time will tell. \n\nLet’s start swapping and find out. \n\nTo keep up with this adventure, [join our Discord](https://discord.gg/6JbGUMDkMp) and follow us on [Twitter](https://twitter.com/paperclipDAO). \n", "timestamp": 1628621663, "digest": "QaEoyCiz2tsBBF58BN_vPulDXk3tuEKsQ4ttV9zCYvA", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "gnMHVhHDm9wFE4ta33HLd-X4__WAjX5SBBixkXWXKEI", "title": "For Trade: One $PAPER/$CLIP", "body": "In 2005, blogger Kyle MacDonald started with a paperclip and traded it for a pen, the first in an incredible series of trades that ended with him trading for a house. Items he traded for along the way include a hand-sculpted doorknob, a snowmobile, a year’s rent in Phoenix, and an afternoon with musician Alice Cooper.\n\nIt’s an amazing story and even an archetypal one---an old Buddhist folk tale tells of a man who traded from a single piece of straw until he had a rice field. The Legend of Zelda’s “trade up” quests took inspiration from this classic story, as have others.\n\n**With the incredible diversity of NFTs available today a similarly magical tale is possible. So let’s create it.** Come trade with us and let’s tell the story of some amazing NFTs along the way.  \n\n![](https://images.mirror-media.xyz/publication-images/a58d4f4c-47bd-41e8-b48d-c6fce513b9be.jpeg?height=1080&width=1920)\n\n**Today we are offering up our first trade which is, naturally, a paperclip.** More specifically it’s a “$Paper/$Clip” NFT for a *redeemed* Uniswap position. You can see it [here](https://opensea.io/assets/0xc36442b4a4522e871399cd717abdd847ab11fe88/103126). \n\nHere's how to trade with us: \n\n1. Check our twitter [@paperclipDAO](https://twitter.com/paperclipDAO) for the pinned tweet telling you what NFT we're offering for trade.\n\n2. Create an offer on [Sudoswap](https://sudoswap.xyz/) to exchange your NFT for our NFT. Sudoswap will generate a trade link.\n\n3. Tweet your trade link at [@paperclipDAO](https://twitter.com/paperclipDAO), proposing the trade. $CLIP holders will then vote on whether or not to accept your trade. \n\n4. If yes, we swap!\n\n**So about those $CLIP tokens...** anyone who successfully trades with us gets $CLIP tokens so they can join the DAO and continue to create the story. The first to trade with us will get the most $CLIP, and as the story becomes richer and the NFTs more innately valuable the amount of $CLIP given will decline (in an interesting way perhaps…) \n\nWhere will this journey end? We think it might be cool to rescue an unobtainable NFT, maybe one from another dimension, and make it available to the community. But only time will tell. \n\nLet’s start swapping and find out. \n\nTo keep up with this adventure, [join our Discord](https://discord.gg/6JbGUMDkMp) and follow us on [Twitter](https://twitter.com/paperclipDAO). \n", "timestamp": 1628621607, "digest": "QaEoyCiz2tsBBF58BN_vPulDXk3tuEKsQ4ttV9zCYvA", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "uh8t8Que8oQMwXpymMXcqW8UJUhlwy8NlfGC_9k8OTA", "title": "For Trade: One $PAPER/$CLIP", "body": "In 2005, blogger Kyle MacDonald started with a paperclip and traded it for a pen, the first in an incredible series of trades that ended with him trading for a house. Items he traded for along the way include a hand-sculpted doorknob, a snowmobile, a year’s rent in Phoenix, and an afternoon with musician Alice Cooper.\n\nIt’s an amazing story and even an archetypal one---an old Buddhist folk tale tells of a man who traded from a single piece of straw until he had a rice field. The Legend of Zelda’s “trade up” quests took inspiration from this classic story, as have others.\n\n**With the incredible diversity of NFTs available today a similarly magical tale is possible. So let’s create it.** Come trade with us and let’s tell the story of some amazing NFTs along the way.  \n\n![](https://images.mirror-media.xyz/publication-images/a58d4f4c-47bd-41e8-b48d-c6fce513b9be.jpeg?height=1080&width=1920)\n\n**Today we are offering up our first trade which is, naturally, a paperclip.** More specifically it’s a “$Paper/$Clip” NFT for a *redeemed* Uniswap position. You can see it [here](https://opensea.io/assets/0xc36442b4a4522e871399cd717abdd847ab11fe88/103126). \n\nHere's how to trade with us: \n\n1. Check our twitter [@paperclipDAO](https://twitter.com/paperclipDAO) for the pinned tweet telling you what NFT we're offering for trade.\n\n2. Create an offer on [Sudoswap](https://sudoswap.xyz/) to exchange your NFT for our NFT. Sudoswap will generate a trade link.\n\n3. Tweet your trade link at [@paperclipDAO](https://twitter.com/paperclipDAO), proposing the trade. $CLIP holders will then vote on whether or not to accept your trade. \n\n4. If yes, we swap!\n\n**So about those $CLIP tokens...** anyone who successfully trades with us gets $CLIP tokens so they can join the DAO and continue to create the story. The first to trade with us will get the most $CLIP, and as the story becomes richer and the NFTs more innately valuable the amount of $CLIP given will decline (in an interesting way perhaps…) \n\nWhere will this journey end? We think it might be cool to rescue an unobtainable NFT, maybe one from another dimension, and make it available to the community. But only time will tell. \n\nLet’s start swapping and find out. \n\nTo keep up with this adventure, [join our Discord](https://discord.gg/6JbGUMDkMp) and follow us on [Twitter](https://twitter.com/paperclipDAO). \n", "timestamp": 1628621744, "digest": "QaEoyCiz2tsBBF58BN_vPulDXk3tuEKsQ4ttV9zCYvA", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "wMNX3SjLIDMmQdoBz9By1EL-QCeaG-q5ilUMdSvzCBk", "title": "For Trade: One $PAPER/$CLIP", "body": "In 2005, blogger Kyle MacDonald started with a paperclip and traded it for a pen, the first in an incredible series of trades that ended with him trading for a house. Items he traded for along the way include a hand-sculpted doorknob, a snowmobile, a year’s rent in Phoenix, and an afternoon with musician Alice Cooper.\n\nIt’s an amazing story and even an archetypal one---an old Buddhist folk tale tells of a man who traded from a single piece of straw until he had a rice field. The Legend of Zelda’s “trade up” quests took inspiration from this classic story, as have others.\n\n**With the incredible diversity of NFTs available today a similarly magical tale is possible. So let’s create it.** Come trade with us and let’s tell the story of some amazing NFTs along the way.  \n\n![](https://images.mirror-media.xyz/publication-images/a58d4f4c-47bd-41e8-b48d-c6fce513b9be.jpeg?height=1080&width=1920)\n\n**Today we are offering up our first trade which is, naturally, a paperclip.** More specifically it’s a “$Paper/$Clip” NFT for a *redeemed* Uniswap position. You can see it [here](https://opensea.io/assets/0xc36442b4a4522e871399cd717abdd847ab11fe88/103126). \n\nHere's how to trade with us: \n\n1. Check our twitter [@paperclipDAO](https://twitter.com/paperclipDAO) for the pinned tweet telling you what NFT we're offering for trade.\n\n2. Create an offer on [Sudoswap](https://sudoswap.xyz/) to exchange your NFT for our NFT. Sudoswap will generate a trade link.\n\n3. Tweet your trade link at [@paperclipDAO](https://twitter.com/paperclipDAO), proposing the trade. $CLIP holders will then vote on whether or not to accept your trade. \n\n4. If yes, we swap!\n\n**So about those $CLIP tokens...** anyone who successfully trades with us gets $CLIP tokens so they can join the DAO and continue to create the story. The first to trade with us will get the most $CLIP, and as the story becomes richer and the NFTs more innately valuable the amount of $CLIP given will decline (in an interesting way perhaps…) \n\nWhere will this journey end? We think it might be cool to rescue an unobtainable NFT, maybe one from another dimension, and make it available to the community. But only time will tell. \n\nLet’s start swapping and find out. \n\nTo keep up with this adventure, [join our Discord](https://discord.gg/6JbGUMDkMp) and follow us on [Twitter](https://twitter.com/paperclipDAO). \n", "timestamp": 1628621705, "digest": "QaEoyCiz2tsBBF58BN_vPulDXk3tuEKsQ4ttV9zCYvA", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "x0V7GAtlyty91H-RhsjVbUqcBSEfPGy9MhqUrYyNJEs", "title": "For Trade: One $PAPER/$CLIP", "body": "In 2005, blogger Kyle MacDonald started with a paperclip and traded it for a pen, the first in an incredible series of trades that ended with him trading for a house. Items he traded for along the way include a hand-sculpted doorknob, a snowmobile, a year’s rent in Phoenix, and an afternoon with musician Alice Cooper.\n\nIt’s an amazing story and even an archetypal one---an old Buddhist folk tale tells of a man who traded from a single piece of straw until he had a rice field. The Legend of Zelda’s “trade up” quests took inspiration from this classic story, as have others.\n\n**With the incredible diversity of NFTs available today a similarly magical tale is possible. So let’s create it.** Come trade with us and let’s tell the story of some amazing NFTs along the way.  \n\n![](https://images.mirror-media.xyz/publication-images/a58d4f4c-47bd-41e8-b48d-c6fce513b9be.jpeg?height=1080&width=1920)\n\n**Today we are offering up our first trade which is, naturally, a paperclip.** More specifically it’s a “$Paper/$Clip” NFT for a *redeemed* Uniswap position. You can see it [here](https://opensea.io/assets/0xc36442b4a4522e871399cd717abdd847ab11fe88/103126). \n\nHere's how to trade with us: \n\n1. Check our twitter [@paperclipDAO](https://twitter.com/paperclipDAO) for the pinned tweet telling you what NFT we're offering for trade.\n\n2. Create an offer on [Sudoswap](https://sudoswap.xyz/) to exchange your NFT for our NFT. Sudoswap will generate a trade link.\n\n3. Tweet your trade link at [@paperclipDAO](https://twitter.com/paperclipDAO), proposing the trade. $CLIP holders will then vote on whether or not to accept your trade. \n\n4. If yes, we swap!\n\n**So about those $CLIP tokens...** anyone who successfully trades with us gets $CLIP tokens so they can join the DAO and continue to create the story. The first to trade with us will get the most $CLIP, and as the story becomes richer and the NFTs more innately valuable the amount of $CLIP given will decline (in an interesting way perhaps…) \n\nWhere will this journey end? We think it might be cool to rescue an unobtainable NFT, maybe one from another dimension, and make it available to the community. But only time will tell. \n\nLet’s start swapping and find out. \n\nTo keep up with this adventure, [join our Discord](https://discord.gg/6JbGUMDkMp) and follow us on [Twitter](https://twitter.com/paperclipDAO). \n", "timestamp": 1628621735, "digest": "QaEoyCiz2tsBBF58BN_vPulDXk3tuEKsQ4ttV9zCYvA", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "Zi-d-6HMkK-TOLa0pKK_LL3by8AZPj08Oz5NTC3Fl8g", "error": {"message": "unknown error: "}}
{"id": "l-EaC07gNyqP4mvwzGNoOsWh-135KxgUNvJEw56_f08", "title": "For Trade: One $PAPER/$CLIP", "body": "In 2005, blogger Kyle MacDonald started with a paperclip and traded it for a pen, the first in an incredible series of trades that ended with him trading for a house. Items he traded for along the way include a hand-sculpted doorknob, a snowmobile, a year’s rent in Phoenix, and an afternoon with musician Alice Cooper.\n\nIt’s an amazing story and even an archetypal one---an old Buddhist folk tale tells of a man who traded from a single piece of straw until he had a rice field. The Legend of Zelda’s “trade up” quests took inspiration from this classic story, as have others.\n\n**With the incredible diversity of NFTs available today a similarly magical tale is possible. So let’s create it.** Come trade with us and let’s tell the story of some amazing NFTs along the way.  \n\n![](https://images.mirror-media.xyz/publication-images/a58d4f4c-47bd-41e8-b48d-c6fce513b9be.jpeg?height=1080&width=1920)\n\n**Today we are offering up our first trade which is, naturally, a paperclip.** More specifically it’s a “$Paper/$Clip” NFT for a *redeemed* Uniswap position. You can see it [here](https://opensea.io/assets/0xc36442b4a4522e871399cd717abdd847ab11fe88/103126). \n\nHere's how to trade with us: \n\n1. Check our twitter [@paperclipDAO](https://twitter.com/paperclipDAO) for the pinned tweet telling you what NFT we're offering for trade.\n\n2. Create an offer on [Sudoswap](https://sudoswap.xyz/) to exchange your NFT for our NFT. Sudoswap will generate a trade link.\n\n3. Tweet your trade link at [@paperclipDAO](https://twitter.com/paperclipDAO), proposing the trade. $CLIP holders will then vote on whether or not to accept your trade. \n\n4. If yes, we swap!\n\n**So about those $CLIP tokens...** anyone who successfully trades with us gets $CLIP tokens so they can join the DAO and continue to create the story. The first to trade with us will get the most $CLIP, and as the story becomes richer and the NFTs more innately valuable the amount of $CLIP given will decline (in an interesting way perhaps…) \n\nWhere will this journey end? We think it might be cool to rescue an unobtainable NFT, maybe one from another dimension, and make it available to the community. But only time will tell. \n\nLet’s start swapping and find out. \n\nTo keep up with this adventure, [join our Discord](https://discord.gg/6JbGUMDkMp) and follow us on [Twitter](https://twitter.com/paperclipDAO). \n", "timestamp": 1628622182, "digest": "QaEoyCiz2tsBBF58BN_vPulDXk3tuEKsQ4ttV9zCYvA", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "VZd2vDdezKQN7comO8-zo6UcUZXqxO6iycX3njFR-_E", "title": "For Trade: One $PAPER/$CLIP", "body": "In 2005, blogger Kyle MacDonald started with a paperclip and traded it for a pen, the first in an incredible series of trades that ended with him trading for a house. Items he traded for along the way include a hand-sculpted doorknob, a snowmobile, a year’s rent in Phoenix, and an afternoon with musician Alice Cooper.\n\nIt’s an amazing story and even an archetypal one---an old Buddhist folk tale tells of a man who traded from a single piece of straw until he had a rice field. The Legend of Zelda’s “trade up” quests took inspiration from this classic story, as have others.\n\n**With the incredible diversity of NFTs available today a similarly magical tale is possible. So let’s create it.** Come trade with us and let’s tell the story of some amazing NFTs along the way.  \n\n![](https://images.mirror-media.xyz/publication-images/a58d4f4c-47bd-41e8-b48d-c6fce513b9be.jpeg?height=1080&width=1920)\n\n**Today we are offering up our first trade which is, naturally, a paperclip.** More specifically it’s a “$Paper/$Clip” NFT for a *redeemed* Uniswap position. You can see it [here](https://opensea.io/assets/0xc36442b4a4522e871399cd717abdd847ab11fe88/103126). \n\nHere's how to trade with us: \n\n1. Check our twitter [@paperclipDAO](https://twitter.com/paperclipDAO) for the pinned tweet telling you what NFT we're offering for trade.\n\n2. Create an offer on [Sudoswap](https://sudoswap.xyz/) to exchange your NFT for our NFT. Sudoswap will generate a trade link.\n\n3. Tweet your trade link at [@paperclipDAO](https://twitter.com/paperclipDAO), proposing the trade. $CLIP holders will then vote on whether or not to accept your trade. \n\n4. If yes, we swap!\n\n**So about those $CLIP tokens...** anyone who successfully trades with us gets $CLIP tokens so they can join the DAO and continue to create the story. The first to trade with us will get the most $CLIP, and as the story becomes richer and the NFTs more innately valuable the amount of $CLIP given will decline (in an interesting way perhaps…) \n\nWhere will this journey end? We think it might be cool to rescue an unobtainable NFT, maybe one from another dimension, and make it available to the community. But only time will tell. \n\nLet’s start swapping and find out. \n\nTo keep up with this adventure, [join our Discord](https://discord.gg/6JbGUMDkMp) and follow us on [Twitter](https://twitter.com/paperclipDAO). \n", "timestamp": 1628621654, "digest": "QaEoyCiz2tsBBF58BN_vPulDXk3tuEKsQ4ttV9zCYvA", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "D5yJAZKFeW1G-fHZcbcZ696_9tRFIPQ4MGUfv26bI60", "title": "For Trade: One $PAPER/$CLIP", "body": "In 2005, blogger Kyle MacDonald started with a paperclip and traded it for a pen, the first in an incredible series of trades that ended with him trading for a house. Items he traded for along the way include a hand-sculpted doorknob, a snowmobile, a year’s rent in Phoenix, and an afternoon with musician Alice Cooper.\n\nIt’s an amazing story and even an archetypal one---an old Buddhist folk tale tells of a man who traded from a single piece of straw until he had a rice field. The Legend of Zelda’s “trade up” quests took inspiration from this classic story, as have others.\n\n**With the incredible diversity of NFTs available today a similarly magical tale is possible. So let’s create it.** Come trade with us and let’s tell the story of some amazing NFTs along the way.  \n\n![](https://images.mirror-media.xyz/publication-images/a58d4f4c-47bd-41e8-b48d-c6fce513b9be.jpeg?height=1080&width=1920)\n\n**Today we are offering up our first trade which is, naturally, a paperclip.** More specifically it’s a “$Paper/$Clip” NFT for a *redeemed* Uniswap position. You can see it [here](https://opensea.io/assets/0xc36442b4a4522e871399cd717abdd847ab11fe88/103126). \n\nHere's how to trade with us: \n\n1. Check our twitter [@paperclipDAO](https://twitter.com/paperclipDAO) for the pinned tweet telling you what NFT we're offering for trade.\n\n2. Create an offer on [Sudoswap](https://sudoswap.xyz/) to exchange your NFT for our NFT. Sudoswap will generate a trade link.\n\n3. Tweet your trade link at [@paperclipDAO](https://twitter.com/paperclipDAO), proposing the trade. $CLIP holders will then vote on whether or not to accept your trade. \n\n4. If yes, we swap!\n\n**So about those $CLIP tokens...** anyone who successfully trades with us gets $CLIP tokens so they can join the DAO and continue to create the story. The first to trade with us will get the most $CLIP, and as the story becomes richer and the NFTs more innately valuable the amount of $CLIP given will decline (in an interesting way perhaps…) \n\nWhere will this journey end? We think it might be cool to rescue an unobtainable NFT, maybe one from another dimension, and make it available to the community. But only time will tell. \n\nLet’s start swapping and find out. \n\nTo keep up with this adventure, [join our Discord](https://discord.gg/6JbGUMDkMp) and follow us on [Twitter](https://twitter.com/paperclipDAO). \n", "timestamp": 1628621700, "digest": "QaEoyCiz2tsBBF58BN_vPulDXk3tuEKsQ4ttV9zCYvA", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "AqHN50eyVV3z-H_rc7AmI6Aojb-PkuoM0_PTk2FXF_M", "title": "For Trade: One $PAPER/$CLIP", "body": "In 2005, blogger Kyle MacDonald started with a paperclip and traded it for a pen, the first in an incredible series of trades that ended with him trading for a house. Items he traded for along the way include a hand-sculpted doorknob, a snowmobile, a year’s rent in Phoenix, and an afternoon with musician Alice Cooper.\n\nIt’s an amazing story and even an archetypal one---an old Buddhist folk tale tells of a man who traded from a single piece of straw until he had a rice field. The Legend of Zelda’s “trade up” quests took inspiration from this classic story, as have others.\n\n**With the incredible diversity of NFTs available today a similarly magical tale is possible. So let’s create it.** Come trade with us and let’s tell the story of some amazing NFTs along the way.  \n\n![](https://images.mirror-media.xyz/publication-images/a58d4f4c-47bd-41e8-b48d-c6fce513b9be.jpeg?height=1080&width=1920)\n\n**Today we are offering up our first trade which is, naturally, a paperclip.** More specifically it’s a “$Paper/$Clip” NFT for a *redeemed* Uniswap position. You can see it [here](https://opensea.io/assets/0xc36442b4a4522e871399cd717abdd847ab11fe88/103126). \n\nHere's how to trade with us: \n\n1. Check our twitter [@paperclipDAO](https://twitter.com/paperclipDAO) for the pinned tweet telling you what NFT we're offering for trade.\n\n2. Create an offer on [Sudoswap](https://sudoswap.xyz/) to exchange your NFT for our NFT. Sudoswap will generate a trade link.\n\n3. Tweet your trade link at [@paperclipDAO](https://twitter.com/paperclipDAO), proposing the trade. $CLIP holders will then vote on whether or not to accept your trade. \n\n4. If yes, we swap!\n\n**So about those $CLIP tokens...** anyone who successfully trades with us gets $CLIP tokens so they can join the DAO and continue to create the story. The first to trade with us will get the most $CLIP, and as the story becomes richer and the NFTs more innately valuable the amount of $CLIP given will decline (in an interesting way perhaps…) \n\nWhere will this journey end? We think it might be cool to rescue an unobtainable NFT, maybe one from another dimension, and make it available to the community. But only time will tell. \n\nLet’s start swapping and find out. \n\nTo keep up with this adventure, [join our Discord](https://discord.gg/6JbGUMDkMp) and follow us on [Twitter](https://twitter.com/paperclipDAO). \n", "timestamp": 1628621504, "digest": "QaEoyCiz2tsBBF58BN_vPulDXk3tuEKsQ4ttV9zCYvA", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "6CqMtRx6IGUXkl8JeonDP-DZOsuOArzmnXF-c2dwNP4", "title": "Full effort", "body": "Full effort > full time", "timestamp": 1628626304, "digest": "hNiURkUsq47HQ8s3x90gBBW5-N1IhTr9gC6PeH3STAU", "contributor": "0xB0623C91c65621df716aB8aFE5f66656B21A9108"}
