{"id": "mOBMBrh_EOPqgw2LGBxlpMRWa-tKU14_AxeBRFAltqA", "title": "Book Of The Twins", "body": "## Chapter 1: The Bronze Ring\n\n![@lootvoxels](https://images.mirror-media.xyz/publication-images/ebc74c60-3caa-41eb-ba53-b0cf7952e2bf.jpg?height=600&width=600)\n\n\"I never thought I'd see you again.\"\n\nHiram gave his older brother a strong and burly hug.\n\n\"A cup of cold water, brother. The journey has been long.\" Mava Tow looked tired and old, with cracked skin and sun marks under his eyes. He hadn't been home in over 4 years.\n\nHiram fetched a clean glass of water and handed it to his brother, who gulped it down in one fell swoop.\n\nHiram Tow thought his brother had died over 3 years ago, after the family waited several excruciating months for message of his safe arrival in the City of Tulem. A message never came.\n\nHiram looked closely at his once strong and mighty brother Mava, who now looked weak and exhausted. \"Where have you been dear brother?\"\n\nMava sat down at the wooden table, and took a thick bronze ring out of his pocket. He slowly put the ring down on the table. “I’ll tell you…”\n\n## Chapter 2 coming soon", "timestamp": 1631045567, "digest": "pGMn86NxMpXDTE11MLktavn_x6_gg-lCdU-rco_KPk0", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
{"id": "Mr1xZyNUKWLZqOjjHJRvNPOg0KHOObL8a4Xbf5TWrX8", "title": "Book Of The Twins: Chapter 1", "body": "## Chapter 1: The Bronze Ring\n\n![@lootvoxels](https://images.mirror-media.xyz/publication-images/ebc74c60-3caa-41eb-ba53-b0cf7952e2bf.jpg?height=600&width=600)\n\n\"I never thought I'd see you again.\"\n\nHiram gave his older brother a strong and burly hug.\n\n\"A cup of cold water, brother. The journey has been long.\" Mava Tow looked tired and old, with cracked skin and sun marks under his eyes. He hadn't been home in over 4 years.\n\nHiram fetched a clean glass of water and handed it to his brother, who gulped it down in one fell swoop.\n\nHiram Tow thought his brother had died over 3 years ago, after the family waited several excruciating months for message of his safe arrival in the City of Tulem. A message never came.\n\nHiram looked closely at his once strong and mighty brother Mava, who now looked weak and exhausted. \"Where have you been dear brother?\"\n\nMava sat down at the wooden table, and took a thick bronze ring out of his pocket. He slowly put the ring down on the table. “I’ll tell you…”\n\n## Chapter 2 coming soon\n\n```\n<div className=\"nft-embed\"></div>\n<script\n  async\n  src=\"https://nfte.app/api/embed.js?contract=0x495f947276749ce646f68ac8c248420045cb7b5e&tokenId=45806826772110747458953591340947477033056666649221032167075464196359119175681\">\n</script>\n```", "timestamp": 1631046335, "digest": "pGMn86NxMpXDTE11MLktavn_x6_gg-lCdU-rco_KPk0", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
{"id": "WrMdxxigxetjrK5FGmZbEWR5aifbzkXSMQvby1wZWVQ", "title": "Test Survey 3", "body": "[survey://3?address=0x69DdE2e4d81720AEfdb50Bc7439EDd32565d21f2](survey://3?address=0x69DdE2e4d81720AEfdb50Bc7439EDd32565d21f2)\n\n", "timestamp": 1631062487, "digest": "rD53KBFsEqWmfIkmQwzygxy6qJOPyxsmQILVBJyPRY4", "contributor": "0xA0Cf798816D4b9b9866b5330EEa46a18382f251e"}
{"id": "nzv8PqIBRj7F6FNI68W2aSk8PhxC7FlhIJQcKVWnMcw", "title": "A peek into DAOs: Part 2 of 3", "body": "*This is Part 2 in a three-part series. [Find Part 1 here](https://annika.mirror.xyz/9yxmN8Sh3_i43zgFWxQjNVMaL3vqNHGJ_JERr_sgEmk).*\n\nAs a result of my rapidly-accelerating crypto obsession, in the past couple months I’ve gone from a near-never Discord user to waking up every morning to an overwhelming left-hand sidebar with logos and notifications galore.\n\nThese are, of course, the logos of DAOs I’m following. \n\nSince I’m teetering on the brink of being mostly a quiet DAO lurker to becoming a contributing member of these communities, I’d like to document my experience and learnings about DAOs as they are today in 2021. \n\nI think it’s important I do this before I get much deeper and become ‘one of them’ (“one of us… one of us…”), so that I can provide my best layman’s take for the 99% of the planet that isn’t DAO-native. I decided I’d write about my three main learnings from my involvement with DAOs to date, but as usual with my writing, this got real long real quick – so I’m splitting it into three parts to really dig into each and discuss its implications. \n\nThe three things I’ve learned are:\n\n1. [DAO is an ethos](https://annika.mirror.xyz/9yxmN8Sh3_i43zgFWxQjNVMaL3vqNHGJ_JERr_sgEmk)\n2. The transparency is wild\n3. You gotta hustle\n\nLet’s dig into #2.\n\n## Part 2: The transparency is wild \n\n“Step into my company Slack, will you” – said no one, ever. \n\nIn Part 1 of this piece, [DAO is an ethos](https://annika.mirror.xyz/9yxmN8Sh3_i43zgFWxQjNVMaL3vqNHGJ_JERr_sgEmk), I wrote about ways that DAO norms might manifest themselves when it comes to the future of work. Here in Part 2, I’ll dig into the transparency and openness piece specifically – because I think this sub-ethos underpins one of the biggest shifts we’ll see in companies and how they recruit, organize, and raise capital. \n\nThe shift is that DAOs are, typically, Default Open. \n\nSo, what *is* Default Open?\n\n![](https://images.mirror-media.xyz/publication-images/ed0cabf5-8132-43d7-865f-63d6989fa8c2.png?height=338&width=600)\n\nDefault Open is exactly what it sounds like: it means that access to information within a company is, by default, open to the entire company to view. You can think of this as akin to your sharing settings on iCloud or Google Drive; the default here is that it’s shared with the entire company base, rather than the default being private.\n\n![](https://images.mirror-media.xyz/publication-images/4dfb6da5-d9e5-4cce-b95e-b38fbd0cf965.png?height=63&width=624)\n\nOnly if there is a good reason to restrict access does a file, a piece of info, or a Discord channel become private – rather than the reverse.\n\nDAOs take Web2 Default Open to a new level. If, in Web2, Default Open allows the entire company to access all its information, in Web3, this universe is extended to the entire world. \n\nIf joining a startup is signing up for a seat on a rocketship, joining DAOs is snooping on a bunch of rocketships being built, figuring out which rocket-building team you jive with, and stepping in with a wrench where you see fit.\n\nThe openness required to do this constitutes a massive mindset shift - and I was blown away when I first experienced it in practice. \n\nWhen looking at joining DAOs, I assumed I’d need to fill out an application, talk to a key organizer, and get some sort of approval before starting to engage. While this is true of some DAOs, this was not my experience at large. In many cases, I gained access to the Discord pretty much right away. \n\n**What’s notable is that these Discords aren’t just for fans & end-users of the protocol.** In Web2, you’ll often see community Slack groups for open-source software projects who would then also have a separate internal Slack instance for employees only. Not in crypto. **These public Discords are literally where work the gets done, where calls get scheduled, where people get hired, and where governance happens.** It’s incredible. \n\n[https://twitter.com/rrhoover/status/1433834562182914061?s=20](https://twitter.com/rrhoover/status/1433834562182914061?s=20)\n\nIf you have a Discord account, go ahead and try it out right now: visit the website or Twitter page of a given crypto project (I’d start with [Uniswap](https://uniswap.org/)), find the Discord link, and odds are you’ll click into a dark page with a pop-up saying “you’re invited to join”. \n\nClick accept, read the T&Cs and do the required emoji reaction to confirm you’ll comply with the rules of the forum, and you’re in.\n\n![](https://images.mirror-media.xyz/publication-images/847a0827-9ea5-45cb-a11b-97267c09b95d.png?height=491&width=624)\n\nIMO, poking around in these Discords is one of the fastest ways to start to understand the DAO landscape and the ethos of the builders at the forefront in crypto, generally speaking.\n\n[https://twitter.com/chaserchapman/status/1429870422401691659](https://twitter.com/chaserchapman/status/1429870422401691659)\n\nIf you’re not crypto-native and the thought of doing this yourself is overwhelming, I’ll shed some light on a few examples what I’m seeing within in DAO Discords to really bring this to life.\n\n**Governance**\n\nDiscussions that would be happening at the Board of Directors level in Web2, around things like “what does our employee stock options plan look like?” and “where do we want this protocol to be in five years?” are held totally in public.\n\nVoting on key governance matters - which, again, would typically happen at the Board level - is often put forth to the community of token-holders as a whole.\n\n![](https://images.mirror-media.xyz/publication-images/8f44883c-b752-4631-8919-656a6b33e426.png?height=1037&width=2295)\n\n**Budget decisions**\n\nConversations around treasury allocation (i.e., how the company plans to manage & spend its money, basically) are also happening in public.\n\nThe level of detail here varies, but in many cases, you can even see job offers – yes, all the way down to specific terms of an offer for a specific candidate. And, if you’re a tokenholder, you can vote on whether or not to approve that hire.\n\n![](https://images.mirror-media.xyz/publication-images/7c8f9149-d077-491a-aa0d-c56b6158610b.png?height=1181&width=1625)\n\n**Fundraising**\n\nFundraising, too, is happening in public.\n\nSince decisions are made as a collective, even discussions around raising a venture round are not exempt from community participation. VCs are having to join community calls and jumping into Discords to pitch DAOs, answer questions, and articulate their value-add - not just to the CEO, but to the voting community as a whole.\n\nSushiswap, for one, was recently pursuing a venture fundraise, and the community was opposed to certain terms of the raise. [Collectivizing Finance](https://annika.mirror.xyz/Pj8N16OdD2MW6s8lE_Ex8TC7WLHJSRiLOp3Gz-lHZPg), a piece I recently co-wrote, goes into more depth on the dynamics of this raise. \n\nFrom a transparency lens, what’s fascinating here is that the dialogue the VCs had with the community can be publicly viewed. **These are conversations that would normally happen behind closed doors with a select group executives**, let alone in the presence of employees, and are now visible to the public-at-large.\n\n![](https://images.mirror-media.xyz/publication-images/0693effd-e74c-4088-8572-242020259209.png?height=1175&width=1807)\n\nTo close out this section, I want to pause and reflect on all this for a moment. \n\nIt feels *super* weird that all of this information is public, doesn’t it? Uncomfortable, in a way. This shift towards increased transparency is outside of our societal working norms and, at times, it’s an uneasy one. \n\nTo be honest, I’m not sure a 100% Default Open level of transparency is optimal. Yes, I think employees and prospective hires should generally be entitled to *far* more information than they currently are in a typical company and that this swinging of the pendulum in this direction is fantastic - but I do worry a bit about the level of access that bad actor outsiders with zero skin in the game might have.\n\nFor each DAO, the level of comfort with openness is likely to vary based on constituents and subject matter, and it’ll take experimentation to get to a balance that feels right for insiders & outsiders alike.\n\n### As always, it’s a spectrum\n\nJust as [Decentralization is not Binary](https://annikalewis.medium.com/decentralization-is-not-binary-45bbb9946fad), nor is openness – and the DAOs I described above are those that are far-to-the-left on the open vs. closed spectrum.\n\n![](https://images.mirror-media.xyz/publication-images/01454e00-5e71-4451-b6b9-eafb63858761.png?height=623&width=1342)\n\nBeyond these highly open DAOs, we’re also seeing more and more token-gated DAOs popping up (e.g., [The LAO](https://www.thelao.io/), [FWB](https://www.fwb.help/)) – that is to say, an individual needs to be a token-holder (e.g., hold 75 $FWB tokens) to gain access to the Discord and the benefits the DAO has to offer, thereby restricting openness.\n\nAnd on the Web2 side, while you may not have ‘DAOs’, per se, there are companies out there that are taking openness to a new level and incorporating a lot of the DAO ethos, whether they know it or not. [Gitlab](https://about.gitlab.com/), a Web2 company I very much admire, [provides public access to an absurd amount of its strategy & procedures](https://gitlabfan.com/7-examples-of-extreme-transparency-of-gitlab-e257796c9ef4). People are thinking about transparency well beyond just crypto.\n\nAll-in-all, it’s great to see the status quo being challenged in a big way. *But is today’s DAO-level transparency sustainable?*\n\n### The future of transparency\n\nWhile I think this ‘Default Open’ ethos is here to stay, I expect the approach and the specifics for many DAOs may get re-thought. \n\nOn one hand, it’s great that someone new to crypto has access to the depths of these protocols to poke around and learn.\n\nOn the other hand, as mentioned earlier, these protocols may be exposing themselves to unnecessary risk / scrutiny from bad actors.\n\nIn particular, I expect we’ll see more DAOs playing with different versions of gating, for example:\n\n* **Earned token-gating**: Rather than needing to *buy* tokens to join a token-gated DAO, the DAO might offer opportunities to earn these tokens via work rather than having a cash outlay. Big fan of experimentation here in an attempt to open up access to those who may not have the capital required to join.\n* **Channel-based gating**: DAOs might gate specific channels - and they could do this on different bases. Say, you can only join this governance channel if you’re actively engaged within the community (e.g., say, you’ve posted 10x in the Discord) \n* **Statements of intent**: Perhaps, to gain access to a Discord, as part of the onboarding, the joiner might need to state their intent / motivations in getting involved. \n\nThese types of mechanisms are already starting to gain traction, but it’s very early days and best practices have yet to emerge. \n\nIf DAOs are a leading indicator, I expect that in five years’ time, companies-at-large will be *much* more fluid and open with their information, strategy, and roadmaps. Job seekers will be better informed, employees will have greater context in their day-to-day work, and fundraising will be collectivized and transparent. \n\nIt won’t come without growing pains - but building a Default Open company will become the norm, rather than the exception.", "timestamp": 1631066923, "digest": "RSS779e5d6PoW1y4x2KDYwnoZSnDnJm_rgIoyga5dcY", "contributor": "0x894Aa5F1E45454677A8560ddE3B45Cb5C427Ef92"}
{"id": "c_ImknWtkbgKkPNnR0wkakMLoWz2zgu5JR6_9VYFrSg", "title": "RITUALS", "body": "## \n\n![Aaron Penne x Boreta @ Bright Moments](https://images.mirror-media.xyz/publication-images/73e69ab3-221f-413c-b9b0-02a0cf8e1e1b.jpg?height=640&width=1280)\n\n### RITUALS binds collectors to the artwork at the moment of creation. Each expression of our generative algorithm provides a unique window into the same parametric universe, a reminder that while each of us is different,  we are also the same. The visuals and music weave an infinitely shifting experience, permanently etched on to the blockchain.\n\n### Of the 1,000 RITUALS that will be minted on ArtBlocks, the first 200 will be done exclusively IRL at Bright Moments NFT Gallery in Venice Beach.  These 200 physical experiences will be recognized on-chain (and with a visual watermark), that will forever link these decentralized ERC-721 smart contracts with the central role of the collector as a physical being, in a certain space, at a specific moment in time.\n\n### For those joining us for the RITUALS weekend, we are working with some of the most creative chefs, musicians, designers, and mindfulness practitioners that LA has to offer.\n\na collaboration of [Aaron Penne](https://www.artxcode.io/journal/aaron-penne-apparitions-on-art-blocks), [Boreta](https://boreta.net/), and [Bright Moments](https://twitter.com/brtmoments)\n\n* **A 50-Hour Live Minting Marathon, with 200 continuous 15-minute IRL experiences.**\n* **Friday Afternoon Sep 24 - Sunday Evening, Sep 26 @ Bright Moments, 62 Windward Ave, Venice, California**\n* **ArtBlocks Factory edition of 1,000 NFTs = 200 IRL + 800 online mints**\n* **120 IRL tickets (GTRV = Golden Token: Rituals Venice) will go on sale for 2 ETH each tomorrow, Mon Aug 30 at 9am PT / noon ET**\n* **800 online mints will be available starting Sun Sep 26 at 7p PT / 10p ET, pricing TBD.**\n* **Holders of GTRV will receive  random IRL minting slots between #0-199, (which they can swap with other holders in a token-gated Discord channel).**  \n* **Regardless of when you mint, in order to have the richest emotional experience possible,  we encourage you to join us Friday and Sunday for dinner.**\n\n**SCHEDULE**:\n\n* ***Before***:  Friday, Sep 24, 4pm PT: Prior to minting, we will host a late afternoon meal on the Windward Ave patio for the 200 holders of GTRV.  Everybody will have a name tag that displays which slot they will be minting (ie #0 Friday 5pm… #100 Saturday 6pm… #199 Sunday 7:45pm, etc…). Food by [Travis Lett](https://www.outerknown.com/blogs/journey/a-morning-with-travis-lett) (Gjusta, Gjelina, MTN), music by [Carlos Niño](https://en.wikipedia.org/wiki/Carlos_Gabriel_Ni%C3%B1o).\n* ***During***: Fri, Sep 24, 5p - Sun, Sep 26, 7pm PT Continuous series of 200, 15-minute live minting experiences.  During each session, visitors will have an intimate, meditative opportunity to relax, set their intention and generate an original audio / visual experience that is revealed in the gallery (and which they will own as an ArtBlocks NFT in their ETH wallet). We ask everyone to bring something meaningful to them, and set it on the collective altar for the weekend.  There will be tea and fruit available for visitors in the gallery, and light food and drinks for visitors and their guests on the patio.\n* ***After***: Sun, Sep 26, 7pm PT Upon the final mint, we will reconvene on the Windward patio, having all experienced RITUALS in the gallery, and all of us  changed somehow by it.  We will also experience the 800 online RITUALS being minted in real time by others online across the world. Food by Travis Lett, music by Carlos Niño.\n\n*Note on Group Rituals:  for groups of four who wish to pool 4 GTRV and share their minting experiences over the course of an hour, we can help you pool your four minting slots, and the four NFTs that you each generate, into a single portfolio of 4 NFTs fractionalized four ways (similar to [PartyBid](https://www.partybid.app/) & [Fractional.art](https://www.fractional.art)).*\n\n### RITUALS MINTING SCHEDULE:\n\n![RITUALS MINTING SLOTS 1/2](https://images.mirror-media.xyz/publication-images/c0c5a729-f8da-4546-9cba-bf27b9f7c03c.png?height=1524&width=2118)\n\n![RITUALS MINTING SLOTS 2/2](https://images.mirror-media.xyz/publication-images/fe8d6397-ddc8-4cf3-a1eb-c8c3b62dd3e3.png?height=1353&width=2117)\n\n***Note:  The direct sale of 120 GTNY (Golden Token: New York) was completed on August 30.  [If you wish to buy a live IRL minting slot to RITUALS, you can do so in the secondary market on OpenSea here](https://opensea.io/collection/golden-token-rituals-venice).***\n\n[edition://0xc1DfB53ca70A7bF100078521c5fB75a2991B80b6?editionId=0](edition://0xc1DfB53ca70A7bF100078521c5fB75a2991B80b6?editionId=0)\n\n", "timestamp": 1631074079, "digest": "G13gPtKyusEoZi02vYw2-71iIuHG7O4ieNxQMntDrG4", "contributor": "0x467aadC88d99B4E978A8d3d4f0A9017DCAECaAbF"}
{"id": "tc6D52XhNOnczN2lA-vlSslknZoolzmLvBK--m-_JHI", "title": "RITUALS", "body": "## \n\n![Aaron Penne x Boreta @ Bright Moments](https://images.mirror-media.xyz/publication-images/73e69ab3-221f-413c-b9b0-02a0cf8e1e1b.jpg?height=640&width=1280)\n\n### RITUALS binds collectors to the artwork at the moment of creation. Each expression of our generative algorithm provides a unique window into the same parametric universe, a reminder that while each of us is different,  we are also the same. The visuals and music weave an infinitely shifting experience, permanently etched on to the blockchain.\n\n### Of the 1,000 RITUALS that will be minted on ArtBlocks, the first 200 will be done exclusively IRL at Bright Moments NFT Gallery in Venice Beach.  These 200 physical experiences will be recognized on-chain (and with a visual watermark), that will forever link these decentralized ERC-721 smart contracts with the central role of the collector as a physical being, in a certain space, at a specific moment in time.\n\n### For those joining us for the RITUALS weekend, we are working with some of the most creative chefs, musicians, designers, and mindfulness practitioners that LA has to offer.\n\na collaboration of [Aaron Penne](https://www.artxcode.io/journal/aaron-penne-apparitions-on-art-blocks), [Boreta](https://boreta.net/), and [Bright Moments](https://twitter.com/brtmoments)\n\n* **A 50-Hour Live Minting Marathon, with 200 continuous 15-minute IRL experiences.**\n* **Friday Afternoon Sep 24 - Sunday Evening, Sep 26 @ Bright Moments, 62 Windward Ave, Venice, California**\n* **ArtBlocks Factory edition of 1,000 NFTs = 200 IRL + 800 online mints**\n* **120 IRL tickets (GTRV = Golden Token: Rituals Venice) will go on sale for 2 ETH each tomorrow, Mon Aug 30 at 9am PT / noon ET**\n* **800 online mints will be available starting Sun Sep 26 at 7p PT / 10p ET, pricing TBD.**\n* **Holders of GTRV will receive  random IRL minting slots between #0-199, (which they can swap with other holders in a token-gated Discord channel).**\n* **Regardless of when you mint, in order to have the richest emotional experience possible,  we encourage you to join us Friday and Sunday for dinner.**\n\n**SCHEDULE**:\n\n* ***Before***:  Friday, Sep 24, 4pm PT: Prior to minting, we will host a late afternoon meal on the Windward Ave patio for the 200 holders of GTRV.  Everybody will have a name tag that displays which slot they will be minting (ie #0 Friday 5pm… #100 Saturday 6pm… #199 Sunday 7:45pm, etc…). Food by [Travis Lett](https://www.outerknown.com/blogs/journey/a-morning-with-travis-lett) (Gjusta, Gjelina, MTN), music by [Carlos Niño](https://en.wikipedia.org/wiki/Carlos_Gabriel_Ni%C3%B1o).\n* ***During***: Fri, Sep 24, 5p - Sun, Sep 26, 7pm PT Continuous series of 200, 15-minute live minting experiences.  During each session, visitors will have an intimate, meditative opportunity to relax, set their intention and generate an original audio / visual experience that is revealed in the gallery (and which they will own as an ArtBlocks NFT in their ETH wallet). We ask everyone to bring something meaningful to them, and set it on the collective altar for the weekend.  There will be tea and fruit available for visitors in the gallery, and light food and drinks for visitors and their guests on the patio.\n* ***After***: Sun, Sep 26, 7pm PT Upon the final mint, we will reconvene on the Windward patio, having all experienced RITUALS in the gallery, and all of us  changed somehow by it.  We will also experience the 800 online RITUALS being minted in real time by others online across the world. Food by Travis Lett, music by Carlos Niño.\n\n*Note on Group Rituals:  for groups of four who wish to pool 4 GTRV and share their minting experiences over the course of an hour, we can help you pool your four minting slots, and the four NFTs that you each generate, into a single portfolio of 4 NFTs fractionalized four ways (similar to [PartyBid](https://www.partybid.app/) & [Fractional.art](https://www.fractional.art)).*\n\n### RITUALS MINTING SCHEDULE:\n\nWe are excited to release minting times for the upcoming RITUALS drop. Before we do, a few reminders:\n\n* Your minting time was chosen randomly. The script was written by Aaron Penne personally and is determined by fate, much like your future mints. You can watch the process here: <https://streamable.com/zpv649>\n* Your minting time is tied to your token ID. This is very important, because it means that to get a new minting time you need to swap tokens with someone else. If you choose to trade tickets we recommend using a tool like <https://sudoswap.xyz/>.\n* Please plan to arrive at least 1 hour before your scheduled minting time to make sure we stay on-time and on-track. As you can see, we have a very tight timeline 🙂\n\nIf you plan to swap GTRV with another holder, please remember to NEVER accept unsolicited DMs or to click on links that have not been vetted by the team. We are not responsible for the loss of your token through trading, so please please please be careful.\n\nWith that being said, feel free to use the Bright Moments Discord sever to coordinate swaps. Under no circumstances should you send your ticket directly to someone you don't know.\n\nHappy minting!\n\n![RITUALS MINTING SLOTS 1/2](https://images.mirror-media.xyz/publication-images/c0c5a729-f8da-4546-9cba-bf27b9f7c03c.png?height=1524&width=2118)\n\n![RITUALS MINTING SLOTS 2/2](https://images.mirror-media.xyz/publication-images/fe8d6397-ddc8-4cf3-a1eb-c8c3b62dd3e3.png?height=1353&width=2117)\n\n***Note:  The direct sale of 120 GTNY (Golden Token: New York) was completed on August 30.  [If you wish to buy a live IRL minting slot to RITUALS, you can do so in the secondary market on OpenSea here](https://opensea.io/collection/golden-token-rituals-venice).***\n\n[edition://0xc1DfB53ca70A7bF100078521c5fB75a2991B80b6?editionId=0](edition://0xc1DfB53ca70A7bF100078521c5fB75a2991B80b6?editionId=0)\n\n", "timestamp": 1631074242, "digest": "G13gPtKyusEoZi02vYw2-71iIuHG7O4ieNxQMntDrG4", "contributor": "0x467aadC88d99B4E978A8d3d4f0A9017DCAECaAbF"}
{"id": "eyv4eajSsME-D16a3Wkj4qZBecY0SsjsF-YxHZL8qLY", "title": "Token race block", "body": "[proposal://bafkreibsrgus3tln5jkpyn52exkplqxxhythfywkel5yej2qlnv3uxehvu](proposal://bafkreibsrgus3tln5jkpyn52exkplqxxhythfywkel5yej2qlnv3uxehvu)\n\n[proposal://bafkreigz7xuwrauw7mfy6byry666hnjb6sckaqrdeqt4esoyfxx3ssgvq4](proposal://bafkreigz7xuwrauw7mfy6byry666hnjb6sckaqrdeqt4esoyfxx3ssgvq4)\n\n[proposal://bafkreifa4lguwmgv4hyrmmg2pe54heisoz3umqp43zg2srbgwkjfow42g4](proposal://bafkreifa4lguwmgv4hyrmmg2pe54heisoz3umqp43zg2srbgwkjfow42g4)\n\n", "timestamp": 1631115116, "digest": "TsThtLURRiAmlKkr4CoBvQPYWABukv-bl2NYecsl0xA", "contributor": "0x5FE6C3F8d12D5Ad1480F6DC01D8c7864Aa58C523"}
{"id": "47gW2mN-fK-YlGBuWfEPQPUv4R5-3BhIffQMLHI7RD4", "title": "Learning From The Explorers of Mirror", "body": "Written by [Josh Cornelius](https://twitter.com/joshcrnls)\n\nA big part of what we’re building at mCLUB is an infrastructure and support system to help creators take advantage of Mirror's paradigm-shifting toolset. To that end — and due to recent requests — we're sharing examples of Mirror projects that have made good use of the platform's tools.\n\n## Crowdfunds\n\n![](https://images.mirror-media.xyz/publication-images/d9065afd-9c7a-43ea-aa95-d63141deca61.jpeg?height=970&width=1104)\n\nCrowdfunds are a simple way for creators to issue a token in exchange for ETH. These are commonly used to kickstart DAOs and other social token-based projects, but they can also be used to fund any creative pursuit. Mirror even provides the flexibility to integrate crowdfunding with tiered NFTs, which allows creators to envision more complex crowdfunding campaigns. Read the Mirror docs on [crowdfunding](https://mirror.xyz/dashboard/guide/crowdfunds) for a deeper dive, and check out these three crowdfunding examples:\n\n[A Book ($NOVEL)](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg)\n\nUnless you’re established enough to earn an advance from a publisher, funding novel writing was effectively impossible. Emily Segal is pioneering a web3 funding model using Mirror crowdfunding. Everyone who contributed to her crowdfund received $NOVEL, giving them a stake in an upcoming manuscript excerpt and first-edition NFTs, among other benefits.\n\n[A DAO ($mCLUB)](https://club.mirror.xyz/dnN3Dwe-iD6jBpzkase4YLHTxYtnuFnmUbSoOfPEkjI)\n\nHey, that’s us! To launch our DAO and kickstart our treasury, Seed Club used Mirror crowdfunding. Anybody who resonated with the mission and wanted to join could contribute ETH and receive $mCLUB tokens, providing supporters membership and governance rights in the DAO. Seed Club combined the crowdfunding with tiered NFTs to help guide prospective members and give them something more \"tangible\" than just tokens in return.\n\n[A Film ($INFINITE)](https://ethereumfilm.mirror.xyz/3SV8gLXHIW8Ot45h3RL7aOgDINxN2hjLfFVOvyatB2A)\n\n*Ethereum: The Infinite Garden* was the first film to fundraise using NFTs. Backers received access to a Discord (where they’re participating in the production of the film), credit in the film, and NFTs, depending on their level of backing. They also combined the crowdfund with Mirror’s podium option, where the top 3 backers of the project received unique 1/1 NFTs. Using this model can help incentivize supporters with deep pockets to compete for the top of the podium, leading to potentially larger funding volumes.\n\n## NFT Editions\n\n![](https://images.mirror-media.xyz/publication-images/041d33d5-fb58-474b-926a-05b9b1b6bc0d.gif?height=1067&width=600)\n\nEditions allow creators to mint a fixed supply of identical NFTs at a fixed price. Although that sounds basic and straightforward, they’re being used for wildly different use cases. [Mirror docs here](https://mirror.xyz/dashboard/guide/editions), examples below.\n\n[IRL NFT Minting (Bright Moments)](https://brightmoments.mirror.xyz/WBND1KbJvg6ripddVSasW0wkvhTeXmCOdCh2rzRGpkE)\n\nBright Moments is building a network of real-world, end-user crypto experiences. They started out with a location in Venice Beach where they were minting CryptoVenetians, NFTs based on real characters living in Venice Beach, and are now planning a pop-up in NYC. In order to build hype and fund the pop-up, they used Mirror editions to sell 200 NFTs that give holders a guaranteed reservation to mint a unique CryptoNewYorker. Non-unique NFTs as keys to a unique 1/1 NFT minting experience… cool.\n\n[Emergency Aid](https://vv.mirror.xyz/sb9NU7Wzpg-53wqNFPM-MCwWQ7y48RJlri3cr3Nt0Do)\n\nTo help provide financial aid to displaced families in Afghanistan Jack Butcher leveraged Mirror Editions. He created a 1,000-edition NFT, where each purchase raised enough funds to provide one family’s emergency needs for a month, and a higher-priced 1,000-edition NFT that supported 10 families for a month.\n\n[A Newsletter (Dirt)](https://air.mirror.xyz/lmV9Dxeos9HvKSu0BKY9pqARK2vAlPXhrNMt68E4GkI)\n\nBack in May, Dirt launched the first NFT-funded newsletter using Mirror editions. They set out to raise enough money to fund a team of editors, writers, and artists to produce Season 1 of the newsletter. The campaign was wildly successful, and they’re [continuing down their path](https://air.mirror.xyz/lmV9Dxeos9HvKSu0BKY9pqARK2vAlPXhrNMt68E4GkI) of running an entire media company using NFTs.\n\n## Entry NFTs (Auctions, Splits, and Tips)\n\n![](https://images.mirror-media.xyz/publication-images/d98eeee7-6e01-4826-836c-79a9f77df8a8.jpeg?height=700&width=860)\n\nAlthough their use cases have exploded recently, Mirror launched with a focus on publishing. The three core tools they provided to help writers monetize were the ability to mint posts as NFTs (1/1 auctions or editions), a seamless approach to tipping content creators, and an innovative way to split funds raised with contributors or with people who inspired the post. [Docs](https://mirror.xyz/dashboard/guide/nfts).\n\n[\"Power To The Person\" by Packy McCormick](https://notboring.mirror.xyz/SPV_-bchriVn_ncDj8OgnLccSb5qAsU0sXNpg9y_UTk)\n\nPacky minted this seminal essay about the passion economy, where he predicted we’ll see a trillion dollar company being run by a single person, as an NFT on Mirror and auctioned it off. Using Mirror’s toolset he was not only able to reward the people whose ideas or work he references in the article, but he rewarded anyone who retweeted his announcement of the post a share in 10% of the proceeds.\n\n[\"A Beginner’s Guide to NFTs\" by Linda Xie](https://www.notion.so/cab150b9cbcc4b7fb6090fc77881a95d)\n\nLinda wrote the canonical beginners guide to NFTs at the start of the year and sold NFT editions of the post at varying levels of rarity. More interestingly, she used the split feature not to reward contributors but to route all funds generated to three different charities she wanted to support. This allowed supporters to both own a digital artifact of a potentially historical piece of writing and donate to charities at the same time.\n\n[\"DAO Landscape\" by Coopahtroopah](https://coopahtroopa.mirror.xyz/_EDyn4cs9tDoOxNGZLfKL7JjLo5rGkkEfRa_a-6VEWw)\n\nIn partnership with Forefront, Cooper wrote a post breaking down the state of DAOs in mid-June. To honor this collaboration, the post was auctioned off as an NFT, and the funds raised were split automatically between Cooper and Carlos, the founder of Forefront. There is also the option to tip at the bottom of the post for those who want to recognize and support the work but don’t have the funds to own the NFT outright. Any tips are also split between these two collaborators.\n\n🪞♣️\n\nWheeew, would you agree Mirror is gmi? If you still have questions about how you could use Mirror's tools for your own projects, please reach out to us at mCLUB via [Twitter](https://twitter.com/mclubdao) or [Discord](http://discord.gg/WT2fHy4). It’s literally why we exist.", "timestamp": 1631120276, "digest": "vP3SoUf_r2xXhcQXsJB1uyhiAOZoNt3ZEZpkI49rl00", "contributor": "0xE62B7b73Ef13365C95d4F191A2715dF1E2836e25"}
{"id": "ttNDoHioKl3MUJ6cXcFyt54Q-Rdl1uRt9esugyhMjw4", "title": "Book Of The Twins: Chapter 1", "body": "## \n\n![@lootvoxels](https://images.mirror-media.xyz/publication-images/ebc74c60-3caa-41eb-ba53-b0cf7952e2bf.jpg?height=600&width=600)\n\n## The Bronze Ring\n\n\"I never thought I'd see you again.\"\n\nHiram gave his older brother a strong and burly hug.\n\n\"A cup of cold water, brother. The journey has been long.\" Mava Tow looked tired and old, with cracked skin and sun marks under his eyes. He hadn't been home in over 4 years.\n\nHiram fetched a clean glass of water and handed it to his brother, who gulped it down in one fell swoop.\n\nHiram Tow thought his brother had died over 3 years ago, after the family waited several excruciating months for message of his safe arrival in the City of Tulem. A message never came.\n\nHiram looked closely at his once strong and mighty brother Mava, who now looked weak and exhausted. \"Where have you been dear brother?\"\n\nMava sat down at the wooden table, and took a thick bronze ring out of his pocket. He slowly put the ring down on the table. “I’ll tell you…”\n\n## Chapter 2 coming soon", "timestamp": 1631125507, "digest": "pGMn86NxMpXDTE11MLktavn_x6_gg-lCdU-rco_KPk0", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
{"id": "sKI2pEbcx3mIv88mIxuhgE44JvN6nMy0kaTTqZDGxbw", "title": "Book Of The Twins: Chapter 1", "body": "## The Bronze Ring\n\n![@lootvoxels](https://images.mirror-media.xyz/publication-images/ebc74c60-3caa-41eb-ba53-b0cf7952e2bf.jpg?height=600&width=600)\n\n\"I never thought I'd see you again.\"\n\nHiram gave his older brother a strong and burly hug.\n\n\"A cup of cold water, brother. The journey has been long.\" Mava Tow looked tired and old, with cracked skin and sun marks under his eyes. He hadn't been home in over 4 years.\n\nHiram fetched a clean glass of water and handed it to his brother, who gulped it down in one fell swoop.\n\nHiram Tow thought his brother had died over 3 years ago, after the family waited several excruciating months for message of his safe arrival in the City of Tulem. A message never came.\n\nHiram looked closely at his once strong and mighty brother Mava, who now looked weak and exhausted. \"Where have you been dear brother?\"\n\nMava sat down at the wooden table, and took a thick bronze ring out of his pocket. He slowly put the ring down on the table. “I’ll tell you…”\n\n## Chapter 2 coming soon", "timestamp": 1631125536, "digest": "pGMn86NxMpXDTE11MLktavn_x6_gg-lCdU-rco_KPk0", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
{"id": "iF9uSuZTg5NJfdk08S0ePz336zPuOU_hdg3et4TiF8k", "title": "Book Of The Twins: Chapter 1", "body": "## \n\n![@lootvoxels](https://images.mirror-media.xyz/publication-images/ebc74c60-3caa-41eb-ba53-b0cf7952e2bf.jpg?height=600&width=600)\n\n\"I never thought I'd see you again.\"\n\nHiram gave his older brother a strong and burly hug.\n\n\"A cup of cold water, brother. The journey has been long.\" Mava Tow looked tired and old, with cracked skin and sun marks under his eyes. He hadn't been home in over 4 years.\n\nHiram fetched a clean glass of water and handed it to his brother, who gulped it down in one fell swoop.\n\nHiram Tow thought his brother had died over 3 years ago, after the family waited several excruciating months for message of his safe arrival in the City of Tulem. A message never came.\n\nHiram looked closely at his once strong and mighty brother Mava, who now looked weak and exhausted. \"Where have you been dear brother?\"\n\nMava sat down at the wooden table, and took a thick bronze ring out of his pocket. He slowly put the ring down on the table. “I’ll tell you…”\n\n## Chapter 2 coming soon", "timestamp": 1631125587, "digest": "pGMn86NxMpXDTE11MLktavn_x6_gg-lCdU-rco_KPk0", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
{"id": "0-J2RWfQdWT5NY970-S7KWYIHmMxIuhfyh_Q4G9DVeU", "title": "Book Of The Twins: Chapter 1", "body": "![@lootvoxels](https://images.mirror-media.xyz/publication-images/ebc74c60-3caa-41eb-ba53-b0cf7952e2bf.jpg?height=600&width=600)\n\n\"I never thought I'd see you again.\"\n\nHiram gave his older brother a strong and burly hug.\n\n\"A cup of cold water, brother. The journey has been long.\" Mava Tow looked tired and old, with cracked skin and sun marks under his eyes. He hadn't been home in over 4 years.\n\nHiram fetched a clean glass of water and handed it to his brother, who gulped it down in one fell swoop.\n\nHiram Tow thought his brother had died over 3 years ago, after the family waited several excruciating months for message of his safe arrival in the City of Tulem. A message never came.\n\nHiram looked closely at his once strong and mighty brother Mava, who now looked weak and exhausted. \"Where have you been dear brother?\"\n\nMava sat down at the wooden table, and took a thick bronze ring out of his pocket. He slowly put the ring down on the table. “I’ll tell you…”\n\n## Chapter 2 coming soon", "timestamp": 1631131013, "digest": "pGMn86NxMpXDTE11MLktavn_x6_gg-lCdU-rco_KPk0", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
{"id": "Ttue_ZKk76ZaAz2fnTvPRxVQQPMeR7fz1wIc1kHf76g", "title": "In the future musicians will be more like Bach than Kanye", "body": "We’re all full of the new Kanye West record, his open work-in-progress way of putting the record together and, of course, his Donda Stemplayer. This will be the future, a future of more transparency in the creative process of artists, and with amazing generative music that allows fans to become creators. And yet, each artist needs to be a content machine. Another perspective on the Donda success story is how it created tonnes of content, some of it experiential and other parts more digital. It dominated the news because it continuously dripped content into the world. This is not for everyone. \n\nIf we think back to Bach and how musicians worked, created, and subsequently got remunerated in his age then that is actually our future. They worked for a patron and learn their craft through apprenticeship. From Mozart and Paganini onwards, we started to create an image of artists as mavericks and people who’s art would force itself out no matter what and no matter the consequences. But Bach and his contemporaries and predecessors were essentially craftspeople. Churches and royals would hire them to do a specific job: create music befitting certain events, holidays, or ceremonies. \n\n![](https://images.mirror-media.xyz/publication-images/de6c3d4b-d755-4a26-a939-7a43a261d149.jpg?height=562&width=784)\n\n## Why the musicians of the future will be more like craftspeople\n\nThere’s a lot of enthusiasm surrounding the potential of Web3 for musicians: \n\n* it allows them to create more close-knit communities; \n* it gives artists the power to control their IP by, for example, releasing their music through NFTs; \n* it allows them to fund their music in a novel way, outside of the old musical infrastructures of labels and managers. \n\nBut the Web3 solutions for music are mostly built within the framework of the creator economy. This means that there is pressure to continuously engage a group of followers. There’s also a need to distinguish between what you offer your more regular fans versus your superfans. The latter desire, and should receive, insights into the creative process and gain access to the artist. \n\nWhat that means is that it’s not possible to just disappear for a couple of years and work on your magnum opus and just release it into the world. That kind of release required the kind of marketing strategy and force that a major label like Universal could offer around 20 years ago. There are plenty of critiques of the current marketplace for music, and art in general. One of my personal favourites is from William Deresiewicz. In his book *The Death of the Artist*, he argues that we’re coming into a time where Art with a capital A and the Artist with a capital A disappear. What started in the mid-18th Century is now running its course. Spurred on by the capitalism of Big Tech we are in the death throes of these romantic concepts. Instead artists need to act like entrepreneurs. \n\nNowadays, it’s all about churning out high quality content consistently and regularly. NFTs, DAOs, and other Web3 solutions don’t necessarily change this, they almost reinforce it. The power of an NFT is about ownership, but also about buying access. **3LAU** offered a [custom-created song for the highest bidder](https://nft.3lau.com/#/auction) in one of his drops. **Li Jin** ended up [writing an article with the person who bought her first NFT](https://www.nytimes.com/2021/03/24/opinion/what-are-nfts.html). Experimentation with this is ongoing with current examples being gated communities like **[Friends With Benefits](https://www.fwb.help/manifesto)** or **Holly Herndon**’s **[Holly+](https://decrypt.co/75958/holly-herndon-launches-dao-controlled-vocal-deepfake-platform-holly)**. There’s also the potential for more dynamic NFTs that allow for change and growth over time. Something I’m personally very curious about is how NFTs can be put together so that they will only open at some point in the future when certain criteria are met. With all of this potential, it still means that artists need to look at their craft differently than before. Art becomes something else again. \n\nAll of these developments, however, still require a kind of always-on mentality and a focus on briefness and easy-to-grasp concepts. The hope is that by engaging with  fans through tools like NFTs artists can create the financial space to focus on what they want to create. But those same fans also crave attention and require content to keep their ears piqued. Of course, there are some who have created success. If we look at **Cristina Spinei**, for example, [who recently stated that](https://medium.com/geekculture/can-nfts-fix-the-music-industrys-broken-business-model-ba3159a8ff1d):\n\n> “NFTs have allowed me to gain complete independence from classical music institutions. This is the first year in ages that I won’t be applying for any awards or grants. It’s liberating to connect directly with an audience and collectors.”\n\nNotwithstanding her success, she has learned her craft and is now finding ways to earn money off of her craft through new technologies. \n\n## Communities & technologies also require craft\n\nFreedom from institutions is one of the great promises of the blockchain. Making that work is why a lot of people start experimenting on it in the first place. But operating on the Web3 requires its own form of craft. This is why Bas wrote his [Web3 Primer](https://musicx.mirror.xyz/aFsodqVCC0JTCQ48z002Gecdkq0w9-2tGa-YqXp3BB0) and this is also why Spinei put together an [NFT Guide](https://www.cristinaspinei.com/nftguide) specifically for classical musicians. To flourish in this new landscape requires knowledge of its concepts and tools. And that knowledge comes through craft. There’s no wonder that most **Discord** channels I’m in have a community manager, it takes skill and dedication to keep a group of people together. Setting up a community isn’t as easy as minting five NFTs and sending out a group email. \n\nAs some of the earlier examples showcase, [technology itself can be a creative medium](https://www.arts.gov/sites/default/files/Tech-as-Art-report-062921.pdf). Learning how to utilize them as such is something that should be allowed time for. Not necessarily through institutions such as schools and universities, but it definitely requires something thorough. What Deresiewicz ascertained is that there have been [three models of artist](https://www.theatlantic.com/magazine/archive/2015/01/the-death-of-the-artist-and-the-birth-of-the-creative-entrepreneur/383497/) in the past couple of hundred years. \n\n> “Artisan, genius, professional: underlying all these models is the market. In blunter terms, they’re all about the way that you get paid. If the artisanal paradigm predates the emergence of modern capitalism—the age of the artisan was the age of the patron, with the artist as, essentially, a sort of feudal dependent—the paradigms of genius and professional were stages in the effort to adjust to it.”\n\nAnd now we have an environment where this adjustment continues while it shirks towards a form of rebellion. The latter is the opportunity to become independent from longstanding infrastructures. The former shines through in the way that it’s still about getting paid. The question is, at what stage do you get paid? If, indeed, we go back to the musician as a craftsperson then the system supporting that should allow them to learn their craft, every aspect of it. \n\n![](https://images.mirror-media.xyz/publication-images/d60830af-f625-4b2a-8389-b2b956ae340c.jpg?height=245&width=495)\n\n## An artisanal freedom\n\nOf course, there are endless opportunities to create and market your music. Web3 offers enticing solutions that promise freedom. But that freedom is not the kind of freedom we traditionally associate with the genius artist. It’s not about creating your work in solitude, outside of the public eye. On the contrary, the freedom promised through Web3 tools and solutions - of which NFTs are just one - focus on craft. It’s a world that still requires artists to stand out from a large crowd. This requires platforms, gatekeepers, and attention-grabbing headlines just as much as it did in previous environments that artists operated in. The hope, then, is that we come to a new kind of artist, one who finds their perfection in the way that Bach did. Through endless craft comes a moment where the entertainment becomes art. This can be in the ear of the beholder or in the form of the art. Perhaps we don’t need to make music that people will consume in a concert hall with an 80-person orchestra. Instead, it could be music for pixels with a total duration of 50 seconds. To do that right, to not let that be generic but something truly creative requires craft. It’s up to all of us to see to it that artists are allowed to learn those crafts. ", "timestamp": 1631139667, "digest": "hKvSdCRDde8dmRAdVryFLc7Zo4vqFMRJ8CO-85tkjQ4", "contributor": "0x04a395a382B43d083ac5F43eb4c32B93d5a43E00"}
{"id": "5FZoNQuu3juZJnLDN-LPtT8O5_mtSkwmENaOO4xK1UU", "title": "Book Of The Twins: Chapter 1", "body": "![](https://images.mirror-media.xyz/publication-images/9e9ac67a-a7d0-4d75-b8ee-ea6bfd785ffb.jpg?height=600&width=600)\n\n\"I never thought I'd see you again.\"\n\nHiram gave his older brother a strong and burly hug.\n\n\"A cup of cold water, brother. The journey has been long.\" Mava Tow looked tired and old, with cracked skin and sun marks under his eyes. He hadn't been home in over 4 years.\n\nHiram fetched a clean glass of water and handed it to his brother, who gulped it down in one fell swoop.\n\nHiram Tow thought his brother had died over 3 years ago, after the family waited several excruciating months for message of his safe arrival in the City of Tulem. A message never came.\n\nHiram looked closely at his once strong and mighty brother Mava, who now looked weak and exhausted. \"Where have you been dear brother?\"\n\nMava sat down at the wooden table, and took a thick bronze ring out of his pocket. He slowly put the ring down on the table. “I’ll tell you…”\n\n### Chapter 2 coming soon\n\nCover Artwork by @lladonika and @hafiizkarim. Find more of their work at [Loot Voxels](https://opensea.io/collection/lootvoxels) on OpenSea.\n\n[split://0x5A431a4b53B193f57e3D3c3D462A3491673ce56C](split://0x5A431a4b53B193f57e3D3c3D462A3491673ce56C)\n\n", "timestamp": 1631142643, "digest": "pGMn86NxMpXDTE11MLktavn_x6_gg-lCdU-rco_KPk0", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
{"id": "oV5jgd0ZMEykYNAgFD0TxnRozodKCKic5xQkD2JiU6I", "title": "Book Of The Twins: Chapter 1", "body": "![](https://images.mirror-media.xyz/publication-images/9e9ac67a-a7d0-4d75-b8ee-ea6bfd785ffb.jpg?height=600&width=600)\n\n\"I never thought I'd see you again.\"\n\nHiram gave his older brother a strong and burly hug.\n\n\"A cup of cold water, brother. The journey has been long.\" Mava Tow looked tired and old, with cracked skin and sun marks under his eyes. He hadn't been home in over 4 years.\n\nHiram fetched a clean glass of water and handed it to his brother, who gulped it down in one fell swoop.\n\nHiram Tow thought his brother had died over 3 years ago, after the family waited several excruciating months for message of his safe arrival in the City of Tulem. A message never came.\n\nHiram looked closely at his once strong and mighty brother Mava, who now looked weak and exhausted. \"Where have you been dear brother?\"\n\nMava sat down at the wooden table, and took a thick bronze ring out of his pocket. He slowly put the ring down on the table. “I’ll tell you…”\n\n### Chapter 2 coming soon\n\nCover Artwork by @lladonika and @hafiizkarim \\n Find more of their work at [Loot Voxels](https://opensea.io/collection/lootvoxels) on OpenSea\n\n[split://0x5A431a4b53B193f57e3D3c3D462A3491673ce56C](split://0x5A431a4b53B193f57e3D3c3D462A3491673ce56C)\n\n", "timestamp": 1631142607, "digest": "pGMn86NxMpXDTE11MLktavn_x6_gg-lCdU-rco_KPk0", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
{"id": "zjbhpUdx--JcLhJj8577UcqIL2lGDmcGNvQXyXR-474", "title": "Book Of The Twins: Chapter 1", "body": "![](https://images.mirror-media.xyz/publication-images/9e9ac67a-a7d0-4d75-b8ee-ea6bfd785ffb.jpg?height=600&width=600)\n\n\"I never thought I'd see you again.\"\n\nHiram gave his older brother a strong and burly hug.\n\n\"A cup of cold water, brother. The journey has been long.\" Mava Tow looked tired and old, with cracked skin and sun marks under his eyes. He hadn't been home in over 4 years.\n\nHiram fetched a clean glass of water and handed it to his brother, who gulped it down in one fell swoop.\n\nHiram Tow thought his brother had died over 3 years ago, after the family waited several excruciating months for message of his safe arrival in the City of Tulem. A message never came.\n\nHiram looked closely at his once strong and mighty brother Mava, who now looked weak and exhausted. \"Where have you been dear brother?\"\n\nMava sat down at the wooden table, and took a thick bronze ring out of his pocket. He slowly put the ring down on the table. “I’ll tell you…”\n\n### Chapter 2 coming soon\n\nCover Artwork by @lladonika and @hafiizkarim. Find more of their work at [Loot Voxels](https://opensea.io/collection/lootvoxels) on OpenSea.\n\n[split://0x5A431a4b53B193f57e3D3c3D462A3491673ce56C](split://0x5A431a4b53B193f57e3D3c3D462A3491673ce56C)\n\n", "timestamp": 1631142908, "digest": "pGMn86NxMpXDTE11MLktavn_x6_gg-lCdU-rco_KPk0", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
{"id": "aK3wLo6RdocrcNb1JMs7Ow85HVqdyLHNfewPgd4n_NA", "title": "Learning From The Explorers of Mirror", "body": "Written by [Josh Cornelius](https://twitter.com/joshcrnls)\n\nA big part of what we’re building at mCLUB is an infrastructure and support system to help creators take advantage of Mirror's paradigm-shifting toolset. To that end — and due to recent requests — we're sharing examples of Mirror projects that have made good use of the platform's tools.\n\n## Crowdfunds\n\n![](https://images.mirror-media.xyz/publication-images/d9065afd-9c7a-43ea-aa95-d63141deca61.jpeg?height=970&width=1104)\n\nCrowdfunds are a simple way for creators to issue a token in exchange for ETH. These are commonly used to kickstart DAOs and other social token-based projects, but they can also be used to fund any creative pursuit. Mirror even provides the flexibility to integrate crowdfunding with tiered NFTs, which allows creators to envision more complex crowdfunding campaigns. Read the Mirror docs on [crowdfunding](https://mirror.xyz/dashboard/guide/crowdfunds) for a deeper dive, and check out these three crowdfunding examples:\n\n### Crowdfunds\n\n[A Book ($NOVEL)](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg)\n\nUnless you’re established enough to earn an advance from a publisher, funding novel writing was effectively impossible. Emily Segal is pioneering a web3 funding model using Mirror crowdfunding. Everyone who contributed to her crowdfund received $NOVEL, giving them a stake in an upcoming manuscript excerpt and first-edition NFTs, among other benefits.\n\n[A DAO ($mCLUB)](https://club.mirror.xyz/dnN3Dwe-iD6jBpzkase4YLHTxYtnuFnmUbSoOfPEkjI)\n\nHey, that’s us! To launch our DAO and kickstart our treasury, Seed Club used Mirror crowdfunding. Anybody who resonated with the mission and wanted to join could contribute ETH and receive $mCLUB tokens, providing supporters membership and governance rights in the DAO. Seed Club combined the crowdfunding with tiered NFTs to help guide prospective members and give them something more \"tangible\" than just tokens in return.\n\n[A Film ($INFINITE)](https://ethereumfilm.mirror.xyz/3SV8gLXHIW8Ot45h3RL7aOgDINxN2hjLfFVOvyatB2A)\n\n*Ethereum: The Infinite Garden* was the first film to fundraise using NFTs. Backers received access to a Discord (where they’re participating in the production of the film), credit in the film, and NFTs, depending on their level of backing. They also combined the crowdfund with Mirror’s podium option, where the top 3 backers of the project received unique 1/1 NFTs. Using this model can help incentivize supporters with deep pockets to compete for the top of the podium, leading to potentially larger funding volumes.\n\n## NFT Editions\n\n![](https://images.mirror-media.xyz/publication-images/ebacf320-0553-413f-8f90-4dc0763fe079.png?height=942&width=941)\n\nEditions allow creators to mint a fixed supply of identical NFTs at a fixed price. Although that sounds basic and straightforward, they’re being used for wildly different use cases. [Mirror docs here](https://mirror.xyz/dashboard/guide/editions), examples below.\n\n### NFT Editions\n\n[IRL NFT Minting (Bright Moments)](https://brightmoments.mirror.xyz/WBND1KbJvg6ripddVSasW0wkvhTeXmCOdCh2rzRGpkE)\n\nBright Moments is building a network of real-world, end-user crypto experiences. They started out with a location in Venice Beach where they were minting CryptoVenetians, NFTs based on real characters living in Venice Beach, and are now planning a pop-up in NYC. In order to build hype and fund the pop-up, they used Mirror editions to sell 200 NFTs that give holders a guaranteed reservation to mint a unique CryptoNewYorker. Non-unique NFTs as keys to a unique 1/1 NFT minting experience… cool.\n\n[Emergency Aid](https://vv.mirror.xyz/sb9NU7Wzpg-53wqNFPM-MCwWQ7y48RJlri3cr3Nt0Do)\n\nTo help provide financial aid to displaced families in Afghanistan Jack Butcher leveraged Mirror Editions. He created a 1,000-edition NFT, where each purchase raised enough funds to provide one family’s emergency needs for a month, and a higher-priced 1,000-edition NFT that supported 10 families for a month.\n\n[A Newsletter (Dirt)](https://air.mirror.xyz/lmV9Dxeos9HvKSu0BKY9pqARK2vAlPXhrNMt68E4GkI)\n\nBack in May, Dirt launched the first NFT-funded newsletter using Mirror editions. They set out to raise enough money to fund a team of editors, writers, and artists to produce Season 1 of the newsletter. The campaign was wildly successful, and they’re [continuing down their path](https://air.mirror.xyz/lmV9Dxeos9HvKSu0BKY9pqARK2vAlPXhrNMt68E4GkI) of running an entire media company using NFTs.\n\n## Entry NFTs (Auctions, Splits, and Tips)\n\n![](https://images.mirror-media.xyz/publication-images/d98eeee7-6e01-4826-836c-79a9f77df8a8.jpeg?height=700&width=860)\n\nAlthough their use cases have exploded recently, Mirror launched with a focus on publishing. The three core tools they provided to help writers monetize were the ability to mint posts as NFTs (1/1 auctions or editions), a seamless approach to tipping content creators, and an innovative way to split funds raised with contributors or with people who inspired the post. [Docs](https://mirror.xyz/dashboard/guide/nfts).\n\n### Entry NFTs\n\n[\"Power To The Person\" by Packy McCormick](https://notboring.mirror.xyz/SPV_-bchriVn_ncDj8OgnLccSb5qAsU0sXNpg9y_UTk)\n\nPacky minted this seminal essay about the passion economy, where he predicted we’ll see a trillion dollar company being run by a single person, as an NFT on Mirror and auctioned it off. Using Mirror’s toolset he was not only able to reward the people whose ideas or work he references in the article, but he rewarded anyone who retweeted his announcement of the post a share in 10% of the proceeds.\n\n[\"A Beginner’s Guide to NFTs\" by Linda Xie](https://linda.mirror.xyz/df649d61efb92c910464a4e74ae213c4cab150b9cbcc4b7fb6090fc77881a95d)\n\nLinda wrote the canonical beginners guide to NFTs at the start of the year and sold NFT editions of the post at varying levels of rarity. More interestingly, she used the split feature not to reward contributors but to route all funds generated to three different charities she wanted to support. This allowed supporters to both own a digital artifact of a potentially historical piece of writing and donate to charities at the same time.\n\n[\"DAO Landscape\" by Coopahtroopah](https://coopahtroopa.mirror.xyz/_EDyn4cs9tDoOxNGZLfKL7JjLo5rGkkEfRa_a-6VEWw)\n\nIn partnership with Forefront, Cooper wrote a post breaking down the state of DAOs in mid-June. To honor this collaboration, the post was auctioned off as an NFT, and the funds raised were split automatically between Cooper and Carlos, the founder of Forefront. There is also the option to tip at the bottom of the post for those who want to recognize and support the work but don’t have the funds to own the NFT outright. Any tips are also split between these two collaborators.\n\n🪞♣️\n\nWheeew, would you agree Mirror is gmi? If you still have questions about how you could use Mirror's tools for your own projects, please reach out to us at mCLUB via [Twitter](https://twitter.com/mclubdao) or [Discord](http://discord.gg/WT2fHy4). It’s literally why we exist.", "timestamp": 1631165242, "digest": "vP3SoUf_r2xXhcQXsJB1uyhiAOZoNt3ZEZpkI49rl00", "contributor": "0xE62B7b73Ef13365C95d4F191A2715dF1E2836e25"}
{"id": "mKaBbJ04pXt66ZlbL3Bkto8iR3oJqXhHvWTE3CVeZsQ", "title": "iO Hang #1", "body": "[https://www.youtube.com/watch?v=F7nLg1yTAL0](https://www.youtube.com/watch?v=F7nLg1yTAL0)\n\n", "timestamp": 1631174625, "digest": "59VgAfxoPmc89FICkaCyMvNbur7-sd1Qhw3UNnlVmTs", "contributor": "0xc46E9a66FDdC8D1a69529d86E668236f02957F1b"}
{"id": "ooBuA5yagp3HBhFZYhG8UdTM2-PqY1AYP537nobTYvA", "title": "iO Hang #1", "body": "In which we discuss: Roberto Bolano’s *2666*, Kafka, webs 1, 2.0, 3 and 2.5 (in that order), the Dark Forest, hysteresis, NFTs, and more.\n\n[https://www.youtube.com/watch?v=F7nLg1yTAL0](https://www.youtube.com/watch?v=F7nLg1yTAL0)\n\n", "timestamp": 1631174812, "digest": "59VgAfxoPmc89FICkaCyMvNbur7-sd1Qhw3UNnlVmTs", "contributor": "0xc46E9a66FDdC8D1a69529d86E668236f02957F1b"}
