{"id": "ViR8QzOJmku3P2UdK64rmjVNA1_rDdK4IE9sJNd_qR8", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. \n\nIf you're just learning about this project, it's a collection of perspectives from 46 Beacon Chain researchers and implementers, wrapped in delightful graphics. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\n**Read on for more info on how and where to win a copy!**\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\nIf you do win, please note that we will require a physical address to mail it to you. Limit one giveaway per identity.\n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ [Congrats to the winner!](https://twitter.com/StatefulWorks/status/1408514803841253391?s=20) - we'll be reaching out shortly1\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Congrats to the raffle winner [0x47dF...4d66](https://etherscan.io/address/0x47df75f37f8c90c847df8401cdd12d33b46e4d66) - we'll be reaching out for your information!\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ This giveaway has been awarded! [See the winning submission here!](https://twitter.com/EthereumMemes/status/1407023004823949314?s=20)\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ [Enter the raffle ASAP](https://poap.fun/278) once you have claimed\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ [Meme contest live now!](https://twitter.com/gitcoin/status/1408140416176754689)\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway info added soon!\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ Winner has been chosen, will be announced soon!\n→ POAP to be distributed via DM\n\nQuality, consistency and thoughtfulness wrapped in a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language, so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1624727755, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "a-VRRWQTnpjxZos1535lPkHx6wPJCD-sSA9-xVwzWC8", "title": "My Journey From Music To Crypto", "body": "![](https://images.mirror-media.xyz/publication-images/90e164d8-07b1-480c-a1dd-6781675f1a9b.jpeg?height=960&width=1440)\n\nFour years ago, I was a full-time music producer and global-traveling DJ. I had been working in music for nearly a decade, was getting millions of plays on streaming platforms, and had produced a couple songs that landed in the Billboard top 40. But despite having a career many people dream of, by 2016 I was feeling uneasy. My career had started to plateau and my attention was increasingly turning toward topics far afield from music, particularly the existential risks of technology. \n\nTo understand the source of my anxiety, it’s necessary to travel back to my childhood. I grew up watching a lot of Star Trek: The Next Generation with my dad. And looking back, the techno-optimist vision of Gene Roddenberry had a big influence on how I viewed human progress. My music tastes followed a similar theme. I vividly remember hearing Daft Punk’s Around The World the first time, and how excited I was when I bought my first synthesizer. This all led to a more serious interest in futurism in college. I started reading books like Ray Kurzweil’s The Singularity Is Near, and hard science fiction from authors like [Stanislaw Lem](https://en.wikipedia.org/wiki/Stanis%C5%82aw_Lem), from whom I eventually took my DJ name, [Gigamesh](https://www.gigameshmusic.com/music/).\n\n![DJing in Los Angeles, 2018](https://images.mirror-media.xyz/publication-images/ffa2de62-19c1-4a0a-8e02-0bf067e352b8.jpeg?height=960&width=1440)\n\nI released music and performed under that alias full time from 2008 onward, growing a modest global fan base. In the first two years, I achieved commercial success and started touring without a management team or agent. This was all possible thanks to the decentralized nature of pre-Spotify music discovery. I would post bootleg remixes and original songs on Soundcloud and send the links to a list of music blogs. The blogs would feed via RSS into aggregators like [Hype Machine](https://hypem.com/latest). There were very few gatekeepers so online music discovery was an organic, beautiful mess. It created a long tail of musicians like myself who wouldn’t have been able to make a living from it years earlier. \n\nAnother thing working to my benefit during the early years of my music career was that social media was still in its pre-monetization infancy. During this time, it was relatively easy for motivated, talented artists to cut through the noise and find a niche audience without doing constant self-promotion. Words like “content” and “algorithm” hadn’t become fixtures of every musician’s vocabulary. \n\n## Move fast and break everything\n\nBy 2015, my career was cruising along at a steady clip but the road was getting bumpy. My old tools for promotion were no longer viable. Spotify had supplanted Soundcloud as the dominant music discovery platform, and Facebook’s advertising revenue model was making it increasingly more difficult to reach my fans, as their attention was now being auctioned to the highest bidder. I found this frustrating, but I wasn’t fully conscious of the impact it was having on my career until much later. Ironically, the algorithms were also turning me into a news junkie with an addiction to political content.\n\nIt has taken me years to fully understand what was happening, but my optimism about humanity and technology was transforming into existential dread. The exponential technological progress I previously had religious faith in seemed to be in a doom loop with the master algorithm of unfettered capitalism. After the 2016 election, I was just as convinced technology had the potential to make humanity self-destruct as it did to create vast abundance — possibly more. This realization made it difficult for me to rationalize spending my time making dance music. It was causing instability in both the world and my life. I felt creatively unmoored, which led to spending more time consuming news, which created more anxiety and less musical output.\n\nNevertheless, I still remained hopeful about technology’s potential for good, which is where cryptocurrency enters the story. In early 2017 I noticed Bitcoin was in the news for having reached a new all time high. I had bought some at the peak of the previous cycle but hadn’t paid any attention to it in the intervening years. Like many people, I thought the ideas behind it were interesting but only had a cursory understanding of the technology and mainly thought of it as a high-risk investment. That all changed when I learned about Ethereum.\n\nAround February of that year, a musician friend named André ([RAC](https://rac.fm/)) and I started chatting over whatsapp about crypto. At some point, one of us mentioned Ethereum and we were both intrigued. After listening to some podcasts and an interview with [Vitalik Buterin](https://en.wikipedia.org/wiki/Vitalik_Buterin), I fell down the rabbit hole. I quickly moved my BTC to ETH, which then proceeded to go up about 10x over the rest of the year. André went even deeper, positioning himself as a leader at the intersection of music and crypto.\n\nBy the end of the year, I was starting to think I was a financial genius. It was making me considerably less worried about my music career. Life was pretty good! But then four events conspired to throw my life in turmoil in less than three months: crypto entered a brutal bear market, my manager quit the industry, my touring agency was acquired and subsequently dropped me (along with many other artists), and my wife moved out.\n\nSuffice to say I quickly adopted a much more aerial perspective over my life and concluded I needed to make a big change. Despite the price crash, my conviction in cryptocurrency was unshaken. I thought I might be able to forge a path toward a career in the industry. I had always thought about learning to code, so decided to give it a shot. After going through a free intro course online, I realized coding hit a lot of the same pleasure centers in my brain as making music did, so I kept going. \n\nIt was a long transition and unfortunately didn’t save my marriage, but coding did start to make me feel like I could potentially have a higher-leverage impact on the world than what my music skills afforded. After spending about 8 months learning everything I could, I found some freelance web development work. I also volunteered for an organization called [RadicalxChange](https://www.radicalxchange.org/), which has developed a reputation for innovative solutions to the problems in tech I've been concerned about. All of this culminated in landing a full-time role at Left Field Labs, a digital agency that contracts for big tech firms like Google. \n\nWhile I enjoyed the esteem of contributing code for some of the biggest tech companies in the world, I also had misgivings and remained focused on getting into crypto. By the fall of last year it was clear a new bull market was taking shape, so I decided it was time to make the leap. I quit my job and soon launched a business based on an algorithmic crypto trading strategy I developed in my free time. I called it [FinFren](https://finfren.com/). I was able to attract subscribers with minimal promotion, however I primarily viewed it as a side-hustle and was still eager to find a position where I could level-up my skills and feel like I was contributing more directly to the industry. I started applying for jobs.\n\n![](https://images.mirror-media.xyz/publication-images/83a30d27-0d37-4004-bcd7-a46b6e8f3b91.jpeg?height=1080&width=1951)\n\nA few weeks into my search, I dropped a message in the [Optimism](http://optimism.io/) discord server asking if they needed any front end development help. Like most people invested in the Ethereum ecosystem, I knew Optimism to be one of the most ambitious and anticipated infrastructure projects. I estimated my odds of getting a job there to be pretty low, so I was very happy to get immediate independent replies from both the CEO, Jinglan Wang, and CTO, Karl Floersch. They charmed my socks off and offered me a contract gig for a minor redesign of their website. The contract went well, which eventually led to a full-time position. I had arrived!\n\n## Why crypto?\n\nCryptocurrency has helped me regain my faith in the future. Why am I so optimistic about its potential to improve the world? I could go on about this at length, but I’ll try to be brief: \n\nFirst, I don't believe cryptocurrency by itself will change the world significantly. What I think will have the most impact is something Ethereum has but Bitcoin doesn’t: a [Turing-complete](https://www.youtube.com/watch?v=RPQD7-AOjMI) virtual machine. It enables an internet of programmable value in which users can easily gain an ownership stake in all the platforms they interact with. My preferred term used to describe all the applications built on this distributed computer is [Web3](https://ethereum.org/en/developers/docs/web2-vs-web3/), to contrast with the Web2 internet in which advertisers are the customer, and users are the product.\n\n[Web 3](https://twitter.com/Gigamesh/status/1343401220455636993)\n\nA common metaphor for the internet is a digital global hive mind. In that framing, every computer represents a synapse, and Web3 is a way of improving the connections between all the synapses. Rather than arbitrary data passing through the network via centrally controlled, rent-seeking intermediaries, smart contracts enable anyone to attach value to their data down to 18 decimal points of precision. This all happens on a network that is massively difficult to hack or shut down.\n\nIt should be noted the programmable value isn't purely financial. By managing the complex relationship between incentives, smart contracts also enable the expression of *ethical* values as well. All of this will enable us to design better social networks and governance systems to conquer coordination failures. In short, Web3 is a better global operating system.\n\nIn future posts, I plan to write more about the specifics of what we’re working on at Optimism. For now I’ll just say both the team and technology embodies all the values the Ethereum community is known for: inclusivity, pragmatism, extreme ambition, and of course, optimism. \n\nFor anyone who is thinking of making a career change, I strongly recommend getting into Web3. And to any Gigamesh fans reading this: thank you for all your support over the years. I may come back to music full time in the future but the lure of crypto is stronger right now. There are too many exciting things waiting to be built. ✨\n\n![Me and Vitalik Butern, founder of Ethereum](https://images.mirror-media.xyz/publication-images/87478fce-6426-4b59-b6b8-300bc53951a5.jpeg?height=2890&width=2890)\n\n\n\n\n\n", "timestamp": 1624753580, "digest": "0pkjLXlM3qaOwrQcsquaOXlcLo6IvfFvbUAGxLuVEAI", "contributor": "0x2F8f8FbF095345577b901d88EfA8bA4EC3FE8E39"}
{"id": "tgHVflyMrTE-bupx7DtAeI3m36k5ziIIFxLr_DC9mOQ", "title": "Start Here", "body": "Welcome 👋\n\nMy name is Patrick Rivera and I'm a software engineer, writer, and investor in crypto protocols. I currently work at [Mirror](https://mirror.xyz), a protocol helping people build crypto-native media businesses. So far, we've shipped a [decentralized publishing protocol](https://dev.mirror.xyz/J1RD6UQQbdmpCoXvWnuGIfe7WmrbVRdff5EqegO1RjI), [tokenized crowdfunding](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ), [NFT auctions](https://dev.mirror.xyz/_OstP6dwYsX-0YsIaGDw-W4fs3VzESC_QpxrhiyM_Bg), [NFT editions](https://dev.mirror.xyz/AOoIsKPfZvf8LACKWp7gj_mg1ICCDOfPnVBOsDQoXo8), [on-chain revenue splits](https://dev.mirror.xyz/V_7Jp1hy_g8bz-J1B4Wb5KYSmj5Lt4W7q7cw0noxJsU), and a [tokenized referral program](https://mirror.xyz/race).\n\nPreviously, I was a growth engineer at [Instacart](https://instacart.com) and a lead growth engineer at a DeFi startup called [Dharma](https://dharma.io).\n\nIn my free time, I write about the intersection of crypto, creators, and communities.\n\nHere are some of my most popular posts:\n- [A Presentation on Crypto Fundamentals and NFTs](https://docs.google.com/presentation/d/1sUpk0gbvRQelH0MUIOqjNeGe8nwRH4mhrhDHmI6qh4M/edit?usp=sharing)\n- [Come for the Creator, Stay for the Economy](https://p.mirror.xyz/1EpvJwUpx_KlRcHOKLNqADEkwHL_Z1ZYKobF2uLwgBg)\n- [Designing Internet-Native Economies: A Guide to Crypto Tokens](https://future.a16z.com/a-taxonomy-of-tokens-distinctions-with-a-difference/)\n- [Tips for Creators Getting Into Crypto](https://p.mirror.xyz/WQQywdjjfnksMRPMaNKBMxPBqfE5k8nL6pCLe1roGyw)\n- [Crypto-native Newsletter Businesses](https://p.mirror.xyz/CQnk9PLrBAUskCTCHiA5fA9SBDFZGEfCitVH343FWkY)\n- [Internet Renaissance Vibez](https://p.mirror.xyz/pl07RMWdJZktHUAn8hZ02YlO35-Ju49orPrhaRnn4Vo)\n\nSay hi on [Twitter](https://twitter.com/patrickxrivera) or email me at patrick.x.rivera@gmail.com.\n\nI publish a deep dive essay every few weeks so subscribe below to get it right in your inbox.\n\nThanks for reading :~)", "timestamp": 1624773651, "digest": "aKg6UJL7ngyKbmScJ4YbV4bYzjsrWJxLODyU9Rfr0g0", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
