{"id": "Fvdv7N9menbsWkSdiZPJAkGxZ0P1saI6-mpHnPaTXNY", "title": "From Winner Take All to Win and Help Win: the Original Vision of the Internet is Making a Comeback", "body": "A collaboration between [Sari Azout](https://twitter.com/sariazout) and [Jad Esber](https://twitter.com/jad_ae)\n\n**This is a *VERY* special essay. Read through the end to find out why.**\n\n[Token #3075](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3075)\n\n\n![](https://images.mirror-media.xyz/publication-images/82237053-7e22-484b-a906-4eb1bd7c8417.png?height=1626&width=2376)\n\n\n[1](about:blank#fn1)\n\nFrom the internet’s beginnings, we were promised that it would be the great equalizer. Analysts and tech prophets of the early 2000s wrote think pieces about how tech would transform the power dynamics of modern life and erode the hierarchies of society.\n\nBut the bright-eyed optimism of the early 2000s has been almost universally replaced by a techno-dread, a feeling that technology is creating more problems than it’s solving.\n\nToday's digital spaces, rather than democratizing wealth and access, amplify the inequities of the physical world.\n\n[One study](https://www.washingtonpost.com/news/the-switch/wp/2018/03/02/why-almost-no-one-is-making-a-living-on-youtube/) found that making it to the top 3.5% of YouTube channels—which means about 1 million views each month—only gets you $12,000 to $16,000 a year, right around the federal poverty line.\n\nFor all the talk about the democratization of the creator economy, thus far, it’s become a superstar-driven, winner-take-all affair, where a small number of people do incredibly well, while the rest struggle.\n\nSherwin Rosen attributes this to [joint consumption technologies](https://www.uvm.edu/pdodds/files/papers/others/1981/rosen1981a.pdf). Despite the internet giving everyone the same access, the best performers - even if marginally more ‘talented’ than the rest - can also now reach an internet-scale audience and serve a much bigger market, reaping an even greater share of wealth. In [The Rise of the 10x Class](https://www.drorpoleg.com/rise-of-the-10x-class/), Dror Poleg argues this dynamic is now carrying over to all parts of knowledge work, as the Internet makes it possible for people to work from anywhere and earning potential is no longer capped by geography.\n\nIn her seminal piece, [The Creator Economy Needs a Middle Class](https://hbr.org/2020/12/the-creator-economy-needs-a-middle-class), Li Jin argues that it is up to us to build platforms that strengthen the creator middle class and lays out design decisions that can help make success attainable by many.\n\nOut of the turmoil of the last twenty years, new and hopeful possibilities are emerging. Today, we’re seeing the confluence of a few major cultural and technological trends that make us optimistic that the vision of the Internet we had decades ago - creative, quirky, diverse, accessible, democratic - is making a comeback:\n\n1. A renaissance of individualism on the Internet that changes the definition of talent\n2. A shift away from ad-funded models towards creator empowerment\n3. Web3 technologies that unlock infinite remixability and more granular distributions of value\n\n### A Renaissance of Individualism on the Internet that Changes the Definition of Talent\n\n![](https://images.mirror-media.xyz/publication-images/29efa833-5753-4514-b7c9-6afd3fce6635.png?height=866&width=2256)\n\nThe assumption underlying the winner-takes-all market dynamic relies on creators being judged simply by a talent or excellence standard. However, we ignore that taste and talent are co-determined. Talent is the name we give to people who best deliver what we prefer. So if we disagree on what’s “best”, we disagree on who is most talented.\n\nEvery sport that uses ‘mechanical judges’, like stopwatches, instead of human ones are judged solely against an excellence standard. These athletes conform to a taste-free talent vector. We see the entry of a taste vector in Olympic sports that have human judges, such as gymnastics, figure skating and freestyle skiing. To become good at these sports, one must also move towards “connoisseurship”. This requires the development of a “[discriminative faculty to judge and express taste according to the aesthetic principles of a consumption domain](https://www.hbs.edu/ris/Publication%20Files/18-107_582d03d9-92fd-4290-8cc3-d720848ef6a8.pdf)”. For a long time, internet content was at the behest of the rigid mechanical judge that is “number of subscribers” or “view count”.\n\nTo demonstrate the phenomenon of taste distribution more practically, any walk down the supermarket aisles will show that the assortment needed to cater for a diversity of tastes broadens as one moves from say paper towels to soups to wines - products of increasing hedonic value. There is not much dispersion of preferences for paper napkins on any dimension other than price/sturdiness. But that is not true for even the subset of wines that sell in supermarkets. The same applies on the internet.\n\nBut what do people end up preferring? [Holbrook](https://www0.gsb.columbia.edu/mygsb/faculty/research/pubfiles/3039/aaa-JCR-Publication-October-2007.pdf) theorizes that people, as a whole, are much more dispersed in what they prefer than is the ‘expert consensus’. Holbrook’s work draws from [Bordieu’s](https://web.stanford.edu/class/think53/bourdieu17.pdf), who famously discussed that those with the highest volume of “cultural capital” dictate what’s deemed “good taste” - and therefore “what’s best”.\n\nBut how do you accumulate the “cultural capital” to dictate “what’s best”? Bordieu, whose work is rooted in the study of the French bourgeoisie, describes how “the working-class ‘aesthetic’ is a dominated aesthetic...obliged to define itself in terms of the dominant aesthetics”. Holbrook argues that in more individualistic contemporary cultures, this gets distorted and we end up with more heterogeneous tastes.\n\nWinner-take-all outcomes happen in cultural markets under the influence of received expert opinion. But that’s at odds with the internet’s promise to “democratize everything” and to allow us to express our individuality - a culture that flourishes when we can each define what “talent” means to us and that is antagonistic to forced standards and received opinion.\n\nThus far, platforms as well as a select few “influencers” have taken on the role of “expert” taste-making and that has had a profound effect on what has social and cultural value.\n\nAnd so, we introduce “Jad’s Theory” (of talent & taste on the Internet). We’re witnessing a renaissance of individualism on the internet - a breakup with institutions and the rise of the individual and, with that, an unbundling of internet communities. For the creator middle class to rise, we need to see higher resolutions of taste preference and a breakup with singular, discriminatory platform algorithms and the opinion of the ‘few’ that arbitrate taste and force today’s dominant aesthetic. With that, individuals can decide on “what’s best” for themselves, allowing for the talent power law to play out across more taste vectors and spreading the opportunity to be perceived as “the best” - and, with that, spreading the opportunity to profit from that.\n\n![](https://images.mirror-media.xyz/publication-images/b8fb77c9-8409-4da6-9a59-7aa9014e35a0.png?height=988&width=2282)\n\n\n### A shift away from ad-funded models towards creator empowerment\n\n![](https://images.mirror-media.xyz/publication-images/50128c84-ac67-4904-982a-0c0abe7c5a85.png?height=1074&width=2094)\n\nWe’re currently living through a shift in the business model of the Internet, from ad-revenue to direct-to-creator monetization. We can’t underscore enough how profoundly this alters incentives - platforms are now less focused on driving eyeballs and more focused on building tools that make creators money.\n\nAd-funded models require content to be managed at scale, and as advertisers are the main customer, they start to fill the role of the “expert” that defines what is valuable. This causes content to naturally hew to what’s deemed ‘advertiser-friendly’ and the more popular becoming even more popular.\n\nThis also means that in an ad-driven world, monetizing your social presence is only accessible to popular creators, and the size of your fanbase is the single metric that matters.\n\nNew, creator-centric business models enable monetization based on intensity of fandom, not size. [Swipehouse](https://swipehouse.co/) & [Pearpop](https://pearpop.com/), for instance, allow fans to pay for interactions, something that makes sense for creators with 10,000 followers or 10 million followers.\n\nWhether it’s Substack leading the charge on newsletters, Clubhouse [announcing plans for creator payments](https://techcrunch.com/2021/01/24/clubhouse-announces-plans-for-creator-payments-and-raises-new-funding-led-by-andreessen-horowitz/), Soundcloud introducing [fan-powered royalties](https://www.musicbusinessworldwide.com/soundcloud-is-about-to-revolutionize-streaming-payouts-launching-user-centric-royalties-for-100000-indie-artists/), Twitter [unveiling Super Follow](https://www.theverge.com/2021/2/25/22301375/twitter-super-follows-communities-paid-followers), or Snapchat Spotlight distributing over $1m to creators every day, we’re seeing platforms offering a slew of on-platform revenue options, with a renewed focus on aligning their business models with creators of all sizes. This puts the onus on the user to decide “what’s best”.\n\n![](https://images.mirror-media.xyz/publication-images/c4afdcea-75cb-41f8-88a3-2184daa3d2ac.png?height=920&width=1278)\n\nHigh willingness to pay creators, along with better methods to monetize creative output is a potent combination that will lead to a massive rise in the number of people making money online, and new ways to scale income without scaling time. The opportunities around passive income will become a new keystone of the user experience of these platforms, pulling many creators out of the labor stack and into the capital stack. The mom-and-pop businesses of tomorrow will be the Clubhouse hosts, Substack writers, Twitch streamers, Discord Community Managers, Shopify dropshippers, TikTok stars, etc.\n\n\n### Web3 technologies unlock infinite remixability and more granular distributions of value\n\n![](https://images.mirror-media.xyz/publication-images/90d89a70-f3e9-4d8f-96d2-6fe7c98ecdb8.jpg?height=1324&width=2184)\n\n\nTikTok is proof that ease of remixing drastically lowers the barrier to creativity. When everything becomes a base from which you can create new content, the creative affordances are infinite. Usually, the original creator’s work is stolen and the distributor wins. [Stories](https://www.teenvogue.com/story/jalaiah-harmon-renegade-creator-viral-dance) like the [creator of the Renegade dance](https://www.nytimes.com/2020/02/13/style/the-original-renegade.html) that took off when Charli D'Amelio did it getting “frustrated because they weren’t tagging me or giving me credit” wouldn’t exist if everyone “on-chain” saw the financial reward from the rise of a remix.\n\nEvery idea, every project, every piece of content is just a remix of ideas that came before it. In the past, it hasn’t been possible to track the provenance of these ideas or to compensate their originators when they are being used. But technology is on the cusp of enabling us to compensate people for all instances in which their work ends up being useful.\n\n**The true power of Web3 technologies is the potential to reshape how value is created, shared, and distributed on the Internet, making distributing value as easy as sending and receiving an email. That’s a fundamental technology unlock that makes it possible for creators on the internet to earn more of the value they create.**\n\nAn underexplored undercurrent of Web 2.0 monetization tools is that creators have been incentivized to publish *good enough* content frequently vs. *great content* sporadically.\n\nOn Substack, for example, you’re paid monthly, creating pressure to write consistently. The problem is not just the inevitable burnout that comes from having to churn out 1-2 posts a week. The problem is this heavily skews towards pumping out bland and mediocre half-baked thoughts you’ve had a day to work on, not evergreen content that will still be valuable in five years.\n\nBut what if your back-catalog wasn’t stagnant, but rather an ever-evolving source of passive income? What if the value of your work was driven by the number of references and citations, and more references meant more dollars? What if the ROI of an essay that took hundreds of hours to write was orders of magnitude higher than those designed for virality or disposability?\n\nWe’re particularly excited about a web that can route economic value to sources of inspiration, one that can lead to a revival of the back-catalog resulting in a renewed focus on quality over quantity,and one **where *win and help win*** is the guiding philosophy.\n\n![](https://images.mirror-media.xyz/publication-images/6a66ec04-ee51-4d22-ae10-ea029979fe4c.png?height=1626&width=2376)\n\n\n**NFTs give us a way to honor, in perpetuity, the people who’ve influenced our work.**\n\n### With that spirit in mind, this essay will be an experiment in **‘Attribution+’ -** where we not only attribute sources of inspiration but route economic value to them.\n\nIn practical terms, this means we are minting this essay as a NFT, and the proceeds of the NFT sale will be split between the authors AND the individuals that have influenced the **work.**\n\n\n### Thought Partners\n(acknowledgments: people whose work we referenced directly in the essay)\n\n[Li Jin](https://twitter.com/ljin18)\n[John Deighton](https://twitter.com/HBSmktg)\n[Leora Kornfeld](https://twitter.com/lk617?lang=en)]\n[Brandon Baraban](https://www.linkedin.com/in/brandonbaraban/)\n[Gabriel Nessim](https://twitter.com/wacko_gabriel)\n[Dror Poleg](https://twitter.com/drorpoleg)]\n[Patrick Rivera](https://twitter.com/patrickxrivera?lang=en)\n[Balaji](https://twitter.com/balajis)\n[Josh Nissenboim](http://joshnissenboim.com/)\n[Tanay Jaypuria](https://twitter.com/tanayj)\n[Caroline Nguyen\n](https://twitter.com/spacexponential?lang=en)\n\n### **How will the proceeds of the NFT be split?**\n\n- 55% of the proceeds will be split between the authors, Sari and Jad\n- 30% of the proceeds will go to the pool of thought partners we reference above, whose ideas and feedback were instrumental in shaping our own.\n- 5% will go towards [Josh Nissenboim](http://joshnissenboim.com/), the man behind the graphics.\n- 10% will go to readers (like you) who help us spread the word about the essay.\n\n[Thought Partners](split://0x2b1138A1294fC56269ec66A2F17a6d1575473844?network=mainnet)\n\n\n### **What are the benefits of owning this NFT?**\n\n- Be a proud owner of an experiment that honors the original ideals of the Internet - users and creators, unconstrained by intermediaries, sharing ideas and economic upside\n- A powerful signal to the world that you support the “win and help win” worldview, and are, unabashedly, an **Internet optimist.**\n- The prospect of turning a profit by reselling the NFT down the line (Patronage+)\n- Own the underlying illustrations we created for the essay.\n- We’ll also send you physical prints of the four illustrations (one of a kind because this is the only time we’ll ever print or sell them) which, TBH, we’d hang in our powder rooms - they’re great dinner conversation starters for the intellectually inclined.\n- A 1hr Zoom call with Sari and Jad to dive deeper into the thesis (for anyone who bids over 0.1ETH is invited to participate)\n- A lifetime [Startupy](https://startupy.world/) membership and early access to [koodos](http://koodos.com/) (for anyone who bids over 0.5ETH)\n\n[Token #3075](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3075)", "timestamp": 1620487900, "digest": "etHY_neWXosxDJpGOhzuwi-cB0qOvMco_iwO5yJ1Ai0", "contributor": "0xF9875C1544f2C9AeACEc50feD687D984dDAa9D00", "nft": "{\"nftTransactionHash\": \"0x952422b30153269a7a48094aa506b9cd62faf011cd99355a2c2f1468a7c7e84d\"}"}
{"id": "rPNukMXIWOhb0LGm-olcSicEfSerkirrjgbXQKYLNEM", "title": "The Ideas We Lose: Funding Scientific Citations through an NFT SplitStream", "body": "\n## Introduction: How the first great finding in empirical science was lost for decades\n\nBelieve it or not, humanity is completely capable of ignoring a $1,000,000,000,000 bill sitting in plain sight. It happened in 1747, when James Lind ran a controlled scientific study — maybe the first ever — and discovered that citrus fruits cured scurvy. \n\nIn Lind’s day, scurvy killed more British sailors than \"shipwreck, storms, all other diseases, **and enemy action combined**”. Which is to say that Lind's cure was not just going to save countless lives; it was an incomparably powerful *military technology*. The stakes couldn't have been higher. And yet, despite having been proven with the most advanced scientific methods the world had ever seen, **it was promptly lost** for many decades after. \n\n![](https://images.mirror-media.xyz/publication-images/336e837a-bf15-493c-a3fd-c6703670af85.jpeg?height=512&width=1254)\n\nAccording to British Historian [C.C. Lloyd](https://www.mv.helsinki.fi/home/hemila/history/Lloyd_1963.pdf), the British might have “lost the American War of Independence thirty years [after Lind’s study] because his cure was not adopted”. If Lloyd’s suggestion is correct, the discounted net assets of America is what gives you a roughly $1,000,000,000,000 bill that the British may have just left lying on the ground.\n\nWe will return to why and how this happened later. But for now let’s just observe that **the incentives for the production and dissemination of scientific truths are often really, really poor.** And so, as a result, humanity can lose even the most consequential truth. \n\n## Enter NFTs\n\nThe idea that NFTs could help rescue enormous scientific truths from obscurity might strike you as a little fanciful. You might even think... \"aren't NFTs just some hyped-up blockchain art thing? Why should they help science funding at all?\" So to start with let's take the simplest argument, and here we'll just quote it from our [2018 essay on NFTs for Science](https://glyphx.medium.com/post-venture-capital-and-the-crypto-nobel-prize-29847faf3f08):\n\n> Historically, great knowledge is valued like great art. Bill Gates paid $40 million for Leonardo Da Vinci’s Codex Leicester. Einstein’s manuscripts sell for millions. And a single page of Darwin’s writing fetches hundreds of thousands of dollars[...] People buy Darwin’s original pages because they are connected to his idea — the fact that information from The Origin of Species is freely available is not a bug for its high value; it’s a feature. Today’s Darwin would type The Origin of the Species in a Google Doc or a versioned LaTeX file... But now with Planck, and the digital scarcity blockchain enables, she would create a unique Glyph [NFT] that serves as that first manuscript copy.\n\nThis \"science as art\" argument received some validation last month when we sold the first scientific result NFT (for $24,000). But we believe that this is just the beginning, and have been testing ways in which funds and proceeds from NFTs can be channeled to improve science funding more broadly. The aim, ultimately, is to enable progress and to try to help save some of the consequential ideas we might otherwise lose.\n\nWithin this essay we are auctioning off an NFT as a small  test of the SplitStream, and incentive design for funding science through citations. To explain, let us first outline the project this NFT is a part of. Last month, after designing and crowdsourcing the first ever randomized control test of a long-untested theory, Planck sold the result as [the aforementioned first science NFT](https://twitter.com/stephensonhmatt/status/1377316537950932992). These funds will help us run a replication of the study we ran. Here is something nice that a very smart person said about the project:\n\n![](https://images.mirror-media.xyz/publication-images/3a5983a6-915e-4fa7-997c-3a8a8c47a3db.jpeg?height=742&width=1178)\n\nBecause we are interested in incentives for consequential ideas that it seemed possible we might lose, we looked for a promising candidate for the test. The most promising candidate we found was the late Berkeley Professor Seth Roberts' appetite theory.\n\n## Testing Seth Roberts' Appetite Theory\n\nIn 2004, Berkeley Professor Seth Roberts discovered that consuming flavorless calories reduced his appetite. Consuming flavorless or unfamiliar calories made his eating habits more consciously controllable and helped him lose weight. And beyond weight loss, such a tool for conscious eating seemed to have the potential to help people eat more nutritious food, more easily go vegan, etc. Though preliminary, it was an enormous discovery.\n\nSeth was a serious empirical scientist and the [evidence he published for his theory was intriguing, if unorthodox](https://escholarship.org/uc/item/2xc2h866). But some very credible sources recognized the merit of his work and he was featured positively in the [NYTimes](https://www.nytimes.com/2005/09/11/magazine/does-the-truth-lie-within.html). His book became a bestseller. \n\nGlowing anecdotes appeared, including [a notable one from Reddit co-founder Aaron Swartz](https://5shz4jubhf5ju22lobejiotjv36et7td242q7nz6tx3puyuilcba.arweave.net/7I-eJoE5epprS3BIlDpprvxJ_mPXNQ-3Pp32-mKIWII). In that essay, Swartz confidently alludes to the \"clinical trials\" that would surely be carried out on Seth's Theory. **His essential optimism, his confidence that the world would obviously figure out a way to run a clinical test on something so promising, is striking**. \n\nBut the lab studies never came.\n\nWithin 5 years of its publication Seth’s idea had become little-discussed, never having undergone a single clinical trial. Some important outlets like [Marginal Revolution](https://zt3lipqi5yc4exoyclfunv7v2ws7hdmfmx6aeczs4hi2fzsgpaja.arweave.net/zPa0PgjuBcJd2BLLRtf11aXzjYVl_AILMuHRouZGeBI) [LessWrong](https://44zxnconwtyyk4ulw3bmvfq5fl5eeeyjft5yltiq3fdrsrt7kxqa.arweave.net/5zN2ic208YVyi7bCypYdKvpCEwks-4XNENlHGUZ_VeA), and [StatModeling](https://sbwt4p5ujwzqpk3543m24cn7wgrgrpmzvhcmg4u6fmpnkf55v2nq.arweave.net/kG0-P7RNswerfebZrgm_saJovZmpxMNynise1Re9rps) kept the flame alive, but the discussion of Seth's theory all but vanishes:\n\n![Google Searches for Seth Roberts' Theory over time](https://images.mirror-media.xyz/publication-images/27863775-b21c-4641-a1c3-dd9a6ad63131.jpeg?height=664&width=2284)\n\nBy 2017, a few years after Seth had passed away, Neurobiologist Stephan Guyenet wrote that he expected to remain forever “puzzled” by Seth’s theory because “some sort of research” on it was “unlikely to ever happen.” Stephan’s answer reads more than a bit tragic; obesity kills [millions each year](https://www.who.int/news-room/facts-in-pictures/detail/6-facts-on-obesity), interest in using conscious eating to help improve the world, as in vegetarianism, is skyrocketing. Failing to follow up on a promising theory in such a world feels a bit like an echo of our tragic failure to follow up on James Lind's scurvy cure. \n\n## Why Do We Lose Ideas?\n\n> \"Show me the incentive and I'll show you the result.\" - Charlie Munger\n\nJames Lind's scurvy cure [didn't mesh well with the science of 1747](https://us.macmillan.com/books/9780312313920). Science was then 150 years away from discovering vitamins and so, naturally, it would have been hard to understand how it was the vitamin C in citrus that was the cure. The top minds of the day, viewing Lind's results, quickly came to believe that the acid in the juice must be melting some big black scurvy blob that sailors got in their stomachs. \"Great!\" they said, \"let's boil the juice to make it more acidic and work even better!\"\n\nUnfortunately, as we now understand, boiling the juice just destroys the Vitamin C content. Which means the boiled \"cure\" was no cure at all. Now there is nothing wrong about this; it's just good old normal science seeking understanding and trying out hypotheses. And 150 years later this did give us understanding, and that understanding was bigger than a simple cure for scurvy. The problem is that **somehow for the intervening 150 years everyone didn't just go back to using the limes that were proven to work**. \n\nIf Seth’s Theory proves out I think the story will be much the same as Lind's. Theories, like those of Seth Roberts and James Lind, which happen to integrate poorly with existing science of their day are bound to suffer. By failing to integrate into science they lose out on what is surely humanity's best protocol for rewarding, preserving, and developing openly shared knowledge. Patents might offer an alternative, but Seth's and Lind's theories were also hopelessly unpatentable. Citrus fruits are freely available and \"flavorless calories\" are easier to come by still; like a good scientist, Seth even set about demonstrating that a person could just [hold their nose](https://www.huffpost.com/entry/shangrila-diet-phenomenol_b_58958) as they ate and get the desired effect. Good luck writing that patent. \n\n## Demonstrating How NFTs can Help Fund Unpatentable Science\n\nWhen we first wrote about using NFTs as a unique way to fund science, Seth's was one of the major motivating cases. Here's how the simplest mechanism was intended to help fund such research:\n\n1. NFTs of high-potential scientific work are sold\n2. These NFTs, like a collectible, could grow in stature and value as the scientific work was validated\n3. Prospective NFT sales of early scientific results could thereby profitably fund the validation of that research\n\nAs mentioned earlier, our current project is bearing this out: Planck crowdsourced the first ever randomized control trial of Seth Roberts' appetite theory, sold an NFT of the result, and are now using the proceeds to run an independent lab replication of the findings. \n\nIt's important to keep in mind the bigger picture here though. We hope Seth's theory is true (who wouldn't?), but our fundamental concern regards the incentives themselves. To become a full-fledged scientific truth a theory needs to be exposed to falsification. So it's worth remembering that, while our preliminary results on Seth's Theory are promising, every step along the journey is important, as are the incentives to take those steps.\n\nIn this essay, we are introducing a novel incentive structure for scientific funding that uses citations as a channel for funding. We were calling this a \"CitationStream\" but piggybacking on [Jon-Kyle's terminology in his excellent essay](https://jk.mirror.xyz/3iLll7F39DjeVlJo4XNlfunl-C0xD3l2X8sjIJoB9vc), we are going to call it a “SplitStream”. The SplitStream is a system in which portions of an NFT sale may flow to some or all of the works the NFT cites, with those cited works then sending some of their funds further along to the works they cite, and so on. \n\n## The SplitStream\n\nYou might know the quote “If I have seen further, it is from standing on the shoulders of giants”. You might also know that it’s from Isaac Newton, a giant if there ever was one. So **in science, giants tend to look down and see other giants**. Citations, when they work, map those dependencies backwards through time. \n\nCitations on citations. \n\nGiants all the way down.\n\nIf you send funds through these citations, you get a cascade. A stream of splits. A SplitStream. \n\nHere’s what it looks like:\n\n![](https://images.mirror-media.xyz/publication-images/9dfd5cba-c828-461c-b0d5-2be765a465bb.jpeg?height=684&width=592)\n\nWe ran a test of this with an NFT of an independent data analysis of Seth’s Appetite Theory, selling for $4,200. We suspect this was the first ever funding of an independent data analysis! As a part of this independent analysis we were able to demo a powerful cryptographic technology from [Aleo](https://www.aleo.org/) which we believe will be very useful to further open science. We used a Zero-knowledge Proof in Leo to enable independent statisticians to effectively \"query\" our dataset and see certain results without revealing the data itself. \n\nIndependent Analysis is a really valuable thing, and it is a [cutting edge Open Science best practice](https://journals.sagepub.com/doi/10.1177/2515245917747646). The analysis was conducted by two esteemed professors of statistics, Harry Crane and Ryan Martin, and thus the NFT was theirs with proceeds directed according to them. We requested that they keep 50% of the NFT sale but they agreed to test the SplitStream and, for the purposes of this incentive test, their analysis “cites” two NFTs:\n\nThe NFT of the Open Science Test of Seth’s Appetite Theory (currently owned by [Molecule](https://opensea.io/accounts/Molecule_to))\nThe NFT of the Splitstream Protocol (owned by Planck) \n\nPlanck then split our proceeds further to what we are citing:\n1. Mirror because we are using their amazing platform and tech. \n2. [This Artwork is Always on Sale](https://thisartworkisalwaysonsale.com/), suggested by Simon De La Rouvier as the proper target for the citation of his shared idea of Harberger taxes for NFT ownership (which is an important aspect of our protocol.)\n\nWe encourage the recipients of these proceeds, if they are at all substantial, to split back to those they would cite. Let's also note that this is a simple test of the mechanism and certainly does not represent the full range of actual citations we would use. Here is the NFT, an elegant violin plot of the results from the study we ran:\n\n[Token #2837](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=2837)\n\n## Design Challenges for the SplitStream\n\nAs a trained academic, I could hardly discuss a mechanism like the SplitStream without noting some potential pitfalls. Properly done, this has great potential to reward an effective division of labor in for open science and more. But it does not create obligations, or promises, or contracts, or anything like that. Participants are playing, roughly speaking, [a live trust game](https://www.youtube.com/watch?v=6PO3MTV0ZeA).\n\nAnd in fact, these incentives cannot become too enshrined and formal because citations are a fragile system. **A person’s inspiration is purely their private knowledge and thus it *must* be shared voluntarily.** A system which can't elicit honest attributions will fail.\n\nFor example, you could imagine that many people might appreciate being credited as the essential inspiration for a new Nobel-prize winning discovery in physics. Someone with sufficient resources, some prestige-hungry Jeff Bezos, might even be willing to pay for that honor. And then, of course, there’s nothing to stop our Nobel-winning physicist from claiming that her passing conversation with the dear leader Bezos was the fundamental inspiration for everything. Who could say otherwise? This sort of thing is absolutely going to happen sometimes, just as it sometimes happens in academia. \n\nI’m going to call these types of behaviors “Mao effects”: the seeking of favor from those with status or power by over-attributing to them. Mao of course was named the “great helmsman”, the “great leader”, etc. and anything good that happened was often attributed to him. **A network overtaken by these Mao effects breaks down, a Ponzi-scheme for those who claim complete originality.**\n\nIn an evolutionary simulation it roughly looks like this:\n\n![](https://images.mirror-media.xyz/publication-images/3ba8b293-998f-4069-8c0c-d95e7ea9d006.jpeg?height=850&width=1100)\n\nThese effects can get more subtle as well. I can’t do much more here than sort of gesture at this and signal that I take these ideas seriously (e.g. [I actually coauthored a Behavioral Economics literature review called “When Do Monetary Incentives Backfire”](https://vr24zefnxcqg7hctadpx7dzmv3zq64oqodfcaiv2zwskewovtlna.arweave.net/rHXMkK24oG-cUwDff48srvMPcdBwyiAius2kolnVmto)). But a simple step toward preventing Mao Effects is observing the following two rules:\n\n1. Favor citing things which are publicly shared.\n2. Favor citing things which also cite. \n\nThe first condition helps provide a level of transparency and sense-making to the system. So, for instance, you can understand why I cite Mirror because you can clearly see that I'm using their tech. The second condition helps ensure that cited works offer further attribution to the work they've built on. Together these rules help ensure that a would-be Mao openly shares their knowledge while also citing that which contributed to it.\n\n## The Big Picture: Seeking the \"civil society patch\" for Internet Technology\n\nIn the preceding sections, we’ve discussed the ways in which Web3 might enable the sharing and preservation of ideas. It only seems fitting to close this discussion with a small, highly speculative idea of our own. \n\nThe First Industrial Revolution (“IR 1”) is the famous one, occurring a little before the year 1800. It connected people with railroads and steamships and yet, despite its fame, it brought almost no growth:\n\n![](https://images.mirror-media.xyz/publication-images/4b4f3c30-d00a-45f7-96fa-8d3429446746.jpeg?height=335&width=600)\n\nInstead, it took many decades until anyone saw the “big bang” wave of growth that we learned about in grade school, the one that ushered in the modern world. \n\n**This big bang growth actually appeared alongside a second wave of major inventions, quite distinct from the inventions of IR 1.** Whereas IR 1 brought us together with connecting inventions like the steam engine, the second wave had the great livability innovations in areas like heating, sanitation, electric lights, elevators, motion pictures, etc.\n\nThe IR 1 world was a newly connected one, but it was also polluted and dangerous and kind of miserable. And we didn’t actually produce much growth all huddled together, drinking dirty water and breathing fumes. But then, once we figured out how to make this newly connected world more livable and pleasant, things got vastly better. Only then did we get the growth explosion that the Industrial Revolution is famous for.\n\nIn this light then, rather than seeing the second wave of inventions as an IR 2, we might see them as the civil society patch: IR 1.1. Before the patch it just wasn't that pleasant to all live together but after the patch, suddenly, it wasn't so bad. \n\nWhat if the same thing is true now? You can read [top economists today pondering over the stagnant growth and missing productivity of the internet era](https://press.princeton.edu/books/hardcover/9780691147727/the-rise-and-fall-of-american-growth) dating back to the 1970s. But so too might an economist during IR 1.0 have puzzled over the missing productivity that the steam engine should have wrought. What if today’s economists are wrong for the same reasons — what if the internet is indeed revolutionary and we just haven't gotten the 2.1 patch?\n\nThe internet brought our minds together in a great network to rival the 19th century network of railways and steamships. If this 1800s network could take you to undeniably thrilling — but also crowded and disgusting — cities, perhaps the internet too feels a bit like this now. It's thrilling but awful, alluring but somehow inhumane. And so some optimism is available in the story of the 19th century, and the fact that *its* network showed a lot of promise but failed to deliver for a very long time until, suddenly, it did.\n\nLet’s dare to hope that an even greater change awaits us once we figure out how to live and think together online. Structuring, rewarding, and preserving promising ideas seems like a step in the right direction. \n\nTwitter @stephensonhmatt\np1anck.com", "timestamp": 1620494159, "digest": "vKZToDiv68BGnKx6HjUqYHKnJOI5IpU95dbrETU5Seg", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6", "nft": "{\"nftTransactionHash\": \"0xa7d518b7a12a005c4941a88709349ace127f2e37efa3467a7ddef9b7ffa6a852\"}"}
{"id": "qEq0n7FC3OGzzado8oFZuT-Dv78KS20wEu2Xb_jG61I", "title": "The Ideas We Lose: Funding Scientific Citations through an NFT SplitStream", "body": "\n## Introduction: How the First Great Finding in Empirical Science Was Lost for Decades\n\nBelieve it or not, humanity is completely capable of ignoring a $1,000,000,000,000 bill sitting in plain sight. It happened in 1747, when James Lind ran a controlled scientific study — maybe the first ever — and discovered that citrus fruits cured scurvy. \n\nIn Lind’s day, scurvy killed more British sailors than **\"shipwreck, storms, all other diseases, and enemy action combined”**. Which is to say that Lind's cure was not just going to save countless lives; it was an incomparably powerful *military technology*. The stakes couldn't have been higher. And yet, despite having been proven with the most advanced scientific methods the world had ever seen, **it was promptly lost** for many decades after. \n\n![](https://images.mirror-media.xyz/publication-images/336e837a-bf15-493c-a3fd-c6703670af85.jpeg?height=512&width=1254)\n\nAccording to British Historian [C.C. Lloyd](https://www.mv.helsinki.fi/home/hemila/history/Lloyd_1963.pdf), the British might have “lost the American War of Independence thirty years [after Lind’s study] because his cure was not adopted”. If Lloyd’s suggestion is correct, the discounted net assets of America is what gives you a roughly $1,000,000,000,000 bill that the British may have just left lying on the ground.\n\nWe will return to why and how this happened later. But for now let’s just observe that **the incentives for the production and dissemination of scientific truths are often really, really poor.** And so, as a result, humanity can lose even the most consequential truth. \n\n## Enter NFTs\n\nThe idea that NFTs could help rescue enormous scientific truths from obscurity might strike you as a little fanciful. You might even think... \"aren't NFTs just some hyped-up blockchain art thing? Why should they help science funding at all?\" So to start with let's take the simplest argument, and here we'll just quote it from our [2018 essay on NFTs for Science](https://glyphx.medium.com/post-venture-capital-and-the-crypto-nobel-prize-29847faf3f08):\n\n> Historically, great knowledge is valued like great art. Bill Gates paid $40 million for Leonardo Da Vinci’s Codex Leicester. Einstein’s manuscripts sell for millions. And a single page of Darwin’s writing fetches hundreds of thousands of dollars[...] People buy Darwin’s original pages because they are connected to his idea — the fact that information from The Origin of Species is freely available is not a bug for its high value; it’s a feature. Today’s Darwin would type The Origin of the Species in a Google Doc or a versioned LaTeX file... But now with Planck, and the digital scarcity blockchain enables, she would create a unique Glyph [NFT] that serves as that first manuscript copy.\n\nThis \"science as art\" argument received some validation last month when we sold the first scientific result NFT (for $24,000). But we believe that this is just the beginning, and have been testing ways in which funds and proceeds from NFTs can be channeled to improve science funding more broadly. The aim, ultimately, is to enable progress and to try to help save some of the consequential ideas we might otherwise lose.\n\nWithin this essay we are auctioning off an NFT as a small  test of the SplitStream, and incentive design for funding science through citations. To explain, let us first outline the project this NFT is a part of. Last month, after designing and crowdsourcing the first ever randomized control test of a long-untested theory, Planck sold the result as [the aforementioned first science NFT](https://twitter.com/stephensonhmatt/status/1377316537950932992). These funds will help us run a replication of the study we ran. Here is something nice that a very smart person said about the project:\n\n![](https://images.mirror-media.xyz/publication-images/3a5983a6-915e-4fa7-997c-3a8a8c47a3db.jpeg?height=742&width=1178)\n\nBecause we are interested in incentives for consequential ideas that it seemed possible we might lose, we looked for a promising candidate for the test. The most promising candidate we found was the late Berkeley Professor Seth Roberts' appetite theory.\n\n## Testing Seth Roberts' Appetite Theory\n\nIn 2004, Berkeley Professor Seth Roberts discovered that consuming flavorless calories reduced his appetite. Consuming flavorless or unfamiliar calories made his eating habits more consciously controllable and helped him lose weight. And beyond weight loss, such a tool for conscious eating seemed to have the potential to help people eat more nutritious food, more easily go vegan, etc. Though preliminary, it was an enormous discovery.\n\nSeth was a serious empirical scientist and the [evidence he published for his theory was intriguing, if unorthodox](https://escholarship.org/uc/item/2xc2h866). But some very credible sources recognized the merit of his work and he was featured positively in the [NYTimes](https://www.nytimes.com/2005/09/11/magazine/does-the-truth-lie-within.html). His book became a bestseller. \n\nGlowing anecdotes appeared, including [a notable one from Reddit co-founder Aaron Swartz](https://5shz4jubhf5ju22lobejiotjv36et7td242q7nz6tx3puyuilcba.arweave.net/7I-eJoE5epprS3BIlDpprvxJ_mPXNQ-3Pp32-mKIWII). In that essay, Swartz confidently alludes to the \"clinical trials\" that would surely be carried out on Seth's Theory. **His essential optimism, his confidence that the world would obviously figure out a way to run a clinical test on something so promising, is striking**. \n\nBut the lab studies never came.\n\nWithin 5 years of its publication Seth’s idea had become little-discussed, never having undergone a single clinical trial. Some important outlets like [Marginal Revolution](https://zt3lipqi5yc4exoyclfunv7v2ws7hdmfmx6aeczs4hi2fzsgpaja.arweave.net/zPa0PgjuBcJd2BLLRtf11aXzjYVl_AILMuHRouZGeBI) [LessWrong](https://44zxnconwtyyk4ulw3bmvfq5fl5eeeyjft5yltiq3fdrsrt7kxqa.arweave.net/5zN2ic208YVyi7bCypYdKvpCEwks-4XNENlHGUZ_VeA), and [StatModeling](https://sbwt4p5ujwzqpk3543m24cn7wgrgrpmzvhcmg4u6fmpnkf55v2nq.arweave.net/kG0-P7RNswerfebZrgm_saJovZmpxMNynise1Re9rps) kept the flame alive, but the discussion of Seth's theory all but vanishes:\n\n![Google Searches for Seth Roberts' Theory over time](https://images.mirror-media.xyz/publication-images/27863775-b21c-4641-a1c3-dd9a6ad63131.jpeg?height=664&width=2284)\n\nBy 2017, a few years after Seth had passed away, Neurobiologist Stephan Guyenet wrote that he expected to remain forever “puzzled” by Seth’s theory because “some sort of research” on it was “unlikely to ever happen.” Stephan’s answer reads more than a bit tragic; obesity kills [millions each year](https://www.who.int/news-room/facts-in-pictures/detail/6-facts-on-obesity), interest in using conscious eating to help improve the world, as in vegetarianism, is skyrocketing. Failing to follow up on a promising theory in such a world feels a bit like an echo of our tragic failure to follow up on James Lind's scurvy cure. \n\n## Why Do We Lose Ideas?\n\n> \"Show me the incentive and I'll show you the result.\" - Charlie Munger\n\nJames Lind's scurvy cure [didn't mesh well with the science of 1747](https://us.macmillan.com/books/9780312313920). Science was then 150 years away from discovering vitamins and so, naturally, it would have been hard to understand how it was the vitamin C in citrus that was the cure. The top minds of the day, viewing Lind's results, quickly came to believe that the acid in the juice must be melting some big black scurvy blob that sailors got in their stomachs. \"Great!\" they said, \"let's boil the juice to make it more acidic and work even better!\"\n\nUnfortunately, as we now understand, boiling the juice just destroys the Vitamin C content. Which means the boiled \"cure\" was no cure at all. Now there is nothing wrong about this; it's just good old normal science seeking understanding and trying out hypotheses. And 150 years later this did give us understanding, and that understanding was bigger than a simple cure for scurvy. The problem is that **somehow for the intervening 150 years everyone didn't just go back to using the limes that were proven to work**. \n\nIf Seth’s Theory proves out I think the story will be much the same as Lind's. Theories, like those of Seth Roberts and James Lind, which happen to integrate poorly with existing science of their day are bound to suffer. By failing to integrate into science they lose out on what is surely humanity's best protocol for rewarding, preserving, and developing openly shared knowledge. Patents might offer an alternative, but Seth's and Lind's theories were also hopelessly unpatentable. Citrus fruits are freely available and \"flavorless calories\" are easier to come by still; like a good scientist, Seth even set about demonstrating that a person could just [hold their nose](https://www.huffpost.com/entry/shangrila-diet-phenomenol_b_58958) as they ate and get the desired effect. Good luck writing that patent. \n\n## Demonstrating How NFTs can Help Fund Unpatentable Science\n\nWhen we first wrote about using NFTs as a unique way to fund science, Seth's was one of the major motivating cases. Here's how the simplest mechanism was intended to help fund such research:\n\n1. NFTs of high-potential scientific work are sold\n2. These NFTs, like a collectible, could grow in stature and value as the scientific work was validated\n3. Prospective NFT sales of early scientific results could thereby profitably fund the validation of that research\n\nAs mentioned earlier, our current project is bearing this out: Planck crowdsourced the first ever randomized control trial of Seth Roberts' appetite theory, sold an NFT of the result, and are now using the proceeds to run an independent lab replication of the findings. \n\nIt's important to keep in mind the bigger picture here though. We hope Seth's theory is true (who wouldn't?), but our fundamental concern regards the incentives themselves. To become a full-fledged scientific truth a theory needs to be exposed to falsification. So it's worth remembering that, while our preliminary results on Seth's Theory are promising, every step along the journey is important, as are the incentives to take those steps.\n\nIn this essay, we are introducing a novel incentive structure for scientific funding that uses citations as a channel for funding. We were calling this a \"CitationStream\" but piggybacking on [Jon-Kyle's terminology in his excellent essay](https://jk.mirror.xyz/3iLll7F39DjeVlJo4XNlfunl-C0xD3l2X8sjIJoB9vc), we are going to call it a “SplitStream”. The SplitStream is a system in which portions of an NFT sale may flow to some or all of the works the NFT cites, with those cited works then sending some of their funds further along to the works they cite, and so on. \n\n## The SplitStream\n\nYou might know the quote “If I have seen further, it is from standing on the shoulders of giants”. You might also know that it’s from Isaac Newton, a giant if there ever was one. So **in science, giants tend to look down and see other giants**. Citations, when they work, map those dependencies backwards through time. \n\nCitations on citations. \n\nGiants all the way down.\n\nIf you send funds through these citations, you get a cascade. A stream of splits. A SplitStream. \n\nHere’s what it looks like:\n\n![](https://images.mirror-media.xyz/publication-images/9dfd5cba-c828-461c-b0d5-2be765a465bb.jpeg?height=684&width=592)\n\nWe ran a test of this with an NFT of an independent data analysis of Seth’s Appetite Theory, selling for $4,200. We suspect this was the first ever funding of an independent data analysis! As a part of this independent analysis we were able to demo a powerful cryptographic technology from [Aleo](https://www.aleo.org/) which we believe will be very useful to further open science. We used a Zero-knowledge Proof in Leo to enable independent statisticians to effectively \"query\" our dataset and see certain results without revealing the data itself. \n\nIndependent Analysis is a really valuable thing, and it is a [cutting edge Open Science best practice](https://journals.sagepub.com/doi/10.1177/2515245917747646). The analysis was conducted by two esteemed professors of statistics, Harry Crane and Ryan Martin, and thus the NFT was theirs with proceeds directed according to them. We requested that they keep 50% of the NFT sale but they agreed to test the SplitStream and, for the purposes of this incentive test, their analysis “cites” two NFTs:\n\nThe NFT of the Open Science Test of Seth’s Appetite Theory (currently owned by [Molecule](https://opensea.io/accounts/Molecule_to))\nThe NFT of the Splitstream Protocol (owned by Planck) \n\nPlanck then split our proceeds further to what we are citing:\n1. Mirror because we are using their amazing platform and tech. \n2. [This Artwork is Always on Sale](https://thisartworkisalwaysonsale.com/), suggested by Simon De La Rouvier as the proper target for the citation of his shared idea of Harberger taxes for NFT ownership (which is an important aspect of our protocol.)\n\nWe encourage the recipients of these proceeds, if they are at all substantial, to split back to those they would cite. Let's also note that this is a simple test of the mechanism and certainly does not represent the full range of actual citations we would use. Here is the NFT, an elegant violin plot of the results from the study we ran:\n\n[Token #2837](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=2837)\n\n## Design Challenges for the SplitStream\n\nAs a trained academic, I could hardly discuss a mechanism like the SplitStream without noting some potential pitfalls. Properly done, this has great potential to reward an effective division of labor in for open science and more. But it does not create obligations, or promises, or contracts, or anything like that. Participants are playing, roughly speaking, [a live trust game](https://www.youtube.com/watch?v=6PO3MTV0ZeA).\n\nAnd in fact, these incentives cannot become too enshrined and formal because citations are a fragile system. **A person’s inspiration is purely their private knowledge and thus it *must* be shared voluntarily.** A system which can't elicit honest attributions will fail.\n\nFor example, you could imagine that many people might appreciate being credited as the essential inspiration for a new Nobel-prize winning discovery in physics. Someone with sufficient resources, some prestige-hungry Jeff Bezos, might even be willing to pay for that honor. And then, of course, there’s nothing to stop our Nobel-winning physicist from claiming that her passing conversation with the dear leader Bezos was the fundamental inspiration for everything. Who could say otherwise? This sort of thing is absolutely going to happen sometimes, just as it sometimes happens in academia. \n\nI’m going to call these types of behaviors “Mao effects”: the seeking of favor from those with status or power by over-attributing to them. Mao of course was named the “great helmsman”, the “great leader”, etc. and anything good that happened was often attributed to him. **A network overtaken by these Mao effects breaks down, a Ponzi-scheme for those who claim complete originality.**\n\nIn an evolutionary simulation it roughly looks like this:\n\n![](https://images.mirror-media.xyz/publication-images/3ba8b293-998f-4069-8c0c-d95e7ea9d006.jpeg?height=850&width=1100)\n\nThese effects can get more subtle as well. I can’t do much more here than sort of gesture at this and signal that I take these ideas seriously (e.g. [I actually coauthored a Behavioral Economics literature review called “When Do Monetary Incentives Backfire”](https://vr24zefnxcqg7hctadpx7dzmv3zq64oqodfcaiv2zwskewovtlna.arweave.net/rHXMkK24oG-cUwDff48srvMPcdBwyiAius2kolnVmto)). But a simple step toward preventing Mao Effects is observing the following two rules:\n\n1. Favor citing things which are publicly shared.\n2. Favor citing things which also cite. \n\nThe first condition helps provide a level of transparency and sense-making to the system. So, for instance, you can understand why I cite Mirror because you can clearly see that I'm using their tech. The second condition helps ensure that cited works offer further attribution to the work they've built on. Together these rules help ensure that a would-be Mao openly shares their knowledge while also citing that which contributed to it.\n\n## The Big Picture: Seeking the \"civil society patch\" for Internet Technology\n\nIn the preceding sections, we’ve discussed the ways in which Web3 might enable the sharing and preservation of ideas. It only seems fitting to close this discussion with a small, highly speculative idea of our own. \n\nThe First Industrial Revolution (“IR 1”) is the famous one, occurring a little before the year 1800. It connected people with railroads and steamships and yet, despite its fame, it brought almost no growth:\n\n![](https://images.mirror-media.xyz/publication-images/4b4f3c30-d00a-45f7-96fa-8d3429446746.jpeg?height=335&width=600)\n\nInstead, it took many decades until anyone saw the “big bang” wave of growth that we learned about in grade school, the one that ushered in the modern world. \n\n**This big bang growth actually appeared alongside a second wave of major inventions, quite distinct from the inventions of IR 1.** Whereas IR 1 brought us together with connecting inventions like the steam engine, the second wave had the great livability innovations in areas like heating, sanitation, electric lights, elevators, motion pictures, etc.\n\nThe IR 1 world was a newly connected one, but it was also polluted and dangerous and kind of miserable. And we didn’t actually produce much growth all huddled together, drinking dirty water and breathing fumes. But then, once we figured out how to make this newly connected world more livable and pleasant, things got vastly better. Only then did we get the growth explosion that the Industrial Revolution is famous for.\n\nIn this light then, rather than seeing the second wave of inventions as an IR 2, we might see them as the civil society patch: IR 1.1. Before the patch it just wasn't that pleasant to all live together but after the patch, suddenly, it wasn't so bad. \n\nWhat if the same thing is true now? You can read [top economists today pondering over the stagnant growth and missing productivity of the internet era](https://press.princeton.edu/books/hardcover/9780691147727/the-rise-and-fall-of-american-growth) dating back to the 1970s. But so too might an economist during IR 1.0 have puzzled over the missing productivity that the steam engine should have wrought. What if today’s economists are wrong for the same reasons — what if the internet is indeed revolutionary and we just haven't gotten the 2.1 patch?\n\nThe internet brought our minds together in a great network to rival the 19th century network of railways and steamships. If this 1800s network could take you to undeniably thrilling — but also crowded and disgusting — cities, perhaps the internet too feels a bit like this now. It's thrilling but awful, alluring but somehow inhumane. And so some optimism is available in the story of the 19th century, and the fact that *its* network showed a lot of promise but failed to deliver for a very long time until, suddenly, it did.\n\nLet’s dare to hope that an even greater change awaits us once we figure out how to live and think together online. Structuring, rewarding, and preserving promising ideas seems like a step in the right direction. \n\nTwitter @stephensonhmatt\np1anck.com", "timestamp": 1620494297, "digest": "vKZToDiv68BGnKx6HjUqYHKnJOI5IpU95dbrETU5Seg", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6", "nft": "{\"nftTransactionHash\": \"0xa7d518b7a12a005c4941a88709349ace127f2e37efa3467a7ddef9b7ffa6a852\"}"}
{"id": "ll-3fLUyH6vuOBeg7GWg-MSpSK-HhRDJyXPez9xCcHU", "title": "From Winner Take All to Win and Help Win: the Original Vision of the Internet is Making a Comeback", "body": "A collaboration between [Sari Azout](https://twitter.com/sariazout) and [Jad Esber](https://twitter.com/jad_ae)\n\n**This is a *VERY* special essay. Read through the end to find out why.**\n\n[Token #3075](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3075)\n\n\n![](https://images.mirror-media.xyz/publication-images/82237053-7e22-484b-a906-4eb1bd7c8417.png?height=1626&width=2376)\n\n\n[1](about:blank#fn1)\n\nFrom the internet’s beginnings, we were promised that it would be the great equalizer. Analysts and tech prophets of the early 2000s wrote think pieces about how tech would transform the power dynamics of modern life and erode the hierarchies of society.\n\nBut the bright-eyed optimism of the early 2000s has been almost universally replaced by a techno-dread, a feeling that technology is creating more problems than it’s solving.\n\nToday's digital spaces, rather than democratizing wealth and access, amplify the inequities of the physical world.\n\n[One study](https://www.washingtonpost.com/news/the-switch/wp/2018/03/02/why-almost-no-one-is-making-a-living-on-youtube/) found that making it to the top 3.5% of YouTube channels—which means about 1 million views each month—only gets you $12,000 to $16,000 a year, right around the federal poverty line.\n\nFor all the talk about the democratization of the creator economy, thus far, it’s become a superstar-driven, winner-take-all affair, where a small number of people do incredibly well, while the rest struggle.\n\nSherwin Rosen attributes this to [joint consumption technologies](https://www.uvm.edu/pdodds/files/papers/others/1981/rosen1981a.pdf). Despite the internet giving everyone the same access, the best performers - even if marginally more ‘talented’ than the rest - can also now reach an internet-scale audience and serve a much bigger market, reaping an even greater share of wealth. In [The Rise of the 10x Class](https://www.drorpoleg.com/rise-of-the-10x-class/), Dror Poleg argues this dynamic is now carrying over to all parts of knowledge work, as the Internet makes it possible for people to work from anywhere and earning potential is no longer capped by geography.\n\nIn her seminal piece, [The Creator Economy Needs a Middle Class](https://hbr.org/2020/12/the-creator-economy-needs-a-middle-class), Li Jin argues that it is up to us to build platforms that strengthen the creator middle class and lays out design decisions that can help make success attainable by many.\n\nOut of the turmoil of the last twenty years, new and hopeful possibilities are emerging. Today, we’re seeing the confluence of a few major cultural and technological trends that make us optimistic that the vision of the Internet we had decades ago - creative, quirky, diverse, accessible, democratic - is making a comeback:\n\n1. A renaissance of individualism on the Internet that changes the definition of talent\n2. A shift away from ad-funded models towards creator empowerment\n3. Web3 technologies that unlock infinite remixability and more granular distributions of value\n\n### A Renaissance of Individualism on the Internet that Changes the Definition of Talent\n\n![](https://images.mirror-media.xyz/publication-images/29efa833-5753-4514-b7c9-6afd3fce6635.png?height=866&width=2256)\n\nThe assumption underlying the winner-takes-all market dynamic relies on creators being judged simply by a talent or excellence standard. However, we ignore that taste and talent are co-determined. Talent is the name we give to people who best deliver what we prefer. So if we disagree on what’s “best”, we disagree on who is most talented.\n\nEvery sport that uses ‘mechanical judges’, like stopwatches, instead of human ones are judged solely against an excellence standard. These athletes conform to a taste-free talent vector. We see the entry of a taste vector in Olympic sports that have human judges, such as gymnastics, figure skating and freestyle skiing. To become good at these sports, one must also move towards “connoisseurship”. This requires the development of a “[discriminative faculty to judge and express taste according to the aesthetic principles of a consumption domain](https://www.hbs.edu/ris/Publication%20Files/18-107_582d03d9-92fd-4290-8cc3-d720848ef6a8.pdf)”. For a long time, internet content was at the behest of the rigid mechanical judge that is “number of subscribers” or “view count”.\n\nTo demonstrate the phenomenon of taste distribution more practically, any walk down the supermarket aisles will show that the assortment needed to cater for a diversity of tastes broadens as one moves from say paper towels to soups to wines - products of increasing hedonic value. There is not much dispersion of preferences for paper napkins on any dimension other than price/sturdiness. But that is not true for even the subset of wines that sell in supermarkets. The same applies on the internet.\n\nBut what do people end up preferring? [Holbrook](https://www0.gsb.columbia.edu/mygsb/faculty/research/pubfiles/3039/aaa-JCR-Publication-October-2007.pdf) theorizes that people, as a whole, are much more dispersed in what they prefer than is the ‘expert consensus’. Holbrook’s work draws from [Bordieu’s](https://web.stanford.edu/class/think53/bourdieu17.pdf), who famously discussed that those with the highest volume of “cultural capital” dictate what’s deemed “good taste” - and therefore “what’s best”.\n\nBut how do you accumulate the “cultural capital” to dictate “what’s best”? Bordieu, whose work is rooted in the study of the French bourgeoisie, describes how “the working-class ‘aesthetic’ is a dominated aesthetic...obliged to define itself in terms of the dominant aesthetics”. Holbrook argues that in more individualistic contemporary cultures, this gets distorted and we end up with more heterogeneous tastes.\n\nWinner-take-all outcomes happen in cultural markets under the influence of received expert opinion. But that’s at odds with the internet’s promise to “democratize everything” and to allow us to express our individuality - a culture that flourishes when we can each define what “talent” means to us and that is antagonistic to forced standards and received opinion.\n\nThus far, platforms as well as a select few “influencers” have taken on the role of “expert” taste-making and that has had a profound effect on what has social and cultural value.\n\nAnd so, we introduce “Jad’s Theory” (of talent & taste on the Internet). We’re witnessing a renaissance of individualism on the internet - a breakup with institutions and the rise of the individual and, with that, an unbundling of internet communities. For the creator middle class to rise, we need to see higher resolutions of taste preference and a breakup with singular, discriminatory platform algorithms and the opinion of the ‘few’ that arbitrate taste and force today’s dominant aesthetic. With that, individuals can decide on “what’s best” for themselves, allowing for the talent power law to play out across more taste vectors and spreading the opportunity to be perceived as “the best” - and, with that, spreading the opportunity to profit from that.\n\n![](https://images.mirror-media.xyz/publication-images/b8fb77c9-8409-4da6-9a59-7aa9014e35a0.png?height=988&width=2282)\n\n\n### A shift away from ad-funded models towards creator empowerment\n\n![](https://images.mirror-media.xyz/publication-images/50128c84-ac67-4904-982a-0c0abe7c5a85.png?height=1074&width=2094)\n\nWe’re currently living through a shift in the business model of the Internet, from ad-revenue to direct-to-creator monetization. We can’t underscore enough how profoundly this alters incentives - platforms are now less focused on driving eyeballs and more focused on building tools that make creators money.\n\nAd-funded models require content to be managed at scale, and as advertisers are the main customer, they start to fill the role of the “expert” that defines what is valuable. This causes content to naturally hew to what’s deemed ‘advertiser-friendly’ and the more popular becoming even more popular.\n\nThis also means that in an ad-driven world, monetizing your social presence is only accessible to popular creators, and the size of your fanbase is the single metric that matters.\n\nNew, creator-centric business models enable monetization based on intensity of fandom, not size. [Swipehouse](https://swipehouse.co/) & [Pearpop](https://pearpop.com/), for instance, allow fans to pay for interactions, something that makes sense for creators with 10,000 followers or 10 million followers.\n\nWhether it’s Substack leading the charge on newsletters, Clubhouse [announcing plans for creator payments](https://techcrunch.com/2021/01/24/clubhouse-announces-plans-for-creator-payments-and-raises-new-funding-led-by-andreessen-horowitz/), Soundcloud introducing [fan-powered royalties](https://www.musicbusinessworldwide.com/soundcloud-is-about-to-revolutionize-streaming-payouts-launching-user-centric-royalties-for-100000-indie-artists/), Twitter [unveiling Super Follow](https://www.theverge.com/2021/2/25/22301375/twitter-super-follows-communities-paid-followers), or Snapchat Spotlight distributing over $1m to creators every day, we’re seeing platforms offering a slew of on-platform revenue options, with a renewed focus on aligning their business models with creators of all sizes. This puts the onus on the user to decide “what’s best”.\n\n![](https://images.mirror-media.xyz/publication-images/08a3e31b-1978-4422-9469-b57c0afda483.png?height=1058&width=1476)\n\n\nHigh willingness to pay creators, along with better methods to monetize creative output is a potent combination that will lead to a massive rise in the number of people making money online, and new ways to scale income without scaling time. The opportunities around passive income will become a new keystone of the user experience of these platforms, pulling many creators out of the labor stack and into the capital stack. The mom-and-pop businesses of tomorrow will be the Clubhouse hosts, Substack writers, Twitch streamers, Discord Community Managers, Shopify dropshippers, TikTok stars, etc.\n\n\n### Web3 technologies unlock infinite remixability and more granular distributions of value\n\n![](https://images.mirror-media.xyz/publication-images/90d89a70-f3e9-4d8f-96d2-6fe7c98ecdb8.jpg?height=1324&width=2184)\n\n\nTikTok is proof that ease of remixing drastically lowers the barrier to creativity. When everything becomes a base from which you can create new content, the creative affordances are infinite. Usually, the original creator’s work is stolen and the distributor wins. [Stories](https://www.teenvogue.com/story/jalaiah-harmon-renegade-creator-viral-dance) like the [creator of the Renegade dance](https://www.nytimes.com/2020/02/13/style/the-original-renegade.html) that took off when Charli D'Amelio did it getting “frustrated because they weren’t tagging me or giving me credit” wouldn’t exist if everyone “on-chain” saw the financial reward from the rise of a remix.\n\nEvery idea, every project, every piece of content is just a remix of ideas that came before it. In the past, it hasn’t been possible to track the provenance of these ideas or to compensate their originators when they are being used. But technology is on the cusp of enabling us to compensate people for all instances in which their work ends up being useful.\n\n**The true power of Web3 technologies is the potential to reshape how value is created, shared, and distributed on the Internet, making distributing value as easy as sending and receiving an email. That’s a fundamental technology unlock that makes it possible for creators on the internet to earn more of the value they create.**\n\nAn underexplored undercurrent of Web 2.0 monetization tools is that creators have been incentivized to publish *good enough* content frequently vs. *great content* sporadically.\n\nOn Substack, for example, you’re paid monthly, creating pressure to write consistently. The problem is not just the inevitable burnout that comes from having to churn out 1-2 posts a week. The problem is this heavily skews towards pumping out bland and mediocre half-baked thoughts you’ve had a day to work on, not evergreen content that will still be valuable in five years.\n\nBut what if your back-catalog wasn’t stagnant, but rather an ever-evolving source of passive income? What if the value of your work was driven by the number of references and citations, and more references meant more dollars? What if the ROI of an essay that took hundreds of hours to write was orders of magnitude higher than those designed for virality or disposability?\n\nWe’re particularly excited about a web that can route economic value to sources of inspiration, one that can lead to a revival of the back-catalog resulting in a renewed focus on quality over quantity,and one **where *win and help win*** is the guiding philosophy.\n\n![](https://images.mirror-media.xyz/publication-images/6a66ec04-ee51-4d22-ae10-ea029979fe4c.png?height=1626&width=2376)\n\n\n**NFTs give us a way to honor, in perpetuity, the people who’ve influenced our work.**\n\n### With that spirit in mind, this essay will be an experiment in **‘Attribution+’ -** where we not only attribute sources of inspiration but route economic value to them.\n\nIn practical terms, this means we are minting this essay as a NFT, and the proceeds of the NFT sale will be split between the authors AND the individuals that have influenced the **work.**\n\n\n### Thought Partners\n(acknowledgments: people whose work we referenced directly in the essay)\n\n[Li Jin](https://twitter.com/ljin18)\n[John Deighton](https://twitter.com/HBSmktg)\n[Leora Kornfeld](https://twitter.com/lk617?lang=en)\n[Brandon Baraban](https://www.linkedin.com/in/brandonbaraban/)\n[Gabriel Nessim](https://twitter.com/wacko_gabriel)\n[Dror Poleg](https://twitter.com/drorpoleg)\n[Patrick Rivera](https://twitter.com/patrickxrivera?lang=en)\n[Balaji](https://twitter.com/balajis)\n[Josh Nissenboim](http://joshnissenboim.com/)\n[Tanay Jaypuria](https://twitter.com/tanayj)\n[Caroline Nguyen\n](https://twitter.com/spacexponential?lang=en)\n\n### **How will the proceeds of the NFT be split?**\n\n- 55% of the proceeds will be split between the authors, Sari and Jad\n- 30% of the proceeds will go to the pool of thought partners we reference above, whose ideas and feedback were instrumental in shaping our own.\n- 5% will go towards [Josh Nissenboim](http://joshnissenboim.com/) who drew the illustrations.\n- 10% will go to readers (like you) who help us spread the word about the essay.\n\n[Thought Partners](split://0x2b1138A1294fC56269ec66A2F17a6d1575473844?network=mainnet)\n\n\n### **What are the benefits of owning this NFT?**\n\n- Be a proud owner of an experiment that honors the original ideals of the Internet - users and creators, unconstrained by intermediaries, sharing ideas and economic upside\n- A powerful signal to the world that you support the “win and help win” worldview, and are, unabashedly, an **Internet optimist.**\n- The prospect of turning a profit by reselling the NFT down the line (Patronage+)\n- Own the underlying illustrations we created for the essay.\n- We’ll also send you physical prints of the four illustrations (one of a kind because this is the only time we’ll ever print or sell them) which, TBH, we’d hang in our powder rooms - they’re great dinner conversation starters for the intellectually inclined.\n- A 1hr Zoom call with Sari and Jad to dive deeper into the thesis (for anyone who bids over 0.1ETH is invited to participate)\n- A lifetime [Startupy](https://startupy.world/) membership and early access to [koodos](http://koodos.com/) (for anyone who bids over 0.5ETH)\n\n[Token #3075](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3075)", "timestamp": 1620497274, "digest": "etHY_neWXosxDJpGOhzuwi-cB0qOvMco_iwO5yJ1Ai0", "contributor": "0xF9875C1544f2C9AeACEc50feD687D984dDAa9D00", "nft": "{\"nftTransactionHash\": \"0x952422b30153269a7a48094aa506b9cd62faf011cd99355a2c2f1468a7c7e84d\"}"}
