{"id": "RKyXk04ani26gNTgF8XjiMFBKnf_2pY1zQeLb7ODplc", "title": "Fundamental Knowledge: An Interview with 0xDEAFBEEF", "body": "*Since the beginning of 2021, the artist known as 0xDEAFBEEF has captivated the NFT community with a series of pioneering audiovisual works made using the simplest of tools: a text editor, a C compiler, and the Ethereum blockchain. Joining a lineage of on-chain generative art that stretches from [Art Blocks](https://artblocks.io/) back to [Autoglyphs](https://www.larvalabs.com/autoglyphs), 0xDEAFBEEF has consistently explored the programmable potential of his medium. In his series [Entropy](https://www.deafbeef.com/series/3), released this April, the media accompanying each token degrades with every transfer. While with his two most recent series, [Glitchbox](https://www.deafbeef.com/series/4) and [Advection](https://www.deafbeef.com/series/5), he has allowed users to 'curate' the works by altering their parameters on-chain. Combining a background in software engineering and computer graphics research with a self-taught career as a blacksmith, 0xDEAFBEEF has been likened to a “digital craftsman” who has forged a panoply of new creative possibilities for NFTs.*\n\n*JPG co-founder Sam Spike spoke to 0xDEAFBEEF about his generative art practice, the unique power of audiovisual media, and the influence that new technologies have on the development of culture.*\n\n![Series 3 — Entropy](https://images.mirror-media.xyz/publication-images/c419c5b3-6ca8-4be4-93d8-9b1df5276314.jpeg?height=720&width=720)\n\n\n\n**Sam Spike: What was your introduction to on-chain generative art? Was there a particular artist or project that caught your eye?**\n\n0xDEAFBEEF: Generative and procedural art in general is something I've been interested in since I was a child. I was introduced to it through playing ASCII dungeon crawl games, like Rogue and Nethack, that procedurally generated levels for replayability. I found that completely fascinating, and spent my youth learning to program for that purpose.\n\nAs for on-chain generative art, specifically: when first trying to understand NFTs, I believe I came across Autoglyphs but didn't pay much attention to them as I thought the outputs were quite simple. This was prior to my understanding the relevance of them being the first and written completely in Solidity.\n\nIn mid-February, I discovered the wonderful Art Blocks platform and hoped to get on board. By that point, however, the waitlist was too long, and the client side javascript wouldn’t support my work. I decided to develop my own system to directly support the way I'd already been working, with self-contained C code.\n\n**Being a generative artist means courting both order and chaos. You’re creating rules that dictate the general shape of the work, but then you’re leaving its final form to chance or, in the case of your two most recent series, to other people. Why do you choose to work this way?**\n\nI believe nearly every generative artist will agree that exploring a design space is an intensely rewarding experience. It's fun and challenging to design a system, rather than a single result. There is always the opportunity to be surprised. With enough parameters, it can become intractable for a single person to explore all the interesting corners of that design space. So with the collaborative aspect of Glitchbox, it was very rewarding to see the unique and unexpected directions taken by others. \n\nI should add that many of the interactions I've had surrounding generative art and music have been from people who want to participate and start making work of their own. Glitchbox in some sense allows that. The most common feedback from users was that it was fun and motivated them to explore further.\n\nThat being said, I don't think generative art is so radically different from some traditional art processes. Artists do not always begin their process with a finished goal in their mind. The artwork is \"grown\" through an iterative process of observing and deciding what action to take next. \n\n**A recurring theme in your work appears to be a fascination with permanence. You write your models in C language and store them entirely on-chain to minimize dependencies as much as possible. You’ve also said that something you like about blacksmithing is how the tools haven’t changed in hundreds of years. At the same time, your work intentionally evokes the sounds and images of old and often obsolete technologies such as analog synthesizers, early computer graphics, and so on. How do you explain this tension?**\n\nI would argue that rather than these things being obsolete, they are fundamental, in the sense that they are closer to the underlying scientific and mathematical principles that govern them. For me, understanding how signals and information are stored, processed, and perceived is more important than whatever machine you happen to be using at the time.\n\nTo use an analogy: a Volkswagen van can be easily serviced by any mechanic, while a modern vehicle containing many microprocessors requires proprietary tools from the manufacturer. In the latter example, the connection to the underlying scientific and physical system is obscured by additional layers of complexity. As long as those layers of complexity are supported by the powers that be, the modern vehicle is more efficient, because it doesn't demand special knowledge from the user. But it's also more fragile. When the world moves on, it becomes truly obsolete.\n\nYour old smartphone is junk. On the other hand, an analog signal processor can be repaired, repurposed, and scavenged for parts. Oscilloscopes remain useful tools for electrical engineers. Vinyl and magnetic tape recordings from the 60s can still be played. ASCII terminal screens, for those who know how to use them, remain the most efficient way to interact with a computer for many tasks. \n\nOf course, I understand the trade-offs in time and convenience, but it’s an approach that I choose for myself. Having wasted lots of time adapting arbitrarily to platforms and technologies that have turned out to be transient (sometimes intentionally so), I'd much rather invest time in fundamental knowledge. Time spent this way is never wasted, regardless of the result.\n\n![Series 2 — Transmission](https://images.mirror-media.xyz/publication-images/80f80b86-a4c5-4892-8347-1e4e9244c54b.jpeg?height=720&width=720)\n\n**You write on your website that your first series, [Synth Poems](https://www.deafbeef.com/series/0), is ‘audio focused’. But in [Transmission](https://www.deafbeef.com/series/2) you’ve given more significance to the visual elements by subtly incorporating words that reflect the times we live in, like ‘fake news’, ‘new normal’, and even ‘onchain’. How do you think about the relationship between audio and images when making new work?**\n\nVisual perception and auditory perception influence one another, making the audiovisual a different medium than standalone music or animation. Small differences in synchronization make big differences perceptually. Abstract sound and images can powerfully convey a mood or feeling, giving an experience that's wholly different than the components considered separately. Experimental filmmakers understand this. For example, David Lynch does all his sound design, to great effect. Sound can completely change the context of a visual or textual narrative.\n\nI believe that audiovisual as its own medium is relatively new. There’s a lot left to explore. This video is dated, but John Whitney comments on it [here](https://www.youtube.com/watch?v=cP5Mj6ZvZJc&t=9m28s). I’m also excited to see how this area develops as technologies like AI make it easier for individual non-technical artists and composers to explore an aesthetic of tightly married sound and visuals. \n\nAs far as my own process is concerned, it varies. Sometimes the visuals come first, followed by a search for complementary sound. Sometimes it's the reverse. I'll often have a catalog of sounds and visual ideas in different states, and experiment with combining them and having them influence each other until something reveals itself.\n\nAlthough I do have a background in computer graphics and animation, when I started this project last year I intended it to be focused on generative sound/music, for simplicity’s sake. But when I started sharing on Instagram, I quickly realized that for someone to notice the audio, there would also have to be a visual component. Sound struggles to be noticed in visually dominated social media. One can scroll through feeds of images, but music requires time. I've lamented with musician friends years ago that, unfortunately, “you can't Instagram a concept album\". This is one of many examples of how social media has influenced art and artists, which in general I find interesting. Beeple's Everydays and XCOPY's animated GIFs are other examples.\n\n**NFTs have enormous potential to disrupt traditional cultural industries, just like DeFi is disrupting traditional finance. A separate question is whether they will also change the forms of culture itself, spawning new styles, genres and movements. In your view, is culture principally driven by technological change?**\n\nI'm a relative newcomer, but it was apparent to me the first time I joined a Discord channel in February that cryptoculture — with NFTs as a subset — exists, and we are currently witnessing it continue to develop and spawn all those things mentioned.\n\nIs culture principally driven by technological change? I'll offer my layman's opinion. Historically, probably not. In recent history, with the pace of change, and the growth of communication networks especially, I would say yes. But I'm not entirely with [Marshall] McLuhan. Yes, in certain cases cultures are spawned relating to particular technologies and mediums, like hacker culture and cryptoculture. In general, though, I think that the pervasiveness of communication networks transparently enables the exchange of information necessary for any subculture to thrive, as well as the cross-pollination of previously fragmented cultures.\n\nPerhaps blockchain will be the same. While there is definite cryptoculture, I think programmable distributed ledgers will eventually become a similarly transparent and enabling technology, supporting activities that influence culture, without that culture necessarily being \"about\" the medium.\n\n**You’ve previously mentioned to me that you think procedurally generated virtual architecture is an area of untapped potential in the metaverse. Could you say a little bit more about that? Is it something you’d like to explore yourself?**\n\nOf the little I've seen so far of metaverse VR worlds, I believe that most of the design/building is currently being done manually, which is very time consuming. Procedural design tools are already quite common in 'in real life' industries, such as industrial design, architecture, and game design. It seems natural and inevitable that the two realms will meet. At a basic level, this will save designers the tedium of repetitive tasks. But it could also potentially lead to the exploration of new architectural styles, free from material constraints. We might also see people employ machine learning to design by way of example. Of course, this is all dependent on metaverse platforms offering some type of programmable interface.\n\nIt's something I'd like to explore in a small way, perhaps for my own metaverse presence. I'd strongly encourage others with more domain knowledge to take it further.  \n\n**Finally, what's an influence on your work that people would be surprised by?**\n\nFrank Zappa inspired me to leave engineering school at a young age to move to a city and attempt to do creative things with music and sound recording. His spirit of experimentation, humour, business acumen, and life-long dedication to a singular vision have all influenced me, although it may be difficult to see exactly how it comes through in this work. I've followed a wandering path that may have landed somewhere else entirely if it weren't for discovering Frank in those formative years.\n\n![Series 5 — Advection](https://images.mirror-media.xyz/publication-images/f49cabd2-0492-4db1-a8b4-3c5fbc811b5d.jpeg?height=720&width=720)\n\n\n\n*If you want to learn more about 0xDEAFBEEF, check out these resources:*\n\n- ['“Constraints lead to creativity”: an interview with DEAFBEEF'](https://fingerprintsdao.medium.com/constraints-lead-to-creativity-an-interview-with-deafbeef-289e9e64ae25) by Fingerprints DAO\n- ['Thinking Outside the Glitchbox: 0xDEAFBEEF’s On-Chain Generative Art'](https://open.spotify.com/episode/0iaaoaoQJXybIBcC0eNjJj) on the Digitally Rare podcast\n- [The introduction, personal history and FAQ](https://www.deafbeef.com/about.htm) on his website\n- [0xDEAFBEEF Discord server](https://discord.com/invite/ZEWCVTpuPV)\n", "timestamp": 1626360385, "digest": "WAKai5pGG_KMGHKFH4tmWFa9dtPG1AA41Zn2KQ25fHw", "contributor": "0xAbc837FEeEb448D36173d92d9563F324bC3a273f"}
{"id": "qBLUs-Xqy2agSgLRZaAw-u-qt1sFKEI9XaoOp5Zd9nE", "title": "Fundamental Knowledge: An Interview with 0xDEAFBEEF", "body": "*Since the beginning of 2021, the artist known as 0xDEAFBEEF has captivated the NFT community with a series of pioneering audiovisual works made using the simplest of tools: a text editor, a C compiler, and the Ethereum blockchain. Joining a lineage of on-chain generative art that stretches from [Art Blocks](https://artblocks.io/) back to [Autoglyphs](https://www.larvalabs.com/autoglyphs), 0xDEAFBEEF has consistently explored the programmable potential of his medium. In his series [Entropy](https://www.deafbeef.com/series/3), released this April, the media accompanying each token degrades with every transfer. While with his two most recent series, [Glitchbox](https://www.deafbeef.com/series/4) and [Advection](https://www.deafbeef.com/series/5), he has allowed users to 'curate' the works by altering their parameters on-chain. Combining a background in software engineering and computer graphics research with a self-taught career as a blacksmith, 0xDEAFBEEF has been likened to a “digital craftsman” who has forged a panoply of new creative possibilities for NFTs.*\n\n*JPG co-founder Sam Spike spoke to 0xDEAFBEEF about his generative art practice, the unique power of audiovisual media, and the influence that new technologies have on the development of culture.*\n\n![Series 3 — Entropy](https://images.mirror-media.xyz/publication-images/c419c5b3-6ca8-4be4-93d8-9b1df5276314.jpeg?height=720&width=720)\n\n\n\n**Sam Spike: What was your introduction to on-chain generative art? Was there a particular artist or project that caught your eye?**\n\n0xDEAFBEEF: Generative and procedural art in general is something I've been interested in since I was a child. I was introduced to it through playing ASCII dungeon crawl games, like Rogue and Nethack, that procedurally generated levels for replayability. I found that completely fascinating, and spent my youth learning to program for that purpose.\n\nAs for on-chain generative art, specifically: when first trying to understand NFTs, I believe I came across Autoglyphs but didn't pay much attention to them as I thought the outputs were quite simple. This was prior to my understanding the relevance of them being the first and written completely in Solidity.\n\nIn mid-February, I discovered the wonderful Art Blocks platform and hoped to get on board. By that point, however, the waitlist was too long, and the client side javascript wouldn’t support my work. I decided to develop my own system to directly support the way I'd already been working, with self-contained C code.\n\n**Being a generative artist means courting both order and chaos. You’re creating rules that dictate the general shape of the work, but then you’re leaving its final form to chance or, in the case of your two most recent series, to other people. Why do you choose to work this way?**\n\nI believe nearly every generative artist will agree that exploring a design space is an intensely rewarding experience. It's fun and challenging to design a system, rather than a single result. There is always the opportunity to be surprised. With enough parameters, it can become intractable for a single person to explore all the interesting corners of that design space. So with the collaborative aspect of Glitchbox, it was very rewarding to see the unique and unexpected directions taken by others. \n\nI should add that many of the interactions I've had surrounding generative art and music have been from people who want to participate and start making work of their own. Glitchbox in some sense allows that. The most common feedback from users was that it was fun and motivated them to explore further.\n\nThat being said, I don't think generative art is so radically different from some traditional art processes. Artists do not always begin their process with a finished goal in their mind. The artwork is \"grown\" through an iterative process of observing and deciding what action to take next. \n\n**A recurring theme in your work appears to be a fascination with permanence. You write your models in C language and store them entirely on-chain to minimize dependencies as much as possible. You’ve also said that something you like about blacksmithing is how the tools haven’t changed in hundreds of years. At the same time, your work intentionally evokes the sounds and images of old and often obsolete technologies such as analog synthesizers, early computer graphics, and so on. How do you explain this tension?**\n\nI would argue that rather than these things being obsolete, they are fundamental, in the sense that they are closer to the underlying scientific and mathematical principles that govern them. For me, understanding how signals and information are stored, processed, and perceived is more important than whatever machine you happen to be using at the time.\n\nTo use an analogy: a Volkswagen van can be easily serviced by any mechanic, while a modern vehicle containing many microprocessors requires proprietary tools from the manufacturer. In the latter example, the connection to the underlying scientific and physical system is obscured by additional layers of complexity. As long as those layers of complexity are supported by the powers that be, the modern vehicle is more efficient, because it doesn't demand special knowledge from the user. But it's also more fragile. When the world moves on, it becomes truly obsolete.\n\nYour old smartphone is junk. On the other hand, an analog signal processor can be repaired, repurposed, and scavenged for parts. Oscilloscopes remain useful tools for electrical engineers. Vinyl and magnetic tape recordings from the 60s can still be played. ASCII terminal screens, for those who know how to use them, remain the most efficient way to interact with a computer for many tasks. \n\nOf course, I understand the trade-offs in time and convenience, but it’s an approach that I choose for myself. Having wasted lots of time adapting arbitrarily to platforms and technologies that have turned out to be transient (sometimes intentionally so), I'd much rather invest time in fundamental knowledge. Time spent this way is never wasted, regardless of the result.\n\n![Series 2 — Transmission](https://images.mirror-media.xyz/publication-images/80f80b86-a4c5-4892-8347-1e4e9244c54b.jpeg?height=720&width=720)\n\n**You write on your website that your first series, [Synth Poems](https://www.deafbeef.com/series/0), is ‘audio focused’. But in [Transmission](https://www.deafbeef.com/series/2) you’ve given more significance to the visual elements by subtly incorporating words that reflect the times we live in, like ‘fake news’, ‘new normal’, and even ‘onchain’. How do you think about the relationship between audio and images when making new work?**\n\nVisual perception and auditory perception influence one another, making the audiovisual a different medium than standalone music or animation. Small differences in synchronization make big differences perceptually. Abstract sound and images can powerfully convey a mood or feeling, giving an experience that's wholly different than the components considered separately. Experimental filmmakers understand this. For example, David Lynch does all his sound design, to great effect. Sound can completely change the context of a visual or textual narrative.\n\nI believe that audiovisual as its own medium is relatively new. There’s a lot left to explore. This video is dated, but John Whitney comments on it [here](https://www.youtube.com/watch?v=cP5Mj6ZvZJc&t=9m28s). I’m also excited to see how this area develops as technologies like AI make it easier for individual non-technical artists and composers to explore an aesthetic of tightly married sound and visuals. \n\nAs far as my own process is concerned, it varies. Sometimes the visuals come first, followed by a search for complementary sound. Sometimes it's the reverse. I'll often have a catalog of sounds and visual ideas in different states, and experiment with combining them and having them influence each other until something reveals itself.\n\nAlthough I do have a background in computer graphics and animation, when I started this project last year I intended it to be focused on generative sound/music, for simplicity’s sake. But when I started sharing on Instagram, I quickly realized that for someone to notice the audio, there would also have to be a visual component. Sound struggles to be noticed in visually dominated social media. One can scroll through feeds of images, but music requires time. I've lamented with musician friends years ago that, unfortunately, “you can't Instagram a concept album\". This is one of many examples of how social media has influenced art and artists, which in general I find interesting. Beeple's Everydays and XCOPY's animated GIFs are other examples.\n\n**NFTs have enormous potential to disrupt traditional cultural industries, just like DeFi is disrupting traditional finance. A separate question is whether they will also change the forms of culture itself, spawning new styles, genres and movements. In your view, is culture principally driven by technological change?**\n\nI'm a relative newcomer, but it was apparent to me the first time I joined a Discord channel in February that cryptoculture — with NFTs as a subset — exists, and we are currently witnessing it continue to develop and spawn all those things mentioned.\n\nIs culture principally driven by technological change? I'll offer my layman's opinion. Historically, probably not. In recent history, with the pace of change, and the growth of communication networks especially, I would say yes. But I'm not entirely with [Marshall] McLuhan. Yes, in certain cases cultures are spawned relating to particular technologies and mediums, like hacker culture and cryptoculture. In general, though, I think that the pervasiveness of communication networks transparently enables the exchange of information necessary for any subculture to thrive, as well as the cross-pollination of previously fragmented cultures.\n\nPerhaps blockchain will be the same. While there is definite cryptoculture, I think programmable distributed ledgers will eventually become a similarly transparent and enabling technology, supporting activities that influence culture, without that culture necessarily being \"about\" the medium.\n\n**You’ve previously mentioned to me that you think procedurally generated virtual architecture is an area of untapped potential in the metaverse. Could you say a little bit more about that? Is it something you’d like to explore yourself?**\n\nOf the little I've seen so far of metaverse VR worlds, I believe that most of the design/building is currently being done manually, which is very time consuming. Procedural design tools are already quite common in 'in real life' industries, such as industrial design, architecture, and game design. It seems natural and inevitable that the two realms will meet. At a basic level, this will save designers the tedium of repetitive tasks. But it could also potentially lead to the exploration of new architectural styles, free from material constraints. We might also see people employ machine learning to design by way of example. Of course, this is all dependent on metaverse platforms offering some type of programmable interface.\n\nIt's something I'd like to explore in a small way, perhaps for my own metaverse presence. I'd strongly encourage others with more domain knowledge to take it further.  \n\n**Finally, what's an influence on your work that people would be surprised by?**\n\nFrank Zappa inspired me to leave engineering school at a young age to move to a city and attempt to do creative things with music and sound recording. His spirit of experimentation, humour, business acumen, and life-long dedication to a singular vision have all influenced me, although it may be difficult to see exactly how it comes through in this work. I've followed a wandering path that may have landed somewhere else entirely if it weren't for discovering Frank in those formative years.\n\n![Series 5 — Advection](https://images.mirror-media.xyz/publication-images/f49cabd2-0492-4db1-a8b4-3c5fbc811b5d.jpeg?height=720&width=720)\n\n\n\n*If you want to learn more about 0xDEAFBEEF, check out these resources:*\n\n- ['“Constraints lead to creativity”: an interview with DEAFBEEF'](https://fingerprintsdao.medium.com/constraints-lead-to-creativity-an-interview-with-deafbeef-289e9e64ae25) by Fingerprints DAO\n- ['Thinking Outside the Glitchbox: 0xDEAFBEEF’s On-Chain Generative Art'](https://open.spotify.com/episode/0iaaoaoQJXybIBcC0eNjJj) on the Digitally Rare podcast\n- [The introduction, personal history and FAQ](https://www.deafbeef.com/about.htm) on his website\n- [0xDEAFBEEF Discord server](https://discord.com/invite/ZEWCVTpuPV)\n", "timestamp": 1626361290, "digest": "WAKai5pGG_KMGHKFH4tmWFa9dtPG1AA41Zn2KQ25fHw", "contributor": "0xAbc837FEeEb448D36173d92d9563F324bC3a273f"}
{"id": "E8ljVJf2N7zDM6S0isxAxo6iLsqdQuuRDPKLwcldFX8", "title": "Seed Club Raises $2m to build “YCombinator of Tokenized Communities”", "body": "- Seed Club is a DAO that builds and invests in communities with tokens.\n- We're proud to announce a fundraise of $2M into the DAO treasury to help usher in a new era for digital communities.\n- The round includes: Packy McCormick, Stani Kulechov, Denis Nazarov, Nascent, Sfermion and was led by IDEO CoLab Ventures.\n\n[Token #4015](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=4015&auctionId=0x7f6ce315f5fecaba49a4c2bb642c1e9db7a2123981d4104b55ff67ba533156e2)\n\n## Seed Club is a DAO that builds and invests in tokenized communities.\n\nToday it's announcing a $2 million contribution round that includes: Packy McCormick, Stani Kulechov, Denis Nazarov and led by IDEO CoLab Ventures.\n\nIn its first eight months, Seed Club contributed to or helped incubate 17 different social tokens as part of its growing portfolio including: [Squiggle DAO](https://squiggledao.com/), [ForeFront](https://twitter.com/forefront__), [Global Coin Research](https://twitter.com/Globalcoinrsrch), [PartyDAO](https://twitter.com/prtyDAO) and [Songcamp](https://twitter.com/songcamp_).\n\nToday, we welcome an outstanding group of angels, builders, collectors and funds to the DAO.\n\n**Membership now includes:**\n\n**Leading NFT collectors, creators and builders:** Jacob Horne (Zora), Gmoney (Twitter Punk), Quickrider (Flamingo DAO), Brett Shear (Palm Tree Crew), Seth Goldstein (Bright Moments Gallery), Samsonite (Leaving Records), Daniel Maegaard (SeedPhrase), Matthew Ferrick (NiftyGateway) and 6 Agency.\n\n**Social token pros:** Cooper Turley (Audius), Trevor McFedries (Brud), Reuben Bramanathan (IDEO CoLab), Carlos Gomes (Forefront), Scott Moore (Gitcoin), Wong Joon Ian (Individual), James Duncan (Square 1), Jess Sloss (Seed Club), Bradley Miles (Roll), Pet3r Pan (MetaCartel), Kevin Chou (Rally), James Young (Collab.Land), Louis Giraux (SuperRare)\n\n**Web 3 builders:** Kristen Stone (Balancer), Stani Kulechov (Aave), Denis Nazarov (Mirror), Brian Flynn (Rabbit Hole) Bobby Ong (CoinGecko), TM Lee (CoinGecko), Lawson Baker (RaRa), Fire Eyes DAO, Eric Ashdown (Covalent), Patrick Rivera (Mirror), Jarrod Dicker (Dark Star DAO)\n\n**Angels:** Packy McCormick (Not Boring), Ian Lee (IDEO CoLab), Andrew Steinwold (Sfermion), Pri Desai (The LAO), Zack Honarvar (One Day Entertainment), Dan Hannum (Hannum Capital Management), Nick Grossman (Union Square Ventures), Marc Weinstein (Mechanism Capital), Matthew Shaw (Yolo Build Co.), Jake Brukhman (CoinFund), NiMA Asghari, Megan Hannum, 0xElle (Greenfield One) and Launch House.\n\n**Forward thinking funds:** IDEO CoLab, Sfermion, Nascent, Lemniscap, Delphi Digital, Betaworks, Meta Cartel Ventures, The LAO, IOSG Ventures and Taureon\n\n## The Future is Community Capital\n\nFor too long the value that communities create online has been captured by platforms not people. We believe web 3 and social tokens invert this old dynamic and return ownership to creators and their communities.\n\nTokens give communities super powers. Today, groups of people using accessible, on-chain tools can leverage tokens to capitalize, reward, govern and grow collective value on the internet.\n\nAnd while it’s never been easier to issue a community token, the path to developing one with lasting utility and influence requires a holistic approach spanning governance, tokenomics, incentives and community organization.\n\nSeed Club brings community leaders, brands, investors and builders together to solve these complex problems and bring the best community tokens to market.\n\nWe believe there will be tokenized communities worth $Billions, and we plan to help launch them.\n\n**How We Work**\n\nThrough our Accelerator program and Studio offering, we help community token projects design their token economy, establish governance processes and grow their social and economic value. We earn a percentage of their token supply for long term alignment with our incubated communities.\n\nAs these communities/DAOs tokenize and scale, the value of the tokens in Seed Club's treasury will appreciate in parallel. By aligning incentives with these tokenized communities, Seed Club will actively participate in the growth of the overall token ecosystem.\n\nIt’s our hope that our growing community will take an active role in curating and supporting the growth of these tokenized communities, earning a stake in Seed Club in return.\n\n### You Should Join Us.\n\nStay at the cutting edge of web3 trends, help steward Seed Club’s growing social token treasury and explore new ways for digital communities to create and deliver value.\n\nStay up to date: [Subscribe to the Seed Club Newsletter](https://seedclub.substack.com/welcome)\n\nDiscord: [discord.gg/WT2fHy4](http://www.discord.gg/WT2fHy4)\nTwitter: [@seedclubhq](http://www.twitter.com/seedclubhq)\nWebsite: [seedclub.xyz](notion://www.notion.so/www.seedclub.xyz)\n\nListen to Jess Sloss on [The Delphi Podcast](https://twitter.com/Shaughnessy119/status/1400827073564979213?s=20) and [The Defiant](https://t.co/96jPb0GEVP?amp=1)", "timestamp": 1626361846, "digest": "a5PQAwU0CuHJ90lEOmzq545nlC4qqNoTVTeHEGRrqow", "contributor": "0x42DFAf5266Ad40AB4533F9806F5CC1DF4C1eB363"}
{"id": "LT8RR-rtY4Vf0whTO8BkLKt6pB_QA4byAarFoqqZCrs", "title": "This longhorn is an NFT", "body": "At [Creator Cabins](https://twitter.com/creatorcabins), we like to think about the intersection of crypto and physical property. In order to contribute to that conversation, we're selling a Texas Longhorn on-chain 🤠\n\nYes, a real live cow (well, technically a steer). His name is DH-Esteereum. You can own 1/4th of him by purchasing an NFT edition below:\n\n[D-H Esteereum](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=35)\n\nEach 1/4 stake can be converted into...steaks. More precisely, ~35-38 pounds of lean grass-fed/free-range longhorn beef, in the form of steaks, roasts, and hamburger meat. Available for pickup at Creator Cabins outside of Austin, TX any time in the next year. Local purchasers only, processing included!\n\nI suppose someone with a soft heart could buy a majority stake in D-H Esteereum and choose to spare his life, allowing him to spend the rest of his days chewing grass at the [Double Helix Ranch](http://doublehelixranch.com/). If there's no majority consensus on what to do with the cow, you'll have to start the world's smallest DAO and figure it out 🤷\n\nIn addition to your share of the cow, you get to keep the NFT edition as a memento to commemorate your purchase of the first-ever (??) ownership of a living creature minted on-chain.\n\nProceeds go to doublehelixranch.eth, our friendly neighborhood longhorn ranchers in the Texas Hill Country. Thanks to Nat Eliason for the tweet that turned this from a joke into reality:\n\nhttps://twitter.com/nateliason/status/1415464640876879872", "timestamp": 1626361915, "digest": "OmwhMeOpeK8MJTBhHV0RpQmqh1mYMMpcJir97pTZyEQ", "contributor": "0xbeC26FFa12c90217943D1b2958f60A821aE6E549"}
{"id": "MJLzQfX8y7R-qTCIbU38uKMf-2hRbbIxFuLLmPVlerI", "title": "Fundamental Knowledge: An Interview with 0xDEAFBEEF", "body": "![](https://images.mirror-media.xyz/publication-images/b181c518-1204-4a4c-8563-2fb841b024ba.jpg?height=400&width=800)\n\n\n*Since the beginning of 2021, the artist known as 0xDEAFBEEF has captivated the NFT community with a series of pioneering audiovisual works made using the simplest of tools: a text editor, a C compiler, and the Ethereum blockchain. Joining a lineage of on-chain generative art that stretches from [Art Blocks](https://artblocks.io/) back to [Autoglyphs](https://www.larvalabs.com/autoglyphs), 0xDEAFBEEF has consistently explored the programmable potential of his medium. In his series [Entropy](https://www.deafbeef.com/series/3), released this April, the media accompanying each token degrades with every transfer. While with his two most recent series, [Glitchbox](https://www.deafbeef.com/series/4) and [Advection](https://www.deafbeef.com/series/5), he has allowed users to 'curate' the works by altering their parameters on-chain. Combining a background in software engineering and computer graphics research with a self-taught career as a blacksmith, 0xDEAFBEEF has been likened to a “digital craftsman” who has forged a panoply of new creative possibilities for NFTs.*\n\n*JPG co-founder Sam Spike spoke to 0xDEAFBEEF about his generative art practice, the unique power of audiovisual media, and the influence that new technologies have on the development of culture.*\n\n![Series 3 — Entropy](https://images.mirror-media.xyz/publication-images/c419c5b3-6ca8-4be4-93d8-9b1df5276314.jpeg?height=720&width=720)\n\n\n\n**Sam Spike: What was your introduction to on-chain generative art? Was there a particular artist or project that caught your eye?**\n\n0xDEAFBEEF: Generative and procedural art in general is something I've been interested in since I was a child. I was introduced to it through playing ASCII dungeon crawl games, like Rogue and Nethack, that procedurally generated levels for replayability. I found that completely fascinating, and spent my youth learning to program for that purpose.\n\nAs for on-chain generative art, specifically: when first trying to understand NFTs, I believe I came across Autoglyphs but didn't pay much attention to them as I thought the outputs were quite simple. This was prior to my understanding the relevance of them being the first and written completely in Solidity.\n\nIn mid-February, I discovered the wonderful Art Blocks platform and hoped to get on board. By that point, however, the waitlist was too long, and the client side javascript wouldn’t support my work. I decided to develop my own system to directly support the way I'd already been working, with self-contained C code.\n\n**Being a generative artist means courting both order and chaos. You’re creating rules that dictate the general shape of the work, but then you’re leaving its final form to chance or, in the case of your two most recent series, to other people. Why do you choose to work this way?**\n\nI believe nearly every generative artist will agree that exploring a design space is an intensely rewarding experience. It's fun and challenging to design a system, rather than a single result. There is always the opportunity to be surprised. With enough parameters, it can become intractable for a single person to explore all the interesting corners of that design space. So with the collaborative aspect of Glitchbox, it was very rewarding to see the unique and unexpected directions taken by others. \n\nI should add that many of the interactions I've had surrounding generative art and music have been from people who want to participate and start making work of their own. Glitchbox in some sense allows that. The most common feedback from users was that it was fun and motivated them to explore further.\n\nThat being said, I don't think generative art is so radically different from some traditional art processes. Artists do not always begin their process with a finished goal in their mind. The artwork is \"grown\" through an iterative process of observing and deciding what action to take next. \n\n**A recurring theme in your work appears to be a fascination with permanence. You write your models in C language and store them entirely on-chain to minimize dependencies as much as possible. You’ve also said that something you like about blacksmithing is how the tools haven’t changed in hundreds of years. At the same time, your work intentionally evokes the sounds and images of old and often obsolete technologies such as analog synthesizers, early computer graphics, and so on. How do you explain this tension?**\n\nI would argue that rather than these things being obsolete, they are fundamental, in the sense that they are closer to the underlying scientific and mathematical principles that govern them. For me, understanding how signals and information are stored, processed, and perceived is more important than whatever machine you happen to be using at the time.\n\nTo use an analogy: a Volkswagen van can be easily serviced by any mechanic, while a modern vehicle containing many microprocessors requires proprietary tools from the manufacturer. In the latter example, the connection to the underlying scientific and physical system is obscured by additional layers of complexity. As long as those layers of complexity are supported by the powers that be, the modern vehicle is more efficient, because it doesn't demand special knowledge from the user. But it's also more fragile. When the world moves on, it becomes truly obsolete.\n\nYour old smartphone is junk. On the other hand, an analog signal processor can be repaired, repurposed, and scavenged for parts. Oscilloscopes remain useful tools for electrical engineers. Vinyl and magnetic tape recordings from the 60s can still be played. ASCII terminal screens, for those who know how to use them, remain the most efficient way to interact with a computer for many tasks. \n\nOf course, I understand the trade-offs in time and convenience, but it’s an approach that I choose for myself. Having wasted lots of time adapting arbitrarily to platforms and technologies that have turned out to be transient (sometimes intentionally so), I'd much rather invest time in fundamental knowledge. Time spent this way is never wasted, regardless of the result.\n\n![Series 2 — Transmission](https://images.mirror-media.xyz/publication-images/80f80b86-a4c5-4892-8347-1e4e9244c54b.jpeg?height=720&width=720)\n\n**You write on your website that your first series, [Synth Poems](https://www.deafbeef.com/series/0), is ‘audio focused’. But in [Transmission](https://www.deafbeef.com/series/2) you’ve given more significance to the visual elements by subtly incorporating words that reflect the times we live in, like ‘fake news’, ‘new normal’, and even ‘onchain’. How do you think about the relationship between audio and images when making new work?**\n\nVisual perception and auditory perception influence one another, making the audiovisual a different medium than standalone music or animation. Small differences in synchronization make big differences perceptually. Abstract sound and images can powerfully convey a mood or feeling, giving an experience that's wholly different than the components considered separately. Experimental filmmakers understand this. For example, David Lynch does all his sound design, to great effect. Sound can completely change the context of a visual or textual narrative.\n\nI believe that audiovisual as its own medium is relatively new. There’s a lot left to explore. This video is dated, but John Whitney comments on it [here](https://www.youtube.com/watch?v=cP5Mj6ZvZJc&t=9m28s). I’m also excited to see how this area develops as technologies like AI make it easier for individual non-technical artists and composers to explore an aesthetic of tightly married sound and visuals. \n\nAs far as my own process is concerned, it varies. Sometimes the visuals come first, followed by a search for complementary sound. Sometimes it's the reverse. I'll often have a catalog of sounds and visual ideas in different states, and experiment with combining them and having them influence each other until something reveals itself.\n\nAlthough I do have a background in computer graphics and animation, when I started this project last year I intended it to be focused on generative sound/music, for simplicity’s sake. But when I started sharing on Instagram, I quickly realized that for someone to notice the audio, there would also have to be a visual component. Sound struggles to be noticed in visually dominated social media. One can scroll through feeds of images, but music requires time. I've lamented with musician friends years ago that, unfortunately, “you can't Instagram a concept album\". This is one of many examples of how social media has influenced art and artists, which in general I find interesting. Beeple's Everydays and XCOPY's animated GIFs are other examples.\n\n**NFTs have enormous potential to disrupt traditional cultural industries, just like DeFi is disrupting traditional finance. A separate question is whether they will also change the forms of culture itself, spawning new styles, genres and movements. In your view, is culture principally driven by technological change?**\n\nI'm a relative newcomer, but it was apparent to me the first time I joined a Discord channel in February that cryptoculture — with NFTs as a subset — exists, and we are currently witnessing it continue to develop and spawn all those things mentioned.\n\nIs culture principally driven by technological change? I'll offer my layman's opinion. Historically, probably not. In recent history, with the pace of change, and the growth of communication networks especially, I would say yes. But I'm not entirely with [Marshall] McLuhan. Yes, in certain cases cultures are spawned relating to particular technologies and mediums, like hacker culture and cryptoculture. In general, though, I think that the pervasiveness of communication networks transparently enables the exchange of information necessary for any subculture to thrive, as well as the cross-pollination of previously fragmented cultures.\n\nPerhaps blockchain will be the same. While there is definite cryptoculture, I think programmable distributed ledgers will eventually become a similarly transparent and enabling technology, supporting activities that influence culture, without that culture necessarily being \"about\" the medium.\n\n**You’ve previously mentioned to me that you think procedurally generated virtual architecture is an area of untapped potential in the metaverse. Could you say a little bit more about that? Is it something you’d like to explore yourself?**\n\nOf the little I've seen so far of metaverse VR worlds, I believe that most of the design/building is currently being done manually, which is very time consuming. Procedural design tools are already quite common in 'in real life' industries, such as industrial design, architecture, and game design. It seems natural and inevitable that the two realms will meet. At a basic level, this will save designers the tedium of repetitive tasks. But it could also potentially lead to the exploration of new architectural styles, free from material constraints. We might also see people employ machine learning to design by way of example. Of course, this is all dependent on metaverse platforms offering some type of programmable interface.\n\nIt's something I'd like to explore in a small way, perhaps for my own metaverse presence. I'd strongly encourage others with more domain knowledge to take it further.  \n\n**Finally, what's an influence on your work that people would be surprised by?**\n\nFrank Zappa inspired me to leave engineering school at a young age to move to a city and attempt to do creative things with music and sound recording. His spirit of experimentation, humour, business acumen, and life-long dedication to a singular vision have all influenced me, although it may be difficult to see exactly how it comes through in this work. I've followed a wandering path that may have landed somewhere else entirely if it weren't for discovering Frank in those formative years.\n\n![Series 5 — Advection](https://images.mirror-media.xyz/publication-images/f49cabd2-0492-4db1-a8b4-3c5fbc811b5d.jpeg?height=720&width=720)\n\n\n\n*If you want to learn more about 0xDEAFBEEF, check out these resources:*\n\n- ['“Constraints lead to creativity”: an interview with DEAFBEEF'](https://fingerprintsdao.medium.com/constraints-lead-to-creativity-an-interview-with-deafbeef-289e9e64ae25) by Fingerprints DAO\n- ['Thinking Outside the Glitchbox: 0xDEAFBEEF’s On-Chain Generative Art'](https://open.spotify.com/episode/0iaaoaoQJXybIBcC0eNjJj) on the Digitally Rare podcast\n- [The introduction, personal history and FAQ](https://www.deafbeef.com/about.htm) on his website\n- [0xDEAFBEEF Discord server](https://discord.com/invite/ZEWCVTpuPV)\n", "timestamp": 1626361901, "digest": "WAKai5pGG_KMGHKFH4tmWFa9dtPG1AA41Zn2KQ25fHw", "contributor": "0xAbc837FEeEb448D36173d92d9563F324bC3a273f"}
{"id": "_Mq5LaDDu4TkEH5FJ4p62-qNwTmVcx-U5yBYVECS-b8", "title": "Fundamental Knowledge: An Interview with 0xDEAFBEEF", "body": "![](https://images.mirror-media.xyz/publication-images/b181c518-1204-4a4c-8563-2fb841b024ba.jpg?height=400&width=800)\n\n*Since the beginning of 2021, the artist known as 0xDEAFBEEF has captivated the NFT community with a series of pioneering audiovisual works made using the simplest of tools: a text editor, a C compiler, and the Ethereum blockchain. Joining a lineage of on-chain generative art that stretches from [Art Blocks](https://artblocks.io/) back to [Autoglyphs](https://www.larvalabs.com/autoglyphs), 0xDEAFBEEF has consistently explored the programmable potential of his medium. In his series [Entropy](https://www.deafbeef.com/series/3), released this April, the media accompanying each token degrades with every transfer. While with his two most recent series, [Glitchbox](https://www.deafbeef.com/series/4) and [Advection](https://www.deafbeef.com/series/5), he has allowed users to 'curate' the works by altering their parameters on-chain. Combining a background in software engineering and computer graphics research with a self-taught career as a blacksmith, 0xDEAFBEEF has been likened to a “digital craftsman” who has forged a panoply of new creative possibilities for NFTs.*\n\n*JPG co-founder Sam Spike spoke to 0xDEAFBEEF about his generative art practice, the unique power of audiovisual media, and the influence that new technologies have on the development of culture.*\n\n![Series 3 — Entropy](https://images.mirror-media.xyz/publication-images/c419c5b3-6ca8-4be4-93d8-9b1df5276314.jpeg?height=720&width=720)\n\n\n\n**Sam Spike: What was your introduction to on-chain generative art? Was there a particular artist or project that caught your eye?**\n\n0xDEAFBEEF: Generative and procedural art in general is something I've been interested in since I was a child. I was introduced to it through playing ASCII dungeon crawl games, like Rogue and Nethack, that procedurally generated levels for replayability. I found that completely fascinating, and spent my youth learning to program for that purpose.\n\nAs for on-chain generative art, specifically: when first trying to understand NFTs, I believe I came across Autoglyphs but didn't pay much attention to them as I thought the outputs were quite simple. This was prior to my understanding the relevance of them being the first and written completely in Solidity.\n\nIn mid-February, I discovered the wonderful Art Blocks platform and hoped to get on board. By that point, however, the waitlist was too long, and the client side javascript wouldn’t support my work. I decided to develop my own system to directly support the way I'd already been working, with self-contained C code.\n\n**Being a generative artist means courting both order and chaos. You’re creating rules that dictate the general shape of the work, but then you’re leaving its final form to chance or, in the case of your two most recent series, to other people. Why do you choose to work this way?**\n\nI believe nearly every generative artist will agree that exploring a design space is an intensely rewarding experience. It's fun and challenging to design a system, rather than a single result. There is always the opportunity to be surprised. With enough parameters, it can become intractable for a single person to explore all the interesting corners of that design space. So with the collaborative aspect of Glitchbox, it was very rewarding to see the unique and unexpected directions taken by others. \n\nI should add that many of the interactions I've had surrounding generative art and music have been from people who want to participate and start making work of their own. Glitchbox in some sense allows that. The most common feedback from users was that it was fun and motivated them to explore further.\n\nThat being said, I don't think generative art is so radically different from some traditional art processes. Artists do not always begin their process with a finished goal in their mind. The artwork is \"grown\" through an iterative process of observing and deciding what action to take next. \n\n**A recurring theme in your work appears to be a fascination with permanence. You write your models in C language and store them entirely on-chain to minimize dependencies as much as possible. You’ve also said that something you like about blacksmithing is how the tools haven’t changed in hundreds of years. At the same time, your work intentionally evokes the sounds and images of old and often obsolete technologies such as analog synthesizers, early computer graphics, and so on. How do you explain this tension?**\n\nI would argue that rather than these things being obsolete, they are fundamental, in the sense that they are closer to the underlying scientific and mathematical principles that govern them. For me, understanding how signals and information are stored, processed, and perceived is more important than whatever machine you happen to be using at the time.\n\nTo use an analogy: a Volkswagen van can be easily serviced by any mechanic, while a modern vehicle containing many microprocessors requires proprietary tools from the manufacturer. In the latter example, the connection to the underlying scientific and physical system is obscured by additional layers of complexity. As long as those layers of complexity are supported by the powers that be, the modern vehicle is more efficient, because it doesn't demand special knowledge from the user. But it's also more fragile. When the world moves on, it becomes truly obsolete.\n\nYour old smartphone is junk. On the other hand, an analog signal processor can be repaired, repurposed, and scavenged for parts. Oscilloscopes remain useful tools for electrical engineers. Vinyl and magnetic tape recordings from the 60s can still be played. ASCII terminal screens, for those who know how to use them, remain the most efficient way to interact with a computer for many tasks. \n\nOf course, I understand the trade-offs in time and convenience, but it’s an approach that I choose for myself. Having wasted lots of time adapting arbitrarily to platforms and technologies that have turned out to be transient (sometimes intentionally so), I'd much rather invest time in fundamental knowledge. Time spent this way is never wasted, regardless of the result.\n\n![Series 2 — Transmission](https://images.mirror-media.xyz/publication-images/80f80b86-a4c5-4892-8347-1e4e9244c54b.jpeg?height=720&width=720)\n\n**You write on your website that your first series, [Synth Poems](https://www.deafbeef.com/series/0), is ‘audio focused’. But in [Transmission](https://www.deafbeef.com/series/2) you’ve given more significance to the visual elements by subtly incorporating words that reflect the times we live in, like ‘fake news’, ‘new normal’, and even ‘onchain’. How do you think about the relationship between audio and images when making new work?**\n\nVisual perception and auditory perception influence one another, making the audiovisual a different medium than standalone music or animation. Small differences in synchronization make big differences perceptually. Abstract sound and images can powerfully convey a mood or feeling, giving an experience that's wholly different than the components considered separately. Experimental filmmakers understand this. For example, David Lynch does all his sound design, to great effect. Sound can completely change the context of a visual or textual narrative.\n\nI believe that audiovisual as its own medium is relatively new. There’s a lot left to explore. This video is dated, but John Whitney comments on it [here](https://www.youtube.com/watch?v=cP5Mj6ZvZJc&t=9m28s). I’m also excited to see how this area develops as technologies like AI make it easier for individual non-technical artists and composers to explore an aesthetic of tightly married sound and visuals. \n\nAs far as my own process is concerned, it varies. Sometimes the visuals come first, followed by a search for complementary sound. Sometimes it's the reverse. I'll often have a catalog of sounds and visual ideas in different states, and experiment with combining them and having them influence each other until something reveals itself.\n\nAlthough I do have a background in computer graphics and animation, when I started this project last year I intended it to be focused on generative sound/music, for simplicity’s sake. But when I started sharing on Instagram, I quickly realized that for someone to notice the audio, there would also have to be a visual component. Sound struggles to be noticed in visually dominated social media. One can scroll through feeds of images, but music requires time. I've lamented with musician friends years ago that, unfortunately, “you can't Instagram a concept album\". This is one of many examples of how social media has influenced art and artists, which in general I find interesting. Beeple's Everydays and XCOPY's animated GIFs are other examples.\n\n**NFTs have enormous potential to disrupt traditional cultural industries, just like DeFi is disrupting traditional finance. A separate question is whether they will also change the forms of culture itself, spawning new styles, genres and movements. In your view, is culture principally driven by technological change?**\n\nI'm a relative newcomer, but it was apparent to me the first time I joined a Discord channel in February that cryptoculture — with NFTs as a subset — exists, and we are currently witnessing it continue to develop and spawn all those things mentioned.\n\nIs culture principally driven by technological change? I'll offer my layman's opinion. Historically, probably not. In recent history, with the pace of change, and the growth of communication networks especially, I would say yes. But I'm not entirely with [Marshall] McLuhan. Yes, in certain cases cultures are spawned relating to particular technologies and mediums, like hacker culture and cryptoculture. In general, though, I think that the pervasiveness of communication networks transparently enables the exchange of information necessary for any subculture to thrive, as well as the cross-pollination of previously fragmented cultures.\n\nPerhaps blockchain will be the same. While there is definite cryptoculture, I think programmable distributed ledgers will eventually become a similarly transparent and enabling technology, supporting activities that influence culture, without that culture necessarily being \"about\" the medium.\n\n**You’ve previously mentioned to me that you think procedurally generated virtual architecture is an area of untapped potential in the metaverse. Could you say a little bit more about that? Is it something you’d like to explore yourself?**\n\nOf the little I've seen so far of metaverse VR worlds, I believe that most of the design/building is currently being done manually, which is very time consuming. Procedural design tools are already quite common in 'in real life' industries, such as industrial design, architecture, and game design. It seems natural and inevitable that the two realms will meet. At a basic level, this will save designers the tedium of repetitive tasks. But it could also potentially lead to the exploration of new architectural styles, free from material constraints. We might also see people employ machine learning to design by way of example. Of course, this is all dependent on metaverse platforms offering some type of programmable interface.\n\nIt's something I'd like to explore in a small way, perhaps for my own metaverse presence. I'd strongly encourage others with more domain knowledge to take it further.  \n\n**Finally, what's an influence on your work that people would be surprised by?**\n\nFrank Zappa inspired me to leave engineering school at a young age to move to a city and attempt to do creative things with music and sound recording. His spirit of experimentation, humour, business acumen, and life-long dedication to a singular vision have all influenced me, although it may be difficult to see exactly how it comes through in this work. I've followed a wandering path that may have landed somewhere else entirely if it weren't for discovering Frank in those formative years.\n\n![Series 5 — Advection](https://images.mirror-media.xyz/publication-images/f49cabd2-0492-4db1-a8b4-3c5fbc811b5d.jpeg?height=720&width=720)\n\n\n\n*If you want to learn more about 0xDEAFBEEF, check out these resources:*\n\n- ['“Constraints lead to creativity”: an interview with DEAFBEEF'](https://fingerprintsdao.medium.com/constraints-lead-to-creativity-an-interview-with-deafbeef-289e9e64ae25) by Fingerprints DAO\n- ['Thinking Outside the Glitchbox: 0xDEAFBEEF’s On-Chain Generative Art'](https://open.spotify.com/episode/0iaaoaoQJXybIBcC0eNjJj) on the Digitally Rare podcast\n- [The introduction, personal history and FAQ](https://www.deafbeef.com/about.htm) on his website\n- [0xDEAFBEEF Discord server](https://discord.com/invite/ZEWCVTpuPV)\n", "timestamp": 1626361826, "digest": "WAKai5pGG_KMGHKFH4tmWFa9dtPG1AA41Zn2KQ25fHw", "contributor": "0xAbc837FEeEb448D36173d92d9563F324bC3a273f"}
{"id": "p_1BDsG9N0BRC2uCuMs7wspKLItllV5qlKQPSUQJfa0", "title": "# Seed Club Raises $2m to build “YCombinator of Tokenized Communities”", "body": "- Seed Club is a DAO that builds and invests in communities with tokens.\n- We're proud to announce a fundraise of $2M into the DAO treasury to help usher in a new era for digital communities.\n- The round includes: Packy McCormick, Stani Kulechov, Denis Nazarov, Nascent, Sfermion and was led by IDEO CoLab Ventures.\n\n[Token #4015](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=4015&auctionId=0x7f6ce315f5fecaba49a4c2bb642c1e9db7a2123981d4104b55ff67ba533156e2)\n\n## Seed Club is a DAO that builds and invests in tokenized communities.\n\nToday it's announcing a $2 million contribution round that includes: Packy McCormick, Stani Kulechov, Denis Nazarov and led by IDEO CoLab Ventures.\n\nIn its first eight months, Seed Club contributed to or helped incubate 17 different social tokens as part of its growing portfolio including: [Squiggle DAO](https://squiggledao.com/), [ForeFront](https://twitter.com/forefront__), [Global Coin Research](https://twitter.com/Globalcoinrsrch), [PartyDAO](https://twitter.com/prtyDAO) and [Songcamp](https://twitter.com/songcamp_).\n\nToday, we welcome an outstanding group of angels, builders, collectors and funds to the DAO.\n\n**Membership now includes:**\n\n**Leading NFT collectors, creators and builders:** Jacob Horne (Zora), Gmoney (Twitter Punk), Quickrider (Flamingo DAO), Brett Shear (Palm Tree Crew), Seth Goldstein (Bright Moments Gallery), Samsonite (Leaving Records), Daniel Maegaard (SeedPhrase), Matthew Ferrick (NiftyGateway) and 6 Agency.\n\n**Social token pros:** Cooper Turley (Audius), Trevor McFedries (Brud), Reuben Bramanathan (IDEO CoLab), Carlos Gomes (Forefront), Scott Moore (Gitcoin), Wong Joon Ian (Individual), James Duncan (Square 1), Jess Sloss (Seed Club), Bradley Miles (Roll), Pet3r Pan (MetaCartel), Kevin Chou (Rally), James Young (Collab.Land), Louis Giraux (SuperRare)\n\n**Web 3 builders:** Kristen Stone (Balancer), Stani Kulechov (Aave), Denis Nazarov (Mirror), Brian Flynn (Rabbit Hole) Bobby Ong (CoinGecko), TM Lee (CoinGecko), Lawson Baker (RaRa), Fire Eyes DAO, Eric Ashdown (Covalent), Patrick Rivera (Mirror), Jarrod Dicker (Dark Star DAO)\n\n**Angels:** Packy McCormick (Not Boring), Ian Lee (IDEO CoLab), Andrew Steinwold (Sfermion), Pri Desai (The LAO), Zack Honarvar (One Day Entertainment), Dan Hannum (Hannum Capital Management), Nick Grossman (Union Square Ventures), Marc Weinstein (Mechanism Capital), Matthew Shaw (Yolo Build Co.), Jake Brukhman (CoinFund), NiMA Asghari, Megan Hannum, 0xElle (Greenfield One) and Launch House.\n\n**Forward thinking funds:** IDEO CoLab, Sfermion, Nascent, Lemniscap, Delphi Digital, Betaworks, Meta Cartel Ventures, The LAO, IOSG Ventures and Taureon\n\n## The Future is Community Capital\n\nFor too long the value that communities create online has been captured by platforms not people. We believe web 3 and social tokens invert this old dynamic and return ownership to creators and their communities.\n\nTokens give communities super powers. Today, groups of people using accessible, on-chain tools can leverage tokens to capitalize, reward, govern and grow collective value on the internet.\n\nAnd while it’s never been easier to issue a community token, the path to developing one with lasting utility and influence requires a holistic approach spanning governance, tokenomics, incentives and community organization.\n\nSeed Club brings community leaders, brands, investors and builders together to solve these complex problems and bring the best community tokens to market.\n\nWe believe there will be tokenized communities worth $Billions, and we plan to help launch them.\n\n**How We Work**\n\nThrough our Accelerator program and Studio offering, we help community token projects design their token economy, establish governance processes and grow their social and economic value. We earn a percentage of their token supply for long term alignment with our incubated communities.\n\nAs these communities/DAOs tokenize and scale, the value of the tokens in Seed Club's treasury will appreciate in parallel. By aligning incentives with these tokenized communities, Seed Club will actively participate in the growth of the overall token ecosystem.\n\nIt’s our hope that our growing community will take an active role in curating and supporting the growth of these tokenized communities, earning a stake in Seed Club in return.\n\n### You Should Join Us.\n\nStay at the cutting edge of web3 trends, help steward Seed Club’s growing social token treasury and explore new ways for digital communities to create and deliver value.\n\nStay up to date: [Subscribe to the Seed Club Newsletter](https://seedclub.substack.com/welcome)\n\nDiscord: [discord.gg/WT2fHy4](http://www.discord.gg/WT2fHy4)\nTwitter: [@seedclubhq](http://www.twitter.com/seedclubhq)\nWebsite: [seedclub.xyz](notion://www.notion.so/www.seedclub.xyz)\n\nListen to Jess Sloss on [The Delphi Podcast](https://twitter.com/Shaughnessy119/status/1400827073564979213?s=20) and [The Defiant](https://t.co/96jPb0GEVP?amp=1)", "timestamp": 1626361806, "digest": "a5PQAwU0CuHJ90lEOmzq545nlC4qqNoTVTeHEGRrqow", "contributor": "0x42DFAf5266Ad40AB4533F9806F5CC1DF4C1eB363"}
{"id": "SJu7E3lM-xS_gIRdPT2hJ3h9BvaXIpuEXN_iGjziOz0", "title": "Fundamental Knowledge: An Interview with 0xDEAFBEEF", "body": "![](https://images.mirror-media.xyz/publication-images/b181c518-1204-4a4c-8563-2fb841b024ba.jpg?height=400&width=800)\n\n*Since the beginning of 2021, the artist known as 0xDEAFBEEF has captivated the NFT community with a series of pioneering audiovisual works made using the simplest of tools: a text editor, a C compiler, and the Ethereum blockchain. Joining a lineage of on-chain generative art that stretches from [Art Blocks](https://artblocks.io/) back to [Autoglyphs](https://www.larvalabs.com/autoglyphs), 0xDEAFBEEF has consistently explored the programmable potential of his medium. In his series [Entropy](https://www.deafbeef.com/series/3), released this April, the media accompanying each token degrades with every transfer. While with his two most recent series, [Glitchbox](https://www.deafbeef.com/series/4) and [Advection](https://www.deafbeef.com/series/5), he has allowed users to 'curate' the works by altering their parameters on-chain. Combining a background in software engineering and computer graphics research with a self-taught career as a blacksmith, 0xDEAFBEEF has been likened to a “digital craftsman” who has forged a panoply of new creative possibilities for NFTs.*\n\n*JPG co-founder Sam Spike spoke to 0xDEAFBEEF about his generative art practice, the unique power of audiovisual media, and the influence that new technologies have on the development of culture.*\n\n![Series 3 — Entropy](https://images.mirror-media.xyz/publication-images/c419c5b3-6ca8-4be4-93d8-9b1df5276314.jpeg?height=720&width=720)\n\n\n\n**Sam Spike: What was your introduction to on-chain generative art? Was there a particular artist or project that caught your eye?**\n\n0xDEAFBEEF: Generative and procedural art in general is something I've been interested in since I was a child. I was introduced to it through playing ASCII dungeon crawl games, like Rogue and Nethack, that procedurally generated levels for replayability. I found that completely fascinating, and spent my youth learning to program for that purpose.\n\nAs for on-chain generative art, specifically: when first trying to understand NFTs, I believe I came across Autoglyphs but didn't pay much attention to them as I thought the outputs were quite simple. This was prior to my understanding the relevance of them being the first and written completely in Solidity.\n\nIn mid-February, I discovered the wonderful Art Blocks platform and hoped to get on board. By that point, however, the waitlist was too long, and the client side javascript wouldn’t support my work. I decided to develop my own system to directly support the way I'd already been working, with self-contained C code.\n\n**Being a generative artist means courting both order and chaos. You’re creating rules that dictate the general shape of the work, but then you’re leaving its final form to chance or, in the case of your two most recent series, to other people. Why do you choose to work this way?**\n\nI believe nearly every generative artist will agree that exploring a design space is an intensely rewarding experience. It's fun and challenging to design a system, rather than a single result. There is always the opportunity to be surprised. With enough parameters, it can become intractable for a single person to explore all the interesting corners of that design space. So with the collaborative aspect of Glitchbox, it was very rewarding to see the unique and unexpected directions taken by others. \n\nI should add that many of the interactions I've had surrounding generative art and music have been from people who want to participate and start making work of their own. Glitchbox in some sense allows that. The most common feedback from users was that it was fun and motivated them to explore further.\n\nThat being said, I don't think generative art is so radically different from some traditional art processes. Artists do not always begin their process with a finished goal in their mind. The artwork is \"grown\" through an iterative process of observing and deciding what action to take next. \n\n**A recurring theme in your work appears to be a fascination with permanence. You write your models in C language and store them entirely on-chain to minimize dependencies as much as possible. You’ve also said that something you like about blacksmithing is how the tools haven’t changed in hundreds of years. At the same time, your work intentionally evokes the sounds and images of old and often obsolete technologies such as analog synthesizers, early computer graphics, and so on. How do you explain this tension?**\n\nI would argue that rather than these things being obsolete, they are fundamental, in the sense that they are closer to the underlying scientific and mathematical principles that govern them. For me, understanding how signals and information are stored, processed, and perceived is more important than whatever machine you happen to be using at the time.\n\nTo use an analogy: a Volkswagen van can be easily serviced by any mechanic, while a modern vehicle containing many microprocessors requires proprietary tools from the manufacturer. In the latter example, the connection to the underlying scientific and physical system is obscured by additional layers of complexity. As long as those layers of complexity are supported by the powers that be, the modern vehicle is more efficient, because it doesn't demand special knowledge from the user. But it's also more fragile. When the world moves on, it becomes truly obsolete.\n\nYour old smartphone is junk. On the other hand, an analog signal processor can be repaired, repurposed, and scavenged for parts. Oscilloscopes remain useful tools for electrical engineers. Vinyl and magnetic tape recordings from the 60s can still be played. ASCII terminal screens, for those who know how to use them, remain the most efficient way to interact with a computer for many tasks. \n\nOf course, I understand the trade-offs in time and convenience, but it’s an approach that I choose for myself. Having wasted lots of time adapting arbitrarily to platforms and technologies that have turned out to be transient (sometimes intentionally so), I'd much rather invest time in fundamental knowledge. Time spent this way is never wasted, regardless of the result.\n\n![Series 2 — Transmission](https://images.mirror-media.xyz/publication-images/80f80b86-a4c5-4892-8347-1e4e9244c54b.jpeg?height=720&width=720)\n\n**You write on your website that your first series, [Synth Poems](https://www.deafbeef.com/series/0), is ‘audio focused’. But in [Transmission](https://www.deafbeef.com/series/2) you’ve given more significance to the visual elements by subtly incorporating words that reflect the times we live in, like ‘fake news’, ‘new normal’, and even ‘onchain’. How do you think about the relationship between audio and images when making new work?**\n\nVisual perception and auditory perception influence one another, making the audiovisual a different medium than standalone music or animation. Small differences in synchronization make big differences perceptually. Abstract sound and images can powerfully convey a mood or feeling, giving an experience that's wholly different than the components considered separately. Experimental filmmakers understand this. For example, David Lynch does all his sound design, to great effect. Sound can completely change the context of a visual or textual narrative.\n\nI believe that audiovisual as its own medium is relatively new. There’s a lot left to explore. This video is dated, but John Whitney comments on it [here](https://www.youtube.com/watch?v=cP5Mj6ZvZJc&t=9m28s). I’m also excited to see how this area develops as technologies like AI make it easier for individual non-technical artists and composers to explore an aesthetic of tightly married sound and visuals. \n\nAs far as my own process is concerned, it varies. Sometimes the visuals come first, followed by a search for complementary sound. Sometimes it's the reverse. I'll often have a catalog of sounds and visual ideas in different states, and experiment with combining them and having them influence each other until something reveals itself.\n\nAlthough I do have a background in computer graphics and animation, when I started this project last year I intended it to be focused on generative sound/music, for simplicity’s sake. But when I started sharing on Instagram, I quickly realized that for someone to notice the audio, there would also have to be a visual component. Sound struggles to be noticed in visually dominated social media. One can scroll through feeds of images, but music requires time. I've lamented with musician friends years ago that, unfortunately, “you can't Instagram a concept album\". This is one of many examples of how social media has influenced art and artists, which in general I find interesting. Beeple's Everydays and XCOPY's animated GIFs are other examples.\n\n**NFTs have enormous potential to disrupt traditional cultural industries, just like DeFi is disrupting traditional finance. A separate question is whether they will also change the forms of culture itself, spawning new styles, genres and movements. In your view, is culture principally driven by technological change?**\n\nI'm a relative newcomer, but it was apparent to me the first time I joined a Discord channel in February that cryptoculture — with NFTs as a subset — exists, and we are currently witnessing it continue to develop and spawn all those things mentioned.\n\nIs culture principally driven by technological change? I'll offer my layman's opinion. Historically, probably not. In recent history, with the pace of change, and the growth of communication networks especially, I would say yes. But I'm not entirely with [Marshall] McLuhan. Yes, in certain cases cultures are spawned relating to particular technologies and mediums, like hacker culture and cryptoculture. In general, though, I think that the pervasiveness of communication networks transparently enables the exchange of information necessary for any subculture to thrive, as well as the cross-pollination of previously fragmented cultures.\n\nPerhaps blockchain will be the same. While there is definite cryptoculture, I think programmable distributed ledgers will eventually become a similarly transparent and enabling technology, supporting activities that influence culture, without that culture necessarily being \"about\" the medium.\n\n**You’ve previously mentioned to me that you think procedurally generated virtual architecture is an area of untapped potential in the metaverse. Could you say a little bit more about that? Is it something you’d like to explore yourself?**\n\nOf the little I've seen so far of metaverse VR worlds, I believe that most of the design/building is currently being done manually, which is very time consuming. Procedural design tools are already quite common in 'in real life' industries, such as industrial design, architecture, and game design. It seems natural and inevitable that the two realms will meet. At a basic level, this will save designers the tedium of repetitive tasks. But it could also potentially lead to the exploration of new architectural styles, free from material constraints. We might also see people employ machine learning to design by way of example. Of course, this is all dependent on metaverse platforms offering some type of programmable interface.\n\nIt's something I'd like to explore in a small way, perhaps for my own metaverse presence. I'd strongly encourage others with more domain knowledge to take it further.  \n\n**Finally, what's an influence on your work that people would be surprised by?**\n\nFrank Zappa inspired me to leave engineering school at a young age to move to a city and attempt to do creative things with music and sound recording. His spirit of experimentation, humour, business acumen, and life-long dedication to a singular vision have all influenced me, although it may be difficult to see exactly how it comes through in this work. I've followed a wandering path that may have landed somewhere else entirely if it weren't for discovering Frank in those formative years.\n\n![Series 5 — Advection](https://images.mirror-media.xyz/publication-images/f49cabd2-0492-4db1-a8b4-3c5fbc811b5d.jpeg?height=720&width=720)\n\n\n\n*If you want to learn more about 0xDEAFBEEF, check out these resources:*\n\n- ['“Constraints lead to creativity”: an interview with DEAFBEEF'](https://fingerprintsdao.medium.com/constraints-lead-to-creativity-an-interview-with-deafbeef-289e9e64ae25) by Fingerprints DAO\n- ['Thinking Outside the Glitchbox: 0xDEAFBEEF’s On-Chain Generative Art'](https://open.spotify.com/episode/0iaaoaoQJXybIBcC0eNjJj) on the Digitally Rare podcast\n- [The introduction, personal history and FAQ](https://www.deafbeef.com/about.htm) on his website\n- [0xDEAFBEEF Discord server](https://discord.com/invite/ZEWCVTpuPV)\n", "timestamp": 1626361993, "digest": "WAKai5pGG_KMGHKFH4tmWFa9dtPG1AA41Zn2KQ25fHw", "contributor": "0xAbc837FEeEb448D36173d92d9563F324bC3a273f"}
{"id": "cqT-T6pyVWcv9Z6-HSRQVNt8u9H-4823tsrY4TDpGsY", "title": "Seed Club Raises $2m to build “YCombinator of Tokenized Communities”", "body": "- Seed Club is a DAO that builds and invests in communities with tokens.\n- We're proud to announce a fundraise of $2M into the DAO treasury to help usher in a new era for digital communities.\n- The round includes: Packy McCormick, Stani Kulechov, Denis Nazarov, Nascent, Sfermion and was led by IDEO CoLab Ventures.\n\n[Token #4015](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=4015&auctionId=0x7f6ce315f5fecaba49a4c2bb642c1e9db7a2123981d4104b55ff67ba533156e2)\n\n## Seed Club is a DAO that builds and invests in tokenized communities.\n\nToday it's announcing a $2 million contribution round that includes: Packy McCormick, Stani Kulechov, Denis Nazarov and led by IDEO CoLab Ventures.\n\nIn its first eight months, Seed Club contributed to or helped incubate 17 different social tokens as part of its growing portfolio including: [Squiggle DAO](https://squiggledao.com/), [ForeFront](https://twitter.com/forefront__), [Global Coin Research](https://twitter.com/Globalcoinrsrch), [PartyDAO](https://twitter.com/prtyDAO) and [Songcamp](https://twitter.com/songcamp_).\n\nToday, we welcome an outstanding group of angels, builders, collectors and funds to the DAO.\n\n**Membership now includes:**\n\n**Leading NFT collectors, creators and builders:** Jacob Horne (Zora), Gmoney (Twitter Punk), Quickrider (Flamingo DAO), Brett Shear (Palm Tree Crew), Seth Goldstein (Bright Moments Gallery), Samsonite (Leaving Records), Daniel Maegaard (SeedPhrase), Matthew Ferrick (NiftyGateway) and 6 Agency.\n\n**Social token pros:** Cooper Turley (Audius), Trevor McFedries (Brud), Reuben Bramanathan (IDEO CoLab), Carlos Gomes (Forefront), Scott Moore (Gitcoin), Wong Joon Ian (Individual), James Duncan (Square 1), Jess Sloss (Seed Club), Bradley Miles (Roll), Pet3r Pan (MetaCartel), Kevin Chou (Rally), James Young (Collab.Land), Louis Giraux (SuperRare) and Alex Zhang (FWB).\n\n**Web 3 builders:** Kristen Stone (Balancer), Stani Kulechov (Aave), Denis Nazarov (Mirror), Brian Flynn (Rabbit Hole) Bobby Ong (CoinGecko), TM Lee (CoinGecko), Lawson Baker (RaRa), Fire Eyes DAO, Eric Ashdown (Covalent), Patrick Rivera (Mirror), Jarrod Dicker (Dark Star DAO)\n\n**Angels:** Packy McCormick (Not Boring), Ian Lee (IDEO CoLab), Andrew Steinwold (Sfermion), Pri Desai (The LAO), Zack Honarvar (One Day Entertainment), Dan Hannum (Hannum Capital Management), Nick Grossman (Union Square Ventures), Marc Weinstein (Mechanism Capital), Matthew Shaw (Yolo Build Co.), Jake Brukhman (CoinFund), NiMA Asghari, Megan Hannum, 0xElle (Greenfield One) and Launch House.\n\n**Forward thinking funds:** IDEO CoLab, Sfermion, Nascent, Lemniscap, Delphi Digital, Betaworks, Meta Cartel Ventures, The LAO, IOSG Ventures and Taureon\n\n## The Future is Community Capital\n\nFor too long the value that communities create online has been captured by platforms not people. We believe web 3 and social tokens invert this old dynamic and return ownership to creators and their communities.\n\nTokens give communities super powers. Today, groups of people using accessible, on-chain tools can leverage tokens to capitalize, reward, govern and grow collective value on the internet.\n\nAnd while it’s never been easier to issue a community token, the path to developing one with lasting utility and influence requires a holistic approach spanning governance, tokenomics, incentives and community organization.\n\nSeed Club brings community leaders, brands, investors and builders together to solve these complex problems and bring the best community tokens to market.\n\nWe believe there will be tokenized communities worth $Billions, and we plan to help launch them.\n\n**How We Work**\n\nThrough our Accelerator program and Studio offering, we help community token projects design their token economy, establish governance processes and grow their social and economic value. We earn a percentage of their token supply for long term alignment with our incubated communities.\n\nAs these communities/DAOs tokenize and scale, the value of the tokens in Seed Club's treasury will appreciate in parallel. By aligning incentives with these tokenized communities, Seed Club will actively participate in the growth of the overall token ecosystem.\n\nIt’s our hope that our growing community will take an active role in curating and supporting the growth of these tokenized communities, earning a stake in Seed Club in return.\n\n### You Should Join Us.\n\nStay at the cutting edge of web3 trends, help steward Seed Club’s growing social token treasury and explore new ways for digital communities to create and deliver value.\n\nStay up to date: [Subscribe to the Seed Club Newsletter](https://seedclub.substack.com/welcome)\n\nDiscord: [discord.gg/WT2fHy4](http://www.discord.gg/WT2fHy4)\nTwitter: [@seedclubhq](http://www.twitter.com/seedclubhq)\nWebsite: [seedclub.xyz](notion://www.notion.so/www.seedclub.xyz)\n\nListen to Jess Sloss on [The Delphi Podcast](https://twitter.com/Shaughnessy119/status/1400827073564979213?s=20) and [The Defiant](https://t.co/96jPb0GEVP?amp=1)", "timestamp": 1626363108, "digest": "a5PQAwU0CuHJ90lEOmzq545nlC4qqNoTVTeHEGRrqow", "contributor": "0x42DFAf5266Ad40AB4533F9806F5CC1DF4C1eB363"}
{"id": "mlpSZERpWrWVIDF2RocYW3PMnxdbdtRO1z6rm26MUwE", "title": "Fundamental Knowledge: An Interview with 0xDEAFBEEF", "body": "![](https://images.mirror-media.xyz/publication-images/b181c518-1204-4a4c-8563-2fb841b024ba.jpg?height=400&width=800)\n\n*Since the beginning of 2021, the artist known as 0xDEAFBEEF has captivated the NFT community with a series of pioneering audiovisual works made using the simplest of tools: a text editor, a C compiler, and the Ethereum blockchain. Joining a lineage of on-chain generative art that stretches from [Art Blocks](https://artblocks.io/) back to [Autoglyphs](https://www.larvalabs.com/autoglyphs), 0xDEAFBEEF has consistently explored the programmable potential of his medium. In his series [Entropy](https://www.deafbeef.com/series/3), released this April, the media accompanying each token degrades with every transfer. While with his two most recent series, [Glitchbox](https://www.deafbeef.com/series/4) and [Advection](https://www.deafbeef.com/series/5), he has allowed users to 'curate' the works by altering their parameters on-chain. Combining a background in software engineering and computer graphics research with a self-taught career as a blacksmith, 0xDEAFBEEF has been likened to a “digital craftsman” who has forged a panoply of new creative possibilities for NFTs.*\n\n*JPG co-founder Sam Spike spoke to 0xDEAFBEEF about his generative art practice, the unique power of audiovisual media, and the influence that new technologies have on the development of culture.*\n\n![Series 3 — Entropy](https://images.mirror-media.xyz/publication-images/c419c5b3-6ca8-4be4-93d8-9b1df5276314.jpeg?height=720&width=720)\n\n\n\n**Sam Spike: What was your introduction to on-chain generative art? Was there a particular artist or project that caught your eye?**\n\n0xDEAFBEEF: Generative and procedural art in general is something I've been interested in since I was a child. I was introduced to it through playing ASCII dungeon crawl games, like Rogue and Nethack, that procedurally generated levels for replayability. I found that completely fascinating, and spent my youth learning to program for that purpose.\n\nAs for on-chain generative art, specifically: when first trying to understand NFTs, I believe I came across Autoglyphs but didn't pay much attention to them as I thought the outputs were quite simple. This was prior to my understanding the relevance of them being the first and written completely in Solidity.\n\nIn mid-February, I discovered the wonderful Art Blocks platform and hoped to get on board. By that point, however, the waitlist was too long, and the client side javascript wouldn’t support my work. I decided to develop my own system to directly support the way I'd already been working, with self-contained C code.\n\n**Being a generative artist means courting both order and chaos. You’re creating rules that dictate the general shape of the work, but then you’re leaving its final form to chance or, in the case of your two most recent series, to other people. Why do you choose to work this way?**\n\nI believe nearly every generative artist will agree that exploring a design space is an intensely rewarding experience. It's fun and challenging to design a system, rather than a single result. There is always the opportunity to be surprised. With enough parameters, it can become intractable for a single person to explore all the interesting corners of that design space. So with the collaborative aspect of Glitchbox, it was very rewarding to see the unique and unexpected directions taken by others. \n\nI should add that many of the interactions I've had surrounding generative art and music have been from people who want to participate and start making work of their own. Glitchbox in some sense allows that. The most common feedback from users was that it was fun and motivated them to explore further.\n\nThat being said, I don't think generative art is so radically different from some traditional art processes. Artists do not always begin their process with a finished goal in their mind. The artwork is \"grown\" through an iterative process of observing and deciding what action to take next. \n\n**A recurring theme in your work appears to be a fascination with permanence. You write your models in C language and store them entirely on-chain to minimize dependencies as much as possible. You’ve also said that something you like about blacksmithing is how the tools haven’t changed in hundreds of years. At the same time, your work intentionally evokes the sounds and images of old and often obsolete technologies such as analog synthesizers, early computer graphics, and so on. How do you explain this tension?**\n\nI would argue that rather than these things being obsolete, they are fundamental, in the sense that they are closer to the underlying scientific and mathematical principles that govern them. For me, understanding how signals and information are stored, processed, and perceived is more important than whatever machine you happen to be using at the time.\n\nTo use an analogy: a Volkswagen van can be easily serviced by any mechanic, while a modern vehicle containing many microprocessors requires proprietary tools from the manufacturer. In the latter example, the connection to the underlying scientific and physical system is obscured by additional layers of complexity. As long as those layers of complexity are supported by the powers that be, the modern vehicle is more efficient, because it doesn't demand special knowledge from the user. But it's also more fragile. When the world moves on, it becomes truly obsolete.\n\nYour old smartphone is junk. On the other hand, an analog signal processor can be repaired, repurposed, and scavenged for parts. Oscilloscopes remain useful tools for electrical engineers. Vinyl and magnetic tape recordings from the 60s can still be played. ASCII terminal screens, for those who know how to use them, remain the most efficient way to interact with a computer for many tasks. \n\nOf course, I understand the trade-offs in time and convenience, but it’s an approach that I choose for myself. Having wasted lots of time adapting arbitrarily to platforms and technologies that have turned out to be transient (sometimes intentionally so), I'd much rather invest time in fundamental knowledge. Time spent this way is never wasted, regardless of the result.\n\n![Series 2 — Transmission](https://images.mirror-media.xyz/publication-images/80f80b86-a4c5-4892-8347-1e4e9244c54b.jpeg?height=720&width=720)\n\n**You write on your website that your first series, [Synth Poems](https://www.deafbeef.com/series/0), is ‘audio focused’. But in [Transmission](https://www.deafbeef.com/series/2) you’ve given more significance to the visual elements by subtly incorporating words that reflect the times we live in, like ‘fake news’, ‘new normal’, and even ‘onchain’. How do you think about the relationship between audio and images when making new work?**\n\nVisual perception and auditory perception influence one another, making the audiovisual a different medium than standalone music or animation. Small differences in synchronization make big differences perceptually. Abstract sound and images can powerfully convey a mood or feeling, giving an experience that's wholly different than the components considered separately. Experimental filmmakers understand this. For example, David Lynch does all his sound design, to great effect. Sound can completely change the context of a visual or textual narrative.\n\nI believe that audiovisual as its own medium is relatively new. There’s a lot left to explore. This video is dated, but John Whitney comments on it [here](https://www.youtube.com/watch?v=cP5Mj6ZvZJc&t=9m28s). I’m also excited to see how this area develops as technologies like AI make it easier for individual non-technical artists and composers to explore an aesthetic of tightly married sound and visuals. \n\nAs far as my own process is concerned, it varies. Sometimes the visuals come first, followed by a search for complementary sound. Sometimes it's the reverse. I'll often have a catalog of sounds and visual ideas in different states, and experiment with combining them and having them influence each other until something reveals itself.\n\nAlthough I do have a background in computer graphics and animation, when I started this project last year I intended it to be focused on generative sound/music, for simplicity’s sake. But when I started sharing on Instagram, I quickly realized that for someone to notice the audio, there would also have to be a visual component. Sound struggles to be noticed in visually dominated social media. One can scroll through feeds of images, but music requires time. I've lamented with musician friends years ago that, unfortunately, “you can't Instagram a concept album\". This is one of many examples of how social media has influenced art and artists, which in general I find interesting. Beeple's Everydays and XCOPY's animated GIFs are other examples.\n\n**NFTs have enormous potential to disrupt traditional cultural industries, just like DeFi is disrupting traditional finance. A separate question is whether they will also change the forms of culture itself, spawning new styles, genres and movements. In your view, is culture principally driven by technological change?**\n\nI'm a relative newcomer, but it was apparent to me the first time I joined a Discord channel in February that cryptoculture — with NFTs as a subset — exists, and we are currently witnessing it continue to develop and spawn all those things mentioned.\n\nIs culture principally driven by technological change? I'll offer my layman's opinion. Historically, probably not. In recent history, with the pace of change, and the growth of communication networks especially, I would say yes. But I'm not entirely with [Marshall] McLuhan. Yes, in certain cases cultures are spawned relating to particular technologies and mediums, like hacker culture and cryptoculture. In general, though, I think that the pervasiveness of communication networks transparently enables the exchange of information necessary for any subculture to thrive, as well as the cross-pollination of previously fragmented cultures.\n\nPerhaps blockchain will be the same. While there is definite cryptoculture, I think programmable distributed ledgers will eventually become a similarly transparent and enabling technology, supporting activities that influence culture, without that culture necessarily being \"about\" the medium.\n\n**You’ve previously mentioned to me that you think procedurally generated virtual architecture is an area of untapped potential in the metaverse. Could you say a little bit more about that? Is it something you’d like to explore yourself?**\n\nOf the little I've seen so far of metaverse VR worlds, I believe that most of the design/building is currently being done manually, which is very time consuming. Procedural design tools are already quite common in 'in real life' industries, such as industrial design, architecture, and game design. It seems natural and inevitable that the two realms will meet. At a basic level, this will save designers the tedium of repetitive tasks. But it could also potentially lead to the exploration of new architectural styles, free from material constraints. We might also see people employ machine learning to design by way of example. Of course, this is all dependent on metaverse platforms offering some type of programmable interface.\n\nIt's something I'd like to explore in a small way, perhaps for my own metaverse presence. I'd strongly encourage others with more domain knowledge to take it further.  \n\n**Finally, what's an influence on your work that people would be surprised by?**\n\nFrank Zappa inspired me to leave engineering school at a young age to move to a city and attempt to do creative things with music and sound recording. His spirit of experimentation, humour, business acumen, and life-long dedication to a singular vision have all influenced me, although it may be difficult to see exactly how it comes through in this work. I've followed a wandering path that may have landed somewhere else entirely if it weren't for discovering Frank in those formative years.\n\n![Series 5 — Advection](https://images.mirror-media.xyz/publication-images/f49cabd2-0492-4db1-a8b4-3c5fbc811b5d.jpeg?height=720&width=720)\n\n\n\n*If you want to learn more about 0xDEAFBEEF, check out these resources:*\n\n- ['“Constraints lead to creativity”: an interview with DEAFBEEF'](https://fingerprintsdao.medium.com/constraints-lead-to-creativity-an-interview-with-deafbeef-289e9e64ae25) by Fingerprints DAO\n- ['Thinking Outside the Glitchbox: 0xDEAFBEEF’s On-Chain Generative Art'](https://open.spotify.com/episode/0iaaoaoQJXybIBcC0eNjJj) on the Digitally Rare podcast\n- [The introduction, personal history and FAQ](https://www.deafbeef.com/about.htm) on his website\n- [0xDEAFBEEF Discord server](https://discord.com/invite/ZEWCVTpuPV)", "timestamp": 1626367658, "digest": "wrzU5WeQEez_utHRN51Eksd4nWPmrp7GKifV7ihd5Cw", "contributor": "0xAbc837FEeEb448D36173d92d9563F324bC3a273f"}
{"id": "gGFYrHAbx3tLYnCX7TjS12GgbkgAIG_Ca0CGLRxANdA", "title": "Fundamental Knowledge: An Interview with 0xDEAFBEEF", "body": "![](https://images.mirror-media.xyz/publication-images/b181c518-1204-4a4c-8563-2fb841b024ba.jpg?height=400&width=800)\n\n*Since the beginning of 2021, the artist known as 0xDEAFBEEF has captivated the NFT community with a series of pioneering audiovisual works made using the simplest of tools: a text editor, a C compiler, and the Ethereum blockchain. Joining a lineage of on-chain generative art that stretches from [Art Blocks](https://artblocks.io/) back to [Autoglyphs](https://www.larvalabs.com/autoglyphs), 0xDEAFBEEF has consistently explored the programmable potential of his medium. In his series [Entropy](https://www.deafbeef.com/series/3), released this April, the media accompanying each token degrades with every transfer. While with his two most recent series, [Glitchbox](https://www.deafbeef.com/series/4) and [Advection](https://www.deafbeef.com/series/5), he has allowed users to 'curate' the works by altering their parameters on-chain. Combining a background in software engineering and computer graphics research with a self-taught career as a blacksmith, 0xDEAFBEEF has been likened to a “digital craftsman” who has forged a panoply of new creative possibilities for NFTs.*\n\n*JPG co-founder Sam Spike spoke to 0xDEAFBEEF about his generative art practice, the unique power of audiovisual media, and the influence that new technologies have on the development of culture.*\n\n![Series 3 — Entropy](https://images.mirror-media.xyz/publication-images/c419c5b3-6ca8-4be4-93d8-9b1df5276314.jpeg?height=720&width=720)\n\n\n\n**Sam Spike: What was your introduction to on-chain generative art? Was there a particular artist or project that caught your eye?**\n\n0xDEAFBEEF: Generative and procedural art in general is something I've been interested in since I was a child. I was introduced to it through playing ASCII dungeon crawl games, like Rogue and Nethack, that procedurally generated levels for replayability. I found that completely fascinating, and spent my youth learning to program for that purpose.\n\nAs for on-chain generative art, specifically: when first trying to understand NFTs, I believe I came across Autoglyphs but didn't pay much attention to them as I thought the outputs were quite simple. This was prior to my understanding the relevance of them being the first and written completely in Solidity.\n\nIn mid-February, I discovered the wonderful Art Blocks platform and hoped to get on board. By that point, however, the waitlist was too long, and the client side javascript wouldn’t support my work. I decided to develop my own system to directly support the way I'd already been working, with self-contained C code.\n\n**Being a generative artist means courting both order and chaos. You’re creating rules that dictate the general shape of the work, but then you’re leaving its final form to chance or, in the case of your two most recent series, to other people. Why do you choose to work this way?**\n\nI believe nearly every generative artist will agree that exploring a design space is an intensely rewarding experience. It's fun and challenging to design a system, rather than a single result. There is always the opportunity to be surprised. With enough parameters, it can become intractable for a single person to explore all the interesting corners of that design space. So with the collaborative aspect of Glitchbox, it was very rewarding to see the unique and unexpected directions taken by others. \n\nI should add that many of the interactions I've had surrounding generative art and music have been from people who want to participate and start making work of their own. Glitchbox in some sense allows that. The most common feedback from users was that it was fun and motivated them to explore further.\n\nThat being said, I don't think generative art is so radically different from some traditional art processes. Artists do not always begin their process with a finished goal in their mind. The artwork is \"grown\" through an iterative process of observing and deciding what action to take next. \n\n**A recurring theme in your work appears to be a fascination with permanence. You write your models in C language and store them entirely on-chain to minimize dependencies as much as possible. You’ve also said that something you like about blacksmithing is how the tools haven’t changed in hundreds of years. At the same time, your work intentionally evokes the sounds and images of old and often obsolete technologies such as analog synthesizers, early computer graphics, and so on. How do you explain this tension?**\n\nI would argue that rather than these things being obsolete, they are fundamental, in the sense that they are closer to the underlying scientific and mathematical principles that govern them. For me, understanding how signals and information are stored, processed, and perceived is more important than whatever machine you happen to be using at the time.\n\nTo use an analogy: a Volkswagen van can be easily serviced by any mechanic, while a modern vehicle containing many microprocessors requires proprietary tools from the manufacturer. In the latter example, the connection to the underlying scientific and physical system is obscured by additional layers of complexity. As long as those layers of complexity are supported by the powers that be, the modern vehicle is more efficient, because it doesn't demand special knowledge from the user. But it's also more fragile. When the world moves on, it becomes truly obsolete.\n\nYour old smartphone is junk. On the other hand, an analog signal processor can be repaired, repurposed, and scavenged for parts. Oscilloscopes remain useful tools for electrical engineers. Vinyl and magnetic tape recordings from the 60s can still be played. ASCII terminal screens, for those who know how to use them, remain the most efficient way to interact with a computer for many tasks. \n\nOf course, I understand the trade-offs in time and convenience, but it’s an approach that I choose for myself. Having wasted lots of time adapting arbitrarily to platforms and technologies that have turned out to be transient (sometimes intentionally so), I'd much rather invest time in fundamental knowledge. Time spent this way is never wasted, regardless of the result.\n\n![Series 2 — Transmission](https://images.mirror-media.xyz/publication-images/80f80b86-a4c5-4892-8347-1e4e9244c54b.jpeg?height=720&width=720)\n\n**You write on your website that your first series, [Synth Poems](https://www.deafbeef.com/series/0), is ‘audio focused’. But in [Transmission](https://www.deafbeef.com/series/2) you’ve given more significance to the visual elements by subtly incorporating words that reflect the times we live in, like ‘fake news’, ‘new normal’, and even ‘onchain’. How do you think about the relationship between audio and images when making new work?**\n\nVisual perception and auditory perception influence one another, making the audiovisual a different medium than standalone music or animation. Small differences in synchronization make big differences perceptually. Abstract sound and images can powerfully convey a mood or feeling, giving an experience that's wholly different than the components considered separately. Experimental filmmakers understand this. For example, David Lynch does all his sound design, to great effect. Sound can completely change the context of a visual or textual narrative.\n\nI believe that audiovisual as its own medium is relatively new. There’s a lot left to explore. This video is dated, but John Whitney comments on it [here](https://www.youtube.com/watch?v=cP5Mj6ZvZJc&t=9m28s). I’m also excited to see how this area develops as technologies like AI make it easier for individual non-technical artists and composers to explore an aesthetic of tightly married sound and visuals. \n\nAs far as my own process is concerned, it varies. Sometimes the visuals come first, followed by a search for complementary sound. Sometimes it's the reverse. I'll often have a catalog of sounds and visual ideas in different states, and experiment with combining them and having them influence each other until something reveals itself.\n\nAlthough I do have a background in computer graphics and animation, when I started this project last year I intended it to be focused on generative sound/music, for simplicity’s sake. But when I started sharing on Instagram, I quickly realized that for someone to notice the audio, there would also have to be a visual component. Sound struggles to be noticed in visually dominated social media. One can scroll through feeds of images, but music requires time. I've lamented with musician friends years ago that, unfortunately, “you can't Instagram a concept album\". This is one of many examples of how social media has influenced art and artists, which in general I find interesting. Beeple's Everydays and XCOPY's animated GIFs are other examples.\n\n**NFTs have enormous potential to disrupt traditional cultural industries, just like DeFi is disrupting traditional finance. A separate question is whether they will also change the forms of culture itself, spawning new styles, genres and movements. In your view, is culture principally driven by technological change?**\n\nI'm a relative newcomer, but it was apparent to me the first time I joined a Discord channel in February that cryptoculture — with NFTs as a subset — exists, and we are currently witnessing it continue to develop and spawn all those things mentioned.\n\nIs culture principally driven by technological change? I'll offer my layman's opinion. Historically, probably not. In recent history, with the pace of change, and the growth of communication networks especially, I would say yes. But I'm not entirely with [Marshall] McLuhan. Yes, in certain cases cultures are spawned relating to particular technologies and mediums, like hacker culture and cryptoculture. In general, though, I think that the pervasiveness of communication networks transparently enables the exchange of information necessary for any subculture to thrive, as well as the cross-pollination of previously fragmented cultures.\n\nPerhaps blockchain will be the same. While there is definite cryptoculture, I think programmable distributed ledgers will eventually become a similarly transparent and enabling technology, supporting activities that influence culture, without that culture necessarily being \"about\" the medium.\n\n**You’ve previously mentioned to me that you think procedurally generated virtual architecture is an area of untapped potential in the metaverse. Could you say a little bit more about that? Is it something you’d like to explore yourself?**\n\nOf the little I've seen so far of metaverse VR worlds, I believe that most of the design/building is currently being done manually, which is very time consuming. Procedural design tools are already quite common in 'in real life' industries, such as industrial design, architecture, and game design. It seems natural and inevitable that the two realms will meet. At a basic level, this will save designers the tedium of repetitive tasks. But it could also potentially lead to the exploration of new architectural styles, free from material constraints. We might also see people employ machine learning to design by way of example. Of course, this is all dependent on metaverse platforms offering some type of programmable interface.\n\nIt's something I'd like to explore in a small way, perhaps for my own metaverse presence. I'd strongly encourage others with more domain knowledge to take it further.  \n\n**Finally, what's an influence on your work that people would be surprised by?**\n\nFrank Zappa inspired me to leave engineering school at a young age to move to a city and attempt to do creative things with music and sound recording. His spirit of experimentation, humour, business acumen, and life-long dedication to a singular vision have all influenced me, although it may be difficult to see exactly how it comes through in this work. I've followed a wandering path that may have landed somewhere else entirely if it weren't for discovering Frank in those formative years.\n\n![Series 5 — Advection](https://images.mirror-media.xyz/publication-images/f49cabd2-0492-4db1-a8b4-3c5fbc811b5d.jpeg?height=720&width=720)\n\n\n\n*If you want to learn more about 0xDEAFBEEF, check out these resources:*\n\n- ['“Constraints lead to creativity”: an interview with DEAFBEEF'](https://fingerprintsdao.medium.com/constraints-lead-to-creativity-an-interview-with-deafbeef-289e9e64ae25) by Fingerprints DAO\n- ['Thinking Outside the Glitchbox: 0xDEAFBEEF’s On-Chain Generative Art'](https://open.spotify.com/episode/0iaaoaoQJXybIBcC0eNjJj) on the Digitally Rare podcast\n- [The introduction, personal history and FAQ](https://www.deafbeef.com/about.htm) on his website\n- [0xDEAFBEEF Discord server](https://discord.com/invite/ZEWCVTpuPV)", "timestamp": 1626367761, "digest": "wrzU5WeQEez_utHRN51Eksd4nWPmrp7GKifV7ihd5Cw", "contributor": "0xAbc837FEeEb448D36173d92d9563F324bC3a273f"}
{"id": "g51Kq3ehfOa3u95x50A5KlzvC2guUujPeLN9qS2epqE", "title": "Fundamental Knowledge: An Interview with 0xDEAFBEEF", "body": "![](https://images.mirror-media.xyz/publication-images/b181c518-1204-4a4c-8563-2fb841b024ba.jpg?height=400&width=800)\n\n*Since the beginning of 2021, the artist known as 0xDEAFBEEF has captivated the NFT community with a series of pioneering audiovisual works made using the simplest of tools: a text editor, a C compiler, and the Ethereum blockchain. Joining a lineage of on-chain generative art that stretches from [Art Blocks](https://artblocks.io/) back to [Autoglyphs](https://www.larvalabs.com/autoglyphs), 0xDEAFBEEF has consistently explored the programmable potential of his medium. In his series [Entropy](https://www.deafbeef.com/series/3), released this April, the media accompanying each token degrades with every transfer. While with his two most recent series, [Glitchbox](https://www.deafbeef.com/series/4) and [Advection](https://www.deafbeef.com/series/5), he has allowed users to 'curate' the works by altering their parameters on-chain. Combining a background in software engineering and computer graphics research with a self-taught career as a blacksmith, 0xDEAFBEEF has been likened to a “digital craftsman” who has forged a panoply of new creative possibilities for NFTs.*\n\n*JPG co-founder Sam Spike spoke to 0xDEAFBEEF about his generative art practice, the unique power of audiovisual media, and the influence that new technologies have on the development of culture.*\n\n![Series 3 — Entropy](https://images.mirror-media.xyz/publication-images/c419c5b3-6ca8-4be4-93d8-9b1df5276314.jpeg?height=720&width=720)\n\n\n\n**Sam Spike: What was your introduction to on-chain generative art? Was there a particular artist or project that caught your eye?**\n\n0xDEAFBEEF: Generative and procedural art in general is something I've been interested in since I was a child. I was introduced to it through playing ASCII dungeon crawl games, like Rogue and Nethack, that procedurally generated levels for replayability. I found that completely fascinating, and spent my youth learning to program for that purpose.\n\nAs for on-chain generative art, specifically: when first trying to understand NFTs, I believe I came across Autoglyphs but didn't pay much attention to them as I thought the outputs were quite simple. This was prior to my understanding the relevance of them being the first and written completely in Solidity.\n\nIn mid-February, I discovered the wonderful Art Blocks platform and hoped to get on board. By that point, however, the waitlist was too long, and the client side javascript wouldn’t support my work. I decided to develop my own system to directly support the way I'd already been working, with self-contained C code.\n\n**Being a generative artist means courting both order and chaos. You’re creating rules that dictate the general shape of the work, but then you’re leaving its final form to chance or, in the case of your two most recent series, to other people. Why do you choose to work this way?**\n\nI believe nearly every generative artist will agree that exploring a design space is an intensely rewarding experience. It's fun and challenging to design a system, rather than a single result. There is always the opportunity to be surprised. With enough parameters, it can become intractable for a single person to explore all the interesting corners of that design space. So with the collaborative aspect of Glitchbox, it was very rewarding to see the unique and unexpected directions taken by others. \n\nI should add that many of the interactions I've had surrounding generative art and music have been from people who want to participate and start making work of their own. Glitchbox in some sense allows that. The most common feedback from users was that it was fun and motivated them to explore further.\n\nThat being said, I don't think generative art is so radically different from some traditional art processes. Artists do not always begin their process with a finished goal in their mind. The artwork is \"grown\" through an iterative process of observing and deciding what action to take next. \n\n**A recurring theme in your work appears to be a fascination with permanence. You write your models in C language and store them entirely on-chain to minimize dependencies as much as possible. You’ve also said that something you like about blacksmithing is how the tools haven’t changed in hundreds of years. At the same time, your work intentionally evokes the sounds and images of old and often obsolete technologies such as analog synthesizers, early computer graphics, and so on. How do you explain this tension?**\n\nI would argue that rather than these things being obsolete, they are fundamental, in the sense that they are closer to the underlying scientific and mathematical principles that govern them. For me, understanding how signals and information are stored, processed, and perceived is more important than whatever machine you happen to be using at the time.\n\nTo use an analogy: a Volkswagen van can be easily serviced by any mechanic, while a modern vehicle containing many microprocessors requires proprietary tools from the manufacturer. In the latter example, the connection to the underlying scientific and physical system is obscured by additional layers of complexity. As long as those layers of complexity are supported by the powers that be, the modern vehicle is more efficient, because it doesn't demand special knowledge from the user. But it's also more fragile. When the world moves on, it becomes truly obsolete.\n\nYour old smartphone is junk. On the other hand, an analog signal processor can be repaired, repurposed, and scavenged for parts. Oscilloscopes remain useful tools for electrical engineers. Vinyl and magnetic tape recordings from the 60s can still be played. ASCII terminal screens, for those who know how to use them, remain the most efficient way to interact with a computer for many tasks. \n\nOf course, I understand the trade-offs in time and convenience, but it’s an approach that I choose for myself. Having wasted lots of time adapting arbitrarily to platforms and technologies that have turned out to be transient (sometimes intentionally so), I'd much rather invest time in fundamental knowledge. Time spent this way is never wasted, regardless of the result.\n\n![Series 2 — Transmission](https://images.mirror-media.xyz/publication-images/80f80b86-a4c5-4892-8347-1e4e9244c54b.jpeg?height=720&width=720)\n\n**You write on your website that your first series, [Synth Poems](https://www.deafbeef.com/series/0), is ‘audio focused’. But in [Transmission](https://www.deafbeef.com/series/2) you’ve given more significance to the visual elements by subtly incorporating words that reflect the times we live in, like ‘fake news’, ‘new normal’, and even ‘onchain’. How do you think about the relationship between audio and images when making new work?**\n\nVisual perception and auditory perception influence one another, making the audiovisual a different medium than standalone music or animation. Small differences in synchronization make big differences perceptually. Abstract sound and images can powerfully convey a mood or feeling, giving an experience that's wholly different than the components considered separately. Experimental filmmakers understand this. For example, David Lynch does all his sound design, to great effect. Sound can completely change the context of a visual or textual narrative.\n\nI believe that audiovisual as its own medium is relatively new. There’s a lot left to explore. This video is dated, but John Whitney comments on it [here](https://www.youtube.com/watch?v=cP5Mj6ZvZJc&t=9m28s). I’m also excited to see how this area develops as technologies like AI make it easier for individual non-technical artists and composers to explore an aesthetic of tightly married sound and visuals. \n\nAs far as my own process is concerned, it varies. Sometimes the visuals come first, followed by a search for complementary sound. Sometimes it's the reverse. I'll often have a catalog of sounds and visual ideas in different states, and experiment with combining them and having them influence each other until something reveals itself.\n\nAlthough I do have a background in computer graphics and animation, when I started this project last year I intended it to be focused on generative sound/music, for simplicity’s sake. But when I started sharing on Instagram, I quickly realized that for someone to notice the audio, there would also have to be a visual component. Sound struggles to be noticed in visually dominated social media. One can scroll through feeds of images, but music requires time. I've lamented with musician friends years ago that, unfortunately, “you can't Instagram a concept album\". This is one of many examples of how social media has influenced art and artists, which in general I find interesting. Beeple's Everydays and XCOPY's animated GIFs are other examples.\n\n**NFTs have enormous potential to disrupt traditional cultural industries, just like DeFi is disrupting traditional finance. A separate question is whether they will also change the forms of culture itself, spawning new styles, genres and movements. In your view, is culture principally driven by technological change?**\n\nI'm a relative newcomer, but it was apparent to me the first time I joined a Discord channel in February that cryptoculture — with NFTs as a subset — exists, and we are currently witnessing it continue to develop and spawn all those things mentioned.\n\nIs culture principally driven by technological change? I'll offer my layman's opinion. Historically, probably not. In recent history, with the pace of change, and the growth of communication networks especially, I would say yes. But I'm not entirely with [Marshall] McLuhan. Yes, in certain cases cultures are spawned relating to particular technologies and mediums, like hacker culture and cryptoculture. In general, though, I think that the pervasiveness of communication networks transparently enables the exchange of information necessary for any subculture to thrive, as well as the cross-pollination of previously fragmented cultures.\n\nPerhaps blockchain will be the same. While there is definite cryptoculture, I think programmable distributed ledgers will eventually become a similarly transparent and enabling technology, supporting activities that influence culture, without that culture necessarily being \"about\" the medium.\n\n**You’ve previously mentioned to me that you think procedurally generated virtual architecture is an area of untapped potential in the metaverse. Could you say a little bit more about that? Is it something you’d like to explore yourself?**\n\nOf the little I've seen so far of metaverse VR worlds, I believe that most of the design/building is currently being done manually, which is very time consuming. Procedural design tools are already quite common in 'in real life' industries, such as industrial design, architecture, and game design. It seems natural and inevitable that the two realms will meet. At a basic level, this will save designers the tedium of repetitive tasks. But it could also potentially lead to the exploration of new architectural styles, free from material constraints. We might also see people employ machine learning to design by way of example. Of course, this is all dependent on metaverse platforms offering some type of programmable interface.\n\nIt's something I'd like to explore in a small way, perhaps for my own metaverse presence. I'd strongly encourage others with more domain knowledge to take it further.  \n\n**Finally, what's an influence on your work that people would be surprised by?**\n\nFrank Zappa inspired me to leave engineering school at a young age to move to a city and attempt to do creative things with music and sound recording. His spirit of experimentation, humour, business acumen, and life-long dedication to a singular vision have all influenced me, although it may be difficult to see exactly how it comes through in this work. I've followed a wandering path that may have landed somewhere else entirely if it weren't for discovering Frank in those formative years.\n\n![Series 5 — Advection](https://images.mirror-media.xyz/publication-images/f49cabd2-0492-4db1-a8b4-3c5fbc811b5d.jpeg?height=720&width=720)\n\n\n\n*If you want to learn more about 0xDEAFBEEF, check out these resources:*\n\n- ['“Constraints lead to creativity”: an interview with DEAFBEEF'](https://fingerprintsdao.medium.com/constraints-lead-to-creativity-an-interview-with-deafbeef-289e9e64ae25) by Fingerprints DAO\n- ['Thinking Outside the Glitchbox: 0xDEAFBEEF’s On-Chain Generative Art'](https://open.spotify.com/episode/0iaaoaoQJXybIBcC0eNjJj) on the Digitally Rare podcast\n- [The introduction, personal history and FAQ](https://www.deafbeef.com/about.htm) on his website\n- [0xDEAFBEEF Discord server](https://discord.com/invite/ZEWCVTpuPV)", "timestamp": 1626368084, "digest": "qSUps1Krz02iyW8FCWHiEcHGaLrslw6BSldJQpuD9_A", "contributor": "0xAbc837FEeEb448D36173d92d9563F324bC3a273f"}
{"id": "KitZqGra3cHin2K-7NwY53XkgbiK_-YsOWj0fNEg-8Q", "title": "Seed Club Raises $2m to build “YCombinator of Tokenized Communities”", "body": "- Seed Club is a DAO that builds and invests in communities with tokens.\n- We're proud to announce a fundraise of $2M into the DAO treasury to help usher in a new era for digital communities.\n- The round includes: Packy McCormick, Stani Kulechov, Denis Nazarov, Nascent, Sfermion and was led by IDEO CoLab Ventures.\n\n[Token #4015](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=4015&auctionId=0x7f6ce315f5fecaba49a4c2bb642c1e9db7a2123981d4104b55ff67ba533156e2)\n\n## Seed Club is a DAO that builds and invests in tokenized communities.\n\nToday it's announcing a $2 million contribution round that includes: Packy McCormick, Stani Kulechov, Denis Nazarov and led by IDEO CoLab Ventures.\n\nIn its first eight months, Seed Club contributed to or helped incubate 17 different social tokens as part of its growing portfolio including: [Squiggle DAO](https://squiggledao.com/), [ForeFront](https://twitter.com/forefront__), [Global Coin Research](https://twitter.com/Globalcoinrsrch), [PartyDAO](https://twitter.com/prtyDAO) and [Songcamp](https://twitter.com/songcamp_).\n\nToday, we welcome an outstanding group of angels, builders, collectors and funds to the DAO.\n\n**Membership now includes:**\n\n**Leading NFT collectors, creators and builders:** Jacob Horne (Zora), Gmoney (Twitter Punk), Quickrider (Flamingo DAO), Brett Shear (Palm Tree Crew), Seth Goldstein (Bright Moments Gallery), Samsonite (Leaving Records), Daniel Maegaard (SeedPhrase), Matthew Ferrick (NiftyGateway) and 6 Agency.\n\n**Social token pros:** Cooper Turley (Audius), Trevor McFedries (Brud), Reuben Bramanathan (IDEO CoLab), Carlos Gomes (Forefront), Scott Moore (Gitcoin), Wong Joon Ian (Individual), James Duncan (Square 1), Jess Sloss (Seed Club), Bradley Miles (Roll), Pet3r Pan (MetaCartel), Kevin Chou (Rally), James Young (Collab.Land), Louis Giraux (SuperRare) and Alex Zhang (FWB).\n\n**Web 3 builders:** Kristen Stone (Balancer), Stani Kulechov (Aave), Denis Nazarov (Mirror), Brian Flynn (Rabbit Hole) Bobby Ong (CoinGecko), TM Lee (CoinGecko), Lawson Baker (RaRa), Fire Eyes DAO, Eric Ashdown (Covalent), Patrick Rivera (Mirror), Jarrod Dicker (Dark Star DAO)\n\n**Angels:** Packy McCormick (Not Boring), Ian Lee (IDEO CoLab), Andrew Steinwold (Sfermion), Pri Desai (The LAO), Zack Honarvar (One Day Entertainment), Dan Hannum (Hannum Capital Management), Nick Grossman (Union Square Ventures), Marc Weinstein (Mechanism Capital), Matthew Shaw (Yolo Build Co.), Jake Brukhman (CoinFund), NiMA Asghari, Megan Hannum, 0xElle (Greenfield One) and Launch House.\n\n**Forward thinking funds:** IDEO CoLab, Sfermion, Nascent, Lemniscap, Delphi Digital, Betaworks, Meta Cartel Ventures, The LAO, IOSG Ventures and Taureon\n\n## The Future is Community Capital\n\nFor too long the value that communities create online has been captured by platforms not people. We believe web 3 and social tokens invert this old dynamic and return ownership to creators and their communities.\n\nTokens give communities super powers. Today, groups of people using accessible, on-chain tools can leverage tokens to capitalize, reward, govern and grow collective value on the internet.\n\nAnd while it’s never been easier to issue a community token, the path to developing one with lasting utility and influence requires a holistic approach spanning governance, tokenomics, incentives and community organization.\n\nSeed Club brings community leaders, brands, investors and builders together to solve these complex problems and bring the best community tokens to market.\n\nWe believe there will be tokenized communities worth $Billions, and we plan to help launch them.\n\n**How We Work**\n\nThrough our Accelerator program and Studio offering, we help community token projects design their token economy, establish governance processes and grow their social and economic value. We earn a percentage of their token supply for long term alignment with our incubated communities.\n\nAs these communities/DAOs tokenize and scale, the value of the tokens in Seed Club's treasury will appreciate in parallel. By aligning incentives with these tokenized communities, Seed Club will actively participate in the growth of the overall token ecosystem.\n\nIt’s our hope that our growing community will take an active role in curating and supporting the growth of these tokenized communities, earning a stake in Seed Club in return.\n\n### You Should Join Us.\n\nStay at the cutting edge of web3 trends, help steward Seed Club’s growing social token treasury and explore new ways for digital communities to create and deliver value.\n\nStay up to date: [Subscribe to the Seed Club Newsletter](https://seedclub.substack.com/welcome)\n\nDiscord: [discord.gg/WT2fHy4](http://www.discord.gg/WT2fHy4)\nTwitter: [@seedclubhq](http://www.twitter.com/seedclubhq)\nWebsite: [seedclub.xyz](notion://www.notion.so/www.seedclub.xyz)\n\nListen to Jess Sloss on [The Delphi Podcast](https://twitter.com/Shaughnessy119/status/1400827073564979213?s=20) and [The Defiant](https://t.co/96jPb0GEVP?amp=1)", "timestamp": 1626371001, "digest": "a5PQAwU0CuHJ90lEOmzq545nlC4qqNoTVTeHEGRrqow", "contributor": "0x42DFAf5266Ad40AB4533F9806F5CC1DF4C1eB363"}
{"id": "3Cbe5gVIvewl9BfWR1_5gYUGL-OUYIoKWelOPyBYgBI", "title": "Introducing Mirror Club", "body": "*Introducing Mirror Club by Seed Club, a Grant Giving DAO designed to support creators and give those looking for opportunities in DAOs, hands-on experience.*\n\nIt’s no secret, we're big fans of Mirror.\n\nFrom being the first official winner of the [$WRITE RACE](https://mirror.xyz/race), to helping launch projects like Not Boring’s [Power to the Person](https://notboring.mirror.xyz/SPV_-bchriVn_ncDj8OgnLccSb5qAsU0sXNpg9y_UTk) (first use of splits), Mint Fund’s $BOUNTY (first smart contract sold as an NFT) and Colin and Samir’s [Seat at the Table NFT](https://colinandsamir.mirror.xyz/G5kD1SysIvVE-Socv7zknOExp3wZWZPSZ9_sxBj_cV4) (the first use of a PartyBid contract), we’ve seen the power that easy to access web 3 tools can unlock for creators.\n\nWe’re also big fans of DAOs.\n\nSeed Club is a DAO that builds and invests in communities with tokens. Our community is full of thousands of smart, talented individuals looking to get hands-on experience working for a DAO.\n\nA common frustration we hear from many is how hard it is to “break into” existing DAOs. There are hundreds of people who want to participate, but have yet to find their way into an operational role.\n\nSo we asked ourselves …\n\nWhat if we used Mirror’s full set of creator empowering tools to launch a DAO that supports creative projects on Mirror, and gives individuals hands-on experience in building and operating a DAO?\n\nWell, today we’re excited to announce Mirror Club: a Grant Giving DAO designed to support creators and make it easy for individuals to gain valuable DAO experience.\n\n### Mirror Club starts now with the $mCLUB crowdfund.\n\nHere’s the game plan.\n\n- Backers can support the crowdfund with ETH in return for $mCLUB tokens.\n- $mCLUB tokens represent membership in Mirror Club.\n- The first feature of Mirror Club will be a tokenized Discord, gated by $mCLUB. Backers will immediately be able to access the Mirror Club section of the Seed Club Discord.\n- $mCLUB holders, with the support of Seed Club, will coordinate in the Discord to decide on a plan for governance and how to allocate the contributed funds.\n- 50% of $mCLUB supply will be held back to airdrop toon quality community members who'd like to participate but may not be able to back the project with ETH.\n- The crowdfund will target a fundraise of 25 ETH, which will be deposited into a multisig governed by the backers at mirror.club.eth\n\nSo what will the Mirror Club DAO do?\n\nThat’s really up to you.\n\nPerhaps the DAO becomes known for being the first backer of the most inspiring creative projects launching on Mirror. It might help recruit new creators into the Mirror ecosystem (and help them win a future $WRITE RACE), or help steward the development of new features, templates and modules. The DAO could even launch its own MediaDAO, funding its operations using NFTs and splits.\n\nThe future is up to $mCLUB holders.\n\n[Mirror Club](crowdfund://0xEF42258fB2B3f2ac0Ccf545240b7332B4ba4bB25?version=tiered_1&network=rinkeby&features=overview)\n\n[Mirror Club](crowdfund://0xEF42258fB2B3f2ac0Ccf545240b7332B4ba4bB25?version=tiered_1&network=rinkeby&features=backers)\n\n[Mirror Club](crowdfund://0xEF42258fB2B3f2ac0Ccf545240b7332B4ba4bB25?version=tiered_1&network=rinkeby&features=editions)\n\n[Hepburn](edition://0x92F424663F2E52DeDa4471D4560157eFEC7fAAd0?editionId=28&version=crowdfund_1)\n\n[Nietzsche](edition://0x92F424663F2E52DeDa4471D4560157eFEC7fAAd0?editionId=29&version=crowdfund_1)\n\n[Zen](edition://0x92F424663F2E52DeDa4471D4560157eFEC7fAAd0?editionId=30&version=crowdfund_1)\n", "timestamp": 1626373623, "digest": "p0q6UuQYQHHvlBbcjqzpD0MC_t3R1DhO3cRZgWfbdDE", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "ANxX7DWYGwQAZZe1Oh5cUT-rvNOyDyFNOREhEOmp7Pg", "title": "Seed Club Raises $2m to build “YCombinator of Tokenized Communities”", "body": "- Seed Club is a DAO that builds and invests in communities with tokens.\n- We're proud to announce a fundraise of $2M into the DAO treasury to help usher in a new era for digital communities.\n- The round includes: Packy McCormick, Stani Kulechov, Denis Nazarov, Nascent, Sfermion and was led by IDEO CoLab Ventures.\n\n[Token #4015](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=4015&auctionId=0x7f6ce315f5fecaba49a4c2bb642c1e9db7a2123981d4104b55ff67ba533156e2)\n\n## Seed Club is a DAO that builds and invests in tokenized communities.\n\nToday it's announcing a $2 million contribution round that includes: Packy McCormick, Stani Kulechov, Denis Nazarov and led by IDEO CoLab Ventures.\n\nIn its first eight months, Seed Club contributed to or helped incubate 17 different social tokens as part of its growing portfolio including: [Squiggle DAO](https://squiggledao.com/), [ForeFront](https://twitter.com/forefront__), [Global Coin Research](https://twitter.com/Globalcoinrsrch), [PartyDAO](https://twitter.com/prtyDAO) and [Songcamp](https://twitter.com/songcamp_).\n\nToday, we welcome an outstanding group of angels, builders, collectors and funds to the DAO.\n\n**Membership now includes:**\n\n**Leading NFT collectors, creators and builders:** Jacob Horne (Zora), Gmoney (Twitter Punk), Quickrider (Flamingo DAO), Brett Shear (Palm Tree Crew), Seth Goldstein (Bright Moments Gallery), Samsonite (Leaving Records), Daniel Maegaard (SeedPhrase), Matthew Ferrick (NiftyGateway) and 6 Agency.\n\n**Social token pros:** Cooper Turley (Audius), Trevor McFedries (Brud), Reuben Bramanathan (IDEO CoLab), Carlos Gomes (Forefront), Scott Moore (Gitcoin), Wong Joon Ian (Individual), James Duncan (Square 1), Jess Sloss (Seed Club), Bradley Miles (Roll), Pet3r Pan (MetaCartel), Kevin Chou (Rally), James Young (Collab.Land), Louis Giraux (SuperRare) and Alex Zhang (FWB).\n\n**Web 3 builders:** Kristen Stone (Balancer), Stani Kulechov (Aave), Denis Nazarov (Mirror), Brian Flynn (Rabbit Hole) Bobby Ong (CoinGecko), TM Lee (CoinGecko), Lawson Baker (RaRa), Fire Eyes DAO, Eric Ashdown (Covalent), Patrick Rivera (Mirror), Jarrod Dicker (Dark Star DAO)\n\n**Angels:** Packy McCormick (Not Boring), Ian Lee (IDEO CoLab), Andrew Steinwold (Sfermion), Pri Desai (The LAO), Zack Honarvar (One Day Entertainment), Dan Hannum (Hannum Capital Management), Nick Grossman (Union Square Ventures), Marc Weinstein (Mechanism Capital), Matthew Shaw (Yolo Build Co.), Jake Brukhman (CoinFund), NiMA Asghari, Megan Hannum, 0xElle (Greenfield One) and Launch House.\n\n**Forward thinking funds:** IDEO CoLab, Sfermion, Nascent, Lemniscap, Delphi Digital, Betaworks, Meta Cartel Ventures, The LAO, IOSG Ventures and Taureon\n\n## The Future is Community Capital\n\nFor too long the value that communities create online has been captured by platforms not people. We believe web 3 and social tokens invert this old dynamic and return ownership to creators and their communities.\n\nTokens give communities super powers. Today, groups of people using accessible, on-chain tools can leverage tokens to capitalize, reward, govern and grow collective value on the internet.\n\nAnd while it’s never been easier to issue a community token, the path to developing one with lasting utility and influence requires a holistic approach spanning governance, tokenomics, incentives and community organization.\n\nSeed Club brings community leaders, brands, investors and builders together to solve these complex problems and bring the best community tokens to market.\n\nWe believe there will be tokenized communities worth $Billions, and we plan to help launch them.\n\n**How We Work**\n\nThrough our Accelerator program and Studio offering, we help community token projects design their token economy, establish governance processes and grow their social and economic value. We earn a percentage of their token supply for long term alignment with our incubated communities.\n\nAs these communities/DAOs tokenize and scale, the value of the tokens in Seed Club's treasury will appreciate in parallel. By aligning incentives with these tokenized communities, Seed Club will actively participate in the growth of the overall token ecosystem.\n\nIt’s our hope that our growing community will take an active role in curating and supporting the growth of these tokenized communities, earning a stake in Seed Club in return.\n\n### You Should Join Us.\n\nStay at the cutting edge of web3 trends, help steward Seed Club’s growing social token treasury and explore new ways for digital communities to create and deliver value.\n\nFor now, the best way to get involved is to join our community on Discord.\n\nStay up to date: [Subscribe to the Seed Club Newsletter](https://seedclub.substack.com/welcome)\n\nDiscord: [discord.gg/WT2fHy4](http://www.discord.gg/WT2fHy4)\nTwitter: [@seedclubhq](http://www.twitter.com/seedclubhq)\nWebsite: [seedclub.xyz](notion://www.notion.so/www.seedclub.xyz)\n\nListen to Jess Sloss on [The Delphi Podcast](https://twitter.com/Shaughnessy119/status/1400827073564979213?s=20) and [The Defiant](https://t.co/96jPb0GEVP?amp=1)", "timestamp": 1626375440, "digest": "a5PQAwU0CuHJ90lEOmzq545nlC4qqNoTVTeHEGRrqow", "contributor": "0x42DFAf5266Ad40AB4533F9806F5CC1DF4C1eB363"}
{"id": "wYME3b1jmhiRvSPcnkgVJd1gngGdsVd1rcdt45fQviw", "title": "This longhorn is an NFT", "body": "At [Creator Cabins](https://twitter.com/creatorcabins), we like to think about the intersection of crypto and physical property. In order to contribute to that conversation, we're selling a Texas Longhorn on-chain 🤠\n\nYes, a real live cow (well, technically a steer). His name is DH-Esteereum. You can own 1/4th of him by purchasing an NFT edition below:\n\n[D-H Esteereum](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=35)\n\nEach 1/4 stake can be converted into...steaks. More precisely, ~35-38 pounds of lean grass-fed/free-range longhorn beef, in the form of steaks, roasts, and hamburger meat. Available for pickup at Creator Cabins outside of Austin, TX any time in the next year. Local purchasers only, processing included!\n\nI suppose someone with a soft heart could buy a majority stake in D-H Esteereum and choose to spare his life. If there's no majority consensus on what to do with the cow, you'll have to start the world's smallest DAO and figure it out 🤷\n\nIn addition to your share of the cow, you get to keep the NFT edition as a memento to commemorate your purchase of the first-ever (??) ownership of a living creature minted on-chain.\n\nProceeds go to doublehelixranch.eth, our friendly neighborhood longhorn ranchers in the Texas Hill Country. Thanks to Nat Eliason for the tweet that turned this from a joke into reality:\n\nhttps://twitter.com/nateliason/status/1415464640876879872", "timestamp": 1626377620, "digest": "OmwhMeOpeK8MJTBhHV0RpQmqh1mYMMpcJir97pTZyEQ", "contributor": "0xbeC26FFa12c90217943D1b2958f60A821aE6E549"}
{"id": "llicHZOOQENenOMQ71RkmI_QYRKNXA9-klS59mvXMtw", "title": "Leaving Records Introducing GENRE DAO", "body": "**Where we’ve been**\nLeaving Records, established 2008/9, is an all-genre artist community and record label founded by Matthew David McQueen (A.K.A. Matthewdavid), nearing 200 releases from artists worldwide.\n\n**Where we are going** \nThe new technologies and [mindsets powering Web 3.0](https://medium.com/fabric-ventures/what-is-web-3-0-why-it-matters-934eb07f3d2b) can profoundly change how music is created, appreciated, and shared between artists and their communities. In our efforts to be on the cutting edge of this technological revolution, Leaving Records is honored to be challenging the notion of what a record label could be in the 21st Century. \n\nCollectively-governed entities known as DAOs (Decentralized Autonomous Organizations) allow like-minded people across the Internet to come together to achieve shared goals in a radically new way. Without relying on a single authority figure, the DAO’s operations are decided upon by its members. \n\nWe owe our sustainability to artists, friends, and supporters — **the community**. Experimenting in Web 3.0 territory, we will now engage in ways to further the coordination & operation of Leaving Records from within our community.       \n\n\n**Introducing GENRE DAO**\nGENRE is our community token that symbolizes membership in the Leaving Records All-Genre DAO community. GENRE is also a governance token for the GENRE DAO community members, including (but not limited to) Artists from the Leaving Records catalog, Day1 NFT holders, and the greater community adding value to the GENRE DAO Treasury (more details on this to come).\n\n![](https://images.mirror-media.xyz/publication-images/08690161-da17-4f37-8be3-fbdc8c53f576.jpeg?height=3953&width=3953)\n\n\n**Leaving Records All-Genre DAO Values**\n- Providing a safe space for the uplifting of underground, experimental, and marginalized music & community via our resources platform.\n- All Genre-embracing curation & facilitation via record label platform + publicly accessible events platform online and IRL.\n- Advocation of alternative, experimental lifestyle & creative practice.\n\n\n**We are here now** \nJoin our Discord to claim 10 GENRE here: (https://discord.gg/zwPsCpzfjX). We look forward to collaborating and co-creating the future of Leaving Records with you. \n\n\n", "timestamp": 1626379494, "digest": "PHJ-Z8DkEjBwLZrJBrdzTCoVh0iAoYoye8Aoi1Fy1OM", "contributor": "0xE3309Dd02F1f7254b8CbE478ac7b5519802E151c"}
{"id": "HFi959I7jby_HunWbeQOctEcX-0KbhJW5jEUD-5suXE", "title": "Social Token Refresh", "body": "Social tokens. Community tokens. Creator coins. DAOs.\n\nThe terms you hear every day have evolved into a movement with no signs of slowing down.\n\nIn the time that’s passed since the [2020 Social Token Year in Review](https://2020inreview.forefront.news/), what was once a nascent sector has become a hotbed for the industry’s most creative minds to explore the intersection of financial and social capital.\n\n[](https://twitter.com/Cooopahtroopa/status/1343606740894568448?s=20)\n\nIn this refresh, we’ll provide a snapshot of what’s transpired alongside insights, analysis and predictions for what’s to come.\n\nBuckle up - we’re going to cover a lot, fast.\n\n## Social Token Refresh\n\nThree key themes to recap 2021 in social tokens thus far.\n\n*Seasons*\n\nSeasons are a fixed time interval for a community to identify and reward active contributors. It often involves a pre-defined threshold of tokens or social status required to access a Season, and revolves around one core theme.\n\nCredit to [Simon de la Rouviere](https://blog.simondlr.com/posts/seasons-longevity-in-community-tokens), many social token communities are playing around with the idea of seasons including Friends with Benefits, Forefront, Gitcoin and Bankless DAO.\n\n*Hacks*\n\nIn March, the social token community underwent its biggest growing pain to date following an [exploit of Roll](https://thedefiant.io/social-tokens-get-rolled-on/) - a social token issuer. Many of the more well known tokens suffered a liquidity crisis when one rogue actor sold ~$5.7M tokens on the open market across communities like FWB, WHALE, and JULIEN. All projects have subsequently recovered, with some - like FWB - [issuing a new token](https://medium.com/friends-with-benefits/introducing-fwb-pro-313d62183678) to start with a clean slate.\n\n*Raises*\n\nSocial token projects secured years of runway to build the infrastructure for a community owned future. Notable raises included [Coinvise](https://coinvise.substack.com/p/coinvise-raises-25m-to-build-a-social), [Rally](https://www.coindesk.com/social-token-platform-rally-raises-22m-in-rly-sale-on-coinlist), [Calaxy](https://www.coindesk.com/spencer-dinwiddies-crypto-app-for-creators-raises-7-5m) and [Bitclout](https://www.businessofbusiness.com/articles/inside-the-rise-of-bitclout-a-crypto-based-social-network-influencers-andreessen-horowitz-sequoia/). These rounds showed the first signs of funds investing serious capital into social token infrastructure plays.\n\n## Social Token 2021 Map\n\nIn recent months, social tokens have taken a turn.\n\nThe below map depicts **new tokens** which have joined the fold - broadly categorized by where they live.\n\n*Note: the below map is subjective. There are likely tokens which have been left out. This map is meant to represent the most active social tokens today, rather than to highlight every social token in existence.*\n\n![](https://images.mirror-media.xyz/publication-images/7c280bb5-5b12-470d-bf30-6a2d9bc34856.jpeg?height=2880&width=5120)\n\n### Mainnet\n\nHome to most notable community tokens today, mainnet tokens are issued everywhere from Roll to Coinvise, with some tokens deploying their own smart contracts. Mainnet tokens benefit from the full composability of its respective protocol - often meaning more tooling around governance, distribution and access.\n\nMany of the most popular community tokens on mainnet have fully transitioned into a DAO - sharing a vast majority of the supply and treasury with their community. While leading the charge on decentralization, mainnet tokens typically tend to be for deep crypto-native communities familiar with web3 tooling.\n\n[](https://twitter.com/Cooopahtroopa/status/1408158533783228416?s=20)\n\n### Rally\n\nHome to non-crypto native communities, Rally tokens - known as Creator Coins - are starting to show the first sign of mainstream crossover thanks to influential creators with established audiences and following on platforms like Twitch, TikTok, Spotify and Instagram. Rally is currently a permissioned network operating as a sidechain, giving creators the benefits of fiat onramps and gasless transactions for centralization. Each week, holders of Creator Coins on Rally earn governance tokens, RLY, through the Creator Rewards program.\n\nDelphi Digital recently conducted an [economic audit of Rally](https://forum.rally.io/t/proposal-token-bonding-curve-examination-tbc-templates/925), proposing new ideas and sharing insights into Rally’s bonding curves. I highly recommend reading about their work [here](https://forum.rally.io/t/proposal-token-bonding-curve-examination-tbc-templates/925).\n\n### BitClout\n\nRounding out the chart is the contentious sleeper pick - BitClout. While many have mixed thoughts on the ecosystem, BitClout offers a simple onramp to a Creator Economy by connecting a social profile like Twitter or Instagram. Leading creators on BitClout are now driving a number of ecosystem projects to build on top of the protocol, including new features like Diamonds to reward interactions with micro-tips.\n\nRegardless of where you fall on BitClout, it’s undeniable there is a growing community. Keep an eye out for tools and platforms to better connect tokenholders and show that BitClout can be about more than just speculation.\n\n## Community Highlights\n\n### Friends with Benefits\n\nExploring the intersection of culture and crypto, FWB is pioneering what it means to work for a DAO - currently undergoing its [third formal Season](https://fwb.mirror.xyz/TvKSPfZqHNXRZVYFYyJuziCMIZ8fZ34q585YcUYRGtc). After bouncing back from a Roll hack and launching FWB Pro, Friends with Benefits provides a glimpse into what DAO sustainability looks like when it comes to creating a cultural membership to remember.\n\nWith one IRL event under its belt, Friends with Benefits is now [taking its talents to Paris](https://twitter.com/FWBtweets/status/1415080861448372225?s=20) - setting a precedent for a suite of IRL products to complement one of the fastest growing communities in crypto.\n\n**Market Cap:** $4.7M\n**Discord Members:** 1714\n**Token Holders:** 2473\n\n### Forefront\n\nResources are critical to learning. But what happens when you crowdsource that knowledge and share ownership of it with those creating it? \n\nForefront is a leading curator in the social token community newly backed by the [FF token](https://www.coingecko.com/en/coins/forefront). While still in the early stages, one session in the Forefront Discord will have you begging for more.\n\nOver the coming weeks, Forefront will introduce its first Season - giving contributors onramps to help build the Home for Social Tokens.\n\n**Market Cap:** $242k\n**Discord Members:** 1513\n**Token Holders:** 1191\n\n### Bankless DAO\n\nGoing Bankless is a hell of a lot easier when you’ve got a family to do it with you. Beyond the leading DeFi media brand Bankless has developed, its now entered the social token conversation with a token - [BANK](https://www.coingecko.com/en/coins/bankless-dao). Contributors are now owning new partnership funnels, developing partnerships with projects like Index Coop and MetaFactory. If you’re into DeFi and looking to own the narrative, the Bankless DAO is for you.\n\n**Market Cap:** $5.2M\n**Discord Members:** 1600\n**Token Holders:** 3320\n\n### Seed Club\n\nAs an incubator and investor, Seed Club works directly with creators to take their social token from 0 to 1. Along the way, Seed Club itself is maturing as a DAO - hiring contributors, bootstrapping funding and building mainstream onboarding funnels. If you’re looking to see what it looks like to start your own Creator Economy, Seed Club is the exact right place for you.\n\nHaving just announced its Seed Round (no pun intended) the next few months will likely see Seed Club’s native token - CLUB - go from a non-transferable reputation token to something that rivals all the above mentioned social tokens on the market. The time to contribute is now!\n\n[](https://twitter.com/seedclubhq/status/1415693072571060225?s=20)\n\n**Market Cap:** SoonTM\n**Discord Members:** 3231\n**Token Holders:** 63\n\n## Latest Tools\n\nLooking to start your own social token? Here’s what all the pros are using today.\n\n- Mirror - Web3 publishing platform to crowdfund creative projects.\n- Coordinape - Distribution tool to reward active contributors with tokens through group votes.\n- Snapshot - Off-chain voting solution for token-based governance.\n- Gnosis Safe - Custody of community treasuries using a multi-sig wallet.\n- Parcel // Multisend - Treasury management solution to track and distribute budgets.\n- POAP - NFTs tied to specific events to reward attendees and build social graphs.\n- Mintgate - Platform to gate content which can only be unlocked by holding certain tokens. \n- Bonfire - Creator tools to distribute, analyze and engage community members.\n\n## What’s Next?\n\n*Treasury Diversification*\n\nExpect more social token projects to raise working capital through Treasury Diversification proposals. These events allow ecosystem contributors to purchase tokens directly from a community treasury, assuming tokenholders approve of it through governance.\n\n*DAO Servicing*\n\nGrants committees, treasury management and acquisitions. Three of the many areas where teams are building products and services to better serve the next generation of social token communities. \n\n*Legal Structures*\n\nDid someone say Wyoming? While there’s talk of DAO legislation, expect more standards to emerge around how to launch a social token, and around how to turn that community into a DAO.\n\n*Governance Frameworks*\n\nStandards around governance are a must. While we’re starting to see early signs of templates across DeFi, expect the next wave to paint clear pictures around rewarding active contributors, setting monthly budgets and onboarding formal roles.\n\n## Top Stories\n\n[Cooper Turley] - [How to Launch a Token](https://forefront.news/blog/how-to-launch-a-token)\n[Li Jin] - [The Case for Universal Creator Income](https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g)\n[Alex Masmej] [Why Creator Tokens Will Precede Community Tokens](https://future.a16z.com/creator-before-community/)\n[Patrick Rivera] [A Guide to Crypto Tokens](https://future.a16z.com/a-taxonomy-of-tokens-distinctions-with-a-difference/)\n[Dark Star] [Creator DAOs - An OS for Participation](https://darkstar.mirror.xyz/Tf9IS6yNxtPXwC5mmfi_UISe8v6BOfef2bDmQSxoJao)\n[Austin Robey] [Ways to Improve Community Ownership](https://ff.mirror.xyz/ZRsr5HZMfbHOEe2lIYoWinRCI65NlvDW_QzEu1rn7As)\n[Joey Debruin] [The Audience Grows the Creator](https://forefront.news/blog/guest-joey-the-audience-grows-the-creator)\n[Packy McCormick] [The Cooperation Economy](https://www.notboring.co/p/the-cooperation-economy)\n[Kinjal Shah] [When Consumer Meets Crypto](https://medium.com/blockchain-capital-blog/when-consumer-meets-crypto-e42ad4db7384)\n[Mason Nystrom] [The Evolution of Content Platforms](https://messari.io/article/the-evolution-of-content-platforms?utm_source=MasonNystrom&utm_medium=ledetweet&utm_campaign=contentevolution)\n[Cooper Turley + Kinjal Shah] [The Rise of Micro-Economies](https://coopahtroopa.mirror.xyz/gWY6Kfebs9wHdfoZZswfiLTBVzfKiyFaIwNf2q8JpgI)\n\n## Closing Thoughts\n\nSlowly but surely, social tokens mature by the day.\n\nWhile we’re a long way from meaningful mainstream adoption, niche communities are developing at a significant pace.\n\nWhat’s most notable about each of these respective communities is their willingness to collaborate, coordinate, and win together. It’s very common to see members tap into each other’s Discord - frequently sharing learnings on townhalls, events and panels.\n\nIf you’re new to the social token space and looking to get involved, shoot me a DM on Discord @cooaphtroopa#9799 - I’m confident there’s a community for you.\n\nUntil then, keep building - the whole social token community is right there with you.\n\nWith love,\n\n- Coopahtroopa", "timestamp": 1626391188, "digest": "DYSs-mhdJi1uXZTaiyJfwiFZYAF9kRK6yBsAplk6A68", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "HVxNdOVM0aZdqjX84dGl38cG0AUZMMVAPC9M4D3glAw", "title": "Social Token Refresh", "body": "A Coopah x [ForeFront](https://forefront.news/) Collab.\n\nSocial tokens. Community tokens. Creator coins. DAOs.\n\nThe terms you hear every day have evolved into a movement with no signs of slowing down.\n\nIn the time that’s passed since the [2020 Social Token Year in Review](https://2020inreview.forefront.news/), what was once a nascent sector has become a hotbed for the industry’s most creative minds to explore the intersection of financial and social capital.\n\n[](https://twitter.com/Cooopahtroopa/status/1343606740894568448?s=20)\n\nIn this refresh, we’ll provide a snapshot of what’s transpired alongside insights, analysis and predictions for what’s to come.\n\nBuckle up - we’re going to cover a lot, fast.\n\n## Social Token Refresh\n\nThree key themes to recap 2021 in social tokens thus far.\n\n*Seasons*\n\nSeasons are a fixed time interval for a community to identify and reward active contributors. It often involves a pre-defined threshold of tokens or social status required to access a Season, and revolves around one core theme.\n\nCredit to [Simon de la Rouviere](https://blog.simondlr.com/posts/seasons-longevity-in-community-tokens), many social token communities are playing around with the idea of seasons including Friends with Benefits, Forefront, Gitcoin and Bankless DAO.\n\n*Hacks*\n\nIn March, the social token community underwent its biggest growing pain to date following an [exploit of Roll](https://thedefiant.io/social-tokens-get-rolled-on/) - a social token issuer. Many of the more well known tokens suffered a liquidity crisis when one rogue actor sold ~$5.7M tokens on the open market across communities like FWB, WHALE, and JULIEN. All projects have subsequently recovered, with some - like FWB - [issuing a new token](https://medium.com/friends-with-benefits/introducing-fwb-pro-313d62183678) to start with a clean slate.\n\n*Raises*\n\nSocial token projects secured years of runway to build the infrastructure for a community owned future. Notable raises included [Coinvise](https://coinvise.substack.com/p/coinvise-raises-25m-to-build-a-social), [Rally](https://www.coindesk.com/social-token-platform-rally-raises-22m-in-rly-sale-on-coinlist), [Calaxy](https://www.coindesk.com/spencer-dinwiddies-crypto-app-for-creators-raises-7-5m) and [Bitclout](https://www.businessofbusiness.com/articles/inside-the-rise-of-bitclout-a-crypto-based-social-network-influencers-andreessen-horowitz-sequoia/). These rounds showed the first signs of funds investing serious capital into social token infrastructure plays.\n\n## Social Token 2021 Map\n\nIn recent months, social tokens have taken a turn.\n\nThe below map depicts **new tokens** which have joined the fold - broadly categorized by where they live.\n\n*Note: the below map is subjective. There are likely tokens which have been left out. This map is meant to represent the most active social tokens today, rather than to highlight every social token in existence.*\n\n![](https://images.mirror-media.xyz/publication-images/7c280bb5-5b12-470d-bf30-6a2d9bc34856.jpeg?height=2880&width=5120)\n\n### Mainnet\n\nHome to most notable community tokens today, mainnet tokens are issued everywhere from Roll to Coinvise, with some tokens deploying their own smart contracts. Mainnet tokens benefit from the full composability of its respective protocol - often meaning more tooling around governance, distribution and access.\n\nMany of the most popular community tokens on mainnet have fully transitioned into a DAO - sharing a vast majority of the supply and treasury with their community. While leading the charge on decentralization, mainnet tokens typically tend to be for deep crypto-native communities familiar with web3 tooling.\n\n[](https://twitter.com/Cooopahtroopa/status/1408158533783228416?s=20)\n\n### Rally\n\nHome to non-crypto native communities, Rally tokens - known as Creator Coins - are starting to show the first sign of mainstream crossover thanks to influential creators with established audiences and following on platforms like Twitch, TikTok, Spotify and Instagram. Rally is currently a permissioned network operating as a sidechain, giving creators the benefits of fiat onramps and gasless transactions for centralization. Each week, holders of Creator Coins on Rally earn governance tokens, RLY, through the Creator Rewards program.\n\nDelphi Digital recently conducted an [economic audit of Rally](https://forum.rally.io/t/proposal-token-bonding-curve-examination-tbc-templates/925), proposing new ideas and sharing insights into Rally’s bonding curves. I highly recommend reading about their work [here](https://forum.rally.io/t/proposal-token-bonding-curve-examination-tbc-templates/925).\n\n### BitClout\n\nRounding out the chart is the contentious sleeper pick - BitClout. While many have mixed thoughts on the ecosystem, BitClout offers a simple onramp to a Creator Economy by connecting a social profile like Twitter or Instagram. Leading creators on BitClout are now driving a number of ecosystem projects to build on top of the protocol, including new features like Diamonds to reward interactions with micro-tips.\n\nRegardless of where you fall on BitClout, it’s undeniable there is a growing community. Keep an eye out for tools and platforms to better connect tokenholders and show that BitClout can be about more than just speculation.\n\n## Community Highlights\n\n### Friends with Benefits\n\nExploring the intersection of culture and crypto, FWB is pioneering what it means to work for a DAO - currently undergoing its [third formal Season](https://fwb.mirror.xyz/TvKSPfZqHNXRZVYFYyJuziCMIZ8fZ34q585YcUYRGtc). After bouncing back from a Roll hack and launching FWB Pro, Friends with Benefits provides a glimpse into what DAO sustainability looks like when it comes to creating a cultural membership to remember.\n\nWith one IRL event under its belt, Friends with Benefits is now [taking its talents to Paris](https://twitter.com/FWBtweets/status/1415080861448372225?s=20) - setting a precedent for a suite of IRL products to complement one of the fastest growing communities in crypto.\n\n**Market Cap:** $4.7M\n**Discord Members:** 1714\n**Token Holders:** 2473\n\n### Forefront\n\nResources are critical to learning. But what happens when you crowdsource that knowledge and share ownership of it with those creating it? \n\nForefront is a leading curator in the social token community newly backed by the [FF token](https://www.coingecko.com/en/coins/forefront). While still in the early stages, one session in the Forefront Discord will have you begging for more.\n\nOver the coming weeks, Forefront will introduce its first Season - giving contributors onramps to help build the Home for Social Tokens.\n\n**Market Cap:** $242k\n**Discord Members:** 1513\n**Token Holders:** 1191\n\n### Bankless DAO\n\nGoing Bankless is a hell of a lot easier when you’ve got a family to do it with you. Beyond the leading DeFi media brand Bankless has developed, its now entered the social token conversation with a token - [BANK](https://www.coingecko.com/en/coins/bankless-dao). Contributors are now owning new partnership funnels, developing partnerships with projects like Index Coop and MetaFactory. If you’re into DeFi and looking to own the narrative, the Bankless DAO is for you.\n\n**Market Cap:** $5.2M\n**Discord Members:** 1600\n**Token Holders:** 3320\n\n### Seed Club\n\nAs an incubator and investor, Seed Club works directly with creators to take their social token from 0 to 1. Along the way, Seed Club itself is maturing as a DAO - hiring contributors, bootstrapping funding and building mainstream onboarding funnels. If you’re looking to see what it looks like to start your own Creator Economy, Seed Club is the exact right place for you.\n\nHaving just announced its Seed Round (no pun intended) the next few months will likely see Seed Club’s native token - CLUB - go from a non-transferable reputation token to something that rivals all the above mentioned social tokens on the market. The time to contribute is now!\n\n[](https://twitter.com/seedclubhq/status/1415693072571060225?s=20)\n\n**Market Cap:** SoonTM\n**Discord Members:** 3231\n**Token Holders:** 63\n\n## Latest Tools\n\nLooking to start your own social token? Here’s what all the pros are using today.\n\n- Mirror - Web3 publishing platform to crowdfund creative projects.\n- Coordinape - Distribution tool to reward active contributors with tokens through group votes.\n- Snapshot - Off-chain voting solution for token-based governance.\n- Gnosis Safe - Custody of community treasuries using a multi-sig wallet.\n- Parcel // Multisend - Treasury management solution to track and distribute budgets.\n- POAP - NFTs tied to specific events to reward attendees and build social graphs.\n- Mintgate - Platform to gate content which can only be unlocked by holding certain tokens. \n- Bonfire - Creator tools to distribute, analyze and engage community members.\n\n## What’s Next?\n\n*Treasury Diversification*\n\nExpect more social token projects to raise working capital through Treasury Diversification proposals. These events allow ecosystem contributors to purchase tokens directly from a community treasury, assuming tokenholders approve of it through governance.\n\n*DAO Servicing*\n\nGrants committees, treasury management and acquisitions. Three of the many areas where teams are building products and services to better serve the next generation of social token communities. \n\n*Legal Structures*\n\nDid someone say Wyoming? While there’s talk of DAO legislation, expect more standards to emerge around how to launch a social token, and around how to turn that community into a DAO.\n\n*Governance Frameworks*\n\nStandards around governance are a must. While we’re starting to see early signs of templates across DeFi, expect the next wave to paint clear pictures around rewarding active contributors, setting monthly budgets and onboarding formal roles.\n\n## Top Stories\n\n[Cooper Turley] - [How to Launch a Token](https://forefront.news/blog/how-to-launch-a-token)\n[Li Jin] - [The Case for Universal Creator Income](https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g)\n[Alex Masmej] [Why Creator Tokens Will Precede Community Tokens](https://future.a16z.com/creator-before-community/)\n[Patrick Rivera] [A Guide to Crypto Tokens](https://future.a16z.com/a-taxonomy-of-tokens-distinctions-with-a-difference/)\n[Dark Star] [Creator DAOs - An OS for Participation](https://darkstar.mirror.xyz/Tf9IS6yNxtPXwC5mmfi_UISe8v6BOfef2bDmQSxoJao)\n[Austin Robey] [Ways to Improve Community Ownership](https://ff.mirror.xyz/ZRsr5HZMfbHOEe2lIYoWinRCI65NlvDW_QzEu1rn7As)\n[Joey Debruin] [The Audience Grows the Creator](https://forefront.news/blog/guest-joey-the-audience-grows-the-creator)\n[Packy McCormick] [The Cooperation Economy](https://www.notboring.co/p/the-cooperation-economy)\n[Kinjal Shah] [When Consumer Meets Crypto](https://medium.com/blockchain-capital-blog/when-consumer-meets-crypto-e42ad4db7384)\n[Mason Nystrom] [The Evolution of Content Platforms](https://messari.io/article/the-evolution-of-content-platforms?utm_source=MasonNystrom&utm_medium=ledetweet&utm_campaign=contentevolution)\n[Cooper Turley + Kinjal Shah] [The Rise of Micro-Economies](https://coopahtroopa.mirror.xyz/gWY6Kfebs9wHdfoZZswfiLTBVzfKiyFaIwNf2q8JpgI)\n\n## Closing Thoughts\n\nSlowly but surely, social tokens mature by the day.\n\nWhile we’re a long way from meaningful mainstream adoption, niche communities are developing at a significant pace.\n\nWhat’s most notable about each of these respective communities is their willingness to collaborate, coordinate, and win together. It’s very common to see members tap into each other’s Discord - frequently sharing learnings on townhalls, events and panels.\n\nIf you’re new to the social token space and looking to get involved, shoot me a DM on Discord @cooaphtroopa#9799 - I’m confident there’s a community for you.\n\nUntil then, keep building - the whole social token community is right there with you.\n\nWith love,\n\n- Coopahtroopa\n\nWant to see more Refreshes like this one? Leave a tip to show your support!\n\n[Social Token Refresh](split://0x23545b1B8DC8Dd30C7bCC16e9214540Fa37BFB18?network=mainnet)", "timestamp": 1626391680, "digest": "DYSs-mhdJi1uXZTaiyJfwiFZYAF9kRK6yBsAplk6A68", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "2s5yRiP4jp82wHW9O3soq_IG_qgYUkqCIFofJZ2aVmE", "title": "Leaving Records Introducing GENRE DAO", "body": "**Where we’ve been**\nLeaving Records, established 2008/9, is an all-genre artist community and record label founded by Matthew David McQueen (A.K.A. Matthewdavid), nearing 200 releases from artists worldwide.\n\n**Where we are going** \nThe new technologies and [mindsets powering Web 3.0](https://medium.com/fabric-ventures/what-is-web-3-0-why-it-matters-934eb07f3d2b) can profoundly change how music is created, appreciated, and shared between artists and their communities. In our efforts to be on the cutting edge of this technological revolution, Leaving Records is honored to be challenging the notion of what a record label could be in the 21st Century. \n\nCollectively-governed entities known as DAOs (Decentralized Autonomous Organizations) allow like-minded people across the Internet to come together to achieve shared goals in a radically new way. Without relying on a single authority figure, the DAO’s operations are decided upon by its members. \n\nWe owe our sustainability to artists, friends, and supporters — **the community**. Experimenting in Web 3.0 territory, we will now engage in ways to further the coordination & operation of Leaving Records from within our community.       \n\n\n**Introducing GENRE DAO**\nGENRE is our community token that symbolizes membership in the Leaving Records All-Genre DAO community. GENRE is also a governance token for the GENRE DAO community members, including (but not limited to) Artists from the Leaving Records catalog, Day1 NFT holders, and the greater community adding value to the GENRE DAO Treasury (more details on this to come).\n\n![](https://images.mirror-media.xyz/publication-images/08690161-da17-4f37-8be3-fbdc8c53f576.jpeg?height=3953&width=3953)\n\n\n**Leaving Records All-Genre DAO Values**\n- Providing a safe space for the uplifting of underground, experimental, and marginalized music & community via our resources platform.\n- All Genre-embracing curation & facilitation via record label platform + publicly accessible events platform online and IRL.\n- Advocation of alternative, experimental lifestyle & creative practice.\n\n\n**We are here now** \nJoin our Discord to claim 10 GENRE here: (https://discord.gg/zwPsCpzfjX). We look forward to collaborating and co-creating the future of Leaving Records with you. \n\nPS: This post is an NFT. Funds raised from this article will be the first initiative into the GENRE DAO Treasury. The owner will receive an ALL GENRE swag set. Plus 100 Genre Tokens. \n\n\n", "timestamp": 1626393566, "digest": "PHJ-Z8DkEjBwLZrJBrdzTCoVh0iAoYoye8Aoi1Fy1OM", "contributor": "0xE3309Dd02F1f7254b8CbE478ac7b5519802E151c"}
{"id": "ZwEbigKhA6sBT9VLGnEntfkNGN2uhRB4R5XaEZ9fMN8", "title": "Leaving Records Introducing GENRE DAO", "body": "**Where we’ve been**\nLeaving Records, established 2008/9, is an all-genre artist community and record label founded by Matthew David McQueen (A.K.A. Matthewdavid), nearing 200 releases from artists worldwide.\n\n**Where we are going** \nThe new technologies and [mindsets powering Web 3.0](https://medium.com/fabric-ventures/what-is-web-3-0-why-it-matters-934eb07f3d2b) can profoundly change how music is created, appreciated, and shared between artists and their communities. In our efforts to be on the cutting edge of this technological revolution, Leaving Records is honored to be challenging the notion of what a record label could be in the 21st Century. \n\nCollectively-governed entities known as DAOs (Decentralized Autonomous Organizations) allow like-minded people across the Internet to come together to achieve shared goals in a radically new way. Without relying on a single authority figure, the DAO’s operations are decided upon by its members. \n\nWe owe our sustainability to artists, friends, and supporters — **the community**. Experimenting in Web 3.0 territory, we will now engage in ways to further the coordination & operation of Leaving Records from within our community.       \n\n\n**Introducing GENRE DAO**\nGENRE is our community token that symbolizes membership in the Leaving Records All-Genre DAO community. GENRE is also a governance token for the GENRE DAO community members, including (but not limited to) Artists from the Leaving Records catalog, Day1 NFT holders, and the greater community adding value to the GENRE DAO Treasury (more details on this to come).\n\n![](https://images.mirror-media.xyz/publication-images/08690161-da17-4f37-8be3-fbdc8c53f576.jpeg?height=3953&width=3953)\n\n*Artwork by [Dazer](https://www.ddazerr.com/) (aka Jordan Rundle)*\n\n\n**Leaving Records All-Genre DAO Values**\n- Providing a safe space for the uplifting of underground, experimental, and marginalized music & community via our resources platform.\n- All Genre-embracing curation & facilitation via record label platform + publicly accessible events platform online and IRL.\n- Advocation of alternative, experimental lifestyle & creative practice.\n\n\n**We are here now** \nJoin our Discord to claim 10 GENRE here: (https://discord.gg/zwPsCpzfjX). We look forward to collaborating and co-creating the future of Leaving Records with you. \n\nPS: This post is an NFT. Funds raised from this article will be the first initiative into the GENRE DAO Treasury. The owner will receive an ALL GENRE swag set. Plus 100 Genre Tokens. \n\n\n", "timestamp": 1626394818, "digest": "PHJ-Z8DkEjBwLZrJBrdzTCoVh0iAoYoye8Aoi1Fy1OM", "contributor": "0xE3309Dd02F1f7254b8CbE478ac7b5519802E151c"}
{"id": "ehrRo-1lxKSAEs1EK2hH8EoMebUJPE-gM4BUBRmjbgc", "title": "Leaving Records Introducing GENRE DAO", "body": "**Where we’ve been**\nLeaving Records, established 2008/9, is an all-genre artist community and record label founded by Matthew David McQueen (A.K.A. Matthewdavid), nearing 200 releases from artists worldwide.\n\n**Where we are going** \nThe new technologies and [mindsets powering Web 3.0](https://medium.com/fabric-ventures/what-is-web-3-0-why-it-matters-934eb07f3d2b) can profoundly change how music is created, appreciated, and shared between artists and their communities. In our efforts to be on the cutting edge of this technological revolution, Leaving Records is honored to be challenging the notion of what a record label could be in the 21st Century. \n\nCollectively-governed entities known as DAOs (Decentralized Autonomous Organizations) allow like-minded people across the Internet to come together to achieve shared goals in a radically new way. Without relying on a single authority figure, the DAO’s operations are decided upon by its members. \n\nWe owe our sustainability to artists, friends, and supporters — **the community**. Experimenting in Web 3.0 territory, we will now engage in ways to further the coordination & operation of Leaving Records from within our community.       \n\n\n**Introducing GENRE DAO**\nGENRE is our community token that symbolizes membership in the Leaving Records All-Genre DAO community. GENRE is also a governance token for the GENRE DAO community members, including (but not limited to) Artists from the Leaving Records catalog, Day1 NFT holders, and the greater community adding value to the GENRE DAO Treasury (more details on this to come).\n\n![](https://images.mirror-media.xyz/publication-images/08690161-da17-4f37-8be3-fbdc8c53f576.jpeg?height=3953&width=3953)\n\n*Artwork by [Dazer](https://www.ddazerr.com/) (aka Jordan Rundle)*\n\n\n**Leaving Records All-Genre DAO Values**\n- Providing a safe space for the uplifting of underground, experimental, and marginalized music & community via our resources platform.\n- All Genre-embracing curation & facilitation via record label platform + publicly accessible events platform online and IRL.\n- Advocation of alternative, experimental lifestyle & creative practice.\n\n\n**We are here now** \nJoin our Discord to claim 10 GENRE here: (https://discord.gg/zwPsCpzfjX). We look forward to collaborating and co-creating the future of Leaving Records with you. \n\nPS: This post is an NFT. Funds raised from this article will be the first initiative into the GENRE DAO Treasury.\n\n\n", "timestamp": 1626398454, "digest": "PHJ-Z8DkEjBwLZrJBrdzTCoVh0iAoYoye8Aoi1Fy1OM", "contributor": "0xE3309Dd02F1f7254b8CbE478ac7b5519802E151c"}
{"id": "MFe99MWD1CZGHfc2Y6ryF4yU3Ue9HbtqcRkeTXk-hpU", "title": "Funding Friday: Ethereum: The Infinite Garden", "body": "ETHEREUM: THE INFINITE GARDEN is a “feature-length documentary film that explores the innovative real-world applications of the Ethereum blockchain, the die-hard community of enthusiasts and developers, and its creator, Vitalik Buterin, whose vision for the internet has the potential to change the world.”\n\n![](https://avc.com/content/uploads/2021/07/Screen-Shot-2021-07-16-at-7.14.35-AM.png)\n\nThe film is being [crowdfunded on the Ethereum blockchai](https://ethereumfilm.mirror.xyz/3SV8gLXHIW8Ot45h3RL7aOgDINxN2hjLfFVOvyatB2A)n and the campaign ends at 6pm eastern time today.\n\nWhen you choose to back the project, you will have a choice to pledge one ETH and get an NFT from the film or pledge less and get a token recognizing your contribution.\n\n![](https://avc.com/content/uploads/2021/07/Screen-Shot-2021-07-16-at-7.20.11-AM.png)\n\nI backed the film earlier this week and as of this morning, the film has raised 500 ETH of the 750 ETH goal.\n\nYou can back the film [here](https://ethereumfilm.mirror.xyz/3SV8gLXHIW8Ot45h3RL7aOgDINxN2hjLfFVOvyatB2A).\n", "timestamp": 1626434703, "digest": "bFK5dBrSEkkqFLubBubaAkhlCfMNfzueFoBkPfvFSt8", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "W3h-QUaP1VfP7VqyXV9c7alQwqTiGkuFpcTEkY9_e_A", "title": "The Leaping Corgi Scholarship sponsors players to start earning in the metaverse", "body": "*By [Li Jin](https://twitter.com/ljin18), [Leah Callon-Butler](https://twitter.com/leah_cb), [Gabby Dizon](https://twitter.com/gabusch), [Richerd Chan](https://twitter.com/richerd), and [Jason Li](https://twitter.com/ArtOutland)*\n\n![](https://images.mirror-media.xyz/publication-images/63945c57-f5d0-4202-af8e-9d3b595f78f6.jpeg?height=726&width=1280)\n\n\n\nIn January 2020, essayist Matthew Ball pronounced [the metaverse](https://www.matthewball.vc/all/themetaverse) to be the “next great labor platform.” Beyond a portal to entertainment, he envisioned the metaverse as the enabler of an inclusive, high value economy, in which any individual, regardless of location or identity, could participate via virtual labor.\n\nMonths later, in the wake of pandemic-induced economic fallout, this prediction quickly materialized. While some jobs moved online, many did not. Particularly [impacted](https://www.youtube.com/watch?v=Yo-BrASMHU4) were blue-collar workers in emerging economies—local shopkeepers and service workers who watched already unstable income streams dry up. With bills to pay, people turned to new income sources wherever they could find them—including play-to-earn video games.\n\nPlay-to-earn is a new category of video games where players can earn rewards such as in-game assets and tokens, which can then be sold for cryptocurrencies and cashed out for local currencies.\n\nIn the Filipino town of [Cabanatuan City](https://www.coindesk.com/nft-game-filipinos-covid), play-to-earn game [Axie Infinity](https://axieinfinity.com/) helped hundreds of people put food on the table and complete debt payments. Beyond the promise of reliable income, some found that playing the game to be more enjoyable and lucrative than local minimum-wage jobs.\n\nUnlike previous iterations of online work which centered around real-world value being exchanged through platforms, Axie Infinity was part of a burgeoning ecosystem of virtual worlds in which people earn income, connect, and socialize—entirely online.\n\n## **Axie Infinity**\n\nBased on blockchain technology, Axie Infinity is a decentralized digital pet universe where players battle, breed and trade fantasy creatures called Axies. Players earn yield in the form of fungible tokens called Smooth Love Potions (SLP) by winning battles between Axies. \n\n**Founded just three years ago, Axie Infinity has $25M daily marketplace volume, $9B run rate, and over 400k DAUs, as of July 2021. Players across the world are earning between $500-1000 per month playing the game.**\n\nFor all of the game’s promise, there are barriers to entry: to play Axie Infinity, a player must first purchase a team of three Axies, which are themselves non-fungible tokens (NFTs). In the early days of the game, Axies were affordable for all those wanting to play, but as excitement for the game grew, so did the price of Axies.\n\nToday, purchasing Axies can be prohibitively expensive: a starter team can easily cost upwards of $500. That dynamic threatens to plague virtual worlds with the same structures of inequality that exist offline, with those in greatest need of play-to-earn’s potential being excluded from participating.\n\nThat’s where [Yield Guild Games](https://yieldguild.io/) (YGG) comes in.\n\n## **Yield Guild Games**\n\nYGG is a gaming guild that purchases and rents teams of Axies to new players who would be otherwise unable to afford the assets necessary to play the game. YGG also provides these players with training and support along the way. While the program is free, Axie revenues earned by the player are shared with their community manager and YGG.\n\nCurrently, there is more demand for such scholarships than there are programs to meet it. In response, YGG recently introduced the Sponsor-A-Scholar program, which allows patrons to donate funds to help expand YGG’s fleet of Axies and serve more scholars. [Flying Falcon](https://medium.com/yield-guild-games/flying-falcon-sponsors-players-to-start-earning-in-nft-games-2d5f179d74e7), a pseudonymous benefactor, was the first to contribute to the Sponsor-A-Scholar program, sponsoring a total of 50 players in May 2021.\n\n## **Universal Creative Income and NFT Fundraising**\n\nA study by the World Bank found that people prefer a reciprocal approach to philanthropic donations: in other words, they get something for the money they donate. Since NFTs themselves are viewed as stores of value, NFT auctions can be effective as fundraising mechanisms, encouraging higher interest in bidding.\n\nAt the same time that YGG was emerging, [Li Jin](https://twitter.com/ljin18), founder of [Atelier Ventures](https://www.atelierventures.co/), began exploring ways of funding the long tail of internet creators, ultimating culminating in an essay proposing that platforms and DAOs enact [Universal Creative Income](https://li.substack.com/p/the-case-for-universal-creative-income#:~:text=Universal%20Creative%20Income%20(UCI),a%20family%20with%20%2450%2C000%20income.) (UCI). Beyond simply calling for UCI, Jin was eager to help fund such a proposal as the one she had envisioned in her essay.\n\nRecognizing the power of NFTs to raise funds for good and garner community support, and on the heels of a successful [NFT debut](https://www.nytimes.com/2021/03/24/opinion/what-are-nfts.html), Jin [auctioned a second NFT](https://foundation.app/@li/nft-50862) (co-created with illustrator [Annie Zhao](http://bananie.zone/)) representing her UCI essay. All proceeds, she announced, would be donated to the Sponsor-A-Scholar program by Yield Guild Games.\n\n## **The auction**\n\n[![](https://images.mirror-media.xyz/publication-images/a0846059-3eb4-47e0-a2df-939b4aae0f26.jpg?height=2160&width=3840)](https://foundation.app/@li/universal-creative-income-50862)\n\nOn June 19th, [Richerd Chan](https://twitter.com/richerd) won the NFT auction for [5.6969 ETH, or $12,878](https://foundation.app/@li/universal-creative-income-50862).\n\nBut the story doesn’t end there.\n\nFollowing the close of the auction, Richerd proposed that he fractionalize the NFT and sell a part of it to the second-highest bidder, [Jason Li](https://twitter.com/ArtOutland) (whose bid was 4.866 ETH or $11,000), donating the additional proceeds to the program. Jason generously agreed.\n\nThey decided to name the scholarship “**Leaping Corgi Scholarship**” to honor Li’s love of corgis—animals that are as intelligent as they are adorable.\n\nRichard and Jason’s combined donation of 10.5629 ($23,878) to the YGG Sponsor-A-Scholar program will fund a **total of 87 scholars** from developing countries to be able to play-to-earn with Axie Infinity. These scholars will be chosen by YGG’s community managers based on referrals from their existing scholar community, and will be based in countries such as the Philippines, Indonesia, Venezuela and Brazil.\n\n## **Support the Leaping Corgi Scholarship**\nAll proceeds from the Leaping Corgi Scholarship NFT edition sales will go towards funding additional scholarships. If we sell all editions, we can sponsor an additional Axie team.\n\n*Buyers will receive periodic updates on scholars' lives.*\n\n\n[Leaping Corgi Scholarship](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=36)\n\n## **The Winner: Richerd Chan**\n\nRicherd is the founder of [manifold.xyz](https://manifold.xyz/), the premier NFT product and smart contract technology firm for creatives in the NFT space. Though he has been in crypto for almost a decade, Richerd first dove into the NFT space at the start of 2021. As he began collecting NFT artwork and connecting with the artist community, Richerd saw how much room there was for innovation. With a background in blockchain development, game design, and art, Richard and his team started to work with artists on developing bespoke NFTs and smART contracts.They are currently taking their learnings and experiences to create tools and an ecosystem to power the creator economy and enable creators.\n\n“I love the NFT space because it's the perfect interaction of everything I love - art, technology, crypto, and programming,” said Richerd. “Art is super important to me. I’m an artist at times too, so I get it,” he said.\n\n## **The Runner Up: Jason Li**\n\nJason is a passionate art collector and co-founder of Outland Art, a marketing and consulting platform for artists and galleries. Jason and his team recently pivoted toward the metaverse and NFT world. As a new medium, he believes that traditional artists can re-imagine how to express themselves using NFTs.\n\n“In the traditional art world, artists have been making prints/editions for more than a century, it is the artist signatures and authorizations that make a regular printed piece of paper valuable. This is almost the same concept as an NFT except NFT provides much easier authentication process. I truly believe this technology will significantly change some part of the traditional art world and broaden people’s imagination about what is possible.” said Jason.\n\n## **Scholarship Recipients**\n\nOf the 87 scholarship recipients, 52 are located in the Philippines, 10 are in India, 10 are in LATAM, and 15 are in Brazil. The following are comments from some of the scholars, expressing their gratitude and explaining how they intend to spend their earnings.\n\n*\"I applied for the scholarship because I am unemployed, and it has been very difficult for me as a single mother recently arrived in Peru. I couldn't believe the joy I felt at being chosen. I am extremely grateful. For my earnings, apart from setting aside a little for rent and food, I will invest in the game with the Axies.\"* -YGG Scholar 2460—Leaping Corgi, Peru.\n\n*“I am planning to give half of my earnings to my mother so that we can continue to build our house and give some for paying our bills. I am super excited to play this game because I can earn money while enjoying the game.”* - YGG Scholar 2453—Leaping Corgi, Philippines.\n\n*“I'm thrilled to finally be part of this life-changing game. I'm planning to spend my earnings on my brother's education since he's now studying in college. The other portion would be for my personal savings.”* - YGG Scholar 2450—Leaping Corgi, Philippines.\n\n*“I was very happy and excited to start. I graduated in architecture this year, but with this crisis and pandemic, many people stopped hiring. With this scholarship, I can manage my time, play, study, and I know I can count on extra income at the end of the month.”* - YGG Scholar 2470—Leaping Corgi, Brazil.\n\n\n## **Further reading:**\n\n- For more background on the YGG Sponsor-A-Scholar program, see here: [https://medium.com/yield-guild-games/flying-falcon-sponsors-players-to-start-earning-in-nft-games-2d5f179d74e7](https://medium.com/yield-guild-games/flying-falcon-sponsors-players-to-start-earning-in-nft-games-2d5f179d74e7)\n- For more information on Yield Guild Games, see the Media Kit here: [https://drive.google.com/drive/u/0/folders/1yCaivYoqW7HaGdug-2GyDS17RRpj4f97](https://drive.google.com/drive/u/0/folders/1yCaivYoqW7HaGdug-2GyDS17RRpj4f97)\n- For background on the play-to-earn movement, see this mini-documentary about a community in the rural Philippines that played an NFT game to earn money while locked down during the COVID-19 pandemic: [https://www.youtube.com/watch?v=Yo-BrASMHU4](https://www.youtube.com/watch?v=Yo-BrASMHU4)\n- An article in the New York Times about the first NFT that Li ever sold: [https://www.nytimes.com/2021/03/24/opinion/what-are-nfts.html](https://www.nytimes.com/2021/03/24/opinion/what-are-nfts.html)\n- The NFT that Li sold to fund the YGG Sponsor-a-Scholar program: [https://foundation.app/@li/nft-50862](https://foundation.app/@li/nft-50862).\n- The Case for Universal Creative Income (where the artwork for Li’s second NFT sale was originally published): [https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g](https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g)\n- The HBR article (December 2020) that Li wrote about the need for a creator middle class: https://hbr.org/2020/12/the-creator-economy-needs-a-middle-class\n\n\n*With thanks to [Lila Shroff](https://twitter.com/LilaShroff).*", "timestamp": 1626453659, "digest": "Dd7gY8Ip1tRcpznNhunVRMfpwKeZcnIIKIUgx4RFO38", "contributor": "0x808a2adbD0a3fc679e3F7CD18d4f579BFCaaEC9C"}
{"id": "9Pqfpm1QOVJ5G6WGcbGM2QSVTQmhqobPVEA5RIBUUds", "title": "The Leaping Corgi Scholarship sponsors players to start earning in the metaverse", "body": "*By [Li Jin](https://twitter.com/ljin18), [Leah Callon-Butler](https://twitter.com/leah_cb), [Gabby Dizon](https://twitter.com/gabusch), [Richerd Chan](https://twitter.com/richerd), and [Jason Li](https://twitter.com/ArtOutland)*\n\n![](https://images.mirror-media.xyz/publication-images/63945c57-f5d0-4202-af8e-9d3b595f78f6.jpeg?height=726&width=1280)\n\n\n\nIn January 2020, essayist Matthew Ball pronounced [the metaverse](https://www.matthewball.vc/all/themetaverse) to be the “next great labor platform.” Beyond a portal to entertainment, he envisioned the metaverse as the enabler of an inclusive, high value economy, in which any individual, regardless of location or identity, could participate via virtual labor.\n\nMonths later, in the wake of pandemic-induced economic fallout, this prediction quickly materialized. While some jobs moved online, many did not. Particularly [impacted](https://www.youtube.com/watch?v=Yo-BrASMHU4) were blue-collar workers in emerging economies—local shopkeepers and service workers who watched already unstable income streams dry up. With bills to pay, people turned to new income sources wherever they could find them—including play-to-earn video games.\n\nPlay-to-earn is a new category of video games where players can earn rewards such as in-game assets and tokens, which can then be sold for cryptocurrencies and cashed out for local currencies.\n\nIn the Filipino town of [Cabanatuan City](https://www.coindesk.com/nft-game-filipinos-covid), play-to-earn game [Axie Infinity](https://axieinfinity.com/) helped hundreds of people put food on the table and complete debt payments. Beyond the promise of reliable income, some found that playing the game to be more enjoyable and lucrative than local minimum-wage jobs.\n\nUnlike previous iterations of online work which centered around real-world value being exchanged through platforms, Axie Infinity was part of a burgeoning ecosystem of virtual worlds in which people earn income, connect, and socialize—entirely online.\n\n## **Axie Infinity**\n\nBased on blockchain technology, Axie Infinity is a decentralized digital pet universe where players battle, breed and trade fantasy creatures called Axies. Players earn yield in the form of fungible tokens called Smooth Love Potions (SLP) by winning battles between Axies. \n\n**Founded just three years ago, Axie Infinity has $25M daily marketplace volume, $9B run rate, and over 400k DAUs, as of July 2021. Players across the world are earning between $500-1000 per month playing the game.**\n\nFor all of the game’s promise, there are barriers to entry: to play Axie Infinity, a player must first purchase a team of three Axies, which are themselves non-fungible tokens (NFTs). In the early days of the game, Axies were affordable for all those wanting to play, but as excitement for the game grew, so did the price of Axies.\n\nToday, purchasing Axies can be prohibitively expensive: a starter team can easily cost upwards of $500. That dynamic threatens to plague virtual worlds with the same structures of inequality that exist offline, with those in greatest need of play-to-earn’s potential being excluded from participating.\n\nThat’s where [Yield Guild Games](https://yieldguild.io/) (YGG) comes in.\n\n## **Yield Guild Games**\n\nYGG is a gaming guild that purchases and rents teams of Axies to new players who would be otherwise unable to afford the assets necessary to play the game. YGG also provides these players with training and support along the way. While the program is free, Axie revenues earned by the player are shared with their community manager and YGG.\n\nCurrently, there is more demand for such scholarships than there are programs to meet it. In response, YGG recently introduced the Sponsor-A-Scholar program, which allows patrons to donate funds to help expand YGG’s fleet of Axies and serve more scholars. [Flying Falcon](https://medium.com/yield-guild-games/flying-falcon-sponsors-players-to-start-earning-in-nft-games-2d5f179d74e7), a pseudonymous benefactor, was the first to contribute to the Sponsor-A-Scholar program, sponsoring a total of 50 players in May 2021.\n\n## **Universal Creative Income and NFT Fundraising**\n\nA study by the World Bank found that people prefer a reciprocal approach to philanthropic donations: in other words, they get something for the money they donate. Since NFTs themselves are viewed as stores of value, NFT auctions can be effective as fundraising mechanisms, encouraging higher interest in bidding.\n\nAt the same time that YGG was emerging, [Li Jin](https://twitter.com/ljin18), founder of [Atelier Ventures](https://www.atelierventures.co/), began exploring ways of funding the long tail of internet creators, ultimating culminating in an essay proposing that platforms and DAOs enact [Universal Creative Income](https://li.substack.com/p/the-case-for-universal-creative-income#:~:text=Universal%20Creative%20Income%20(UCI),a%20family%20with%20%2450%2C000%20income.) (UCI). Beyond simply calling for UCI, Jin was eager to help fund such a proposal as the one she had envisioned in her essay.\n\nRecognizing the power of NFTs to raise funds for good and garner community support, and on the heels of a successful [NFT debut](https://www.nytimes.com/2021/03/24/opinion/what-are-nfts.html), Jin [auctioned a second NFT](https://foundation.app/@li/nft-50862) (co-created with illustrator [Annie Zhao](http://bananie.zone/)) representing her UCI essay. All proceeds, she announced, would be donated to the Sponsor-A-Scholar program by Yield Guild Games.\n\n## **The auction**\n\n[![](https://images.mirror-media.xyz/publication-images/a0846059-3eb4-47e0-a2df-939b4aae0f26.jpg?height=2160&width=3840)](https://foundation.app/@li/universal-creative-income-50862)\n\nOn June 19th, [Richerd Chan](https://twitter.com/richerd) won the NFT auction for [5.6969 ETH, or $12,878](https://foundation.app/@li/universal-creative-income-50862).\n\nBut the story doesn’t end there.\n\nFollowing the close of the auction, Richerd proposed that he fractionalize the NFT and sell a part of it to the second-highest bidder, [Jason Li](https://twitter.com/ArtOutland) (whose bid was 4.866 ETH or $11,000), donating the additional proceeds to the program. Jason generously agreed.\n\nThey decided to name the scholarship “**Leaping Corgi Scholarship**” to honor Li’s love of corgis—animals that are as intelligent as they are adorable.\n\nRichard and Jason’s combined donation of 10.5629 ($23,878) to the YGG Sponsor-A-Scholar program will fund a **total of 87 scholars** from developing countries to be able to play-to-earn with Axie Infinity. These scholars will be chosen by YGG’s community managers based on referrals from their existing scholar community, and will be based in countries such as the Philippines, Indonesia, Venezuela and Brazil.\n\n## **Support the Leaping Corgi Scholarship**\nAll proceeds from the Leaping Corgi Scholarship NFT edition sales will go towards funding additional scholarships. If we sell all editions, we can sponsor an additional Axie team.\n\nBuyers will receive periodic updates on scholars' lives.\n\n*Art by [Heresy](https://twitter.com/st_heresy?s=09).*\n\n[Leaping Corgi Scholarship](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=36)\n\n## **The Winner: Richerd Chan**\n\nRicherd is the founder of [manifold.xyz](https://manifold.xyz/), the premier NFT product and smart contract technology firm for creatives in the NFT space. Though he has been in crypto for almost a decade, Richerd first dove into the NFT space at the start of 2021. As he began collecting NFT artwork and connecting with the artist community, Richerd saw how much room there was for innovation. With a background in blockchain development, game design, and art, Richard and his team started to work with artists on developing bespoke NFTs and smART contracts.They are currently taking their learnings and experiences to create tools and an ecosystem to power the creator economy and enable creators.\n\n“I love the NFT space because it's the perfect interaction of everything I love - art, technology, crypto, and programming,” said Richerd. “Art is super important to me. I’m an artist at times too, so I get it,” he said.\n\n## **The Runner Up: Jason Li**\n\nJason is a passionate art collector and co-founder of Outland Art, a marketing and consulting platform for artists and galleries. Jason and his team recently pivoted toward the metaverse and NFT world. As a new medium, he believes that traditional artists can re-imagine how to express themselves using NFTs.\n\n“In the traditional art world, artists have been making prints/editions for more than a century, it is the artist signatures and authorizations that make a regular printed piece of paper valuable. This is almost the same concept as an NFT except NFT provides much easier authentication process. I truly believe this technology will significantly change some part of the traditional art world and broaden people’s imagination about what is possible.” said Jason.\n\n## **Scholarship Recipients**\n\nOf the 87 scholarship recipients, 52 are located in the Philippines, 10 are in India, 10 are in LATAM, and 15 are in Brazil. The following are comments from some of the scholars, expressing their gratitude and explaining how they intend to spend their earnings.\n\n*\"I applied for the scholarship because I am unemployed, and it has been very difficult for me as a single mother recently arrived in Peru. I couldn't believe the joy I felt at being chosen. I am extremely grateful. For my earnings, apart from setting aside a little for rent and food, I will invest in the game with the Axies.\"* -YGG Scholar 2460—Leaping Corgi, Peru.\n\n*“I am planning to give half of my earnings to my mother so that we can continue to build our house and give some for paying our bills. I am super excited to play this game because I can earn money while enjoying the game.”* - YGG Scholar 2453—Leaping Corgi, Philippines.\n\n*“I'm thrilled to finally be part of this life-changing game. I'm planning to spend my earnings on my brother's education since he's now studying in college. The other portion would be for my personal savings.”* - YGG Scholar 2450—Leaping Corgi, Philippines.\n\n*“I was very happy and excited to start. I graduated in architecture this year, but with this crisis and pandemic, many people stopped hiring. With this scholarship, I can manage my time, play, study, and I know I can count on extra income at the end of the month.”* - YGG Scholar 2470—Leaping Corgi, Brazil.\n\n\n## **Further reading:**\n\n- For more background on the YGG Sponsor-A-Scholar program, see here: [https://medium.com/yield-guild-games/flying-falcon-sponsors-players-to-start-earning-in-nft-games-2d5f179d74e7](https://medium.com/yield-guild-games/flying-falcon-sponsors-players-to-start-earning-in-nft-games-2d5f179d74e7)\n- For more information on Yield Guild Games, see the Media Kit here: [https://drive.google.com/drive/u/0/folders/1yCaivYoqW7HaGdug-2GyDS17RRpj4f97](https://drive.google.com/drive/u/0/folders/1yCaivYoqW7HaGdug-2GyDS17RRpj4f97)\n- For background on the play-to-earn movement, see this mini-documentary about a community in the rural Philippines that played an NFT game to earn money while locked down during the COVID-19 pandemic: [https://www.youtube.com/watch?v=Yo-BrASMHU4](https://www.youtube.com/watch?v=Yo-BrASMHU4)\n- An article in the New York Times about the first NFT that Li ever sold: [https://www.nytimes.com/2021/03/24/opinion/what-are-nfts.html](https://www.nytimes.com/2021/03/24/opinion/what-are-nfts.html)\n- The NFT that Li sold to fund the YGG Sponsor-a-Scholar program: [https://foundation.app/@li/nft-50862](https://foundation.app/@li/nft-50862).\n- The Case for Universal Creative Income (where the artwork for Li’s second NFT sale was originally published): [https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g](https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g)\n- The HBR article (December 2020) that Li wrote about the need for a creator middle class: https://hbr.org/2020/12/the-creator-economy-needs-a-middle-class\n\n\n*With thanks to [Lila Shroff](https://twitter.com/LilaShroff).*", "timestamp": 1626454025, "digest": "Dd7gY8Ip1tRcpznNhunVRMfpwKeZcnIIKIUgx4RFO38", "contributor": "0x808a2adbD0a3fc679e3F7CD18d4f579BFCaaEC9C"}
{"id": "9XrGIRmkZtzX5rbxoPLtIqjJrLj3Mgy2kEJxuq9QB2k", "title": "Shall we start a new DAO?", "body": "### Introducing mCLUB, a Grant Giving DAO designed to support creators on Mirror and give hands-on experience to those looking for opportunities in DAOs.\n\n[mCLUB DAO](crowdfund://0x3c50E19C7aBF8E5c9A3C56FcE64E7015a6E1f49c?version=tiered_1&network=mainnet&features=overview)\n\nIt’s no secret, we're big fans of Mirror.\n\nFrom being the first official winner of the [$WRITE RACE](https://mirror.xyz/race), to helping launch projects like Not Boring’s [Power to the Person](https://notboring.mirror.xyz/SPV_-bchriVn_ncDj8OgnLccSb5qAsU0sXNpg9y_UTk) (first use of splits), [Mint Fund](https://themint.fund/)’s $BOUNTY (first smart contract sold as an NFT) and Colin and Samir’s [Seat at the Table NFT](https://colinandsamir.mirror.xyz/G5kD1SysIvVE-Socv7zknOExp3wZWZPSZ9_sxBj_cV4) (the first use of a PartyBid contract), we’ve seen the power that easy to access web 3 tools can unlock for creators.\n\nWe’re also big fans of DAOs.\n\nSeed Club is a DAO that builds and invests in communities with tokens. Our community is full of thousands of smart, talented individuals looking to get hands-on experience working for a DAO.\n\nA common frustration we hear from many is how hard it is to “break into” existing DAOs. There are hundreds of people who want to participate, but have yet to find their way into an operational role.\n\nSo we asked ourselves…\n\nWhat if we used Mirror’s full set of creator empowering tools to launch a DAO that supports creative projects on Mirror, and gives individuals hands-on experience in building and operating a DAO?\n\nWell, today we’re excited to announce mClub: a Grant Giving DAO focused on the Mirror Ecosystem. \n\n### The mClub Mission\n\nFirst and foremost, mCLUB is about hands on learning. Web 3 needs to be experienced and this project is about creating an opportunity for you to go from 0 to 1 in setting up and operating a DAO. \n\nThat said, a DAOs needs a mission to catalyze interest and focus efforts. So here's what we're thinking: \n\nmCLUB's Mission: To be the leading community DAO focused on the Mirror ecosystem.\n\nSpecifically, mCLUB DAO aims to be:\n\n1. The foremost backer of projects, and collector of tokens, on Mirror.\n2. The premier media publication focused on the Mirror ecosystem.\n\n### Why Mirror?\n\nMirror somehow manages to both reveal the capabilities of crypto while also making it easy and “indistinguishable from magic”.\n\nThis makes it a prime tool to help onboard new creators into crypto.\n\nFor months they’ve consistently delivered new functionality that gives creators on chain super powers. We believe they will continue to innovate and that participating in this ecosystem early is a good investment of time and attention.\n\n[mCLUB DAO](crowdfund://0x3c50E19C7aBF8E5c9A3C56FcE64E7015a6E1f49c?version=tiered_1&network=mainnet&features=editions)\n\n### mCLUB DAO starts now with the $mCLUB crowdfund.\n\nHere’s the game plan.\n\n- Backers can support the crowdfund with ETH in return for $mCLUB tokens.\n- 50% of $mCLUB supply will be held back by mCLUB DAO, a portion of which will be used to airdrop to quality community members who'd like to participate but may not be able to back the project with ETH. 15% will be retained within the Seed Club DAO\n- $mCLUB tokens represent membership in mClub.\n- The first feature of mClub will be a tokenized Discord section, gated by $mCLUB. Backers will immediately be able to access the mClub section of the Seed Club Discord.\n- $mCLUB holders, with the support of Seed Club, will coordinate in the Discord to decide on a plan for governance and how to allocate the contributed funds.\n- The crowdfund will target a fundraise of 20 ETH with a 50 ETH Cap, which will be deposited into a multisig governed by the backers at mirror.club.eth\n\n### Whats Next?\n\nThe membership contribution period will be open until Monday, July 19th at 9am PST or until the stretch goal is reached.\n\nA kick off meeting will be scheduled in discord and work will begin.\n\nFor now, backers should join the mClub section of the Seed Club discord. See you in there.\n\n[Join the Seed Club Discord](https://discord.gg/dUTBCZzT4N)\n\n[mCLUB bASIC](edition://0xEF3c951e22c65F6256746F4e227e19A5BcbF393C?editionId=11&version=crowdfund_1)\n\n[mCLUB eXTRA](edition://0xEF3c951e22c65F6256746F4e227e19A5BcbF393C?editionId=12&version=crowdfund_1)\n\n[mCLUB pRO](edition://0xEF3c951e22c65F6256746F4e227e19A5BcbF393C?editionId=13&version=crowdfund_1)\n\n\n", "timestamp": 1626455038, "digest": "dnN3Dwe-iD6jBpzkase4YLHTxYtnuFnmUbSoOfPEkjI", "contributor": "0x42DFAf5266Ad40AB4533F9806F5CC1DF4C1eB363"}
{"id": "WEsDWZq_mcwQ_msEYUGGDAYIihlhJiAJM7eEKX2KtYY", "title": "The Leaping Corgi Scholarship sponsors players to start earning in the metaverse", "body": "*By [Li Jin](https://twitter.com/ljin18), [Leah Callon-Butler](https://twitter.com/leah_cb), [Gabby Dizon](https://twitter.com/gabusch), [Richerd Chan](https://twitter.com/richerd), and [Jason Li](https://twitter.com/ArtOutland)*\n\n![](https://images.mirror-media.xyz/publication-images/63945c57-f5d0-4202-af8e-9d3b595f78f6.jpeg?height=726&width=1280)\n\n\n\nIn January 2020, essayist Matthew Ball pronounced [the metaverse](https://www.matthewball.vc/all/themetaverse) to be the “next great labor platform.” Beyond a portal to entertainment, he envisioned the metaverse as the enabler of an inclusive, high value economy, in which any individual, regardless of location or identity, could participate via virtual labor.\n\nMonths later, in the wake of pandemic-induced economic fallout, this prediction quickly materialized. While some jobs moved online, many did not. Particularly [impacted](https://www.youtube.com/watch?v=Yo-BrASMHU4) were blue-collar workers in emerging economies—local shopkeepers and service workers who watched already unstable income streams dry up. With bills to pay, people turned to new income sources wherever they could find them—including play-to-earn video games.\n\nPlay-to-earn is a new category of video games where players can earn rewards such as in-game assets and tokens, which can then be sold for cryptocurrencies and cashed out for local currencies.\n\nIn the Filipino town of [Cabanatuan City](https://www.coindesk.com/nft-game-filipinos-covid), play-to-earn game [Axie Infinity](https://axieinfinity.com/) helped hundreds of people put food on the table and complete debt payments. Beyond the promise of reliable income, some found that playing the game to be more enjoyable and lucrative than local minimum-wage jobs.\n\nUnlike previous iterations of online work which centered around real-world value being exchanged through platforms, Axie Infinity was part of a burgeoning ecosystem of virtual worlds in which people earn income, connect, and socialize—entirely online.\n\n## **Axie Infinity**\n\nBased on blockchain technology, Axie Infinity is a decentralized digital pet universe where players battle, breed and trade fantasy creatures called Axies. Players earn yield in the form of fungible tokens called Smooth Love Potions (SLP) by winning battles between Axies. \n\n**Founded just three years ago, Axie Infinity has $25M daily marketplace volume, $9B run rate, and over 400k DAUs, as of July 2021. Players across the world are earning between $500-1000 per month playing the game.**\n\nFor all of the game’s promise, there are barriers to entry: to play Axie Infinity, a player must first purchase a team of three Axies, which are themselves non-fungible tokens (NFTs). In the early days of the game, Axies were affordable for all those wanting to play, but as excitement for the game grew, so did the price of Axies.\n\nToday, purchasing Axies can be prohibitively expensive: a starter team can easily cost upwards of $500. That dynamic threatens to plague virtual worlds with the same structures of inequality that exist offline, with those in greatest need of play-to-earn’s potential being excluded from participating.\n\nThat’s where [Yield Guild Games](https://yieldguild.io/) (YGG) comes in.\n\n## **Yield Guild Games**\n\nYGG is a gaming guild that purchases and rents teams of Axies to new players who would be otherwise unable to afford the assets necessary to play the game. YGG also provides these players with training and support along the way. While the program is free, Axie revenues earned by the player are shared with their community manager and YGG.\n\nCurrently, there is more demand for such scholarships than there are programs to meet it. In response, YGG recently introduced the Sponsor-A-Scholar program, which allows patrons to donate funds to help expand YGG’s fleet of Axies and serve more scholars. [Flying Falcon](https://medium.com/yield-guild-games/flying-falcon-sponsors-players-to-start-earning-in-nft-games-2d5f179d74e7), a pseudonymous benefactor, was the first to contribute to the Sponsor-A-Scholar program, sponsoring a total of 50 players in May 2021.\n\n## **Universal Creative Income and NFT Fundraising**\n\nA study by the World Bank found that people prefer a reciprocal approach to philanthropic donations: in other words, they get something for the money they donate. Since NFTs themselves are viewed as stores of value, NFT auctions can be effective as fundraising mechanisms, encouraging higher interest in bidding.\n\nAt the same time that YGG was emerging, [Li Jin](https://twitter.com/ljin18), founder of [Atelier Ventures](https://www.atelierventures.co/), began exploring ways of funding the long tail of internet creators, ultimating culminating in an essay proposing that platforms and DAOs enact [Universal Creative Income](https://li.substack.com/p/the-case-for-universal-creative-income#:~:text=Universal%20Creative%20Income%20(UCI),a%20family%20with%20%2450%2C000%20income.) (UCI). Beyond simply calling for UCI, Jin was eager to help fund such a proposal as the one she had envisioned in her essay.\n\nRecognizing the power of NFTs to raise funds for good and garner community support, and on the heels of a successful [NFT debut](https://www.nytimes.com/2021/03/24/opinion/what-are-nfts.html), Jin [auctioned a second NFT](https://foundation.app/@li/nft-50862) (co-created with illustrator [Annie Zhao](http://bananie.zone/)) representing her UCI essay. All proceeds, she announced, would be donated to the Sponsor-A-Scholar program by Yield Guild Games.\n\n## **The auction**\n\n[![](https://images.mirror-media.xyz/publication-images/a0846059-3eb4-47e0-a2df-939b4aae0f26.jpg?height=2160&width=3840)](https://foundation.app/@li/universal-creative-income-50862)\n\nOn June 19th, [Richerd Chan](https://twitter.com/richerd) won the NFT auction for [5.6969 ETH, or $12,878](https://foundation.app/@li/universal-creative-income-50862).\n\nBut the story doesn’t end there.\n\nFollowing the close of the auction, Richerd proposed that he fractionalize the NFT and sell a part of it to the second-highest bidder, [Jason Li](https://twitter.com/ArtOutland) (whose bid was 4.866 ETH or $11,000), donating the additional proceeds to the program. Jason generously agreed.\n\nThey decided to name the scholarship “**Leaping Corgi Scholarship**” to honor Li’s love of corgis—animals that are as intelligent as they are adorable.\n\n**Richard and Jason’s combined donation of 10.5629 ETH ($23,878) will fund a total of 87 scholars** from developing countries to be able to play-to-earn with Axie Infinity. These scholars will be chosen by YGG’s community managers based on referrals from their existing scholar community, and will be based in countries such as the Philippines, Indonesia, Venezuela and Brazil.\n\n## **Support the Leaping Corgi Scholarship**\nAll proceeds from the Leaping Corgi Scholarship NFT edition sales will go towards funding additional scholarships. If we sell all editions, we can sponsor an additional Axie team.\n\nBuyers will receive periodic updates on scholars' lives.\n\n*Art by [Heresy](https://twitter.com/st_heresy?s=09).*\n\n[Leaping Corgi Scholarship](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=36)\n\n## **The Winner: Richerd Chan**\n\nRicherd is the founder of [manifold.xyz](https://manifold.xyz/), the premier NFT product and smart contract technology firm for creatives in the NFT space. Though he has been in crypto for almost a decade, Richerd first dove into the NFT space at the start of 2021. As he began collecting NFT artwork and connecting with the artist community, Richerd saw how much room there was for innovation. With a background in blockchain development, game design, and art, Richard and his team started to work with artists on developing bespoke NFTs and smART contracts.They are currently taking their learnings and experiences to create tools and an ecosystem to power the creator economy and enable creators.\n\n“I love the NFT space because it's the perfect interaction of everything I love - art, technology, crypto, and programming,” said Richerd. “Art is super important to me. I’m an artist at times too, so I get it,” he said.\n\n## **The Runner Up: Jason Li**\n\nJason is a passionate art collector and co-founder of Outland Art, a marketing and consulting platform for artists and galleries. Jason and his team recently pivoted toward the metaverse and NFT world. As a new medium, he believes that traditional artists can re-imagine how to express themselves using NFTs.\n\n“In the traditional art world, artists have been making prints/editions for more than a century, it is the artist signatures and authorizations that make a regular printed piece of paper valuable. This is almost the same concept as an NFT except NFT provides much easier authentication process. I truly believe this technology will significantly change some part of the traditional art world and broaden people’s imagination about what is possible.” said Jason.\n\n## **Scholarship Recipients**\n\nOf the 87 scholarship recipients, 52 are located in the Philippines, 10 are in India, 10 are in LATAM, and 15 are in Brazil. The following are comments from some of the scholars, expressing their gratitude and explaining how they intend to spend their earnings.\n\n*\"I applied for the scholarship because I am unemployed, and it has been very difficult for me as a single mother recently arrived in Peru. I couldn't believe the joy I felt at being chosen. I am extremely grateful. For my earnings, apart from setting aside a little for rent and food, I will invest in the game with the Axies.\"* -YGG Scholar 2460—Leaping Corgi, Peru.\n\n*“I am planning to give half of my earnings to my mother so that we can continue to build our house and give some for paying our bills. I am super excited to play this game because I can earn money while enjoying the game.”* - YGG Scholar 2453—Leaping Corgi, Philippines.\n\n*“I'm thrilled to finally be part of this life-changing game. I'm planning to spend my earnings on my brother's education since he's now studying in college. The other portion would be for my personal savings.”* - YGG Scholar 2450—Leaping Corgi, Philippines.\n\n*“I was very happy and excited to start. I graduated in architecture this year, but with this crisis and pandemic, many people stopped hiring. With this scholarship, I can manage my time, play, study, and I know I can count on extra income at the end of the month.”* - YGG Scholar 2470—Leaping Corgi, Brazil.\n\n\n## **Further reading:**\n\n- For more background on the YGG Sponsor-A-Scholar program, see here: [https://medium.com/yield-guild-games/flying-falcon-sponsors-players-to-start-earning-in-nft-games-2d5f179d74e7](https://medium.com/yield-guild-games/flying-falcon-sponsors-players-to-start-earning-in-nft-games-2d5f179d74e7)\n- For more information on Yield Guild Games, see the Media Kit here: [https://drive.google.com/drive/u/0/folders/1yCaivYoqW7HaGdug-2GyDS17RRpj4f97](https://drive.google.com/drive/u/0/folders/1yCaivYoqW7HaGdug-2GyDS17RRpj4f97)\n- For background on the play-to-earn movement, see this mini-documentary about a community in the rural Philippines that played an NFT game to earn money while locked down during the COVID-19 pandemic: [https://www.youtube.com/watch?v=Yo-BrASMHU4](https://www.youtube.com/watch?v=Yo-BrASMHU4)\n- An article in the New York Times about the first NFT that Li ever sold: [https://www.nytimes.com/2021/03/24/opinion/what-are-nfts.html](https://www.nytimes.com/2021/03/24/opinion/what-are-nfts.html)\n- The NFT that Li sold to fund the YGG Sponsor-a-Scholar program: [https://foundation.app/@li/nft-50862](https://foundation.app/@li/nft-50862).\n- The Case for Universal Creative Income (where the artwork for Li’s second NFT sale was originally published): [https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g](https://li.mirror.xyz/j3WsyvI5LKFKcFc9YK6cwzpU131Gs-N8ynGh3Jkli_g)\n- The HBR article (December 2020) that Li wrote about the need for a creator middle class: https://hbr.org/2020/12/the-creator-economy-needs-a-middle-class\n\n\n*With thanks to [Lila Shroff](https://twitter.com/LilaShroff).*", "timestamp": 1626456744, "digest": "Dd7gY8Ip1tRcpznNhunVRMfpwKeZcnIIKIUgx4RFO38", "contributor": "0x808a2adbD0a3fc679e3F7CD18d4f579BFCaaEC9C"}
{"id": "MHZtVk6dpXfdbtS25tHDOUwfAFkHQl5HD-l5HSs4uB0", "title": "Leaving Records Introducing GENRE DAO", "body": "**Where we’ve been**\nLeaving Records, established 2008/9, is an all-genre artist community and record label founded by Matthew David McQueen (A.K.A. Matthewdavid), nearing 200 releases from artists worldwide.\n\n**Where we are going** \nThe new technologies and [mindsets powering Web 3.0](https://medium.com/fabric-ventures/what-is-web-3-0-why-it-matters-934eb07f3d2b) can profoundly change how music is created, appreciated, and shared between artists and their communities. In our efforts to be on the cutting edge of this technological revolution, Leaving Records is honored to be challenging the notion of what a record label could be in the 21st Century. \n\nCollectively-governed entities known as DAOs (Decentralized Autonomous Organizations) allow like-minded people across the Internet to come together to achieve shared goals in a radically new way. Without relying on a single authority figure, the DAO’s operations are decided upon by its members. \n\nWe owe our sustainability to artists, friends, and supporters — **the community**. Experimenting in Web 3.0 territory, we will now engage in ways to further the coordination & operation of Leaving Records from within our community.       \n\n\n**Introducing GENRE DAO**\nGENRE is our community token that symbolizes membership in the Leaving Records All-Genre DAO community. GENRE is also a governance token for the GENRE DAO community members, including (but not limited to) Artists from the Leaving Records catalog, Day1 NFT holders, and the greater community adding value to the GENRE DAO Treasury (more details on this to come).\n\n![](https://images.mirror-media.xyz/publication-images/08690161-da17-4f37-8be3-fbdc8c53f576.jpeg?height=3953&width=3953)\n\n*Artwork by [Dazer](https://www.ddazerr.com/) (aka Jordan Rundle)*\n\n\n**Leaving Records All-Genre DAO Values**\n- Providing a safe space for the uplifting of underground, experimental, and marginalized music & community via our resources platform.\n- All Genre-embracing curation & facilitation via record label platform + publicly accessible events platform online and IRL.\n- Advocation of alternative, experimental lifestyle & creative practice.\n\n\n**We are here now** \nJoin our Discord to claim 10 GENRE here: https://discord.gg/zwPsCpzfjX. We look forward to collaborating and co-creating the future of Leaving Records with you. \n\nPS: This post is an NFT. Funds raised from this article will be the first initiative into the GENRE DAO Treasury.\n\n\n", "timestamp": 1626458109, "digest": "PHJ-Z8DkEjBwLZrJBrdzTCoVh0iAoYoye8Aoi1Fy1OM", "contributor": "0xE3309Dd02F1f7254b8CbE478ac7b5519802E151c"}
{"id": "fXgZlNEAgZ3qx1qNFd-QK6s7fcOeBPnM3BbLM5jXyNo", "title": "Our Network: Issue #80", "body": "*This is issue #80 of the on-chain analytics newsletter that reaches nearly 12k crypto investors every week* 📈\n\n**About the editor:** [Spencer Noon](https://twitter.com/spencernoon) is General Partner at [Variant](https://variant.fund/), a first-check crypto VC fund. DMs always open for entrepreneurs.\n\n* * *\n\nOur Community Is Hiring\n-----------------------\n\n*   **Phantom** is hiring a Senior iOS / React Native Engineer ([Link](https://cryptocurrencyjobs.co/engineering/phantom-senior-ios-react-native-engineer/))\n    \n*   **Goldfinch** is hiring a Senior Software Engineer ([Link](https://careers.goldfinch.finance/senior-software-engineer-41636/))\n    \n*   **Yield Protocol** is hiring for a Go To Market Lead ([Link](https://yield.is/careers/go-to-market-lead/))\n    \n*   Don’t see your ideal role? [Fill out my talent form](https://forms.gle/cY4vgKZj7yn9pTSA9) and I’ll personally do my best to connect the dots with top projects in our community.\n    \n\n* * *\n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F31da0e4a-a5bd-49a7-81b4-43537123ae1d_1601x132.png) a.image2.image-link.image2-120-1456 { padding-bottom: 8.241758241758241%; padding-bottom: min(8.241758241758241%, 120px); width: 100%; height: 0; } a.image2.image-link.image2-120-1456 img { max-width: 1456px; max-height: 120px; }]\n\n_This week our contributor analysts cover DeFi: Yearn, 0x, 1inch, and Opyn._\n\n**① Yearn**\n===========\n\n**👥 [Will Leas](https://twitter.com/Will_Leas)**\n\n**📈 Yearn Surpasses $30M In Protocol Revenue**\n\n**👉 [Participate in Yearn Governance](https://gov.yearn.finance/)**\n\n*   Yearn has surpassed $30m in protocol revenue since launch on the back of strong growth in the first half of 2021. Yearn earned more than $23.9m in protocol revenue in H1’21, ~5x greater than all of 2020’s protocol revenue combined. (Source: yfistats)\n    \n\n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F9f5a4460-193b-4d3c-a842-b89c57a06abd_624x288.png)\n\n*   Protocol revenue growth mirrors the growth of Yearn’s TVL. In the first half of 2021, Yearn’s TVL grew 671% from $531m to $4.1b. TVL growth can largely be attributed to the launch and subsequent growth of v2 yVaults. (Source: yearn.science)\n    \n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F5044139e-1412-4fd7-9bb0-923d434b944c_1600x1200.png) a.image2.image-link.image2-444-592 { padding-bottom: 75%; padding-bottom: min(75%, 444px); width: 100%; height: 0; } a.image2.image-link.image2-444-592 img { max-width: 592px; max-height: 444px; }](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages#### %2F5044139e-1412-4fd7-9bb0-923d434b944c_1600x12#### 00.png)\n\n*   QoQ protocol revenue growth has continued to accelerate. In Q2 2021, Yearn’s protocol revenue grew 236% to $18.4m, up from $5.5m in Q1 2021. V2 yVaults contributed $14.7m of the total $18.4m in quarterly revenue. Quarterly protocol revenue has grown more than 3x QoQ in 2021. (Source: yfistats)\n[![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F265aab25-3d92-4edb-95c0-c29e164cfba9_1161x305.png)\n\n* * *\n\n**② 0x**\n========\n\n**👥 [Danning Sui](https://twitter.com/sui414)**\n\n**📈 $1B 24h Volume, 200k Monthly Traders**\n\n**👉 [Join the 0x community on Discord](https://discord.com/invite/tNWkzgUwTQ)** **& [Join the 0x team](https://boards.greenhouse.io/0x)**\n\n*   0x API user base in June peaked at ~196k, which has doubled compared with May. It totals up to ~200k when 0x native contracts traffic combined. Among them, 100k are Ethereum traders through various applications. New user growth was mainly contributed by the Polygon community -- since the launch on Polygon, over 70k users have traded via 0x API, ~90% of whom are brought by Zapper. _First 2 weeks of July show that the scale of Polygon active users is relatively same as Ethereum on 0x API already_. The first 2 weeks of July show that the scale of active Polygon users is already relatively close to those of Ethereum on 0x API.\n    \n\n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F831afb9d-abc5-44ca-9273-444435563285_1316x754.png)\n\n*   Under extremely volatile market condition in May, 0x API volume rocketed to ~3X monthly, with a total of $8.56B across chain ($17.8b when combined with native contracts). Around May 19th, rolling-24h volume hit _$1b all-time-highs_. Matcha attributes to ~50% of the volume steadily over the past months.\n    \n\n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0ef6ecb6-267a-4649-9e87-727ca8a0dd81_1582x944.png)\n\n*   In June, Matcha 2.0 launched with a series of feature releases including fiat-on-ramp, multi-chain trading, OTC trading, dark mode, and asset and portfolio tracking. Its volume dominated across integrators in the past 2 months with a total of ~$6b. DeFiSaver took 2nd place with a total of $2b.\n    \n\n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F1e55f977-5f2c-4d38-8f49-71041a7447a2_1322x748.png)\n\n* * *\n\n**③ 1inch Network**\n===================\n\n**👥  [Nikita Ovchinnik](https://twitter.com/nickicoin) & [Valeriya Minaeva](https://twitter.com/missminaeva)**\n\n**📈 1inch is the 2nd biggest App in DeFi**\n\n**👉 [Join The 1inch Community On Twitter](https://twitter.com/1inch)** **& [Become a 1inch contributor](https://1inch.io/contributors/)**\n\n*   The 1inch Network has taken a leading position on the current landscape of DeFi protocols by user numbers, currently ranked №2. The 1inch DEX aggregator’s numbers have increased by notable rates since January 2021 and have surpassed the majority of applications that were previously further ahead, reaching over 520,000 active users on the Ethereum network alone. (Source: Dune Analytics)\n    \n\n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F37280712-03f2-443a-af3d-a98861d52eaa_2383x1472.png)\n\n*   1inch iOS Wallet numbers: 100k+ downloads. Shortening the path between DeFi and retail users brings growth to the 1inch Wallet for iOS with a native DeFi trading experience. 1inch was able to successfully capitalize on a well-established market of wallets and demonstrate large trading activity.\n \n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F88434678-d08e-440f-8994-d4326857eea3_2294x1420.png)\n*   The 1inch Limit Order Protocol is released, $120m+ volume achieved. It replaces a legacy solution from 0x in the 1inch dApp, offering users much more efficient and flexible limit order swaps and access to features that generate significant cash on-chain. ([Source: Dune Analytics](https://duneanalytics.com/k06a/1inch-Limit-Order-Protocol))\n    \n\n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4e16c8cb-f0fd-4892-8487-60f76c78c26e_2177x1344.png)\n\n* * *\n\n**④ Opyn**\n==========\n\n**👥 [Wade Prospere](https://twitter.com/wadepros)**\n\n**📈 Opyn Reaches All Time High TVL And Volume Traded**\n\n*   Opyn is a capital-efficient DeFi options trading protocol that allows users to buy, sell, and create options on ERC20s. At time of writing, there is currently an all- time-high of $74.93m of collateral locked in Opyn option contracts. The 601% increase in TVL since April 12 is due to Ribbon Finance bringing structured products to DeFi. Structured products take options and other complex derivatives and turn them into simple, automated positions that are easy for users to understand. (Source: DeFi Pulse)\n    \n\n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4279460e-50be-46b0-b33a-83158d9791ba_1232x636.png)\n\n*   Opyn launched the first-ever partially collateralized options in DeFi on June 29, and after 1 week, 20% of short vaults on Opyn are partially collateralized. There are currently 2k WETH and $1m USDC held in partially collateralized vaults, with an average collateralization ratio of 87.53%. (Source: [Opyn KPI Dashboard](https://github.com/anishnuni/Opyn_KPI_Dashboard))\n    \n\n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F70a0f83d-5790-4dea-8534-9f92f171f04b_1244x598.png)\n\n\n*   Opyn’s total notional volume grew to its highest level in June with $202mm in notional volume, $148m of which coming from ETH put and call options, $53mm from WBTC call options, and around $613k from UNI call and put options. Notional = option \\* price of asset at time of trade. (Source: [Opyn KPI Dashboard](https://github.com/anishnuni/Opyn_KPI_Dashboard))\n    \n\n [![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F14ff2d38-de98-4882-bffe-1208c678e64e_1238x620.png)\n\n* * *\n**About the editor:** [Spencer Noon](https://twitter.com/spencernoon) is General Partner at [Variant](https://variant.fund/), a first-check crypto VC fund.", "timestamp": 1626462080, "digest": "Bz7r0ycBzj6cgSBag-J4HGhGCUWvltVA_rJxAI2s_m0", "contributor": "0x9C159121CEEBF937E9bad98fd0c895d7f6038bd4"}
