{"id": "BvOIPULTQe9twHwx4royU0bD2m5TnhGnjvLiz7ERRtA", "title": "Protocols and Creator DAOs: Economic Flows and Cultural Products", "body": "a [glick](https://twitter.com/jonathanglick) x [tal](https://twitter.com/tweettal) x [flynn](https://twitter.com/Flynnjamm) x [darkstar](https://twitter.com/jarroddicker) jam\n\n![](https://images.mirror-media.xyz/publication-images/999034c9-4b69-4ab7-ab2e-b8cc11fe7cb2.png?height=377&width=610)\n\nAt the edge of the steppes was a bend in the great river. On one side lived herdsmen, on the other were forest people. The nomads valued the forest-dwellers axes and baskets. The forest-dwellers loved the herder’s hides and wool. As the two sides became more familiar with each other, they began to trade. \n\nWithin a few years, there was a temporary camp in that bend of the river. It was a perfect place to meet. The two sides would do business, swap stories and eat together. Soon traders were coming throughout the year. The camp became permanent and then became a town. People lived there all the time, a new community formed of people from both sides, catering to the growing number of visitors bringing goods to sell. \n\nThanks to its unique location for efficient trade, the town grew quickly and became rich. The richest people built houses, but they also did something else: they built public places. They used their new wealth to make their town even more attractive. They built temples, theaters, schools and libraries, and they funded the priests, playwrights, teachers and scholars who filled them with culture. \n\nThis, more or less, is the founding pattern of most of our great cities, the origin story of much of our civilization. A location uniquely conducive to trade becomes a permanent settlement. As the trade grows, the wealth of the community does also, and this wealth is used to fund spaces and content to glorify the town, enlighten and entertain its citizens and attract more visitors.\n\nWhen we think about the creation of culture on the blockchain, it is tempting for media people to imagine it freestanding. As if culture were raught whole cloth. [We have written about Creator DAOs](https://darkstar.mirror.xyz/Tf9IS6yNxtPXwC5mmfi_UISe8v6BOfef2bDmQSxoJao) almost as startups emerging from only the imagination of their founders. That’s certainly possible, and those projects will succeed when the products they create are immensely popular. But there’s a more likely path for the first of these projects, mirroring the growth of culture in those first cities. That is to say, culture and creation via patronage and communal backing.\n\nOn the crypto map, the most successful protocols are like that bend in the river, the perfect point for value to flow in both directions. A locus for value creation and trade. And when the protocols granted ownership, they went from being purely transactional to communal. They became settlements. (Ali Yahya, Devon Zuegel, Denis Nazarov and Jesse Walden [riffed on that exact analogy in this wonderful A16Z-hosted discussion](https://a16z.com/2018/07/26/cryptonetworks-cities-analogies/).) The inevitable next step is the development of culture around those settlements, and given the soaring value of protocol treasuries, these communities have the financial means to support it.\n\nWhat does that look like? \n\nCrypto is a ‘nation’ in which communities are now sprouting with their own distinct cultures. The simplest examples are the meme-art that has erupted around tokens. Bitcoin’s laser eyes. Beeple’s Into the Ether. All supported by the flow of funding from passionate investor-fans into NFTs. Another example are the simple websites that have emerged to help newcomers understand and take advantage of the protocol. [Here’s the Zed Gazette](https://zedgazette.com/top-articles/), self-appointed newspaper for the horse-racing game Zed Run, supported by [merch](https://zedstore.run). Another is [The First Mint](https://www.getrevue.co/profile/thefirstmint), a fan-created media brand for the popular NBA Top Shot. But Uniswap is leading the next-generation of this idea. The protocol is enabling [artists](https://twitter.com/haydenzadams/status/1390042383065178114) to design on-chain SVG generators that will create unique NFTs to represent LP positions on the protocol. \n\nBut these examples are just the beginning. As a protocol evolves, there is a sense of responsibility from participating token holders to maintain and evolve the ecosystem being built around it. Like early civilization, there is both a proactive and reactive investment to foster the “city” in order to strengthen its infrastructure, accessibility and desirability. As token holders are owners of the protocol and are incentivized to have it succeed, the role of tokens moves from transactional (i sell for profit) to wealth (i hold for proprietary rights). And this mechanism drives development that welcomes more residents as well as tourists to visit and partake in the civilization’s developments and culture. If the meme is the message, then a protocols’ greatest moat and differentiator may very well end up being the culture it spawned around it.\n\nAnd the funding and interest exists for vastly more ambitious creative projects than the crypto equivalent of training materials, corporate PR and investor relations websites. Look at the scale of these community’s resources: https://open-orgs.info. This is communal wealth built at a scale and speed never before seen.\n\n![](https://images.mirror-media.xyz/publication-images/8051d2dc-9704-4341-948c-e96d7ae3f87d.png?height=556&width=1008)\n\nSo what sort of creations could be funded by the protocols and built out by Creator DAOs? \n\n- The most obvious is ‘identity art’ for the protocol community to enjoy and share. An Artist DAO could create a whole world of NFTs, tens of thousands of unique items to be dropped to token-holders, perhaps depending on their bag size, history and contributions to the community. As we move into the Metaverse, these NFT could evolve into protocol-branded wearables or vehicles, the meta-equivalent of t-shirts and bumper stickers. (Hey, not all culture is high brow.) \n\n- Another valuable project would be definitive reference material on blockchain projects, a so-called ‘Encyclopedia Cryptologica.’ There’s barely any quality, carefully reviewed information on most projects, tokens, concepts -- and where there is, it’s not easily searchable. Only a DAO (or its Wikipedia-like precursor) could mobilize and compensate the huge number of experts and researchers necessary to maintain a living encyclopedia for our exponentially expanding gowing crypto world. \n\n- Of course such a project suggests that financial media and ‘literacy’ programs may in general be worthwhile cultural institutions. Imagine a 24/7 CNBC of crypto -- interviews with leading developers and investors, regulators and politicians -- but entirely run by a Creator DAO. Imagine crypto-literacy programs to help potential investors understand the risks of leverage, understand liquidity, volatility, etc.\n\n- On the other side of the crypto equation, computer science and crypto-business courses would be valuable educational content products. Investing in these projects may be analogous to community-like events which encourage you to support and contribute to the community.\n\n- But there could also be other media types produced, like movies. Crypto is about enabling decentralization to promote creativity and prohibit censorship. So how about a film series about how marginalized creators and communities using the blockchain to enable and express themselves? Or about artists and inventors who fought centralized control in the past? How about a whole film festival?\n\n- New prosperous communities often invent and patronize their own musical culture, a sound and style that stands for their unique perspective on the world. 18th Century European bourgeoisie loved the opera. Baby boomers had rock and roll. Just in time, we have DAO systems like Songcamp, where artists can collaborate and share in the results. Is this the melody of the blockchain? Click and be amazed: (https://twitter.com/songcampdotband/status/1389285939277701122?s=20)\n\n- It’s also not hard to imagine funding for debate societies, legal and political conferences and lobbying efforts, even full-fledged science and technology journals. We may even see funding for IRL social events, like Happy Hours, or their digital equivalents. \n\nOf course, different protocols have different missions and their communities will support their own distinct cultural products. A blockchain devoted to lower electricity consumption for climate purposes will foster creativity around ecological issues. And, indeed, you can see that happening within the NFT community of Hicetnunc, minted on a chain those artists consider better for the planet.\n\nWhat’s really interesting about the relationship between economics and culture is how the culture flows back into the economy. Crossroads towns that built out shrines and cathedrals for their often flimsily-historical patron saints attracted more traffic to their markets. These structures attract tourism and talent that plant their roots and build upon the foundation of what already exists. And the seriousness of the devotion for that culture drove a sense of civic duty that caused citizens to invest in and defend their cities. \n\nWe cannot underestimate the enormous emotional power that creative products instill in the communities that invest in and embrace them. It often takes time for the full significance of these products to emerge. Their potential impact is rarely obvious. The paths they take can be strange. Consider the song that has become the anthem of New York City, played at sporting events, parades and, most strikingly, during the darkest hours of the Covid epidemic. “N*ew York New York”*”was written as a title tune to a forgettable 1977 Robert DeNiro-Liza Minelli movie, then picked up by Sinatra. Somehow, the words perfectly represent the city. B*omp, bomp, bah-de-dah.*.How many people have been subtly inspired to visit or move to New York because of it? How many people found hope in it this past year? The song has become so ingrained in the city’s DNA that is no longer the song from the movie or the song from Sinatra. It’s New York’s song. \n\nWe may be seeing the beginnings of this kind of culture formation in crypto. In fact, it may be even turbocharged, as crypto enables the financialization of social and communal activity in a manner never before seen. This makes clear the need and role for ambitious and thoughtful cultural governance now that creative structures, businesses and behaviors are being built on top of the protocol’s foundation. As proverbial neighborhoods sprout up, subcultures will be built in reaction to the constructs and its visitors and identity will evolve. In doing so, this activity will begin to invite criticism of how or what is built, by those most deeply invested in the protocol and the community it’s fostered. There will be disagreements. There will be overly kitsch and propagandistic creation. But in the end, the protocols that can produce the most meaningful and lasting communities, in large part through content and cultural creation, will be the most lasting, wealthiest and important. In crypto, soft power is everything. \n\n[The proceeds of this NFT will go towards protocol treasuries mentioned and the co-authors of this post.](split://0x27E3Fdccc6e4f422f4Cc0961294e907F5f31284B?network=mainnet)\n\n\n\n", "timestamp": 1620319572, "digest": "yEK4DdvmxwZ2l-yHWGOQs3rMsLD6RYs_phLUzSFdhAI", "contributor": "0x7FdCA0A469Ea8b50b92322aFc0215b67D56A5e9A"}
{"id": "yaplLT5l9_Er7hnNOLgsZMTGf6HGZAa-Rzalt6gg-q0", "title": "Protocols and Creator DAOs: Economic Flows and Cultural Products", "body": "***The proceeds of this NFT will go towards protocol treasuries mentioned and the co-authors of this post.***\n\na [glick](https://twitter.com/jonathanglick) x [tal](https://twitter.com/tweettal) x [flynn](https://twitter.com/Flynnjamm) x [darkstar](https://twitter.com/jarroddicker) jam\n\n![](https://images.mirror-media.xyz/publication-images/999034c9-4b69-4ab7-ab2e-b8cc11fe7cb2.png?height=377&width=610)\n\nAt the edge of the steppes was a bend in the great river. On one side lived herdsmen, on the other were forest people. The nomads valued the forest-dwellers axes and baskets. The forest-dwellers loved the herder’s hides and wool. As the two sides became more familiar with each other, they began to trade. \n\nWithin a few years, there was a temporary camp in that bend of the river. It was a perfect place to meet. The two sides would do business, swap stories and eat together. Soon traders were coming throughout the year. The camp became permanent and then became a town. People lived there all the time, a new community formed of people from both sides, catering to the growing number of visitors bringing goods to sell. \n\nThanks to its unique location for efficient trade, the town grew quickly and became rich. The richest people built houses, but they also did something else: they built public places. They used their new wealth to make their town even more attractive. They built temples, theaters, schools and libraries, and they funded the priests, playwrights, teachers and scholars who filled them with culture. \n\nThis, more or less, is the founding pattern of most of our great cities, the origin story of much of our civilization. A location uniquely conducive to trade becomes a permanent settlement. As the trade grows, the wealth of the community does also, and this wealth is used to fund spaces and content to glorify the town, enlighten and entertain its citizens and attract more visitors.\n\nWhen we think about the creation of culture on the blockchain, it is tempting for media people to imagine it freestanding. As if culture were raught whole cloth. [We have written about Creator DAOs](https://darkstar.mirror.xyz/Tf9IS6yNxtPXwC5mmfi_UISe8v6BOfef2bDmQSxoJao) almost as startups emerging from only the imagination of their founders. That’s certainly possible, and those projects will succeed when the products they create are immensely popular. But there’s a more likely path for the first of these projects, mirroring the growth of culture in those first cities. That is to say, culture and creation via patronage and communal backing.\n\nOn the crypto map, the most successful protocols are like that bend in the river, the perfect point for value to flow in both directions. A locus for value creation and trade. And when the protocols granted ownership, they went from being purely transactional to communal. They became settlements. (Ali Yahya, Devon Zuegel, Denis Nazarov and Jesse Walden [riffed on that exact analogy in this wonderful A16Z-hosted discussion](https://a16z.com/2018/07/26/cryptonetworks-cities-analogies/).) The inevitable next step is the development of culture around those settlements, and given the soaring value of protocol treasuries, these communities have the financial means to support it.\n\nWhat does that look like? \n\nCrypto is a ‘nation’ in which communities are now sprouting with their own distinct cultures. The simplest examples are the meme-art that has erupted around tokens. Bitcoin’s laser eyes. Beeple’s Into the Ether. All supported by the flow of funding from passionate investor-fans into NFTs. Another example are the simple websites that have emerged to help newcomers understand and take advantage of the protocol. [Here’s the Zed Gazette](https://zedgazette.com/top-articles/), self-appointed newspaper for the horse-racing game Zed Run, supported by [merch](https://zedstore.run). Another is [The First Mint](https://www.getrevue.co/profile/thefirstmint), a fan-created media brand for the popular NBA Top Shot. But Uniswap is leading the next-generation of this idea. The protocol is enabling [artists](https://twitter.com/haydenzadams/status/1390042383065178114) to design on-chain SVG generators that will create unique NFTs to represent LP positions on the protocol. \n\nBut these examples are just the beginning. As a protocol evolves, there is a sense of responsibility from participating token holders to maintain and evolve the ecosystem being built around it. Like early civilization, there is both a proactive and reactive investment to foster the “city” in order to strengthen its infrastructure, accessibility and desirability. As token holders are owners of the protocol and are incentivized to have it succeed, the role of tokens moves from transactional (i sell for profit) to wealth (i hold for proprietary rights). And this mechanism drives development that welcomes more residents as well as tourists to visit and partake in the civilization’s developments and culture. If the meme is the message, then a protocols’ greatest moat and differentiator may very well end up being the culture it spawned around it.\n\nAnd the funding and interest exists for vastly more ambitious creative projects than the crypto equivalent of training materials, corporate PR and investor relations websites. Look at the scale of these community’s resources: https://open-orgs.info. This is communal wealth built at a scale and speed never before seen.\n\n![](https://images.mirror-media.xyz/publication-images/8051d2dc-9704-4341-948c-e96d7ae3f87d.png?height=556&width=1008)\n\nSo what sort of creations could be funded by the protocols and built out by Creator DAOs? \n\n- The most obvious is ‘identity art’ for the protocol community to enjoy and share. An Artist DAO could create a whole world of NFTs, tens of thousands of unique items to be dropped to token-holders, perhaps depending on their bag size, history and contributions to the community. As we move into the Metaverse, these NFT could evolve into protocol-branded wearables or vehicles, the meta-equivalent of t-shirts and bumper stickers. (Hey, not all culture is high brow.) \n\n- Another valuable project would be definitive reference material on blockchain projects, a so-called ‘Encyclopedia Cryptologica.’ There’s barely any quality, carefully reviewed information on most projects, tokens, concepts -- and where there is, it’s not easily searchable. Only a DAO (or its Wikipedia-like precursor) could mobilize and compensate the huge number of experts and researchers necessary to maintain a living encyclopedia for our exponentially expanding gowing crypto world. \n\n- Of course such a project suggests that financial media and ‘literacy’ programs may in general be worthwhile cultural institutions. Imagine a 24/7 CNBC of crypto -- interviews with leading developers and investors, regulators and politicians -- but entirely run by a Creator DAO. Imagine crypto-literacy programs to help potential investors understand the risks of leverage, understand liquidity, volatility, etc.\n\n- On the other side of the crypto equation, computer science and crypto-business courses would be valuable educational content products. Investing in these projects may be analogous to community-like events which encourage you to support and contribute to the community.\n\n- But there could also be other media types produced, like movies. Crypto is about enabling decentralization to promote creativity and prohibit censorship. So how about a film series about how marginalized creators and communities using the blockchain to enable and express themselves? Or about artists and inventors who fought centralized control in the past? How about a whole film festival?\n\n- New prosperous communities often invent and patronize their own musical culture, a sound and style that stands for their unique perspective on the world. 18th Century European bourgeoisie loved the opera. Baby boomers had rock and roll. Just in time, we have DAO systems like Songcamp, where artists can collaborate and share in the results. Is this the melody of the blockchain? Click and be amazed: (https://twitter.com/songcampdotband/status/1389285939277701122?s=20)\n\n- It’s also not hard to imagine funding for debate societies, legal and political conferences and lobbying efforts, even full-fledged science and technology journals. We may even see funding for IRL social events, like Happy Hours, or their digital equivalents. \n\nOf course, different protocols have different missions and their communities will support their own distinct cultural products. A blockchain devoted to lower electricity consumption for climate purposes will foster creativity around ecological issues. And, indeed, you can see that happening within the NFT community of Hicetnunc, minted on a chain those artists consider better for the planet.\n\nWhat’s really interesting about the relationship between economics and culture is how the culture flows back into the economy. Crossroads towns that built out shrines and cathedrals for their often flimsily-historical patron saints attracted more traffic to their markets. These structures attract tourism and talent that plant their roots and build upon the foundation of what already exists. And the seriousness of the devotion for that culture drove a sense of civic duty that caused citizens to invest in and defend their cities. \n\nWe cannot underestimate the enormous emotional power that creative products instill in the communities that invest in and embrace them. It often takes time for the full significance of these products to emerge. Their potential impact is rarely obvious. The paths they take can be strange. Consider the song that has become the anthem of New York City, played at sporting events, parades and, most strikingly, during the darkest hours of the Covid epidemic. “N*ew York New York”*”was written as a title tune to a forgettable 1977 Robert DeNiro-Liza Minelli movie, then picked up by Sinatra. Somehow, the words perfectly represent the city. B*omp, bomp, bah-de-dah.*.How many people have been subtly inspired to visit or move to New York because of it? How many people found hope in it this past year? The song has become so ingrained in the city’s DNA that is no longer the song from the movie or the song from Sinatra. It’s New York’s song. \n\nWe may be seeing the beginnings of this kind of culture formation in crypto. In fact, it may be even turbocharged, as crypto enables the financialization of social and communal activity in a manner never before seen. This makes clear the need and role for ambitious and thoughtful cultural governance now that creative structures, businesses and behaviors are being built on top of the protocol’s foundation. As proverbial neighborhoods sprout up, subcultures will be built in reaction to the constructs and its visitors and identity will evolve. In doing so, this activity will begin to invite criticism of how or what is built, by those most deeply invested in the protocol and the community it’s fostered. There will be disagreements. There will be overly kitsch and propagandistic creation. But in the end, the protocols that can produce the most meaningful and lasting communities, in large part through content and cultural creation, will be the most lasting, wealthiest and important. In crypto, soft power is everything. \n\n[The proceeds of this NFT will go towards protocol treasuries mentioned and the co-authors of this post.](split://0x27E3Fdccc6e4f422f4Cc0961294e907F5f31284B?network=mainnet)\n\n\n\n", "timestamp": 1620319949, "digest": "yEK4DdvmxwZ2l-yHWGOQs3rMsLD6RYs_phLUzSFdhAI", "contributor": "0x7FdCA0A469Ea8b50b92322aFc0215b67D56A5e9A"}
{"id": "uOIs5nQiQyN8cqX6FZ1ivuc8zGWaTG99hchYj2q4U2U", "title": "Engineering Splits", "body": "Mirror recently introduced [splits](https://dev.mirror.xyz/mQ03-JXlfdoBnRrZisC5X3kM9nBkOILlHwxbdq382Gw), a native feature that lets you route funds continuously to an unlimited number of Ethereum addresses, according to a set of percentage allocations.\n\nBut what did it take for splits to evolve from an idea to a set of efficient, production ready smart contracts on Ethereum? Read the full story in this post!\n\n## How do Mirror Splits Work?\n\nThere were three problems that we needed to solve for splits:\n\n1. Each split needs a unique address that can be used to receive funds from an economic producer (e.g. NFT auction, crowdfund, or just an EOA sending ETH). It needs be cheap to deploy and specify the split allocations.\n2. Splits need to allow allocations for many accounts, while being relatively cheap to distribute the funds. At first we were thinking in the range of 15-20 accounts.\n3. Splits need to be reusable — accounts should be able to withdraw and deposit multiple times\n\nTo solve the unique address problem, we use a simple proxy pattern that allows us to deploy a contract that only stores some storage variables and delegates all functionality to a core logic contract. This makes it cheap to have unique addresses, and is a fairly common approach in protocol design. It costs 233,315 gas to deploy a Split, which today would be about $50.\n\nWhen we first set out to build our split mechanism, we tried a number of different approaches. The first one was naive: a contract with a function that efficiently sends its balance to a pre-set list of addresses cheaply, according to some allocation verified against a hash.\n\nBut what if we wanted to split across 30 addresses? This would make it more expensive to operate, since costs scale linearly with the number of allocations. And 100? At that point, the paradigm breaks down completely.\n\nWe decided to try a different approach, using some of the core cryptographic primitives of Ethereum to enable cheap splits. In the next section, we'll go over how these work, and how we integrated them into a useful new feature.\n\n### Technical Foundations: Understanding Merkle Trees\n\nThe Merkle tree is perhaps the most salient data structure in blockchain architecture. It can be used to create a very small representation of a large amount of data, while still enabling one to prove certain information about the original data in an efficient way. \n\nTo create and use a Merkle tree, we split our data into chunks, structuring them as a tree (e.g. a binary tree), and then hash the nodes together repeatedly until we get a root hash. We can use the root hash to prove whether some chunk of data was in the original tree at a given location, without needing to share all of the original data. This kind of proof is known as a Merkle Proof.\n\n![We can prove the existence of node 2, using only the root hash and a Merkle Proof.\n](https://images.mirror-media.xyz/publication-images/11b49380-e373-4af2-810f-2823c5baddc2.jpeg?height=1138&width=2024)\n\nGiven a public Merkle Root, we can prove that some data (e.g. a balance) exists at a given place in the tree, by verifying a Merkle Proof. For example, we can provide a proof that Hash 2 is in the given place in this tree.\n\nA simple application of a Merkle Proof is to create a Merkle tree for a large database of balances, and publish the root. When someone wants to know what the balance is for a given address, we can return the balance and a proof, which can be verified (assuming you trust the published root) without downloading the contents of the database.\n\nTherefore, we can prove facts of a large dataset, even when we only access a very small amount of data. Each block in Ethereum contains multiple Merkle trees to prove various aspects of Ethereum's state and state transitions.\n\n### On-chain Merkle Proofs\n\nWhile Merkle Proofs have been primarily used as the foundation of core blockchain architecture, they have also found uses in applications built on top of blockchains. \n\nSmart contracts that verify Merkle Proofs have been around for many years — for example [Raiden's implementation](https://github.com/raiden-network/raiden/blob/5a82ff6799c94c11df57f3b545ac3eb2381aa89c/raiden/smart_contracts/NettingChannelLibrary.sol#L291-L345) in early 2017, and Ameen Soleimani's later [port of it](https://github.com/ameensol/merkle-tree-solidity). \n\nThe most popular application has probably been [Uniswap's 2021 airdrop of 150 million UNI](https://uniswap.org/blog/uni/) to hundreds of thousands of addresses. It would have been infeasible to airdrop tokens to this many addresses without Merkle Proofs — the proofs allowed users to retroactively *claim* their share of the airdrop, instead of Uniswap needing to send an ERC20 transaction to each address up-front.\n\n### Integration with Splits on Mirror\n\nWith Splits, our goal was to allow someone to specify a list of funding allocations of any length, and then allow those accounts to withdraw funds according to their allocation — without costing the deployer or funder an excessive amount of gas.\n\nSo we built upon the existing open-source solutions that used Merkle proofs for airdrops — namely, [Uniswap's implementation](https://github.com/Uniswap/merkle-distributor) — and changed it to allow for a percentage allocation instead of an exact amount. We also added some more functionality to allow for continual use of the contract. One can fund the contract multiple times and allow recipients to keep claiming their allocation. We have open-sourced Splits here: [https://github.com/mirror-xyz/splits](https://github.com/mirror-xyz/splits)\n\nThe challenge with allowing continual claiming of an allocation is that, once someone has claimed their allocation, we need some way to prevent them from claiming the same quantity again. A recipient should only be able to claim once from a given deposit.\n\n**Claim Windows**\n\nOne way to solve this problem would be to track each claim, but this would use a lot of storage and gas to operate. Instead, we decided to add a concept of a claim \"window\" — an interval for which you could claim an allocation, at any time. The flow for this model is as follows:\n\n1. The allocation is specified, and the Merkle proof is set on the contract\n2. Funds are deposited into the contract\n3. The window is incremented from 0 to 1\n4. Anyone can claim their allocation for the first window\n5. More funds are added\n6. The window is incremented from 1 to 2\n7. Anyone can claim their allocation for the first or the second window, or both in the same transaction\n\nIn this way, we allowed perpetual claiming of allocations from a contract using Merkle proofs!\n\n## Future Work\n\nWe think it would be interesting if someone could claim their funds across multiple splits from one address. This would allow someone to accrue revenue continuously from being involved in different splits, and then be able to withdraw all of that in one transaction.\n\nIt's also unclear at the moment how this is implemented on layer 2. It might be the case that L2 transfers are so cheap that much of this is over-engineering for a given use-case. We'll have to do more experiments to see, but at the moment there is some demand for this functionality directly on L1.\n\nIt would also be interesting to see this architecture being used for important projects such as governance funding — whereby a percentage allocation is budgeted for different departments, and now can be fully transparent and on-chain.\n\nWe've also received feedback from people that they'd like to see a real-time dashboard of all the created splits and how much people have received over time. Eventually it could become one component of generating on-chain reputation for applications like credit scores.\n\n*It is important to note that splits currently only work with ETH. ERC-20 tokens sent to a split will be permanently lost.*", "timestamp": 1620324160, "digest": "V_7Jp1hy_g8bz-J1B4Wb5KYSmj5Lt4W7q7cw0noxJsU", "contributor": "0x9651B2a7Aa9ed9635cE896a1Af1a7d6294d5e902"}
{"id": "6zcrpFjBh5Z7J2fRhGlAePAHvdHsLivRQjXZ0_T4NTc", "title": "Protocols and Creator DAOs: Economic Flows and Cultural Products", "body": "a [glick](https://twitter.com/jonathanglick) x [tal](https://twitter.com/tweettal) x [flynn](https://twitter.com/Flynnjamm) x [darkstar](https://twitter.com/jarroddicker) jam\n\n![](https://images.mirror-media.xyz/publication-images/999034c9-4b69-4ab7-ab2e-b8cc11fe7cb2.png?height=377&width=610)\n\nAt the edge of the steppes was a bend in the great river. On one side lived herdsmen, on the other were forest people. The nomads valued the forest-dwellers axes and baskets. The forest-dwellers loved the herder’s hides and wool. As the two sides became more familiar with each other, they began to trade. \n\nWithin a few years, there was a temporary camp in that bend of the river. It was a perfect place to meet. The two sides would do business, swap stories and eat together. Soon traders were coming throughout the year. The camp became permanent and then became a town. People lived there all the time, a new community formed of people from both sides, catering to the growing number of visitors bringing goods to sell. \n\nThanks to its unique location for efficient trade, the town grew quickly and became rich. The richest people built houses, but they also did something else: they built public places. They used their new wealth to make their town even more attractive. They built temples, theaters, schools and libraries, and they funded the priests, playwrights, teachers and scholars who filled them with culture. \n\nThis, more or less, is the founding pattern of most of our great cities, the origin story of much of our civilization. A location uniquely conducive to trade becomes a permanent settlement. As the trade grows, the wealth of the community does also, and this wealth is used to fund spaces and content to glorify the town, enlighten and entertain its citizens and attract more visitors.\n\nWhen we think about the creation of culture on the blockchain, it is tempting for media people to imagine it freestanding. As if culture were raught whole cloth. [We have written about Creator DAOs](https://darkstar.mirror.xyz/Tf9IS6yNxtPXwC5mmfi_UISe8v6BOfef2bDmQSxoJao) almost as startups emerging from only the imagination of their founders. That’s certainly possible, and those projects will succeed when the products they create are immensely popular. But there’s a more likely path for the first of these projects, mirroring the growth of culture in those first cities. That is to say, culture and creation via patronage and communal backing.\n\nOn the crypto map, the most successful protocols are like that bend in the river, the perfect point for value to flow in both directions. A locus for value creation and trade. And when the protocols granted ownership, they went from being purely transactional to communal. They became settlements. (Ali Yahya, Devon Zuegel, Denis Nazarov and Jesse Walden [riffed on that exact analogy in this wonderful A16Z-hosted discussion](https://a16z.com/2018/07/26/cryptonetworks-cities-analogies/).) The inevitable next step is the development of culture around those settlements, and given the soaring value of protocol treasuries, these communities have the financial means to support it.\n\nWhat does that look like? \n\nCrypto is a ‘nation’ in which communities are now sprouting with their own distinct cultures. The simplest examples are the meme-art that has erupted around tokens. Bitcoin’s laser eyes. Beeple’s Into the Ether. All supported by the flow of funding from passionate investor-fans into NFTs. Another example are the simple websites that have emerged to help newcomers understand and take advantage of the protocol. [Here’s the Zed Gazette](https://zedgazette.com/top-articles/), self-appointed newspaper for the horse-racing game Zed Run, supported by [merch](https://zedstore.run). Another is [The First Mint](https://www.getrevue.co/profile/thefirstmint), a fan-created media brand for the popular NBA Top Shot. But Uniswap is leading the next-generation of this idea. The protocol is enabling [artists](https://twitter.com/haydenzadams/status/1390042383065178114) to design on-chain SVG generators that will create unique NFTs to represent LP positions on the protocol. \n\nBut these examples are just the beginning. As a protocol evolves, there is a sense of responsibility from participating token holders to maintain and evolve the ecosystem being built around it. Like early civilization, there is both a proactive and reactive investment to foster the “city” in order to strengthen its infrastructure, accessibility and desirability. As token holders are owners of the protocol and are incentivized to have it succeed, the role of tokens moves from transactional (i sell for profit) to wealth (i hold for proprietary rights). And this mechanism drives development that welcomes more residents as well as tourists to visit and partake in the civilization’s developments and culture. If the meme is the message, then a protocols’ greatest moat and differentiator may very well end up being the culture it spawned around it.\n\nAnd the funding and interest exists for vastly more ambitious creative projects than the crypto equivalent of training materials, corporate PR and investor relations websites. Look at the scale of these community’s resources: https://open-orgs.info. This is communal wealth built at a scale and speed never before seen.\n\n![](https://images.mirror-media.xyz/publication-images/8051d2dc-9704-4341-948c-e96d7ae3f87d.png?height=556&width=1008)\n\nSo what sort of creations could be funded by the protocols and built out by Creator DAOs? \n\n- The most obvious is ‘identity art’ for the protocol community to enjoy and share. An Artist DAO could create a whole world of NFTs, tens of thousands of unique items to be dropped to token-holders, perhaps depending on their bag size, history and contributions to the community. As we move into the Metaverse, these NFT could evolve into protocol-branded wearables or vehicles, the meta-equivalent of t-shirts and bumper stickers. (Hey, not all culture is high brow.) \n\n- Another valuable project would be definitive reference material on blockchain projects, a so-called ‘Encyclopedia Cryptologica.’ There’s barely any quality, carefully reviewed information on most projects, tokens, concepts -- and where there is, it’s not easily searchable. Only a DAO (or its Wikipedia-like precursor) could mobilize and compensate the huge number of experts and researchers necessary to maintain a living encyclopedia for our exponentially expanding gowing crypto world. \n\n- Of course such a project suggests that financial media and ‘literacy’ programs may in general be worthwhile cultural institutions. Imagine a 24/7 CNBC of crypto -- interviews with leading developers and investors, regulators and politicians -- but entirely run by a Creator DAO. Imagine crypto-literacy programs to help potential investors understand the risks of leverage, understand liquidity, volatility, etc.\n\n- On the other side of the crypto equation, computer science and crypto-business courses would be valuable educational content products. Investing in these projects may be analogous to community-like events which encourage you to support and contribute to the community.\n\n- But there could also be other media types produced, like movies. Crypto is about enabling decentralization to promote creativity and prohibit censorship. So how about a film series about how marginalized creators and communities are using the blockchain to enable and express themselves? Or about artists and inventors who fought centralized control in the past? How about a whole film festival?\n\n- New prosperous communities often invent and patronize their own musical culture, a sound and style that stands for their unique perspective on the world. 18th Century European bourgeoisie loved the opera. Baby boomers had rock and roll. Just in time, we have DAO systems like Songcamp, where artists can collaborate and share in the results. Is this the melody of the blockchain? Click and be amazed: (https://twitter.com/songcampdotband/status/1389285939277701122?s=20)\n\n- It’s also not hard to imagine funding for debate societies, legal and political conferences and lobbying efforts, even full-fledged science and technology journals. We may even see funding for IRL social events, like Happy Hours, or their digital equivalents. \n\nOf course, different protocols have different missions and their communities will support their own distinct cultural products. A blockchain devoted to lower electricity consumption for climate purposes will foster creativity around ecological issues. And, indeed, you can see that happening within the NFT community of Hicetnunc, minted on a chain those artists consider better for the planet.\n\nWhat’s really interesting about the relationship between economics and culture is how the culture flows back into the economy. Crossroads towns that built out shrines and cathedrals for their often flimsily-historical patron saints attracted more traffic to their markets. These structures attract tourism and talent that plant their roots and build upon the foundation of what already exists. And the seriousness of the devotion for that culture drove a sense of civic duty that caused citizens to invest in and defend their cities. \n\nWe cannot underestimate the enormous emotional power that creative products instill in the communities that invest in and embrace them. It often takes time for the full significance of these products to emerge. Their potential impact is rarely obvious. The paths they take can be strange. Consider the song that has become the anthem of New York City, played at sporting events, parades and, most strikingly, during the darkest hours of the Covid epidemic. *“New York New York”* was written as a title tune to a forgettable 1977 Robert DeNiro-Liza Minelli movie, then picked up by Sinatra. Somehow, the words perfectly represent the city. *Bomp, bomp, bah-de-dah.*.How many people have been subtly inspired to visit or move to New York because of it? How many people found hope in it this past year? The song has become so ingrained in the city’s DNA that is no longer the song from the movie or the song from Sinatra. It’s New York’s song. \n\nWe may be seeing the beginnings of this kind of culture formation in crypto. In fact, it may be even turbocharged, as crypto enables the financialization of social and communal activity in a manner never before seen. This makes clear the need and role for ambitious and thoughtful cultural governance now that creative structures, businesses and behaviors are being built on top of the protocol’s foundation. As proverbial neighborhoods sprout up, subcultures will be built in reaction to the constructs and its visitors and identity will evolve. In doing so, this activity will begin to invite criticism of how or what is built, by those most deeply invested in the protocol and the community it’s fostered. There will be disagreements. There will be overly kitsch and propagandistic creation. But in the end, the protocols that can produce the most meaningful and lasting communities, in large part through content and cultural creation, will be the most lasting, wealthiest and important. In crypto, soft power is everything. \n\n[The proceeds of this NFT will go towards protocol treasuries mentioned and the co-authors of this post.](split://0x27E3Fdccc6e4f422f4Cc0961294e907F5f31284B?network=mainnet)\n\n\n\n", "timestamp": 1620324921, "digest": "yEK4DdvmxwZ2l-yHWGOQs3rMsLD6RYs_phLUzSFdhAI", "contributor": "0x7FdCA0A469Ea8b50b92322aFc0215b67D56A5e9A"}
{"id": "4FwlWvJusZOJiHgl9fyvWptKbKpj-YZrDNdBYRGOpY8", "title": "Friends with Contributors", "body": "It’s been just over a month since the launch of FWB Pro and the start of [Season Two](https://medium.com/friends-with-benefits/fwb-season-two-slow-new-friends-86222d680ca7).\n\nIn a short window of time, Friends with Benefits (FWB for short) has strengthened its foothold in the growing social token community.\n\nFor those unfamiliar, [Friends with Benefits](https://fwb.help/Manifesto) is a digital community exploring the intersection of culture and crypto.\n\n![](https://images.mirror-media.xyz/publication-images/215eb716-a59c-48b9-9a48-c1a890af03f1.png?height=960&width=1920)\n\nFWB is now home to over 1000 members holding at least 60 $FWB tokens to access a diverse group of channels, [events](https://fwb.help/events) and [experiments](https://twitter.com/FWBtweets/status/1387210477369888768?s=20).\n\n![FWB Map](https://images.mirror-media.xyz/publication-images/9a85f1cb-9100-4940-ad69-a46c826274f9.jpeg?height=1019&width=2687)\n\n## Treasury Diversification\n\nToday, we’re happy to announce that the FWB community has welcomed a suite of leading contributors through our first Treasury Diversification proposals.\n\nThe FWB community [voted](https://snapshot.org/#/friendswithbenefits.eth/proposal/QmesG4qENC7CtAQRi5KAQbKucqRjPqGh8nJx4aR2G6mran) to swap 70,000 $FWB for $700k USD worth of contributions from Divergence, Variant, Collab+Currency, Nascent, GPs of Polychain, The LAO, MetaCartel Ventures and Galaxy Interactive.\n\nThis comes alongside a [vote](https://snapshot.org/#/friendswithbenefits.eth/proposal/QmWnifY3KD5ECJNtQ23m9GHt2oQ1McA3T4DEEpFarPy9jW) to swap 7900 $FWB for 4380 $WHALE - further aligning two of the leading social token communities in our efforts to grow the sector and support positive sum games.\n\nBut, the ball doesn’t stop there.\n\n## FWB as a Curator DAO\n\nFWB’s collective consciousness puts our community in a unique position to act as a leading resource on cultural relevance, including everything from food to music, memes, events and everything in between.\n\nAs we continue to build a deep network of subject matter experts - it’s important that we aggregate this knowledge into resources which help our Friends navigate an ever-changing world.\n\n**FWB will develop decentralized curation products that source culturally relevant topics.**\n\nThe first step towards this was a Host Committee - responsible for overseeing the onboarding of new members to the FWB community. What started as a filter to ensure applicants gelled with the community has quickly turned into a highly aligned group of advocates fine-tuning what it means to be a part of FWB and [creating resources](https://www.youtube.com/watch?v=KpKXcbkw3Bk) for others to get involved!\n\n![FWB Explainer Video](https://images.mirror-media.xyz/publication-images/697931f9-b8f1-4eea-88ef-9253af63809d.png?height=1012&width=1980)\n\nThe next was a Governance Committee - responsible for educating, encouraging and presenting governance proposals to and from the FWB community like the ones described above. \n\nThe first [budget proposal](https://snapshot.org/#/friendswithbenefits.eth/proposal/Qmd14LCw7phTL3ncxQ11QJR23fsuoH4jpkuJ2ARxSVeLbm) for April and May has successfully passed as of this morning. In tandem, we’re thrilled to be working alongside [Llama](https://twitter.com/llamacommunity_) to better track, compartmentalize and oversee the ongoing utilization of the [FWB treasury](https://gnosis-safe.io/app/#/safes/0x660F6D6c9BCD08b86B50e8e53B537F2B40f243Bd/balances).\n\n**Next up is our biggest project to date - giving the community a platform to curate, incubate and earn commissions from an FWB-branded NFT gallery.**\n\nThis product is set to be the first of many routing on-chain cash flows back to the [FWB DAO](https://gnosis-safe.io/app/#/safes/0x660F6D6c9BCD08b86B50e8e53B537F2B40f243Bd/balances) - a project we look forward to sharing more details on SoonTM.\n\nMoving forward, we envision different vertices of FWB each forming their own committee, allowing members to curate topics which are aggregated and governed by FWB holders such as member directories, city guides and newsletters.\n\n## The Path Forward\n\nThe interest around creator DAOs grows by the day. Projects like [PleasrDAO](https://twitter.com/PleasrDAO), [SongCamp](https://twitter.com/songcampdotband), [PartyDAO](https://twitter.com/prtyDAO) and [SquiggleDAO](https://twitter.com/squiggledao) are some of the many ways communities are banding together to leverage shared resources to create positive sum opportunities.\n\nFWB sits in a unique position to be a leader in that category - sourcing the best talent from crypto and beyond to build tools and products which service the growing movement towards collective creation.\n\nIf you or someone you know are interested in joining FWB - check out our [application flow](https://fwb.help/apply).\n\nWe look forward to growing FWB as the leading curation group in web3.\n\nTo our existing members - thank you for your ongoing support, commitment and love. To our soon-to-be new members - what are you waiting for?\n\nWith love,\n\nFWB Staff", "timestamp": 1620329699, "digest": "9DCOelQSQVlBgqy4lKAa3CGq0N_ckECsuRp6CJeRnrg", "contributor": "0xCaCEa967ae0d35d2A006Bb63ec557Fd8A6F013db"}
{"id": "ZKNEarpbhqz_P-kGlG1KGEPKuw0qAl8iTRVoJJTDEoo", "title": "Friends with Contributors", "body": "It’s been just over a month since the launch of [FWB Pro](https://medium.com/friends-with-benefits/introducing-fwb-pro-313d62183678) and the start of [Season Two](https://medium.com/friends-with-benefits/fwb-season-two-slow-new-friends-86222d680ca7).\n\nIn a short window of time, Friends with Benefits (FWB for short) has strengthened its foothold in the growing social token community.\n\nFor those unfamiliar, [Friends with Benefits](https://fwb.help/Manifesto) is a digital community exploring the intersection of culture and crypto.\n\n![](https://images.mirror-media.xyz/publication-images/215eb716-a59c-48b9-9a48-c1a890af03f1.png?height=960&width=1920)\n\nFWB is now home to over 1000 members holding at least 60 $FWB tokens to access a diverse group of channels, [events](https://fwb.help/events) and [experiments](https://twitter.com/FWBtweets/status/1387210477369888768?s=20).\n\n![FWB Map](https://images.mirror-media.xyz/publication-images/9a85f1cb-9100-4940-ad69-a46c826274f9.jpeg?height=1019&width=2687)\n\n## Treasury Diversification\n\nToday, we’re happy to announce that the FWB community has welcomed a suite of leading contributors through our first Treasury Diversification proposals.\n\nThe FWB community [voted](https://snapshot.org/#/friendswithbenefits.eth/proposal/QmesG4qENC7CtAQRi5KAQbKucqRjPqGh8nJx4aR2G6mran) to swap 70,000 $FWB for $700k USD worth of contributions from Divergence, Variant, Collab+Currency, Nascent, GPs of Polychain, The LAO, MetaCartel Ventures and Galaxy Interactive.\n\nThis comes alongside a [vote](https://snapshot.org/#/friendswithbenefits.eth/proposal/QmWnifY3KD5ECJNtQ23m9GHt2oQ1McA3T4DEEpFarPy9jW) to swap 7900 $FWB for 4380 $WHALE - further aligning two of the leading social token communities in our efforts to grow the sector and support positive sum games.\n\nBut, the ball doesn’t stop there.\n\n## FWB as a Curator DAO\n\nFWB’s collective consciousness puts our community in a unique position to act as a leading resource on cultural relevance, including everything from food to music, memes, events and everything in between.\n\nAs we continue to build a deep network of subject matter experts - it’s important that we aggregate this knowledge into resources which help our Friends navigate an ever-changing world.\n\n**FWB will develop decentralized curation products that source culturally relevant topics.**\n\nThe first step towards this was a Host Committee - responsible for overseeing the onboarding of new members to the FWB community. What started as a filter to ensure applicants gelled with the community has quickly turned into a highly aligned group of advocates fine-tuning what it means to be a part of FWB and [creating resources](https://www.youtube.com/watch?v=KpKXcbkw3Bk) for others to get involved!\n\n![FWB Explainer Video](https://images.mirror-media.xyz/publication-images/697931f9-b8f1-4eea-88ef-9253af63809d.png?height=1012&width=1980)\n\nThe next was a Governance Committee - responsible for educating, encouraging and presenting governance proposals to and from the FWB community like the ones described above. \n\nThe first [budget proposal](https://snapshot.org/#/friendswithbenefits.eth/proposal/Qmd14LCw7phTL3ncxQ11QJR23fsuoH4jpkuJ2ARxSVeLbm) for April and May has successfully passed as of this morning. In tandem, we’re thrilled to be working alongside [Llama](https://twitter.com/llamacommunity_) to better track, compartmentalize and oversee the ongoing utilization of the [FWB treasury](https://gnosis-safe.io/app/#/safes/0x660F6D6c9BCD08b86B50e8e53B537F2B40f243Bd/balances).\n\n**Next up is our biggest project to date - giving the community a platform to curate, incubate and earn commissions from an FWB-branded NFT gallery.**\n\nThis product is set to be the first of many routing on-chain cash flows back to the [FWB DAO](https://gnosis-safe.io/app/#/safes/0x660F6D6c9BCD08b86B50e8e53B537F2B40f243Bd/balances) - a project we look forward to sharing more details on SoonTM.\n\nMoving forward, we envision different vertices of FWB each forming their own committee, allowing members to curate topics which are aggregated and governed by FWB holders such as member directories, city guides and newsletters.\n\n## The Path Forward\n\nThe interest around creator DAOs grows by the day. Projects like [PleasrDAO](https://twitter.com/PleasrDAO), [SongCamp](https://twitter.com/songcampdotband), [PartyDAO](https://twitter.com/prtyDAO) and [SquiggleDAO](https://twitter.com/squiggledao) are some of the many ways communities are banding together to leverage shared resources to create positive sum opportunities.\n\nFWB sits in a unique position to be a leader in that category - sourcing the best talent from crypto and beyond to build tools and products which service the growing movement towards collective creation.\n\nIf you or someone you know are interested in joining FWB - check out our [application flow](https://fwb.help/apply).\n\nWe look forward to growing FWB as the leading curation group in web3.\n\nTo our existing members - thank you for your ongoing support, commitment and love. To our soon-to-be new members - what are you waiting for?\n\nWith love,\n\nFWB Staff", "timestamp": 1620329760, "digest": "9DCOelQSQVlBgqy4lKAa3CGq0N_ckECsuRp6CJeRnrg", "contributor": "0xCaCEa967ae0d35d2A006Bb63ec557Fd8A6F013db"}
{"id": "W04vqIAdl0UtdqAUiB9eS29_JwNlnlIqUZGK6LJEm7A", "title": "Cope Launch – Issue #01", "body": "\n![](https://images.mirror-media.xyz/publication-images/105a907c-2997-4ac9-822b-5d0614c8dfb2.jpg?height=2200&width=3800)\n\nWe model the future from scratch. When we make assumptions, we state them. Otherwise, we presume that the future could unfold in many directions.\n\nThe futurist ideal is a profession dedicated to the formulation of new ideas and models for studying future possibilities. In practice, however, professional futurists necessarily produce content that is of value to their employers and funders. In many cases, their ideas are of value insofar as they serve to assist the realization of certain outcomes. It is rare for a futurist to be paid to simply think.\n\nWe launch our research service and publication project, Cope, with the view that the Mirror platform is a crowdfunding marketplace that makes an economy of ideas feasible. We seek to decouple our research from the conditions and agendas set by institutional funders, and conduct research that we and the Mirror community deem to be of importance. Feedback from our supporters is vital to our process. We imagine a new forum for future thought – research for the hive. Supporters can help steer our lines of inquiry by providing comments, asking questions, suggesting research topics, and by providing financial support for directions that they find valuable. \n\nWe methodically piece together plausible scenarios, step by step, using systems theory and applied mathematics. We compile our findings in detailed reports, and release them for small sums. We plan to release reports on a wide range of topics, such as:\n\n\n\n![](https://images.mirror-media.xyz/publication-images/320bf6ce-9d97-46a8-ab5d-1e2b625b7606.jpg?height=1500&width=2700)\n\n\nOur output is high-volume and our turn-arounds are prompt. Successfully crowdfunded reports are released within two weeks, often sooner. At certain intervals we will publish print editions of the entire body of research. These will also include previously unreleased material. All supporters will receive a print edition, regardless of the amount contributed. \n \nIf you're into Cope straight away, please support the first issue of our service. We've set a goal in anticipation of ongoing engagement with the distributed community of supporters. The first issue, Cope #1, includes two reports on topics of personal interest. The first report describes a DAO-based software stack for collective ownership of architecture. It outlines a sequence of scenarios in which programmable money, fractional ownership, and distributed governance radically reconfigure how the built environment is constructed and managed. The second report explores an anticipated issue of memory in digital mind engineering, introducing mathematical models to pose questions and offer solutions. Abstracts can be found below.\n\n\n[Cope 01](crowdfund://0xb0c813151d18482a914a2b95b1a25d020532Bb36?network=homestead)\n\nWe like Mirror because we see crowdfunding as an opportunity for young professional researchers to break from think tanks, universities, and strategy firms. We take the future too seriously to agree to institutional constraints. By establishing regular feedback with a distributed set of supporters who find our reports valuable, we can create systematic studies of future outcomes – and pathways toward them – without having to trudge through byzantine protocols, semantic ciphers of clients, and conditional funding cycles. By lifting legacy constraints, we can speak about the future unrestrained. \n\nWe're also making use of the [Splits](https://mirror.xyz/dashboard/guide/splits) feature, which allows us to automatically direct funds to those who have inspired our work. In this case, we’re sending 4% to three people who have laid groundwork for us: [Kei Kreutler](https://www.ourmachine.net/), [Jesse Walden](https://variant.fund/), and [Kristoffer Josefsson](https://foam.space/). Thanks to you all!\n\n\n\n\n\n## *Cope #01 – Two Reports*\n\n# **The BauDAO – An OS for Urban Ownership** \n-Pierce Myers\n\n\nFractional ownership and distributed governance are programmable mechanisms of the Ownership Economy that will be applied to the expanded field of tangible assets in the city. Real estate is the largest asset class in the world, most locked behind capital barriers, and is the primary mechanism through which the rentier paradigm sustains it’s parasitic extraction of urban value. The Building DAO, or ‘BauDAO’ is a collective-oriented, DAO-based software stack that restructures the paradigm of architectural funding, construction, and ownership. The BauDAO includes software mechanisms that 1) reduce the organizational complexity of fractional ownership of urban assets, 2) enable tiered governance protocols for determining ‘program’, and 3) sharply decrease capital barriers to ownership by orders of magnitude through crowdfunding. \n \nThis report diagrams the software architecture (BIM wrapped in DAO) and the unique role of Architects themselves in triggering this paradigm of distributed urban ownership. The report begins with two near-term cases: a large creative collective acquiring studio space and a neighborhood-based residential building project, then speculates on mid-to-long-term scenarios for how these software-economic mechanisms can reshape cities and ecosystems in concert.\n\n\n![](https://images.mirror-media.xyz/publication-images/6517c066-8cd6-4f2b-9ac2-2c4baa57f5e1.jpg?height=2077&width=2700)\n\n![](https://images.mirror-media.xyz/publication-images/31682ae9-1372-4dc0-afd2-be8cfbefdba8.jpg?height=1828&width=2700)\n\n\n\n# **The Problem of Memory in Digital Minds** \n-James Douglas Boyd\n\nDigital minds will differ from human ones in that they will be both intelligent agents and products of the engineering designs of others. It may not always be easy for a digital mind to differentiate the aspects of its intelligence that are autonomous and those that are features of others’ designs. Memory is one such aspect. We consider an experiment that a digital mind can conduct and two measures that it can estimate for choosing among hypotheses regarding the origins of its memories.\n\n![](https://images.mirror-media.xyz/publication-images/e42a92f8-2e95-463b-b022-d32d4726fbba.png?height=1084&width=2388)\n\n\n\n### *Going Forward*\nAs Cope grows, the issues will include more reports from a diversity of future thinkers. The content will become multimedia, and Splits will be automatically sent to thinkers or creators who inspire our work. In the coming weeks, we will introduce feedback mechanisms supported by platforms such as Google Forms, Gather, and Twitch. \n\n\n\n### **Thanks,** \n### **-Cope**\n\n\n\n\n", "timestamp": 1620331180, "digest": "GTSLTwaY78d11sLiWJHaiYR39UOeya4F9x58mHPVVWQ", "contributor": "0x5E692Fe3d06414D75380604BA202c7d5ed94f219"}
{"id": "e-JTHH0bf8oeI1ZaqDD_x4mVC11chWNRLS8CgyJBvV4", "title": "Auction test two", "body": "[Example Split](split://0x3589620bCfe17C6498b04134ECAc4B6aB2Ff8628?network=rinkeby)\n\n[Token #3028](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3028)", "timestamp": 1620339631, "digest": "n0Ssu6CxMPOUpGxo2Ia0uiQSwcwToobBIShd8DxZjic", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3", "nft": "{\"nftTransactionHash\": \"0xd707f82ed17f71e0d96fb331edc0803af038d5dd91823d159951cb24dc81be72\"}"}
{"id": "sZxkZ8gjjvfLjG5EVs2A7PJjJt_TNWk17wtNEk2OSrg", "title": "test", "body": "test\n\n[Test Split Crowdfund](crowdfund://0xcdEf86692311C04bb09c7df6d267F7CFF19E7163?network=rinkeby)\n\n[test deploy split flow](split://0xF09af8754C1eF031390A69BDAf0BA288B5174ee3?network=rinkeby)\n\n[Add Twitter Identity](crowdfund://0xa5238Dd486788Ad203B282384dfe51F5C946f4d4?network=rinkeby)\n\n[Token #1307](auction://0x7c2668bd0d3c050703cecc956c11bd520c26f7d4?network=rinkeby&tokenId=1307)", "timestamp": 1620347271, "digest": "oQ8xql8YyJPA8V018lgdVmYSMWiatbxC_L4BdwWM6lI", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "w2Sg1pu88g3mC1IDtKbJdVpYUmAldleAGmaidrPFY4U", "title": "test", "body": "test\n\n[Test Split Crowdfund](crowdfund://0xcdEf86692311C04bb09c7df6d267F7CFF19E7163?network=rinkeby)\n\n[test deploy split flow](split://0xF09af8754C1eF031390A69BDAf0BA288B5174ee3?network=rinkeby)\n\n[Token #1307](auction://0x7c2668bd0d3c050703cecc956c11bd520c26f7d4?network=rinkeby&tokenId=1307)", "timestamp": 1620348148, "digest": "oQ8xql8YyJPA8V018lgdVmYSMWiatbxC_L4BdwWM6lI", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "Ovy-2GqUpvUfyNQ-FVLkGvrk2oOCPLGYeQwW9ePiIFA", "title": "Internet Renaissance Vibez", "body": "[SplitStream](split://0xb8d68917BEC2ddA4C336198CC63B828A4ba58b24?network=mainnet)\n\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/81)\n\nThree years ago, I was about to graduate college and still had no idea what I wanted to do. I studied Finance but after a few internships, I realized I wasn’t meant to be in a cheap suit from JCPenny cranking out discounted cash flow models until midnight. At the time, a friend of mine had just finished a coding bootcamp and suggested I try learning to code.\n\nIt was my senior year so like any rational person, I decided to stop going to class so I could code all day (sorry mom). Over the next few months I picked up web development, built full-stack apps, and did so many [Leetcode](https://leetcode.com/) problems that you’d think it was a form of capital punishment. \n\nOnce I graduated, I bought a one-way ticket to San Francisco and stayed on a cozy air mattress in my friend’s living room. Over the next few months, I did some contract work for my friends at [Career Karma](http://careerkarma.com/) and eventually landed a job as a software engineer on the growth team at [Instacart](instacart.com).\n\nA little over a year later, I was looking to work at an early stage startup so I got in touch with a [DeFi](https://en.wikipedia.org/wiki/Decentralized_finance) startup called [Dharma](http://dharma.io/). I had no clue what DeFi was but it was using this crypto thing I vaguely remembered hearing about a while back. After speaking with the team about their vision for a decentralized bank, I was red pilled.\n\nI joined the team but started having imposter syndrome in my first meeting. They talked about counterfactuals, meta transactions, proxy contracts, on-chain this and off-chain that. After the meeting, I had a mini dictionary worth of terms to look up on Wikipedia that night. Then we got to lunch and the entire team passionately debated token economics, incentive structures, governance mechanisms, and all this other stuff I had no clue about. I quickly realized this crypto thing wasn’t just slightly different than existing systems. It was completely different.\n\nOne of my favorite things about crypto is that it’s not just a technology. It’s a philosophy. It’s a belief system. It’s a way of viewing the world. It’s about questioning conventional systems and not caring if everyone else thinks you’re batshit crazy.\n\nOver the next few months, I learned more about cryptonetworks and how they worked under the hood. I remember the “aha moment” when I wrote my first smart contract. With just a few lines of code and a private key, I was able to transfer an internet-native currency anywhere in the world in seconds. \n\nI didn’t have to sign up for Stripe. I didn’t have to use the Plaid API to connect a bank account. I didn’t have to check if TransferWise supported payments for a specific country. There was no centralized party. Just a peer-to-peer cryptonetwork called Ethereum. It was pretty damn mindblowing.\n\nAfter the first few weeks at Dharma, I was confident that DeFi and crypto were the future. But I also got the itch to work on some of my own ideas. I wanted to build software for creative people. Writers. Artists. Musicians. Online teachers. I strongly believe our world depends on these types of people having the tools they need to serve their communities as best they can.\n\nFrankly, I also thought it would take a couple years before the crypto industry had the infrastructure in place for a mainstream consumer app to be built.\n\n\nSo I ended up leaving Dharma to take some time off and explore a few startup ideas. But a couple months ago I read a [manifesto](https://cryptomedia.wtf/) by [Zora](https://zora.co/) that changed how I thought about crypto.\n\nIt described a world where crypto could be used to give any digital media file (eg an image, a song, an essay, digital art, etc.) property rights. It explained how cryptonetworks could turn digital media into liquid financial assets, secured through cryptography, and programmable through smart contracts.\n\nAlthough the individual ideas weren’t new, they were combined and articulated in a way that just made sense. And not just to me.\n\n[Digital artists](https://www.reuters.com/article/retail-trading-nfts/insight-how-a-10-second-video-clip-sold-for-6-6-million-idUKL8N2KV6X9), [athletes](https://www.cnbc.com/2021/02/28/230-million-dollars-spent-on-nba-top-shot.html), [social media influencers](https://cryptoslate.com/logan-paul-nfts-sell-3-5-million-worth-on-first-day-of-release/), [tech executives](https://scottbelsky.medium.com/the-furry-lisa-cryptoart-the-new-economy-of-digital-creativity-6cb2300ea081), [media executives](https://darkstar.mirror.xyz/srmoGiN_1pg_toQGzCupkjWFOaf8xi0mM60zYpn_pwI), and [journalists](https://twitter.com/CaseyNewton/status/1366554892035219462) that never took the crypto weirdos seriously, seem to be taking notice.\n\nBut let’s be real. Is this latest NFT craze a bubble? Probz. Yet, is there at least a kernel of value in the idea of ownership over creative work? I think so.\n\nSo where do we go from here?\n\nWell, there’s been a lot of talk about high transaction fees and lack of scalability in these systems. Although I do think these problems should and will get fixed, a lack of technical scalability is kinda the point.\n\nCryptonetworks trade off technical scalability for social scalability.\n\nFacebook is technically scalable because it’s a social network that processes millions of transactions per second. Meanwhile, Bitcoin is socially scalable because it’s a trillion dollar economic network without a centralized authority.\n\nCrypto isn’t just a technological revolution. It’s also a revolution in capital formation and human coordination. How creative projects are funded. How groups of people are incentivized. How organizations are structured.\n\nYears from now, when I’m old and senile, I believe we’ll look back at this period as an [Internet Renaissance](https://twitter.com/ourZORA/status/1343210395704541189) of sorts. \n\nA time where we dared to fight back against systems that have been designed for centuries to elevate certain groups and keep others disenfranchised.\n\nWho knows though. Maybe all this crypto stuff really is just an intellectual ideal that’ll never work in practice. Regardless, I think it’s at least worth trying.", "timestamp": 1620351339, "digest": "pl07RMWdJZktHUAn8hZ02YlO35-Ju49orPrhaRnn4Vo", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "Zm-192pOQSGrQ73LcW2Q8Eu8tD1Zf59OggOy00L9fA0", "title": "Towards a Decentralized Autonomous Type Foundry Part I", "body": "## Introduction\n\nI've been trying to write something about this for the past few months but I haven't been satisfied with my attempts to articulate the ideas in my head.\n\n**So, rather than letting my thoughts grow stale perhaps I can start by posing a question:**\n\n![](https://images.mirror-media.xyz/publication-images/921953eb-ffbf-4223-a8f2-41b67b7ac461.png?height=987&width=1449&size=large)\n\n\n\nIt's not a whitepaper—but it's a signal of sorts. I know for a fact that I'm not the only person thinking about this. This is a flag that I'm planting with hopes that likeminded people would see it at a distance and respond.\n\nA tapestry of emerging technologies are coalescing to form the next generation of the web that will have a shockwave effect on multiple industries. What implications (good, bad, hypothesized, actualized) do Web3 and blockchain technologies have on the practice of designing and distributing typefaces at large?\n\nWhat are opportunities ahead of us that:\n- Protect the integrity of the industry from bad faith actors and monopolizing forces?\n- Allow for more novel ways to share resources and profits between type designers, foundries, and users of typefaces that subvert the traditional designer / foundry split?\n- Allow for more fairness and equitable inclusion for emerging type designers?\n- Introduce new and novel methods and incentives to fund future type design projects and type design careers?\n- Introduce frictionless bounties for language support, non-latin scripts, and other features that extend the inclusivity and range of any given typeface\n- Allow for better protections against unwanted intellectual property theft? *While* ushering a new culture of consensual remixes, covers, and homages where everyone is compensated and credited fairly?\n- Allow for more streamlined and novel ways to distribute typefaces beyond the current licensing models?\n- Allow for productive and meaningful organizing strategies to enact larger change?\n\nI'll start with that for now.\n\n\n# While You're Waiting: Further Reading\n\nhttps://twitter.com/_EricHu/status/1380516219204292609\n\n### Links\n\n[A Beginner's Guide to DAOs](https://linda.mirror.xyz/Vh8K4leCGEO06_qSGx-vS5lvgUqhqkCz9ut81WwCP2o)\n\n[Introducing Splits](https://dev.mirror.xyz/mQ03-JXlfdoBnRrZisC5X3kM9nBkOILlHwxbdq382Gw)\n\n[Creator DAOs: An OS for Participation](url)\n\n[Platform Cooperative](https://en.wikipedia.org/wiki/Platform_cooperative)\n\n[Eight Qualities of Decentralized Autonomous Organizations](https://www.ourmachine.net/writing/eight-qualities-daos/)\n\n[The Ownership Economy\n](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/)\n\n[Now open: ERC-1155 marketplace](https://medium.com/opensea/now-open-erc-1155-marketplace-816257ab0da7)\n\n### Papers\nDigital Social Contracts: A Foundation for an\nEgalitarian and Just Digital Society [[PDF]](http://ceur-ws.org/Vol-2781/paper5.pdf)\n\n### Contact\nTwitter: [@_erichu](http://twitter.com/_erichu)\nEmail: [mail@erichu.info](mailto:mail@erichu.info)\n\n*Special Thanks to Eugene Angelo, and the rest of [FWB](http://fwb.help)* for all the conversations leading up to this.\n\n", "timestamp": 1620358741, "digest": "cuJ-6Ksevx9QuV5peOcw5lpDYVLbPEY5pumZprr8L1Y", "contributor": "0x4628D77ba8fCc7a7F2B6bd4A0363061a06E7a20F"}
{"id": "80o2cSPh-2CT2ik6ogsvFDuUQBoAOyvBj1ZpmdIHfdI", "title": "Funding Friday: Pattern Alphabet cards for exploring nature", "body": "May 7, 2021\n\nLongtime AVC reader Alex Wolf has [a Kickstarter project](https://www.kickstarter.com/projects/alexwolf/pattern-alphabet-cards-for-exploring-nature) that I think is awesome.\n\nShe has long been working on a “pattern alphabet” to encode the patterns of nature and life.\n\n![](https://avc.com/content/uploads/2021/05/d748b37b0713242717ce7c3b72d1884a_original.png)\n\nThis project turns this alphabet into cards that can be used by kids in school and at home to learn.\n\nI backed the project this morning and I hope and expect she will do great with this Kickstarter project.\n\nYou can see the video [here](https://www.kickstarter.com/projects/alexwolf/pattern-alphabet-cards-for-exploring-nature#).\n\n", "timestamp": 1620384791, "digest": "Tc-1tH4AXOQdvjbRMIfP1ZudcDPfCG9C-Ooo3TQem9g", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "USFx1sfTaFYzUjAZfXKSWrG53BLykxrUCbFnhZd8oas", "title": "Funding Friday: Pattern Alphabet cards for exploring nature", "body": "May 7, 2021\n\nLongtime AVC reader Alex Wolf has [a Kickstarter project](https://www.kickstarter.com/projects/alexwolf/pattern-alphabet-cards-for-exploring-nature) that I think is awesome.\n\nShe has long been working on a “pattern alphabet” to encode the patterns of nature and life.\n\n![](https://avc.com/content/uploads/2021/05/d748b37b0713242717ce7c3b72d1884a_original.png)\n\nThis project turns this alphabet into cards that can be used by kids in school and at home to learn.\n\nI backed the project this morning and I hope and expect she will do great with this Kickstarter project.\n\nYou can see the video [here](https://www.kickstarter.com/projects/alexwolf/pattern-alphabet-cards-for-exploring-nature#).\n\n[Discuss on Twitter ](https://twitter.com/intent/tweet?in_reply_to=1390619966836285443 \"Discuss on Twitter\")\n\n[View Discussions ](https://twitter.com/avc/status/1390619966836285443 \"View Discussions\")\n\n[#crowdfunding](https://avc.com/category/crowdfunding/ \"crowdfunding\")[#hacking education](https://avc.com/category/hacking-education/ \"hacking education\")\n\n[ Previous Post](https://avc.com/2021/05/typos/ \"Typos\")\n", "timestamp": 1620384723, "digest": "Tc-1tH4AXOQdvjbRMIfP1ZudcDPfCG9C-Ooo3TQem9g", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "v6R4cXY51QvMBjzCWFFpbLEEFDl9qj6tyNuN_UDWM_g", "title": "Tony's Predictions for 2021", "body": "Let's start this off with some predictions.\n\nScott Alexander (of [Astral Codex Ten](https://astralcodexten.substack.com/)) motivations and rules:\n\n* The goal of the exercise is to calibrate my ability to know things\n* The predictions will be graded based on what will be true by Jan 1, 2022\n* I haven't done any additional research on these predictions for this post\n\n### Crypto Markets\n1. S&P above $4,184: 80%\n1. ... above $4600: 50%\n1. ... above .08 BTC: 25%\n1. BTC above $50K: 90%\n1. ... above $100K: 60%\n1. ETH above $2.5K: 90%\n1. ... above $5K: 75%\n1. ... above 0.05 BTC: 80%\n1. ... above 0.10 BTC: 50%\n1. DPI above $500: 80%\n1. ... above $1K: 60%\n1. ... above 0.15 ETH: 80%\n1. ... above 0.30 ETH: 40%\n1. Dominant narrative in crypto is digital gold: 40%\n1. ... is decentralized finance: 70%\n1. ... is non fungible tokens: 20%\n1. ... is web3: 5%\n1. We see a drawdown in BTC, ETH, or DPI of >40% over one week: 80%\n1. ... of >60% over one week: 25%\n1. Cryptopunk floor price greater than $60K: 80%\n1. ... greater than 1 BTC: 90%\n1. ... greater than 17 ETH: 50%\n1. Most valuable NFT sale is greater than $70M: 10%\n### Crypto Usage\n1. FAANG company announces 1% or greater BTC exposure on balance sheet: 20%\n1. ... ETH exposure on balance sheet: 5%\n1. A top 20 bank directly lends through a DeFi lending protocol: 60%\n1. TVL in DeFi across major chains greater than $200B: 80%\n1. ... greater than $500B: 60%\n1. ... greater than $1T: 25%\n1. Losses due to hacks, exploits, rugs, etc. greater than $500M: 90%\n1. ... greater than $1B: 75%\n1. ... greater than $2B: 50%\n1. Pancakeswap volumes are greater than Uniswap volumes: 30%\n1. ETH 2.0 Merge occurs: 40%\n1. EIP 1559 occurs: 80%\n1. Diem launches: 80%\n1. ... with smart contracts: 10%\n1. ... with smart contracts usable by anybody (permissionless): 1%\n1. TVL on Ethereum roll-ups exceed TVL on Ethereum: 20%\n1. Exchange volumes on Ethereum roll-ups exceed exchange volumes on Ethereum: 10%\n1. TVL on an Ethereum killer exceeds TVL on Ethereum: 30%\n1. Exchange volumes on an Ethereum killer exceeds exchange volumes on Ethereum: 70%\n1. BTC ETF launches: 60%\n1. ETH ETF launches: 40%\n1. Stablecoin lending rates at Genesis are greater than 5%: 95%\n1. ... greater than 10%: 70%\n1. ... greater than 20%: 20%\n1. A private version of a DeFi use case (e.g. auctions, transactions) reaches 50% of the adoption of the public version: 1%\n1. ... reaches 25% of the adoption of the public version: 5%\n1. ... reaches 10% of the adoption of the public version: 10%\n1. Undercollateralized lending underwritten using on-chain activity surpasses $5M: 50%\n1. ... surpasses $10M: 40%\n1. ... surpasses $100M: 20%\n1. The plurality of personal accounts I see on my twitter feed are cartoon or anime avatars: 60%\n1. ... are NFT avatars: 40%\n1. ... are real faces: 10%\n### Crypto Venture\n1. A crypto fund raises greater than $1B: 80%\n1. ... greater than $2B: 60%\n1. A pre-product seed deal gets done at greater than $250M equity or $500M token valuation: 75%\n1. ... greater than $500M equity or $1B token valuation: 40%\n1. Most high profile preseed/seed deals will be led by DAOs: 15%\n1. ... will be led by traditional VCs: 10%\n1. ... will be led by crypto funds with greater than $200M AUM: 80%\n1. Most high profile launches will be fair launches: 0.1%\n### Politics and Macro\n1. Capital gains taxes increase meaningfully: 10%\n1. A wealth tax is enacted: 5%\n1. ... in California: 10%\n1. Polling suggests republicans will win the senate in the 2022 midterms: 70%\n1. ... will win the house in the 2022 midterms: 70%\n1. Newsom is recalled: 10%\n1. The COVID vaccine patents are suspended: 90%\n1. All COVID restrictions are lifted at the federal level: 80%\n1. ... in California: 70%\n1. Unemployment is greater than 4.5%: 20%\n1. ... is greater than 5%: 10%\n1. 10Y treasury rates greater than 1.5%: 80%\n1. ... greater than 2%: 60%\n1. ... greater than 2.5%: 25%\n### Work\n1. Work full time on Cozy: 99%\n1. *redacted*: 80%\n1. ... *redacted*: 70%\n1. ... *redacted*: 60%\n1. *redacted*: 40%\n1. Start a venture fund: 5%\n### Personal\n1. Write a morning journal more than 70% of days: 99%\n1. ... more than 80% of days: 95%\n1. ... more than 90% of days: 90%\n1. Write a blog post more than 70% of weeks (starting now): 80%\n1. ... more than 80% of weeks: 60%\n1. ... more than 90% of weeks: 50% \n1. Squat for reps over 285lbs: 95%\n1. ... over 300lbs: 90%\n1. ... over 350 lbs: 40%\n1. Weigh over 150lbs: 99%\n1. ... over 160lbs: 30%\n1. ... over 170lbs: 5%\n1. *redacted*: 20%\n1. ... *redacted*: 50%\n1. ... *redacted*: 80% \n1. Live in the same house: 95%\n1. House will have appreciated by more than 0%: 95%\n1. ... by more than 5%: 60%\n1. ... by more than 10%: 20%\n1. Read more than 50 books: 1%\n1. ... more than 40 books: 20%\n1. ... more than 25 books: 80%\n1. Donate greater than 10% of my net income: 95%\n1. ... greater than 1% of my total crypto holdings: 95%\n1. *redacted*: 90%\n1. ... *redacted*: 75%\n1. ... *redacted*: 40%\n1. Make greater than 10 angel investments: 99%\n1. ... greater than 20 angel investments: 60%\n1. ... greater than 50 angel investments: 20%\n1. Go to therapy on a regular schedule: 90%\n1. Married to Anna: 99%\n1. Parents alive: 99%\n1. Gary TikTok greater than 500K followers: 75%\n1. ... greater than 1M followers: 60%\n1. Anna cast in major show or movie: 30%\n1. ... in major commercial: 40%\n\n[NFT](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/10040)\n", "timestamp": 1620401007, "digest": "xDYJl7Yt9Bi_Tdha4IsXy-v2i6YdV5oazPhG09KM19k", "contributor": "0x9b217B4B9533bb2c78504cDcCAdf5739cFa27E86"}
{"id": "Zyw3P3i_EpV8O0opxmEdWGbTA03aGikYs-1f39frpRk", "title": "Introducing Collections", "body": "# What are Collections?\n\nCollections let users earmark meaningful content into a topic of their choice and showcase it on Yup. Think of Spotify playlists or Pinterest Boards but for any URL or website across the web. Collections empower curators/creators to showcase their expertise or taste in anything: from NFTs to 1970s mob movies. \n\n# How to create/add to a collection\n\n## **Web App**\n\n### 1. **Create a collection from scratch by clicking the \"+\" button on your profile**\n\n![](https://images.mirror-media.xyz/publication-images/482ebe19-5e68-4e91-804d-5f08213af30a.jpeg?height=508&width=958)\n\n![](https://images.mirror-media.xyz/publication-images/2a6fa967-842d-4d3b-99ba-17eaec819960.jpeg?height=1016&width=1884)\n\n### 2. **Create a collection from a post by clicking the menu icon on that post**\n\n![](https://images.mirror-media.xyz/publication-images/5e8ee490-de93-49ff-b9de-f0b1dfae271a.jpeg?height=536&width=885)\n\n![](https://images.mirror-media.xyz/publication-images/48a18db4-a654-43b8-b423-7b5186d5aefb.jpeg?height=536&width=885)\n\n### 3. Once you've created your collection**, add to it by clicking the menu button on another post**\n\n![](https://images.mirror-media.xyz/publication-images/4abd89f1-ef95-48d3-a6d2-2201bda588ec.jpeg?height=514&width=974)\n\n![](https://images.mirror-media.xyz/publication-images/c11a5ed6-dc70-4b5b-8bd3-c42ced87140c.jpeg?height=514&width=974)\n\n\n\n### **4. Select your collection from your profile to view what you've added**\n\n![](https://images.mirror-media.xyz/publication-images/eaef1505-4509-45f6-bbc6-1af23e785ccb.jpeg?height=548&width=942)\n\n![](https://images.mirror-media.xyz/publication-images/dfd6ad62-fb3e-41f5-9ad1-7459ffcfc6e8.jpeg?height=680&width=1077)\n\n\n## Extension\n\n### 1. Right-click on any URL/Page to add it to a Collection\n\n![](https://images.mirror-media.xyz/publication-images/864f5228-0e02-4183-af8c-ff2c725762eb.jpeg?height=605&width=1141)\n\n![](https://images.mirror-media.xyz/publication-images/246d03b7-7492-4b2a-8ca6-150bd493a148.jpeg?height=1011&width=2000)", "timestamp": 1620402217, "digest": "sMcjhzCPP0S9Oky0agQpUazkh6R49jirCB11RSFdaJQ", "contributor": "0x30E838D51c61811d382962B4e0699715462DcdE1"}
{"id": "ginbjn1ROLwoztbSR-s7Nvegf-4XJc4p0eP3klMSybU", "title": "Introducing Collections", "body": "![](https://images.mirror-media.xyz/publication-images/2cba0166-f490-470c-b754-0f054fb0460f.jpeg?height=403&width=800)\n\n# What are Collections?\n\nCollections let users earmark meaningful content into a topic of their choice and showcase it on Yup. Think of Spotify playlists or Pinterest Boards but for any URL or website across the web. Collections empower curators/creators to showcase their expertise or taste in anything: from NFTs to 1970s mob movies. \n\n# How to create/add to a collection\n\n## **Web App**\n\n### 1. **Create a collection from scratch by clicking the \"+\" button on your profile**\n\n![](https://images.mirror-media.xyz/publication-images/482ebe19-5e68-4e91-804d-5f08213af30a.jpeg?height=508&width=958)\n\n![](https://images.mirror-media.xyz/publication-images/2a6fa967-842d-4d3b-99ba-17eaec819960.jpeg?height=1016&width=1884)\n\n### 2. **Create a collection from a post by clicking the menu icon on that post**\n\n![](https://images.mirror-media.xyz/publication-images/5e8ee490-de93-49ff-b9de-f0b1dfae271a.jpeg?height=536&width=885)\n\n![](https://images.mirror-media.xyz/publication-images/48a18db4-a654-43b8-b423-7b5186d5aefb.jpeg?height=536&width=885)\n\n### 3. Once you've created your collection**, add to it by clicking the menu button on another post**\n\n![](https://images.mirror-media.xyz/publication-images/4abd89f1-ef95-48d3-a6d2-2201bda588ec.jpeg?height=514&width=974)\n\n![](https://images.mirror-media.xyz/publication-images/c11a5ed6-dc70-4b5b-8bd3-c42ced87140c.jpeg?height=514&width=974)\n\n### **4. Select your collection from your profile to view what you've added**\n\n![](https://images.mirror-media.xyz/publication-images/eaef1505-4509-45f6-bbc6-1af23e785ccb.jpeg?height=548&width=942)\n\n![](https://images.mirror-media.xyz/publication-images/dfd6ad62-fb3e-41f5-9ad1-7459ffcfc6e8.jpeg?height=680&width=1077)\n\n\n## Extension\n\n### 1. Right-click on any URL/Page to add it to a Collection\n\n![](https://images.mirror-media.xyz/publication-images/864f5228-0e02-4183-af8c-ff2c725762eb.jpeg?height=605&width=1141)\n\n![](https://images.mirror-media.xyz/publication-images/246d03b7-7492-4b2a-8ca6-150bd493a148.jpeg?height=1011&width=2000)", "timestamp": 1620402509, "digest": "sMcjhzCPP0S9Oky0agQpUazkh6R49jirCB11RSFdaJQ", "contributor": "0x30E838D51c61811d382962B4e0699715462DcdE1"}
{"id": "H-0ykCZB-DZ8BVovajJ8-aBn7GowV2d3tVdtZSvJCFc", "title": "Introducing Collections", "body": "![](https://images.mirror-media.xyz/publication-images/2cba0166-f490-470c-b754-0f054fb0460f.jpeg?height=403&width=800)\n\n# What are Collections?\n\nCollections let users earmark meaningful content into a topic of their choice and showcase it on Yup. Think of Spotify playlists or Pinterest Boards but for any URL or website across the web. Collections empower curators/creators to showcase their expertise or taste in anything: from NFTs to 1970s mob movies. \n\n# How to create/add to a collection\n\n## **Web App**\n\n### 1. **Create a collection from scratch by clicking the \"+\" button on your profile**\n\n![](https://images.mirror-media.xyz/publication-images/482ebe19-5e68-4e91-804d-5f08213af30a.jpeg?height=508&width=958)\n\n![](https://images.mirror-media.xyz/publication-images/2a6fa967-842d-4d3b-99ba-17eaec819960.jpeg?height=1016&width=1884)\n\n### 2. **Create a collection from a post by clicking the menu icon on that post**\n\n![](https://images.mirror-media.xyz/publication-images/5e8ee490-de93-49ff-b9de-f0b1dfae271a.jpeg?height=536&width=885)\n\n![](https://images.mirror-media.xyz/publication-images/48a18db4-a654-43b8-b423-7b5186d5aefb.jpeg?height=536&width=885)\n\n### 3. Once you've created your collection**, add to it by clicking the menu button on another post**\n\n![](https://images.mirror-media.xyz/publication-images/4abd89f1-ef95-48d3-a6d2-2201bda588ec.jpeg?height=514&width=974)\n\n![](https://images.mirror-media.xyz/publication-images/c11a5ed6-dc70-4b5b-8bd3-c42ced87140c.jpeg?height=514&width=974)\n\n\n\n### **4. Select your collection from your profile to view what you've added**\n\n![](https://images.mirror-media.xyz/publication-images/eaef1505-4509-45f6-bbc6-1af23e785ccb.jpeg?height=548&width=942)\n\n![](https://images.mirror-media.xyz/publication-images/dfd6ad62-fb3e-41f5-9ad1-7459ffcfc6e8.jpeg?height=680&width=1077)\n\n\n## Extension\n\n### 1. Right-click on any URL/Page to add it to a Collection\n\n![](https://images.mirror-media.xyz/publication-images/864f5228-0e02-4183-af8c-ff2c725762eb.jpeg?height=605&width=1141)\n\n![](https://images.mirror-media.xyz/publication-images/246d03b7-7492-4b2a-8ca6-150bd493a148.jpeg?height=1011&width=2000)", "timestamp": 1620402440, "digest": "sMcjhzCPP0S9Oky0agQpUazkh6R49jirCB11RSFdaJQ", "contributor": "0x30E838D51c61811d382962B4e0699715462DcdE1"}
{"id": "mPxToKaOjRNbyBy1Xwtff5UZFitVq5hAKnnKmH4C8gI", "title": "Introducing Collections", "body": "# What are Collections?\n\nCollections let users earmark meaningful content into a topic of their choice and showcase it on Yup. Think of Spotify playlists or Pinterest Boards but for any URL or website across the web. Collections empower curators/creators to showcase their expertise or taste in anything: from NFTs to 1970s mob movies. \n\n# How to create/add to a collection\n\n## **Web App**\n\n### 1. Create a collection from scratch by clicking the \"+\" button on your profile\n\n![](https://images.mirror-media.xyz/publication-images/482ebe19-5e68-4e91-804d-5f08213af30a.jpeg?height=508&width=958)\n\n![](https://images.mirror-media.xyz/publication-images/2a6fa967-842d-4d3b-99ba-17eaec819960.jpeg?height=1016&width=1884)\n\n### 2. Create a collection from a post by clicking the menu icon on that post\n\n![](https://images.mirror-media.xyz/publication-images/5e8ee490-de93-49ff-b9de-f0b1dfae271a.jpeg?height=536&width=885)\n\n![](https://images.mirror-media.xyz/publication-images/48a18db4-a654-43b8-b423-7b5186d5aefb.jpeg?height=536&width=885)\n\n### 3. Once you've created your collection, add to it by clicking the menu button on another post\n\n![](https://images.mirror-media.xyz/publication-images/4abd89f1-ef95-48d3-a6d2-2201bda588ec.jpeg?height=514&width=974)\n\n![](https://images.mirror-media.xyz/publication-images/c11a5ed6-dc70-4b5b-8bd3-c42ced87140c.jpeg?height=514&width=974)\n\n\n\n### **4. Select your collection from your profile to view what you've added**\n\n![](https://images.mirror-media.xyz/publication-images/eaef1505-4509-45f6-bbc6-1af23e785ccb.jpeg?height=548&width=942)\n\n![](https://images.mirror-media.xyz/publication-images/dfd6ad62-fb3e-41f5-9ad1-7459ffcfc6e8.jpeg?height=680&width=1077)\n\n\n## Extension\n\n### 1. Right-click on any URL/Page to add it to a Collection\n\n![](https://images.mirror-media.xyz/publication-images/864f5228-0e02-4183-af8c-ff2c725762eb.jpeg?height=605&width=1141)\n\n![](https://images.mirror-media.xyz/publication-images/246d03b7-7492-4b2a-8ca6-150bd493a148.jpeg?height=1011&width=2000)", "timestamp": 1620402485, "digest": "sMcjhzCPP0S9Oky0agQpUazkh6R49jirCB11RSFdaJQ", "contributor": "0x30E838D51c61811d382962B4e0699715462DcdE1"}
{"id": "5gaOd4WZ0jTs3MviPsJmj1Q_l90em6D4TJIIrZv_1JY", "title": "Introducing Collections", "body": "![](https://images.mirror-media.xyz/publication-images/4abe8c8e-1e79-4390-bf22-62ee5ecf5086.jpeg?height=403&width=800)\n\n# What are Collections?\n\nCollections let users earmark meaningful content into a topic of their choice and showcase it on Yup. Think of Spotify playlists or Pinterest Boards but for any URL or website across the web. Collections empower curators/creators to showcase their expertise or taste in anything: from NFTs to 1970s mob movies. \n\n# How to create/add to a collection\n\n## **Web App**\n\n### 1. **Create a collection from scratch by clicking the \"+\" button on your profile**\n\n![](https://images.mirror-media.xyz/publication-images/482ebe19-5e68-4e91-804d-5f08213af30a.jpeg?height=508&width=958)\n\n![](https://images.mirror-media.xyz/publication-images/2a6fa967-842d-4d3b-99ba-17eaec819960.jpeg?height=1016&width=1884)\n\n### 2. **Create a collection from a post by clicking the menu icon on that post**\n\n![](https://images.mirror-media.xyz/publication-images/5e8ee490-de93-49ff-b9de-f0b1dfae271a.jpeg?height=536&width=885)\n\n![](https://images.mirror-media.xyz/publication-images/48a18db4-a654-43b8-b423-7b5186d5aefb.jpeg?height=536&width=885)\n\n### 3. Once you've created your collection**, add to it by clicking the menu button on another post**\n\n![](https://images.mirror-media.xyz/publication-images/4abd89f1-ef95-48d3-a6d2-2201bda588ec.jpeg?height=514&width=974)\n\n![](https://images.mirror-media.xyz/publication-images/c11a5ed6-dc70-4b5b-8bd3-c42ced87140c.jpeg?height=514&width=974)\n\n### **4. Select your collection from your profile to view what you've added**\n\n![](https://images.mirror-media.xyz/publication-images/eaef1505-4509-45f6-bbc6-1af23e785ccb.jpeg?height=548&width=942)\n\n![](https://images.mirror-media.xyz/publication-images/dfd6ad62-fb3e-41f5-9ad1-7459ffcfc6e8.jpeg?height=680&width=1077)\n\n\n## Extension\n\n### 1. Right-click on any URL/Page to add it to a Collection\n\n![](https://images.mirror-media.xyz/publication-images/864f5228-0e02-4183-af8c-ff2c725762eb.jpeg?height=605&width=1141)\n\n![](https://images.mirror-media.xyz/publication-images/246d03b7-7492-4b2a-8ca6-150bd493a148.jpeg?height=1011&width=2000)", "timestamp": 1620402704, "digest": "sMcjhzCPP0S9Oky0agQpUazkh6R49jirCB11RSFdaJQ", "contributor": "0x30E838D51c61811d382962B4e0699715462DcdE1"}
{"id": "Lsqt8UJ1a9n4kjzTh1C8CnwbRnYn3ANUWd0GHM5z4lk", "title": "Introducing Collections", "body": "# What are Collections?\n\nCollections let users earmark meaningful content into a topic of their choice and showcase it on Yup. Think of Spotify playlists or Pinterest Boards but for any URL or website across the web. Collections empower curators/creators to showcase their expertise or taste in anything: from NFTs to 1970s mob movies. \n\n# How to create/add to a collection\n\n### 1. Create a collection from scratch by clicking the \"+\" button on your profile\n\n![](https://images.mirror-media.xyz/publication-images/482ebe19-5e68-4e91-804d-5f08213af30a.jpeg?height=508&width=958)\n\n![](https://images.mirror-media.xyz/publication-images/2a6fa967-842d-4d3b-99ba-17eaec819960.jpeg?height=1016&width=1884)\n\n### 2. Create a collection from a post by clicking the menu icon on that post\n\n![](https://images.mirror-media.xyz/publication-images/5e8ee490-de93-49ff-b9de-f0b1dfae271a.jpeg?height=536&width=885)\n\n![](https://images.mirror-media.xyz/publication-images/48a18db4-a654-43b8-b423-7b5186d5aefb.jpeg?height=536&width=885)\n\n### 3. Once you've created your collection, add to it by clicking the menu button on another post\n\n![](https://images.mirror-media.xyz/publication-images/4abd89f1-ef95-48d3-a6d2-2201bda588ec.jpeg?height=514&width=974)\n\n![](https://images.mirror-media.xyz/publication-images/c11a5ed6-dc70-4b5b-8bd3-c42ced87140c.jpeg?height=514&width=974)\n\n### 4. From the extension, you can right-click on any URL/Page to add it to a Collection\n\n![](https://images.mirror-media.xyz/publication-images/f39d3a1a-91c2-42f8-864d-6d05083f6d39.jpeg?height=678&width=1200)\n\n### **5. Select your collection from your profile to view what you've added**\n\n![](https://images.mirror-media.xyz/publication-images/eaef1505-4509-45f6-bbc6-1af23e785ccb.jpeg?height=548&width=942)\n\n![](https://images.mirror-media.xyz/publication-images/dfd6ad62-fb3e-41f5-9ad1-7459ffcfc6e8.jpeg?height=680&width=1077)", "timestamp": 1620402658, "digest": "sMcjhzCPP0S9Oky0agQpUazkh6R49jirCB11RSFdaJQ", "contributor": "0x30E838D51c61811d382962B4e0699715462DcdE1"}
{"id": "eNXDY2kErT3XzinWDMz8SSw5So_Y3Q3EHBm_dDddEaI", "title": "Tony's Predictions for 2021", "body": "Let's start this off with some predictions.\n\nScott Alexander (of [Astral Codex Ten](https://astralcodexten.substack.com/)) motivations and rules:\n\n* The goal of the exercise is to calibrate my ability to know things\n* The predictions will be graded based on what will be true by Jan 1, 2022\n* I haven't done any additional research on these predictions for this post\n\n### Crypto Markets\n1. S&P above $4,184: 80%\n1. ... above $4600: 50%\n1. ... above .08 BTC: 25%\n1. BTC above $50K: 90%\n1. ... above $100K: 60%\n1. ETH above $2.5K: 90%\n1. ... above $5K: 75%\n1. ... above 0.05 BTC: 80%\n1. ... above 0.10 BTC: 50%\n1. DPI above $500: 80%\n1. ... above $1K: 60%\n1. ... above 0.15 ETH: 80%\n1. ... above 0.30 ETH: 40%\n1. Dominant narrative in crypto is digital gold: 40%\n1. ... is decentralized finance: 70%\n1. ... is non fungible tokens: 20%\n1. ... is web3: 5%\n1. We see a drawdown in BTC, ETH, or DPI of >40% over one week: 80%\n1. ... of >60% over one week: 25%\n1. Cryptopunk floor price greater than $60K: 80%\n1. ... greater than 1 BTC: 90%\n1. ... greater than 17 ETH: 50%\n1. Meebits floor price greater than $3K: 40%\n1. ... greater than 1 ETH: 20%\n1. ... greater than 0.5 ETH: 40%\n1. Most valuable NFT sale is greater than $70M: 10%\n### Crypto Usage\n1. FAANG company announces 1% or greater BTC exposure on balance sheet: 20%\n1. ... ETH exposure on balance sheet: 5%\n1. A top 20 bank directly lends through a DeFi lending protocol: 60%\n1. TVL in DeFi across major chains greater than $200B: 80%\n1. ... greater than $500B: 60%\n1. ... greater than $1T: 25%\n1. Losses due to hacks, exploits, rugs, etc. greater than $500M: 90%\n1. ... greater than $1B: 75%\n1. ... greater than $2B: 50%\n1. Pancakeswap volumes are greater than Uniswap volumes: 30%\n1. ETH 2.0 Merge occurs: 40%\n1. EIP 1559 occurs: 80%\n1. Diem launches: 80%\n1. ... with smart contracts: 10%\n1. ... with smart contracts usable by anybody (permissionless): 1%\n1. TVL on Ethereum roll-ups exceed TVL on Ethereum: 20%\n1. Exchange volumes on Ethereum roll-ups exceed exchange volumes on Ethereum: 10%\n1. TVL on an Ethereum killer exceeds TVL on Ethereum: 30%\n1. Exchange volumes on an Ethereum killer exceeds exchange volumes on Ethereum: 70%\n1. BTC ETF launches: 60%\n1. ETH ETF launches: 40%\n1. Stablecoin lending rates at Genesis are greater than 5%: 95%\n1. ... greater than 10%: 70%\n1. ... greater than 20%: 20%\n1. A private version of a DeFi use case (e.g. auctions, transactions) reaches 50% of the adoption of the public version: 1%\n1. ... reaches 25% of the adoption of the public version: 5%\n1. ... reaches 10% of the adoption of the public version: 10%\n1. Undercollateralized lending underwritten using on-chain activity surpasses $5M: 50%\n1. ... surpasses $10M: 40%\n1. ... surpasses $100M: 20%\n1. The plurality of personal accounts I see on my twitter feed are cartoon or anime avatars: 60%\n1. ... are NFT avatars: 40%\n1. ... are real faces: 10%\n### Crypto Venture\n1. A crypto fund raises greater than $1B: 80%\n1. ... greater than $2B: 60%\n1. A pre-product seed deal gets done at greater than $250M equity or $500M token valuation: 75%\n1. ... greater than $500M equity or $1B token valuation: 40%\n1. Most high profile preseed/seed deals will be led by DAOs: 15%\n1. ... will be led by traditional VCs: 10%\n1. ... will be led by crypto funds with greater than $200M AUM: 80%\n1. Most high profile launches will be fair launches: 0.1%\n### Politics and Macro\n1. Capital gains taxes increase meaningfully: 10%\n1. A wealth tax is enacted: 5%\n1. ... in California: 10%\n1. Polling suggests republicans will win the senate in the 2022 midterms: 70%\n1. ... will win the house in the 2022 midterms: 70%\n1. Newsom is recalled: 10%\n1. The COVID vaccine patents are suspended: 90%\n1. All COVID restrictions are lifted at the federal level: 80%\n1. ... in California: 70%\n1. Unemployment is greater than 4.5%: 20%\n1. ... is greater than 5%: 10%\n1. 10Y treasury rates greater than 1.5%: 80%\n1. ... greater than 2%: 60%\n1. ... greater than 2.5%: 25%\n### Work\n1. Work full time on Cozy: 99%\n1. *redacted*: 80%\n1. ... *redacted*: 70%\n1. ... *redacted*: 60%\n1. *redacted*: 40%\n1. Start a venture fund: 5%\n### Personal\n1. Write a morning journal more than 70% of days: 99%\n1. ... more than 80% of days: 95%\n1. ... more than 90% of days: 90%\n1. Write a blog post more than 70% of weeks (starting now): 80%\n1. ... more than 80% of weeks: 60%\n1. ... more than 90% of weeks: 50% \n1. Squat for reps over 285lbs: 95%\n1. ... over 300lbs: 90%\n1. ... over 350 lbs: 40%\n1. Weigh over 150lbs: 99%\n1. ... over 160lbs: 30%\n1. ... over 170lbs: 5%\n1. *redacted*: 20%\n1. ... *redacted*: 50%\n1. ... *redacted*: 80% \n1. Live in the same house: 95%\n1. House will have appreciated by more than 0%: 95%\n1. ... by more than 5%: 60%\n1. ... by more than 10%: 20%\n1. Read more than 50 books: 1%\n1. ... more than 40 books: 20%\n1. ... more than 25 books: 80%\n1. Donate greater than 10% of my net income: 95%\n1. ... greater than 1% of my total crypto holdings: 95%\n1. *redacted*: 90%\n1. ... *redacted*: 75%\n1. ... *redacted*: 40%\n1. Make greater than 10 angel investments: 99%\n1. ... greater than 20 angel investments: 60%\n1. ... greater than 50 angel investments: 20%\n1. Go to therapy on a regular schedule: 90%\n1. Married to Anna: 99%\n1. Parents alive: 99%\n1. Gary TikTok greater than 500K followers: 75%\n1. ... greater than 1M followers: 60%\n1. Anna cast in major show or movie: 30%\n1. ... in major commercial: 40%\n\n[NFT](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/10040)\n", "timestamp": 1620403099, "digest": "xDYJl7Yt9Bi_Tdha4IsXy-v2i6YdV5oazPhG09KM19k", "contributor": "0x9b217B4B9533bb2c78504cDcCAdf5739cFa27E86"}
{"id": "0FMNEqJp7-VDacd0WI_1cvBBA2Uvv6pedAhtmn37MjQ", "title": "SplitStream Success!", "body": "The first Zero-Knowledge Analysis NFT was just auctioned off using the SplitStream mechanism. This NFT was from Harry Crane and Ryan Martin's independent data analysis of Planck's test of Seth's Appetite Theory. Half of the funds were then Split to the citations with one of those cited works (so far) splitting further. This is the SplitStream!\n\nSplitStreamees, claim your funds here:\n\nor here:\n[Planck Root Split](split://0xb288D65d059671B852aF36B61B1545DB282aBCBb?network=mainnet)\n\nA huge thanks to mirror for helping us implement this (despite a misstep or two I may have made in the process...) Mirror did not request, nor did their build require, that they be included in the SplitStream. But of course we included them, if for no other reason than that we ran it on their technology! Patrick Riviera, in particular, was incredibly helpful throughout. Also thanks to Aleo and Harry Crane and Ryan Martin. We think that Zero Knowledge Analysis has a big future.\n\nAnd a special thank you to Michael Zargham, the winning bidder, who [described the NFT beautifully](https://twitter.com/mZargham/status/1390362756663152641?s=20) as a \"a unique digital pointer to a node in the directed acyclic graph we call science.\"\n\n", "timestamp": 1620417609, "digest": "drLJEfzzX3M5nI5t9MKyxHR1k5gksoT_Q-a5xOWOdEU", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "B-0_Whfid6Qltqd48uDVNnHux6hKBh4iattu-v0KfHk", "title": "SplitStream Success!", "body": "The first Zero-Knowledge Analysis NFT was just auctioned off using the SplitStream mechanism. This NFT was from Harry Crane and Ryan Martin's independent data analysis of Planck's test of Seth's Appetite Theory. Half of the funds were then Split to the citations with one of those cited works (so far) splitting further. This is the SplitStream!\n\nSplitStreamees, claim your funds here:\n\n\nA huge thanks to mirror for helping us implement this (despite a misstep or two I may have made in the process...) Mirror did not request, nor did their build require, that they be included in the SplitStream. But of course we included them, if for no other reason than that we ran it on their technology! Patrick Riviera, in particular, was incredibly helpful throughout. Also thanks to Aleo and Harry Crane and Ryan Martin. We think that Zero Knowledge Analysis has a big future.\n\nAnd a special thank you to Michael Zargham, the winning bidder, who [described the NFT beautifully](https://twitter.com/mZargham/status/1390362756663152641?s=20) as a \"a unique digital pointer to a node in the directed acyclic graph we call science.\"\n\n", "timestamp": 1620417530, "digest": "drLJEfzzX3M5nI5t9MKyxHR1k5gksoT_Q-a5xOWOdEU", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "KK6inHq5-WRkwfe6mnnDKPYwBN0c29kt8eu7IEk12TE", "title": "SplitStream Success!", "body": "The first Zero-Knowledge Analysis NFT was just auctioned off using the SplitStream mechanism. This NFT was from Harry Crane and Ryan Martin's independent data analysis of Planck's test of Seth's Appetite Theory. Half of the funds were then Split to the citations with one of those cited works (so far) splitting further. This is the SplitStream!\n\nSplitStreamees, claim your funds here:\n[R1 Level Split](split://0xb8d68917BEC2ddA4C336198CC63B828A4ba58b24?network=mainnet)\n\nor here:\n\n\n\nA huge thanks to mirror for helping us implement this (despite a misstep or two I may have made in the process...) Mirror did not request, nor did their build require, that they be included in the SplitStream. But of course we included them, if for no other reason than that we ran it on their technology! Patrick Riviera, in particular, was incredibly helpful throughout. Also thanks to Aleo and Harry Crane and Ryan Martin. We think that Zero Knowledge Analysis has a big future.\n\nAnd a special thank you to Michael Zargham, the winning bidder, who [described the NFT beautifully](https://twitter.com/mZargham/status/1390362756663152641?s=20) as a \"a unique digital pointer to a node in the directed acyclic graph we call science.\"\n\n", "timestamp": 1620417555, "digest": "drLJEfzzX3M5nI5t9MKyxHR1k5gksoT_Q-a5xOWOdEU", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "N28nRjYmQjOT5rLowX2CyWSgo43PCdbMkwNF93G05eA", "title": "SplitStream Success!", "body": "The first Zero-Knowledge Analysis NFT was just auctioned off using the SplitStream mechanism. This NFT was from Harry Crane and Ryan Martin's independent data analysis of Planck's test of Seth's Appetite Theory. Half of the funds were then Split to the citations with one of those cited works (so far) splitting further. This is the SplitStream!\n\nSplitStreamees, claim your funds here:\n[R1 Level Split](split://0xb8d68917BEC2ddA4C336198CC63B828A4ba58b24?network=mainnet)\n\nor here:\n[Planck Root Split](split://0xb288D65d059671B852aF36B61B1545DB282aBCBb?network=mainnet)\n\n\nA huge thanks to mirror for helping us implement this (despite a misstep or two I may have made in the process...) Mirror did not request, nor did their build require, that they be included in the SplitStream. But of course we included them, if for no other reason than that we ran it on their technology! Patrick Riviera, in particular, was incredibly helpful throughout. Also thanks to Aleo and Harry Crane and Ryan Martin. We think that Zero Knowledge Analysis has a big future.\n\nAnd a special thank you to Michael Zargham, the winning bidder, who [described the NFT beautifully](https://twitter.com/mZargham/status/1390362756663152641?s=20) as a \"a unique digital pointer to a node in the directed acyclic graph we call science.\"\n\n", "timestamp": 1620417624, "digest": "drLJEfzzX3M5nI5t9MKyxHR1k5gksoT_Q-a5xOWOdEU", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "srKLwE4mLjdlgp7BQguO1nKAYjReZ7ingzvYKcPiJdI", "title": "SplitStream Success!", "body": "The first Zero-Knowledge Analysis NFT was just auctioned off using the SplitStream mechanism. This NFT was from Harry Crane and Ryan Martin's independent data analysis of Planck's test of Seth's Appetite Theory. Half of the funds were then Split to the citations with one of those cited works (so far) splitting further. This is the SplitStream!\n\nSplitStreamees, claim your funds here:\n\n[R1 Level Split](split://0xb8d68917BEC2ddA4C336198CC63B828A4ba58b24?network=mainnet)\n\nor here:\n\n[Planck Root Split](split://0xb288D65d059671B852aF36B61B1545DB282aBCBb?network=mainnet)\n\nA huge thanks to mirror for helping us implement this (despite a misstep or two I may have made in the process...) Mirror did not request, nor did their build require, that they be included in the SplitStream. But of course we included them, if for no other reason than that we ran it on their technology! Patrick Riviera, in particular, was incredibly helpful throughout. Also thanks to Aleo and Harry Crane and Ryan Martin. We think that Zero Knowledge Analysis has a big future.\n\nAnd a special thank you to Michael Zargham, the winning bidder, who [described the NFT beautifully](https://twitter.com/mZargham/status/1390362756663152641?s=20) as a \"a unique digital pointer to a node in the directed acyclic graph we call science.\"\n\n", "timestamp": 1620418062, "digest": "drLJEfzzX3M5nI5t9MKyxHR1k5gksoT_Q-a5xOWOdEU", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
