{"id": "IxxgXO2pjIQXLAfxdY2G794LELmxktXfyySJcL0qBPc", "title": "My Dream for the Planet School", "body": "Last week, I stepped off the *SSV* (Sailing School Vessel) *Corwith Cramer* after spending six weeks at sea as the 3rd Mate for “Marine Biodiversity & Conservation,” a college semester-at-sea program run by the Sea Education Association (SEA)*.* Coming aboard in Key West, Florida seven weeks ago marked 14 years since I had stepped onto *Cramer* as a student myself. I had never been sailing before and I had no idea how profoundly that voyage would impact me. They say that the sea is a great teacher and I agree, but the community we intentionally create at sea deserves description too.\n\nAn isolated ship at sea is, in many ways, an ideal medium for creating deeply impactful learning opportunities. For this inaugural Planet School blog post, I want to share why I love to teach at sea and how the core elements of an ocean-based curriculum do not actually need to be unique to the sea at all. To do that, I need to give a bit of background on what it means to go sailing for a semester on a tall ship.\n\n![Removing the crutch of GPS and navigating with the stars is yet another opportunity for authentic student agency.](https://images.mirror-media.xyz/publication-images/2czv-EUWimA9Q8y4l-iNF.jpeg?height=450&width=600)\n\nMake no mistake: sailing is hard work. I suspect that many students, like me when I was 20 years old, perceive a semester aboard a sailboat as one of relaxing exoticism bordering on luxuriousness: perfect sunsets, dolphins chasing the bow, strumming a guitar, reading *Treasure Island* or *Moby Dick* and coming home with a perfect tan and a year’s worth of Instagram posts—no filter, obviously. After all, yachts are a pastime of the wealthy and the Caribbean is a vacation destination. While there are innumerable moments of grandeur to be had at sea and all of the things I listed above usually happen multiple times on every voyage, they belie the full story. Any notion of #YachtLife is a delusion that gets shaken almost instantly.\n\nStudents step onto the ship and they step into a new world. First, the language is completely different—both the immense vocabulary of nautical terminology as well as the style of repeating commands. When you are given a task, you repeat the command back to the person who just gave it to you, then you go do the task, then once the task is done you return to the person who gave you the task and tell them it is complete, which they then repeat back to you. This creates a closed loop—there is little chance for miscommunication—but that much repetition does not come naturally. So not only do students have multiple subject areas to master—navigation, seamanship, meteorology, watch standing duties, laboratory procedures—but their way of communicating is being frequently corrected. They are studying new subjects in a new language in a place that is constantly moving (making many of them seasick) and with a watch-standing schedule that means their sleep is inconsistent. On all fronts, my semester with SEA in college was, hands down, my most challenging term and Brown University was not exactly a cake walk.\n\n![](https://images.mirror-media.xyz/publication-images/wYOcovwOe7n5jeVg9IkIg.jpeg?height=3456&width=4608)\n\n## A Three Phase Approach\n\nEvery voyage program I have sailed on—SEA vessels and Proctor Academy’s Ocean Classroom semester—breaks their trip into three phases: The Spaghetti Phase, The Shadow Phase, and the Junior Watch Officer (JWO) Phase. The Spaghetti Phase is so named because, for the students, it feels like information is being thrown at them like spaghetti: some of it sticks and some (most) just falls to the deck. It could also be called the Firehose Phase because it can feel like drinking from a firehose. Whatever the metaphor, the first phase is characterized by feeling overwhelmed, adjusting to the boat, and being corrected frequently. It can be discouraging, so building unity within a student’s watch is important as is creating frequent moments for light hearted community building. The goal is for students to learn *what* to do and to see this behavior role-modeled by the staff.\n\nThe second phase (usually following two weeks of spaghetti) is when students start to shift to learning *why* things are done. During each watch, a student is selected to be the shadow and follow the mate through their duties. The mate narrates what they are doing as they do it, the student accompanies the mate when they check in with the captain, and the student starts to take the lead in various routines, like making sure the hourly boat checks and weather observations are completed. This is the chance to start peeking behind the curtain and feel invited to partake in the boat’s management.\n\nFinally, the JWO Phase. In many ways, the entire trip builds to the JWO Phase. During this phase, a student is elevated to the position of Junior Watch Officer during their watch and takes over for the mate. Students interact directly with the captain to respond to weather changes, recommend sail evolutions, and delegate tasks within their watch.  The JWO can even delegate tasks to the mate, so long as the task does not take the mate away from the quarterdeck for more than 10 minutes. While the mate is still the safety officer and legally responsible for the watch, they step back as much as possible. Mates are told to let mistakes happen and only yell “Hold!” if a student is about to injure someone or damage the boat. No reason is given for yelling “Hold!”, so action does not resume until the JWO or one of their watchmates discovers the problem and corrects it.\n\n![A JWO, wearing the \"JWO Hat,\" plotting the ship's position.](https://images.mirror-media.xyz/publication-images/pw2OQCJQxLevILLX_gG1F.jpeg?height=3024&width=4032)\n\n## A Recipe for Great Learning\n\nThis three phase progression is where the magic happens. All three phases are essential; neither is successful without the other two. Most conventional classrooms never make it past the Spaghetti Phase. Conversely, if we were to skip the Spaghetti Phase, the students would not feel prepared for the greater responsibility asked of them. This progression works because of the learning environment that is very intentionally created by the staff, both in the program’s core design and through staff meetings that happen underway. That environment consists of a few essential ingredients:\n\n1. **Authenticity**. If students feel that their input and time is valued as part of an experience that is not “busy work,” they will invest in it. Since the boat is a real boat sailing on the ocean, everything connected to that objective being completed successfully is very clearly not busy work. There are very real consequences to not doing a job completely or correctly. This element drives home the value of “Seek Excellence.”\n2. **Relevance**. A student could be assigned the authentic task of digging a big hole or meticulously cleaning the interior components of an antique pocket watch but will probably lose interest if the question “why” is not answered. This can sometimes happen with boat checks, which happen every hour on a boat and begin to take on an element of blind routine if their value is not reinforced. When it comes to establishing relevance, the connection can be specific to the student, broad to society, temporal to the moment at hand, or tied to the legacy of the human race 10,000 years from now, but there must be an answer.\n3. **Ownership**. Of all the characteristics here, this is the one we see the most frequently in existing classrooms. High school students are given charge of completing their assignments, showing up to class on time, and discharging a multitude of duties. What I advocate for here is that we create more pathways for the sphere of ownership to keep expanding. We should reward great performance with greater ownership.\n4. **Agency**. This is different from ownership, perhaps even a step up from ownership. Agency combines ownership, relevance, and authenticity to create a moments where the student makes choices that have consequences. As a mate, when I delegate setting a sail to a student, I have given them ownership of that task. Often, the ownership of something means following a script for how that job needs to be done: there is a right way to set a sail and a myriad of wrong ways. Agency means writing the script.\n5. **Ability to Fail**. It is possible to create a learning environment where all of the above are present and yet the lesson still falls short on this final element. A JWO will feel authenticity, relevance, ownership, and agency by the nature of being JWO, but if the mate steps in to answer a tough question or offers an overly revealing hint, the ability to fail dissolves. In some ways, ability to fail creates a deeper layer of fusion between authenticity and the relevance of the experience that generate moments of genuine discomfort for students.\n\n   As a mate, a critical element in creating a successful JWO Phase is to step back and let the student make mistakes, or forget things, or become overwhelmed. This can be hard because I want my students to succeed, but I have come to appreciate that there needs to be a “butterfly emerging from the chrysalis” moment if the value of everything that happened up to that point is going to matter. A student can watch and study something a million times, but then it is their turn to step up and do it. Near the end of the novel *The Alchemist*, the alchemist describes this concept to the protagonist:\n\n> “What you still need to know is this: before a dream is realized, the Soul of the World tests everything that was learned along the way. It does this not because it is evil, but so that we can, in addition to realizing our dreams, master the lessons we’ve learned as we’ve moved toward that dream. That’s the point at which, as we say in the language of the desert, one ‘dies of thirst just when the palm trees have appeared on the horizon.’\n>\n> Every search begins with beginner’s luck. And every search ends with the victor’s being severely tested.”\n\n![](https://images.mirror-media.xyz/publication-images/XFo5fuOKYfz2DwkCXIQz_.jpg?height=447&width=450)\n\nTo be clear, I am not talking about fear of failing as a person. Our classrooms already have this trait to a damaging degree with our modern grading system and the pressure of college admissions. I have frequently seen tears on JWO and while sometimes that is just how a person processes stress, there needs to be a calibration of duties with what a student is ready for, which varies by person. When I debrief with my JWO after the watch is over, a pointer I frequently remind them of is to not be too hard on themself when they fail: accept that you will make a mistake, take a moment to reflect on it, and then give yourself the grace to move past it and you can unpack the lesson later. As a leader, you must move past it or you will be distracted from your job in that moment. I also believe that a student needs, ideally, a minimum of three shifts as JWO to enable them to witness their own progress and internalize lessons. Most often, a student’s first JWO stint is not pretty and having that be their one shot would be unfortunate.\n\n## Beyond Sailing\n\nSailing for weeks at a time is an amazing adventure that makes creating many of these conditions easier, but in some ways it is not ideal. The sleep schedule, seasickness, and risk of burnout for staff and students are the most obvious downsides. Sailing is also an expensive and exclusive opportunity. And do we really need a boat in order to do any of this?\n\nAbsolutely not.\n\n![Planet School terms will begin with 4-5 weeks sailing and then transfer to a land campus, bringing along the ethos developed underway.](https://images.mirror-media.xyz/publication-images/yh6OSBRAKEr2wfgdma3uE.jpeg?height=3024&width=4032)\n\nMy goal with the Planet School is to take this process that I have seen be so effective on sailboats and replicate it in other realms. A three phase progression carried out between a knowledgeable practitioner and a group of students can be done in almost any field: the leader of a “watch” need not be a professional mariner. The expert could be a farmer, an engineer, an economist, or an artist. The task need not be sailing, it could be starting a business, managing a farm, or building a yurt. It could even be building a school.\n\nThe underlying project of the Planet School is to build the school itself. Since a campus is a community, such an undertaking could reasonably include a project in almost any discipline, giving students the chance to explore their passions and be exposed to potential passions they have not experienced before. Some of my most potent memories from high school are from the activities that included role-playing of “real life”: speech and debate, theatre, Model UN, Youth Legislature, and the school newspaper. Through the prevalence of internships, externships, and youth employment as well as the cliche of how teenagers yearn to leave home, the desire for real world experience at that age is evident. We should build our schools to be authentic laboratories for trying out real world solutions. If we are to be better stewards of our planet, then we need to do more than encourage experimentation, bold thinking, and sustainability—we need to create education spaces where we actively train youth in those habits.\n\nI never imagined myself as a teacher. I never imagined myself working in education. Yet I have learned that any systemic reimagining of human civilization must begin with how we equip our future generations. My vision for school is that, whatever the project, students are challenged in an authentic, relevant way where they have agency, feel ownership, and are trusted to be able to fail.", "timestamp": 1653239582, "digest": "SiaaK_sDxGc1-zoy7KhbTktMsmr-WZmS8dSheqQM8Yc", "contributor": "0x505683cF3aDdF5DE8E82AABB9d24763B9A72aAD0"}
{"id": "-xEPSdIp1pN8n8-c7Z4KWokABPxqtQaDmHIgdXnYhp0", "title": "《SAAR 雪人家族》调研报告", "body": "`——TSA 调研组：佩佩 制作`\n\n**// 特别强调：**\n\n1. 链游项⽬均为⾼⻛险项⽬，有复杂的经济模型\n2. 此份研报初衷在于项⽬分享，仅以目前（2022.5.23）的信息归纳分析汇总，情况可能不准确，不作为投资建议。\n\nSAAR是一款基于wax的区块链P2E游戏，讲述的是生活在冰冻洞穴中的几个不同雪人种族的故事，随着人口的增加，雪人们面临着资源稀缺和空间不足的问题，于是他们开始了在阿曼达大陆上的资源找寻挖掘之旅。\n\n这是一款采挖类游戏，团队吸取了市场上各类玩赚项目的宝贵经验，引入新的机制，希望通过动态调节经济模型，来平衡玩家所获得的游戏内资源，以保持长期的市场需求，该项目已于5月16日正式上线，目前属于一个头矿期，那它是否有什么特别之处呢，下面就让我们一起来看下雪人家族它有怎样的一个玩法。\n\n## 1. 代币经济模型\n\n雪人家族中的每个角色也可称为Yeti，玩家入门需要至少一个Yeti NFT，以及一些能量(energy)和矿石(millirium)来恢复体力和工具耐久。 \n\n游戏内设计了四种代币，分别代表四种资源：\n\n![](https://images.mirror-media.xyz/publication-images/pPrCgbWjKbwVmyWarw7k5.png?height=182&width=554)\n\nSRE(能量代币)：用于合成和恢复雪人们的体力。 \n\nSRM(矿石代币)：用于合成和恢复雪人们使用的工具的耐久度。 \n\nSRW(木头代币)：用于合成和恢复雪人们使用的工具的耐久度。 \n\nSRS(精神代币)：用于自动化开采，游戏默认是每小时claim一次，Spirit支持充能达到4级，可每隔4小时进行一次claim。\n\n![](https://images.mirror-media.xyz/publication-images/2huzTYgZjXS-mQ34ZVL5Y.png?height=315&width=554)\n\n上图为总体模型，玩家通过持有不同种族的雪人NFT，挖掘四种资源(即token)，四种币除了分别用于耐力恢复和自动开采，还可以升级雪人以及创建新的雪人包，和可以制作增加挖矿产出的护身符。\n\n## 2. NFT游戏角色简介\n\n### 2.1 雪人Yeti\n\nYeti是游戏最主要的角色，它们可用于开采特定资源，具体取决于Yeti的种族类型和稀有度。 \n\n一共有9种不同的雪人，根据产出的不同可以分为三组类型：\n\n![](https://images.mirror-media.xyz/publication-images/vAsGagFc0aXYodf-AgWKq.png?height=263&width=554)\n\n拿着普通斧头、高级斧头，手拿普通锯子的雪人开采木头资源，每次开采需消耗能量和工具耐久度，耐久度可通过矿石代币修复。\n\n![](https://images.mirror-media.xyz/publication-images/5YSw19O1fsamU1y-TtNol.png?height=271&width=554)\n\n带电锯、普通镐和电钻的雪人开采矿石资源(millirium)，每次开采需消耗能量和工具耐久度，耐久度通过木头代币修复。\n\n![](https://images.mirror-media.xyz/publication-images/3MYMR2ANfzZv_wLaqA5v2.png?height=265&width=554)\n\n初学、中级和高级的雪人工程师是可再生能源生产的先驱，它们产出能量，每次开采仅消耗耐久，耐久需要通过矿石和木头来修复。\n\n### 2.2 护身符Amulet\n\n游戏中目前有6种不同的护身符，可以用于增加每次开采的资源数量，或减少每次开采所需要消耗的数量，同时将护身符放置到祭坛还可以产出一些spirit代币。\n\n![](https://images.mirror-media.xyz/publication-images/9nw67oE3IxfpdMcVCDmQ-.png?height=282&width=312)\n\n护身符除了可从atomichub交易市场购买，还可以使用木头、矿石和精神三种代币来制作。\n\n### 2.3 魔法砖magicbrick\n\n![](https://images.mirror-media.xyz/publication-images/-epA4k2iHzHWgbxPy2aR1.png?height=346&width=430)\n\n小屋(cabin)是雪人们居住的建筑物，游戏初始为每个玩家提供了两间小屋，初始每间小屋仅可容纳一个同一类型的雪人，也就是如果你有两个工程师雪人NFT用于挖能量代币，可将它们分别放置到两个小屋中，但如果有第三个同样用于挖掘能量的雪人，就需要使用魔法砖来升级你的小屋。 \n\n蓝色和绿色魔法砖可用于增加小屋容量，普通cabin升级到大型cabin需要3块蓝色魔法砖或1块绿色魔法砖，大型升级到别墅需要6块蓝色魔法砖或2块绿砖，一个玩家最多可在游戏内放置18只不同类型的雪人。 \n\n粉色和紫色魔法砖则可用于增加使用护身符的插槽。\n\n \n\n### 2.4 土地land\n\n![](https://images.mirror-media.xyz/publication-images/B9wzz_HQZRDqr-7hphMyv.png?height=320&width=554)\n\n玩家除了挖掘资源，也可以选择持有一块或多块土地，每块土地有不同的开采类型和稀有度，土地所有者可从其他玩家在该土地上开采的资源中获得 2% 到 8% 的分润收益。 \n\n注意目前土地还未开始销售，另外如上图所示，在页面中心的阿曼达岛屿附近有六块大型岛屿(megaland)，官方后期将会举行拍卖会，它们每一块是普通土地面积的7倍，且该土地的所有者将和传奇土地所有者平分系统总佣金池的40%。\n\n \n\n## 3. 玩法流程 \n\n在对经济模型和游戏角色有个基础了解后，让我们来看看雪人家族的具体玩法： \n\n**进入游戏网站自动连接钱包：**\n\n[https://saar.game/](https://saar.game/)\n\n**第一次登录首先会看到资源选择页面：**\n\n![](https://images.mirror-media.xyz/publication-images/vdC2xqfZ1zS57DBucooNs.png?height=329&width=554)\n\n根据你持有的雪人类型选择其中一种资源类型来采挖，玩家在同一时间段只能开采木头、矿石、能源这三种中的其中一种，如果你选择开采能源，而账号中还有挖掘木头的雪人，那它将只能产出spirit代币(无需消耗能量)。 \n\n玩家可自由切换采挖资源类型，但需要支付相应的代币，比如从挖能源切换到挖木头，需支付500个srw币。 \n\n**选择土地：**\n\n![](https://images.mirror-media.xyz/publication-images/yIYHEJHdvNmdviTTCuKUe.png?height=287&width=554)\n\n土地可以选megaland或是周围的普通土地都可以，只要点击每块土地看到左侧详细信息里显示有choose for mining即可选择，土地选择需注意，如果是普通地，land type要选择和你主挖的资源一致的地，另外天气尽量选当前是sunny的，如果是其他天气类型会影响产出。\n\n \n\n**选好后在页面右下角点击Village进入游戏页面如下图所示：**\n\n![](https://images.mirror-media.xyz/publication-images/4cCnUWahZUSIGs44sUNhq.png?height=308&width=554)\n\n**点击小屋，进入采挖页面：**\n\n![](https://images.mirror-media.xyz/publication-images/6K5wHYo_jd99wwTM7YL82.png?height=316&width=554)\n\n根据你的雪人类型在右侧分栏选择合适的插槽放置NFT，放置好后如无显示刷新页面即可。\n\n**雪人放置好后即可开始采挖：**\n\n![](https://images.mirror-media.xyz/publication-images/fFmRVQoPILIRN_7MqqIqN.png?height=320&width=554)\n\n上图是普通能量开采工程师的采挖页面，每1小时claim一次，一次大约可获得45.45个能量代币，消耗60个耐久度，需要12个矿石和18个木头代币来修复，这里玩家可选择每次去repair，也可以积累到耐久度用完。 \n\n另如果是挖木头或矿石，采挖时需要消耗能量，因此要事先充入一些能量代币到游戏中。 \n\n以上就是雪人家族大致的流程，目前claim间隔默认是1小时，每支付5个spirit币可将claim间隔时间延长1小时。 \n\n**收益方面团队暂时没有给官方的ROI表，这里附上一份社区玩家做的表格：**\n\n[https://docs.google.com/spreadsheets/d/1iOYDIqOca5KLEZB3QS6Eqs5TblaK0oE9dB2VnXgCGzs/edit#gid=2079524431](https://docs.google.com/spreadsheets/d/1iOYDIqOca5KLEZB3QS6Eqs5TblaK0oE9dB2VnXgCGzs/edit#gid=2079524431)\n\n![](https://images.mirror-media.xyz/publication-images/XuB9ij_hikVtKoIYzx9pR.png?height=251&width=554)\n\n可以填入你想配置的NFT，参考下大致的ROI，但需要注意，游戏内数据是动态变化的，它这里记录的消耗产出和实际存在出入，同时没有考虑手续费和精神代币的产出，所以它只是暂时的参考，从目前观察来看，产出矿石和能量的ROI比木头要好，同时等级越高的收益越高，不考虑价格波动，史诗传奇的ROI平均在10天上下，相对普通的在30天以上。\n\n## 4. 项目测评及潜力分析\n\nSAAR雪人家族是比较典型的多币制挖矿游戏，这也是目前市场主流的一种经济模型，玩家可选择不同的玩法策略，token之间互为供需，可使游戏维持更长期的经济平衡。 \n\n相对于市场同类项目，SAAR的主要亮点一是通过第四种代币sws的消耗，来延长claim时间间隔，达到一定程度的自动化采挖，从同类项目来看，这种设计是有一定玩家需求的。 \n\n另一个是天气状况的设计，每块土地每24小时都可能会有不同的天气变化，Sunny太阳天不会对玩家有任何影响，Windy阴天，有30%概率产生，它会减少Yeti15%的产出量，有10%的几率遇到Snowstorm暴风雪天，在这种天气条件下，开采量减少50%，同时消耗量翻倍，对于普通NFT，这时玩家可能需要选择停工。 \n\n天气的变量增加了游戏的随机性，同时也有助于对游戏内各种资源供需进行动态调整，通过对近年来链游市场的观察，我们也发现，经济模式不只是写在白皮书和表格里的单一数据，随着游戏的发展，能进行有效的动态调节对项目的长期很重要。 \n\n问题方面目前来说可能最主要的还是市场偏小众，据Dappradar数据，日活用户数在500左右，这里主要原因可能在于随着加密市场进入熊市，链游市场一直萎靡不振，特别是近期wax价格大幅下跌，也导致很多玩家离场，另外该项目从销售到上线的时间间隔稍长，现在也会存在一点热度缺失，包括NFT市场交易量暂时不高，还需要看团队在未来是否能够通过一些营销或市场活动激发更多玩家的兴趣。 \n\n不过市场趋冷对玩家来说不一定是坏事，像现在市场上的入门包也就在10-30刀不等，风险可控，所以它还是比较适合一些喜欢玩这种采挖游戏的玩家去体验。 \n\n对于未来的关注点一是制作合成，从NFT市场来看，他家各类型的雪人体量并不是特别大，早期包八九成也都被打开，随着用户增长，有望刺激合成需求，合成消耗更多的代币，代币价值增长再推动更多的用户增长，这也是这种挖矿合成类主要的增长模式。 \n\n另一个就是土地，目前官方还未公布销售规则，对玩家来说，它可能也是该游戏接下来的一个机会点。\n\n## 相关链接\n\n`官推：`\n\n[https://twitter.com/SaaR_nft](https://twitter.com/SaaR_nft)\n\n`白皮书：`\n\n[https://whitepaper.saar.network/](https://whitepaper.saar.network/)\n\n", "timestamp": 1653239757, "digest": "MIbMrEPFslnl04gAUayyZ2CpW313s_6GVvk6md56GEI", "contributor": "0xeF96650E66688D5Fedb995432E28cdadDCcCBF71"}
{"id": "hbEj9k6swRJQhaEVLAYWfxAWtGLoJWn6Mcr6ogWNPU8", "title": "ASX Genesis Event", "body": "## Not you usual TGE\n\nThere have been many debates about what the fairest token generation event mechanism would be, but a consensus has yet to be reached. With that in mind, we’ve decided to do things a little differently and base our launch on (possibly) the rarest commodity in this market: awareness. Welcome to our stealth launch.\n\n\n---\n\n*The ASX Genesis Event has arrived. Please read this article carefully to understand the novel mechanics of this event.*\n\n\n---\n\n## TL;DR\n\n*Values in US$ consider ETH priced at $1,925.*\n\n* **Token:** ASX (ERC-20) → Governance Token of the ASX Protocol\n* **Network:** Ethereum Mainnet\n* **Total / Max Supply:** 1,000,000,000 ASX\n* **Genesis Event Allocation:** 800,000,000 ASX\n* **Initial Liquidity Allocation:** 200,000,000 ASX\n* **Mint Rate:** 1 ASX / 0.000004 ETH or 250,000 ASX / 1 ETH\n* **Venue:** Self-hosted at <https://mint.asx.st/>\n* **Mode:** First-come, first-served basis (FCFS)\n* **Start date**: Live now\n* **End date**: 10 days after the soft cap is reached\n* **Soft Cap:** 1000 ETH | 250,000,000 ASX minted\n* **Hard Cap:** 3200 ETH | 800,000,000 ASX minted\n* **Fully Diluted Market Cap / Value (FDV)**\n  * **at Soft Cap:** 312,500,000 ASX \\~ $2,406,250 | 687,500,000 ASX burned\n  * **at Hard Cap:** 1,000,000,000 ASX \\~ $7,700,000 | 0 ASX burned\n* **Initial Liquidity (40% of FDV)**\n  * **at Soft Cap:** 62,500,000 ASX + 250 ETH | \\~ $962,500\n  * **at Hard Cap:** 200,000,000 ASX + 800 ETH | \\~ $3,080,000\n* There's no founders or team allocation, no seed or private sale, no liquidity mining, and no airdrop. The Genesis Event is the first and only place to get ASX tokens before listing.\n* Team and partners are allowed to participate after the progress bar reaches 50%.\n* Participants can claim their ASX tokens once the event is completed. There's no vesting. 100% of the max supply will be unlocked and circulating on day one.\n* Once the soft cap is reached (250,000,000 ASX minted), a countdown of 10 days will start. When it hits zero, the Genesis Event will end, the initial liquidity pool on Uniswap will be created and the remaining ASX will be burned along with the liquidity provider (LP) token.\n* ASX ERC-20 smart contract address: **0x5313235002b9F11698D7B9187Be44f836FEbD6b5**.\n\n\n---\n\n## A unique token launch\n\nAs a community-focused project committed to the ethos and founding principles of the blockchain space, we are pleased to announce the official launch of **ASX**, the governance token of the ASX Protocol.\n\nIn the spirit of equal distribution, fairness, decentralization, and a community-first ideology, the launch event is taking place on our [custom-made platform](https://mint.asx.st/) and it's the first and only opportunity for anyone to get access to the ASX Protocol's native token, **ASX**, which will give holders the power to govern and curate essential infrastructure components of the network.\n\nOur mission is to give everyone in our community an opportunity to become a stakeholder in the ecosystem, and we want to extend that opportunity as fairly as possible. Launching ASX on our own platform, with a mechanism that is fair and transparent for all participants, drastically increases the chances of achieving this mission.\n\nApart from building our own token launch platform, we made sure everyone was on a level playing field. There's no seed or private sale, no liquidity mining, no emission (zero inflation), zero tokens to influencers or promoters, no airdrop, and zero Treasury, Company, Founders, Team, or Partners allocation.\n\n### 1 billion ASX tokens. 800 million to be minted, 200 million for liquidity. That's it.\n\n> *The protocol's revenue will exclusively serve ASX holders and all operations will be funded with ETH or stablecoins.*\n\nThe ASX Genesis Event is open to all interested and qualifying parties. It's a major milestone for the ASX Protocol ecosystem and speaks to the viability of our core technology and business model as we aim to become the ultimate permissionless omnichain liquidity hub for staked assets.\n\nAt ASX Labs, we believe in creating a global staking ecosystem of the people, by the people, for the people, that shall not perish under any threats. The crypto dream has never been about creating an instrument that can easily be put in a box, but about creating global assets that can govern and manage these new decentralized global networks.\n\n## Understanding the mechanics\n\nTo mint 1 ASX you need to contribute 0.000004 ETH. A total of 800,000,000 ASX will be available for minting. Due to the low fully diluted market cap of the project and to ensure as broad a distribution as possible and dramatically soften the potential for a massive gas war, we decided to operate in stealth mode until 50% of the tokens are minted.\n\nThere's a minimum of 1 ASX per mint and no maximum. Setting up a max cap per wallet without KYC is foolish and we're not big fans of KYC in DeFi. For us, privacy and freedom are paramount, and we respect and stand by yours. With that said, there's a cap of 100 ETH per mint on our Interface just to slow things down, if they get a bit crazy.\n\nIf you're lucky enough to hear about the ASX Protocol early, you'll have enough time to participate. Otherwise, you can get ASX tokens on Uniswap, after the Genesis Event is completed.\n\n## How to participate\n\nParticipating in the ASX Genesis Event is simple, quick, and intuitive, and getting prepared is even easier. Here’s what you’ll need:\n\n→ **An Ethereum-compatible web3 browser wallet**, such as MetaMask. You can generate a wallet address from these web3 wallets directly, or use your seeds to import an existing wallet address.\n\n→ **Sufficient ETH**, which you will need in order to contribute and pay for transactions gas fees.\n\nOnce you’ve got your checklist all set, here’s what the process will look like:\n\n1. To get started, head to our custom-made [Launch Platform](https://mint.asx.st/).\n2. You’ll be prompted with a welcome message. Click on \"**PARTICIPATION TERMS**\". Read everything and, if you agree, click on \"**I AGREE**\". Next, click on \"**CONTINUE**\".\n3. The next message will be a TL;DR of the ASX Genesis Event. Carefully read everything and click on \"**CONTINUE**\".\n4. You can now connect your wallet. We support almost any web3 injected wallet, but for a flawless experience, we recommend using MetaMask. Click on \"**CONNECT WALLET**\", either in the center or on the upper right-hand corner of the page.\n5. Once your wallet is connected, the ETH and ASX input fields will become available to you. You may either insert the amount of ASX you would like to receive or the amount of ETH you would like to contribute. Enter the desired amount and click on \"**MINT**\". Please make sure you have enough ETH in your wallet to pay for transaction fees.\n6. You will see a popup from your MetaMask wallet. Confirm the transaction and then wait for it to go through. Once it is validated on the Ethereum blockchain, your ASX balance, on the top of the page, will update and a \"CLAIM\" button will appear. You will be able to claim your ASX tokens once the event is completed.\n7. That's it! You successfully participated in the ASX Genesis Event.\n\n*Once your transaction is validated, a smart contract, that works like an escrow, will receive your ASX tokens and keep them safe until the end of the Genesis Event, when you will be able to claim them. Claimed ASX tokens are not locked and there is no vesting.*\n\n*Team and partners are allowed to participate in the Genesis Event after the progress bar reaches 50%. If the desired amount of ASX that those parties intend to hold can't be fully minted during this event, the remaining amount will be purchased on Uniswap.*\n\n## Liquidity\n\nBy the end of the Genesis Event, the initial liquidity of the ASX token will be immediately provided as a full range position on Uniswap V3. Since the resulting liquidity provider (LP) token will be directly burned, this initial position will be perpetual.\n\nThe liquidity depth will represent 40% of the FDV (Fully Diluted Value) and its absolute value will be based on the total ASX minted.\n\n* At soft cap, 250 ETH will be paired with 62,500,000 ASX, pricing the token at $0.0077 / ASX with $962,500 of liquidity depth.\n* At hard cap, 800 ETH will be paired with 200,000,000 ASX, pricing the token at $0.0077 / ASX with $3,080,000 of liquidity depth.\n\n*The Genesis Event will end in 10 days after the soft cap is reached or when all ASX tokens are minted, whichever comes first. Any unminted ASX will be burned.*\n\n## Security\n\nWe were very careful when deciding the code for the ASX ERC-20 smart contract and, to make it the safest possible, we only allowed the absolutely necessary lines of code. There's no mint function, no pause function and the contract is not upgradeable. It is an immutable token on the Ethereum Mainnet Network.\n\nBoth the ERC-20 and the Genesis Event smart contracts were developed with the highest levels of security, leveraging the battle-tested OpenZeppelin standard. With the entire supply circulating by the end of the Genesis Event plus the immediate burn of the liquidity provider (LP) token, you can rest assured that the ASX token can never be hacked or rugged.\n\n### Important Notes\n\nThe team at ASX Labs will NEVER DM YOU FIRST or ask you for money on any platform. You should be very skeptical of any DMs received by anyone claiming to be from ASX Labs.\n\nOnly trust ASX Protocol's official channels at the bottom of this announcement for information surrounding the event.\n\nThe ASX token will only be available once the Genesis Event is completed. Only then you will be able to trade it on Uniswap. Be sure to always check the smart contract address before trading.\n\n\n---\n\nThis is the first step towards an omnichain yield future. Welcome aboard.\n\n\n---\n\n* Participate in the [ASX Genesis Event →](https://mint.asx.st/)\n* Access our [Interface →](https://asx.st/)\n* Follow us on [Twitter →](https://twitter.com/asxlabs)\n* Join us on [Telegram →](https://t.me/asxprotocol)\n\n\n---\n\n## Legal Disclaimers\n\n*You understand that the ASX tokens have no intrinsic value and are solely tools of governance, and as such have no intrinsic potential for future appreciation in any form whatsoever. You further represent and warrant that you are an active user of blockchain technology and blockchain-based software systems and have the pre-requisite technical knowledge to understand what has been mentioned in this announcement and the risks that follow*.\n\n*The information provided within this announcement is for general informational purposes only pertaining to the governance tool. You understand that the ASX Protocol governance structure is an experiment in the field of decentralization and community governed structures, in which participation via the ASX token and otherwise is entirely at your own risk*.\n\n*Information contained in this announcement should not be relied upon at any time as advice to buy or sell or hold the aforementioned governance tokens and a particular note should be made to emphasize the solely governance-based nature of the ASX tokens and their lack of intrinsic ownership or economic value. This announcement does not take into account nor does it provide any tax, legal, or investment advice or opinion regarding the specific investment objectives or financial situation of any person.*\n\n*ASX Protocol and its associated parties, as appropriate, make no representation or warranties, expressed or implied, as to the accuracy of such information and ASX Protocol expressly disclaims any liability that may be based on such information or errors or omissions thereof. ASX Protocol reserves the right to amend or replace the information contained herein, in part or in its entirety, at any time, and undertakes no obligation to provide the recipient with access to the amended information or to notify the recipient thereof. The information contained in this announcement supersedes any prior representation, post, or conversation whether informal or formal, concerning the same, similar, or related information*.\n\n*This communication is not for distribution to U.S. newswire or similar services or any dissemination in the United States. This communication shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of, ASX tokens to any U.S. person (including, without limitation, any citizen or resident of the United States) or in the United States or in any jurisdiction in which such offer, solicitation, or sale would be unlawful before registration or qualification under the laws of any such jurisdiction*.\n\n*Any reference or mention of the ASX Genesis Event being open or accessible to the “public” should be understood to refer only to qualified individuals and entities under the applicable law.*\n\n*The ASX token is not an investment contract or security and should not be treated as such.*\n\n\n---\n\n## Restricted List of Countries\n\n*The ASX Genesis Event is not available to anyone located, incorporated or otherwise established in, or a citizen or resident of the United States of America, Afghanistan, Albania, American Samoa, Angola, Antigua and Barbuda, Aruba, Bangladesh, Barbados, Belarus, Benin, Bermuda, Bhutan, Bolivia, Bosnia and Herzegovina, Botswana, Brunei Darussalam, Burkina Faso, Burundi, Cabo Verde, Cambodia, Cameroon, Canada, Cayman Islands, Central African Republic, Chad, China, Comoros, Congo, Côte D'ivoire, Crimea and Sevastopol, Cuba, Democratic People's Republic of Korea, Democratic Republic of the Congo, Djibouti, Dominica, Ecuador, Egypt, El Salvador, Equatorial Guinea, Eritrea, Eswatini, Ethiopia, Fiji, Gabon, Gambia, Ghana, Guam, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, Hong Kong, Iran, Iraq, Jamaica, Jordan, Kenya, Kyrgyzstan, Lao People's Democratic Republic, Lebanon, Lesotho, Liberia, Libya, Macao, Madagascar, Malawi, Maldives, Mali, Malta, Mauritania, Mauritius, Micronesia, Moldova, Mongolia, Montenegro, Morocco, Mozambique, Myanmar, Nauru, Nepal, New Caledonia, Nicaragua, Niger, Nigeria, Niue, Northern Mariana Islands, Oman, Pakistan, Palau, Palestine, Panama, Papua New Guinea, Puerto Rico, Russian Federation, Rwanda, Samoa, Sao Tome and Principe, Senegal, Serbia, Seychelles, Sierra Leone, Somalia, South Georgia, South Sudan, Sri Lanka, Sudan, Suriname, Syrian Arab Republic, Tajikistan, Tanzania, Thailand, Timor-Leste, Togo, Tonga, Trinidad and Tobago, Tunisia, Turkey, Turkmenistan, Uganda, Ukraine, United Kingdom, United States Minor Outlying Islands, US Virgin Islands, Uzbekistan, Vanuatu, Venezuela, Western Sahara, Yemen, Zambia, Zimbabwe, or any state, country, or jurisdiction where it would be illegal, according to applicable law, to participate in this event*.", "timestamp": 1653239791, "digest": "SPP24Za2i393DM3Tx2hJqKXW0GYafuXHOu-pvMLcjNg", "contributor": "0x1be3C6a0a7617CE21Ca1765917629629787b48aD"}
{"id": "JEsmyhO3sPRcqERajgdSY-vgvqoWieNCH7zfZLAOEcg", "title": "GUIDE TO KYVE TESTNET", "body": "Only participate in this testnet for fun and not participate for monetary return,though incentive is expected.\n\ni will be participating with this wallet address : \n\nkyve1ke2ft28wqlufzzkyxsfny0fzwzuk3w52znl9p2\n\n![kyve1ke2ft28wqlufzzkyxsfny0fzwzuk3w52znl9p2](https://images.mirror-media.xyz/publication-images/1urXxryKBFWRlWYq4Uw7v.png?height=404&width=591)\n\n## Introduction\n\nKyve (Twitter : <https://twitter.com/KYVENetwork>) Building the Web3 data lake solution Making data reliable, permanently stored, and easily accessible\n\n![Incentivized Testnet is live](https://images.mirror-media.xyz/publication-images/YNM9go3fMQPjHLlMr0BFg.png?height=500&width=1269)\n\n## TERMS & CONDITIONS\n\nKyve’s incentivized testnet will be open for two months **since 2nd of may 2022**\n\n2% of the the supply (20,000,000 $KYVE) is allocated for the incentivized testnet. The rewards are distributed as follows:\n\n* Pool A rewards the top 5,000 participants on the leaderboard (5,000,000 $KYVE)\n* Pool B rewards top 10,000 participants on the leaderboard (5,000,000 $KYVE)\n* Top node runners in either top 2500 or 5000 (10,000,000 $KYVE)\n\n### You’ll have to complete design, community and engineering tasks to get points to rank high in the leaderboard.\n\nNOW LET BEGIN\n\nGo to <https://app.kyve.network/> and connect your Keplr wallet. It will automatically ask you to add the KYVE Korellia network.\n\nThen click “Facuet” and claim your testnet $KYVE from all 3 sources (Twitter, Discord and wheel spinning). For Discord and wheel spinning, you can claim everyday.\n\n## (Due to extreme congestion of the facuet, prepare to wait a few hours before receiving your tokens.)\n\n![click on perform the three faucet task to get your test faucet](https://images.mirror-media.xyz/publication-images/Xw4U3eJfQdIgShINPdEo5.png?height=599&width=1351)\n\n**Step 1:**\n\nGo to “Tasks” and read the task description.\n\nCommunity tasks are easy to complete,make sure to perform them.\\\\\n\nContent tasks involve making videos/memes/content.\n\nIn this guide, we will go through two simple engineering task, Pool Delegating and Pool Funding.\n\n![select task](https://images.mirror-media.xyz/publication-images/VtVYYQzjY4W6pyWl7HdbP.png?height=604&width=1353)\n\n**Step 2:**\n\nWe first go for the “Pool Delegating Task”.\n\nGo to “Pools” and choose one of the network.\n\n![goto pools and select become a delegator](https://images.mirror-media.xyz/publication-images/7e6Mk0yOnZu1xaXN8Ee3_.png?height=500&width=1323)\n\nAt “Delegation”, choose a validator to delegate your $KYVE to. Input your amount to delegate and confirm.\n\n![click delegation and become a delegator](https://images.mirror-media.xyz/publication-images/hBOmV3pw4Wo7VanPGAKL2.png?height=483&width=1015)\n\n![](https://images.mirror-media.xyz/publication-images/kxmYccKO7pXuVvgnybgkd.png?height=514&width=611)\n\n**Step 2:**\n\nNow we move on to the “Pool Funding Task”.\n\nAt “Funders”, click “Become a funder”. Input an amount higher than minimum funding amount and confirm.\n\n![](https://images.mirror-media.xyz/publication-images/QEqFnF2j68sXNG-WEimuH.png?height=536&width=1285)\n\n![](https://images.mirror-media.xyz/publication-images/q0kdBopa7BAiy4APzZ9IO.png?height=503&width=640)\n\n**Step 3: (Optional)**\n\nCheck the governance section for proposals that you can vote on to finish the governance vote mission. (At the time of writing, there are no proposals to vote on.)\n\n**Step 4:**\n\nTo check your score and rank, go to “Korellia Profile\n\n![](https://images.mirror-media.xyz/publication-images/3-uKDqlQB7-Hnt_RIDjsB.png?height=467&width=1296)\n\nif you need more info you can contact kyve discord\n\n[https://discord.com/invite/UtDMtZ6j8N](https://discord.com/invite/UtDMtZ6j8N)\n\nyou may also reach me on telegram @princeoof for one on one chat", "timestamp": 1653239803, "digest": "-FViJIHJaKOF8AM4a8iPjQCtB8ymI1wUeRLOi_o0yDY", "contributor": "0x06040158f9DD01fB6CC71Ad99EC854C1a5A69ee9"}
{"id": "Bi-lraQ651yKKHG4ZI-d87xyaWLcZhfal5ocgCkQapg", "title": "ASX Genesis Event", "body": "## Not you usual TGE\n\nThere have been many debates about what the fairest token generation event mechanism would be, but a consensus has yet to be reached. With that in mind, we’ve decided to do things a little differently and base our launch on (possibly) the rarest commodity in this market: awareness. Welcome to our stealth launch.\n\n\n---\n\n*The ASX Genesis Event has arrived. Please read this article carefully to understand the novel mechanics of this event.*\n\n\n---\n\n## TL;DR\n\n*Values in US$ consider ETH priced at $1,925.*\n\n* **Token:** ASX (ERC-20) → Governance Token of the ASX Protocol\n* **Network:** Ethereum Mainnet\n* **Total / Max Supply:** 1,000,000,000 ASX\n* **Genesis Event Allocation:** 800,000,000 ASX\n* **Initial Liquidity Allocation:** 200,000,000 ASX\n* **Mint Rate:** 1 ASX / 0.000004 ETH or 250,000 ASX / 1 ETH\n* **Venue:** Self-hosted at <https://mint.asx.st/>\n* **Mode:** First-come, first-served basis (FCFS)\n* **Start date**: Live now\n* **End date**: 10 days after the soft cap is reached\n* **Soft Cap:** 1000 ETH | 250,000,000 ASX minted\n* **Hard Cap:** 3200 ETH | 800,000,000 ASX minted\n* **Fully Diluted Market Cap / Value (FDV)**\n  * **at Soft Cap:** 312,500,000 ASX \\~ $2,406,250 | 687,500,000 ASX burned\n  * **at Hard Cap:** 1,000,000,000 ASX \\~ $7,700,000 | 0 ASX burned\n* **Initial Liquidity (40% of FDV)**\n  * **at Soft Cap:** 62,500,000 ASX + 250 ETH | \\~ $962,500\n  * **at Hard Cap:** 200,000,000 ASX + 800 ETH | \\~ $3,080,000\n* There's no founders or team allocation, no seed or private sale, no liquidity mining, and no airdrop. The Genesis Event is the first and only place to get ASX tokens before listing.\n* Team and partners are allowed to participate after the progress bar reaches 50%.\n* Participants can claim their ASX tokens once the event is completed. There's no vesting. 100% of the max supply will be unlocked and circulating on day one.\n* Once the soft cap is reached (250,000,000 ASX minted), a countdown of 10 days will start. When it hits zero, the Genesis Event will end, the initial liquidity pool on Uniswap will be created and the remaining ASX will be burned along with the liquidity provider (LP) token.\n* ASX ERC-20 smart contract address: **0x5313235002b9F11698D7B9187Be44f836FEbD6b5**.\n\n\n---\n\n## A unique token launch\n\nAs a community-focused project committed to the ethos and founding principles of the blockchain space, we are pleased to announce the official launch of **ASX**, the governance token of the ASX Protocol.\n\nIn the spirit of equal distribution, fairness, decentralization, and a community-first ideology, the launch event is taking place on our [custom-made platform](https://mint.asx.st/) and it's the first and only opportunity for anyone to get access to the ASX Protocol's native token, **ASX**, which will give holders the power to govern and curate essential infrastructure components of the network.\n\nOur mission is to give everyone in our community an opportunity to become a stakeholder in the ecosystem, and we want to extend that opportunity as fairly as possible. Launching ASX on our own platform, with a mechanism that is fair and transparent for all participants, drastically increases the chances of achieving this mission.\n\nApart from building our own token launch platform, we made sure everyone was on a level playing field. There's no seed or private sale, no liquidity mining, no emission (zero inflation), zero tokens to influencers or promoters, no airdrop, and zero Treasury, Company, Founders, Team, or Partners allocation.\n\n### 1 billion ASX tokens. 800 million to be minted, 200 million for liquidity. That's it.\n\n> ***The protocol's revenue will exclusively serve ASX holders and all operations will be funded with ETH or stablecoins.***\n\nThe ASX Genesis Event is open to all interested and qualifying parties. It's a major milestone for the ASX Protocol ecosystem and speaks to the viability of our core technology and business model as we aim to become the ultimate permissionless omnichain liquidity hub for staked assets.\n\nAt ASX Labs, we believe in creating a global staking ecosystem of the people, by the people, for the people, that shall not perish under any threats. The crypto dream has never been about creating an instrument that can easily be put in a box, but about creating global assets that can govern and manage these new decentralized global networks.\n\n## Understanding the mechanics\n\nTo mint 1 ASX you need to contribute 0.000004 ETH. A total of 800,000,000 ASX will be available for minting. Due to the low fully diluted market cap of the project and to ensure as broad a distribution as possible and dramatically soften the potential for a massive gas war, we decided to operate in stealth mode until 50% of the tokens are minted.\n\nThere's a minimum of 1 ASX per mint and no maximum. Setting up a max cap per wallet without KYC is foolish and we're not big fans of KYC in DeFi. For us, privacy and freedom are paramount, and we respect and stand by yours. With that said, there's a cap of 100 ETH per mint on our Interface just to slow things down, if they get a bit crazy.\n\nIf you're lucky enough to hear about the ASX Protocol early, you'll have enough time to participate. Otherwise, you can get ASX tokens on Uniswap, after the Genesis Event is completed.\n\n## How to participate\n\nParticipating in the ASX Genesis Event is simple, quick, and intuitive, and getting prepared is even easier. Here’s what you’ll need:\n\n→ **An Ethereum-compatible web3 browser wallet**, such as MetaMask. You can generate a wallet address from these web3 wallets directly, or use your seeds to import an existing wallet address.\n\n→ **Sufficient ETH**, which you will need in order to contribute and pay for transactions gas fees.\n\nOnce you’ve got your checklist all set, here’s what the process will look like:\n\n1. To get started, head to our custom-made [Launch Platform](https://mint.asx.st/).\n2. You’ll be prompted with a welcome message. Click on \"**PARTICIPATION TERMS**\". Read everything and, if you agree, click on \"**I AGREE**\". Next, click on \"**CONTINUE**\".\n3. The next message will be a TL;DR of the ASX Genesis Event. Carefully read everything and click on \"**CONTINUE**\".\n4. You can now connect your wallet. We support almost any web3 injected wallet, but for a flawless experience, we recommend using MetaMask. Click on \"**CONNECT WALLET**\", either in the center or on the upper right-hand corner of the page.\n5. Once your wallet is connected, the ETH and ASX input fields will become available to you. You may either insert the amount of ASX you would like to receive or the amount of ETH you would like to contribute. Enter the desired amount and click on \"**MINT**\". Please make sure you have enough ETH in your wallet to pay for transaction fees.\n6. You will see a popup from your MetaMask wallet. Confirm the transaction and then wait for it to go through. Once it is validated on the Ethereum blockchain, your ASX balance, on the top of the page, will update and a \"CLAIM\" button will appear. You will be able to claim your ASX tokens once the event is completed.\n7. That's it! You successfully participated in the ASX Genesis Event.\n\n*Once your transaction is validated, a smart contract, that works like an escrow, will receive your ASX tokens and keep them safe until the end of the Genesis Event, when you will be able to claim them. Claimed ASX tokens are not locked and there is no vesting.*\n\n*Team and partners are allowed to participate in the Genesis Event after the progress bar reaches 50%. If the desired amount of ASX that those parties intend to hold can't be fully minted during this event, the remaining amount will be purchased on Uniswap.*\n\n## Liquidity\n\nBy the end of the Genesis Event, the initial liquidity of the ASX token will be immediately provided as a full range position on Uniswap V3. Since the resulting liquidity provider (LP) token will be directly burned, this initial position will be perpetual.\n\nThe liquidity depth will represent 40% of the FDV (Fully Diluted Value) and its absolute value will be based on the total ASX minted.\n\n* At soft cap, 250 ETH will be paired with 62,500,000 ASX, pricing the token at $0.0077 / ASX with $962,500 of liquidity depth.\n* At hard cap, 800 ETH will be paired with 200,000,000 ASX, pricing the token at $0.0077 / ASX with $3,080,000 of liquidity depth.\n\n*The Genesis Event will end in 10 days after the soft cap is reached or when all ASX tokens are minted, whichever comes first. Any unminted ASX will be burned.*\n\n## Security\n\nWe were very careful when deciding the code for the ASX ERC-20 smart contract and, to make it the safest possible, we only allowed the absolutely necessary lines of code. There's no mint function, no pause function and the contract is not upgradeable. It is an immutable token on the Ethereum Mainnet Network.\n\nBoth the ERC-20 and the Genesis Event smart contracts were developed with the highest levels of security, leveraging the battle-tested OpenZeppelin standard. With the entire supply circulating by the end of the Genesis Event plus the immediate burn of the liquidity provider (LP) token, you can rest assured that the ASX token can never be hacked or rugged.\n\n### Important Notes\n\nThe team at ASX Labs will NEVER DM YOU FIRST or ask you for money on any platform. You should be very skeptical of any DMs received by anyone claiming to be from ASX Labs.\n\nOnly trust ASX Protocol's official channels at the bottom of this announcement for information surrounding the event.\n\nThe ASX token will only be available once the Genesis Event is completed. Only then you will be able to trade it on Uniswap. Be sure to always check the smart contract address before trading.\n\n\n---\n\nThis is the first step towards an omnichain yield future. Welcome aboard.\n\n\n---\n\n* Participate in the [ASX Genesis Event →](https://mint.asx.st/)\n* Access our [Interface →](https://asx.st/)\n* Follow us on [Twitter →](https://twitter.com/asxlabs)\n* Join us on [Telegram →](https://t.me/asxprotocol)\n\n\n---\n\n## Legal Disclaimers\n\n*You understand that the ASX tokens have no intrinsic value and are solely tools of governance, and as such have no intrinsic potential for future appreciation in any form whatsoever. You further represent and warrant that you are an active user of blockchain technology and blockchain-based software systems and have the pre-requisite technical knowledge to understand what has been mentioned in this announcement and the risks that follow*.\n\n*The information provided within this announcement is for general informational purposes only pertaining to the governance tool. You understand that the ASX Protocol governance structure is an experiment in the field of decentralization and community governed structures, in which participation via the ASX token and otherwise is entirely at your own risk*.\n\n*Information contained in this announcement should not be relied upon at any time as advice to buy or sell or hold the aforementioned governance tokens and a particular note should be made to emphasize the solely governance-based nature of the ASX tokens and their lack of intrinsic ownership or economic value. This announcement does not take into account nor does it provide any tax, legal, or investment advice or opinion regarding the specific investment objectives or financial situation of any person.*\n\n*ASX Protocol and its associated parties, as appropriate, make no representation or warranties, expressed or implied, as to the accuracy of such information and ASX Protocol expressly disclaims any liability that may be based on such information or errors or omissions thereof. ASX Protocol reserves the right to amend or replace the information contained herein, in part or in its entirety, at any time, and undertakes no obligation to provide the recipient with access to the amended information or to notify the recipient thereof. The information contained in this announcement supersedes any prior representation, post, or conversation whether informal or formal, concerning the same, similar, or related information*.\n\n*This communication is not for distribution to U.S. newswire or similar services or any dissemination in the United States. This communication shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of, ASX tokens to any U.S. person (including, without limitation, any citizen or resident of the United States) or in the United States or in any jurisdiction in which such offer, solicitation, or sale would be unlawful before registration or qualification under the laws of any such jurisdiction*.\n\n*Any reference or mention of the ASX Genesis Event being open or accessible to the “public” should be understood to refer only to qualified individuals and entities under the applicable law.*\n\n*The ASX token is not an investment contract or security and should not be treated as such.*\n\n\n---\n\n## Restricted List of Countries\n\n*The ASX Genesis Event is not available to anyone located, incorporated or otherwise established in, or a citizen or resident of the United States of America, Afghanistan, Albania, American Samoa, Angola, Antigua and Barbuda, Aruba, Bangladesh, Barbados, Belarus, Benin, Bermuda, Bhutan, Bolivia, Bosnia and Herzegovina, Botswana, Brunei Darussalam, Burkina Faso, Burundi, Cabo Verde, Cambodia, Cameroon, Canada, Cayman Islands, Central African Republic, Chad, China, Comoros, Congo, Côte D'ivoire, Crimea and Sevastopol, Cuba, Democratic People's Republic of Korea, Democratic Republic of the Congo, Djibouti, Dominica, Ecuador, Egypt, El Salvador, Equatorial Guinea, Eritrea, Eswatini, Ethiopia, Fiji, Gabon, Gambia, Ghana, Guam, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, Hong Kong, Iran, Iraq, Jamaica, Jordan, Kenya, Kyrgyzstan, Lao People's Democratic Republic, Lebanon, Lesotho, Liberia, Libya, Macao, Madagascar, Malawi, Maldives, Mali, Malta, Mauritania, Mauritius, Micronesia, Moldova, Mongolia, Montenegro, Morocco, Mozambique, Myanmar, Nauru, Nepal, New Caledonia, Nicaragua, Niger, Nigeria, Niue, Northern Mariana Islands, Oman, Pakistan, Palau, Palestine, Panama, Papua New Guinea, Puerto Rico, Russian Federation, Rwanda, Samoa, Sao Tome and Principe, Senegal, Serbia, Seychelles, Sierra Leone, Somalia, South Georgia, South Sudan, Sri Lanka, Sudan, Suriname, Syrian Arab Republic, Tajikistan, Tanzania, Thailand, Timor-Leste, Togo, Tonga, Trinidad and Tobago, Tunisia, Turkey, Turkmenistan, Uganda, Ukraine, United Kingdom, United States Minor Outlying Islands, US Virgin Islands, Uzbekistan, Vanuatu, Venezuela, Western Sahara, Yemen, Zambia, Zimbabwe, or any state, country, or jurisdiction where it would be illegal, according to applicable law, to participate in this event*.", "timestamp": 1653239864, "digest": "SPP24Za2i393DM3Tx2hJqKXW0GYafuXHOu-pvMLcjNg", "contributor": "0x1be3C6a0a7617CE21Ca1765917629629787b48aD"}
{"id": "D-IoBJO5DEL7okXc9-nI9fBoB8maIiqCiLlw2-AYEyI", "title": "My Dream for the Planet School", "body": "Last week, I stepped off the *SSV* (Sailing School Vessel) *Corwith Cramer* after spending six weeks at sea as the 3rd Mate for “Marine Biodiversity & Conservation,” a college semester-at-sea program run by the Sea Education Association (SEA)*.* Coming aboard in Key West, Florida seven weeks ago marked 14 years since I had stepped onto *Cramer* as a student myself. I had never been sailing before and I had no idea how profoundly that voyage would impact me. They say that the sea is a great teacher and I agree, but the community we intentionally create at sea deserves description too.\n\nAn isolated ship at sea is, in many ways, an ideal medium for creating deeply impactful learning opportunities. For this inaugural Planet School blog post, I want to share why I love to teach at sea and how the core elements of an ocean-based curriculum do not actually need to be unique to the sea at all. To do that, I need to give a bit of background on what it means to go sailing for a semester on a tall ship.\n\n![Removing the crutch of GPS and navigating with the stars is yet another opportunity for authentic student agency.](https://images.mirror-media.xyz/publication-images/2czv-EUWimA9Q8y4l-iNF.jpeg?height=450&width=600)\n\nMake no mistake: sailing is hard work. I suspect that many students, like me when I was 20 years old, perceive a semester aboard a sailboat as one of relaxing exoticism bordering on luxuriousness: perfect sunsets, dolphins chasing the bow, strumming a guitar, reading *Treasure Island* or *Moby Dick* and coming home with a perfect tan and a year’s worth of Instagram posts—no filter, obviously. After all, yachts are a pastime of the wealthy and the Caribbean is a vacation destination. While there are innumerable moments of grandeur to be had at sea and all of the things I listed above usually happen multiple times on every voyage, they belie the full story. Any notion of #YachtLife is a delusion that gets shaken almost instantly.\n\nStudents step onto the ship and they step into a new world. First, the language is completely different—both the immense vocabulary of nautical terminology as well as the style of repeating commands. When you are given a task, you repeat the command back to the person who just gave it to you, then you go do the task, then once the task is done you return to the person who gave you the task and tell them it is complete, which they then repeat back to you. This creates a closed loop—there is little chance for miscommunication—but that much repetition does not come naturally. So not only do students have multiple subject areas to master—navigation, seamanship, meteorology, watch standing duties, laboratory procedures—but their way of communicating is being frequently corrected. They are studying new subjects in a new language in a place that is constantly moving (making many of them seasick) and with a watch-standing schedule that means their sleep is inconsistent. On all fronts, my semester with SEA in college was, hands down, my most challenging term and Brown University was not exactly a cake walk.\n\n![](https://images.mirror-media.xyz/publication-images/wYOcovwOe7n5jeVg9IkIg.jpeg?height=3456&width=4608)\n\n## A Three Phase Approach\n\nEvery voyage program I have sailed on—SEA vessels and Proctor Academy’s Ocean Classroom semester—breaks their trip into three phases: The Spaghetti Phase, The Shadow Phase, and the Junior Watch Officer (JWO) Phase. The Spaghetti Phase is so named because, for the students, it feels like information is being thrown at them like spaghetti: some of it sticks and some (most) just falls to the deck. It could also be called the Firehose Phase because it can feel like drinking from a firehose. Whatever the metaphor, the first phase is characterized by feeling overwhelmed, adjusting to the boat, and being corrected frequently. It can be discouraging, so building unity within a student’s watch is important as is creating frequent moments for light hearted community building. The goal is for students to learn *what* to do and to see this behavior role-modeled by the staff.\n\nThe second phase (usually following two weeks of spaghetti) is when students start to shift to learning *why* things are done. During each watch, a student is selected to be the shadow and follow the mate through their duties. The mate narrates what they are doing as they do it, the student accompanies the mate when they check in with the captain, and the student starts to take the lead in various routines, like making sure the hourly boat checks and weather observations are completed. This is the chance to start peeking behind the curtain and feel invited to partake in the boat’s management.\n\nFinally, the JWO Phase. In many ways, the entire trip builds to the JWO Phase. During this phase, a student is elevated to the position of Junior Watch Officer during their watch and takes over for the mate. Students interact directly with the captain to respond to weather changes, recommend sail evolutions, and delegate tasks within their watch.  The JWO can even delegate tasks to the mate, so long as the task does not take the mate away from the quarterdeck for more than 10 minutes. While the mate is still the safety officer and legally responsible for the watch, they step back as much as possible. Mates are told to let mistakes happen and only yell “Hold!” if a student is about to injure someone or damage the boat. No reason is given for yelling “Hold!”, so action does not resume until the JWO or one of their watchmates discovers the problem and corrects it.\n\n![A JWO, wearing the \"JWO Hat,\" plotting the ship's position.](https://images.mirror-media.xyz/publication-images/pw2OQCJQxLevILLX_gG1F.jpeg?height=3024&width=4032)\n\n## A Recipe for Great Learning\n\nThis three phase progression is where the magic happens. All three phases are essential; neither is successful without the other two. Most conventional classrooms never make it past the Spaghetti Phase. Conversely, if we were to skip the Spaghetti Phase, the students would not feel prepared for the greater responsibility asked of them. This progression works because of the learning environment that is very intentionally created by the staff, both in the program’s core design and through staff meetings that happen underway. That environment consists of a few essential ingredients:\n\n1. **Authenticity**. If students feel that their input and time is valued as part of an experience that is not “busy work,” they will invest in it. Since the boat is a real boat sailing on the ocean, everything connected to that objective being completed successfully is very clearly not busy work. There are very real consequences to not doing a job completely or correctly. This element drives home the value of “Seek Excellence.”\n2. **Relevance**. A student could be assigned the authentic task of digging a big hole or meticulously cleaning the interior components of an antique pocket watch but will probably lose interest if the question “why” is not answered. This can sometimes happen with boat checks, which happen every hour on a boat and begin to take on an element of blind routine if their value is not reinforced. When it comes to establishing relevance, the connection can be specific to the student, broad to society, temporal to the moment at hand, or tied to the legacy of the human race 10,000 years from now, but there must be an answer.\n3. **Ownership**. Of all the characteristics here, this is the one we see the most frequently in existing classrooms. High school students are given charge of completing their assignments, showing up to class on time, and discharging a multitude of duties. What I advocate for here is that we create more pathways for the sphere of ownership to keep expanding. We should reward great performance with greater ownership.\n4. **Agency**. This is different from ownership, perhaps even a step up from ownership. Agency combines ownership, relevance, and authenticity to create a moments where the student makes choices that have consequences. As a mate, when I delegate setting a sail to a student, I have given them ownership of that task. Often, the ownership of something means following a script for how that job needs to be done: there is a right way to set a sail and a myriad of wrong ways. Agency means writing the script.\n5. **Ability to Fail**. It is possible to create a learning environment where all of the above are present and yet the lesson still falls short on this final element. A JWO will feel authenticity, relevance, ownership, and agency by the nature of being JWO, but if the mate steps in to answer a tough question or offers an overly revealing hint, the ability to fail dissolves. In some ways, ability to fail creates a deeper layer of fusion between authenticity and the relevance of the experience that generate moments of genuine discomfort for students.\n\n   As a mate, a critical element in creating a successful JWO Phase is to step back and let the student make mistakes, or forget things, or become overwhelmed. This can be hard because I want my students to succeed, but I have come to appreciate that there needs to be a “butterfly emerging from the chrysalis” moment if the value of everything that happened up to that point is going to matter. A student can watch and study something a million times, but then it is their turn to step up and do it. Near the end of the novel *The Alchemist*, the alchemist describes this concept to the protagonist:\n\n> “What you still need to know is this: before a dream is realized, the Soul of the World tests everything that was learned along the way. It does this not because it is evil, but so that we can, in addition to realizing our dreams, master the lessons we’ve learned as we’ve moved toward that dream. That’s the point at which, as we say in the language of the desert, one ‘dies of thirst just when the palm trees have appeared on the horizon.’\n>\n> Every search begins with beginner’s luck. And every search ends with the victor’s being severely tested.”\n\n![](https://images.mirror-media.xyz/publication-images/XFo5fuOKYfz2DwkCXIQz_.jpg?height=447&width=450)\n\nTo be clear, I am not talking about fear of failing as a person. Our classrooms already have this trait to a damaging degree with our modern grading system and the pressure of college admissions. I have frequently seen tears on JWO and while sometimes that is just how a person processes stress, there needs to be a calibration of duties with what a student is ready for, which varies by person. When I debrief with my JWO after the watch is over, a pointer I frequently remind them of is to not be too hard on themself when they fail: accept that you will make a mistake, take a moment to reflect on it, and then give yourself the grace to move past it and you can unpack the lesson later. As a leader, you must move past it or you will be distracted from your job in that moment. I also believe that a student needs, ideally, a minimum of three shifts as JWO to enable them to witness their own progress and internalize lessons. Most often, a student’s first JWO stint is not pretty and having that be their one shot would be unfortunate.\n\n## Beyond Sailing\n\nSailing for weeks at a time is an amazing adventure that makes creating many of these conditions easier, but in some ways it is not ideal. The sleep schedule, seasickness, and risk of burnout for staff and students are the most obvious downsides. Sailing is also an expensive and exclusive opportunity. And do we really need a boat in order to do any of this?\n\nAbsolutely not.\n\n![Planet School terms will begin with 4-5 weeks sailing and then transfer to a land campus, bringing along the ethos developed underway.](https://images.mirror-media.xyz/publication-images/yh6OSBRAKEr2wfgdma3uE.jpeg?height=3024&width=4032)\n\nMy goal with the Planet School is to take this process that I have seen be so effective on sailboats and replicate it in other realms. A three phase progression carried out between a knowledgeable practitioner and a group of students can be done in almost any field: the leader of a “watch” need not be a professional mariner. The expert could be a farmer, an engineer, an economist, or an artist. The task need not be sailing, it could be starting a business, managing a farm, or building a yurt. It could even be building a school.\n\nThe underlying project of the Planet School is to build the school itself. Since a campus is a community, such an undertaking could reasonably include a project in almost any discipline, giving students the chance to explore their passions and be exposed to potential passions they have not experienced before. Some of my most potent memories from high school are from the activities that included role-playing of “real life”: speech and debate, theatre, Model UN, Youth Legislature, and the school newspaper. Through the prevalence of internships, externships, and youth employment as well as the cliche of how teenagers yearn to leave home, the desire for real world experience at that age is evident. We should build our schools to be authentic laboratories for trying out real world solutions. If we are to be better stewards of our planet, then we need to do more than encourage experimentation, bold thinking, and sustainability—we need to create education spaces where we actively train youth in those habits.\n\nI never imagined myself as a teacher. I never imagined myself working in education. Yet I have learned that any systemic reimagining of human civilization must begin with how we equip our future generations. My vision for school is that, whatever the project, students are challenged in an authentic, relevant way where they have agency, feel ownership, and are trusted to be able to fail.", "timestamp": 1653240036, "digest": "SiaaK_sDxGc1-zoy7KhbTktMsmr-WZmS8dSheqQM8Yc", "contributor": "0x505683cF3aDdF5DE8E82AABB9d24763B9A72aAD0"}
{"id": "EmQRGkybTfD-Vjr-i4HBzK844yPiuwJhR5HokNX_OnU", "title": "一文撸完A16z所有投资项目", "body": "May 23th, 2022\n\n**牛市炒币，熊市空投**。这是我从建号时候就提出来的，能够认真执行的人，最近应该不会亏什么钱吧。\n\n过去一周发生了很多事情，熊市已经被Luna正式开启了。别看现在群里还有些欢声笑语，那是现在还没跌够，每次到熊市深处，很多人会真心地怀疑区块链是不是骗局，BTC还能不能起来，在各种市场经历过多次牛熊的我对这个节奏实在太熟悉了。 \n **目前来看，在熊市中里唯一能够不亏钱的方法就是一边做空投一边做一级市场的研究（注意不是投研），耐心等待下一次牛市。**\n\n这次给大家带来的是著名投资机构A16z投资中，那些还未发币，有机会撸空投的项目。A16z投资的AR、SOL、DYDX、FLOW、NEAR、Uniswap都上轮牛市中爆发过了，其投资眼光是想当好的，**所以在熊市中选择背靠大机构投资、更有可能发币的项目撸空投肯定是个不坏的选择。**\n\n其实A16z投资的项目中，能撸的空投不多，有的还需要具备一些专业知识。但是这里十分建议大家从现在开始慢慢学习。**在漫长的熊市中这样的项目还会有很多，一边撸到空投的同时，还能掌握一些区块链世界真正硬核的知识，不管是以后炒币还是吹牛逼都是有用的。**\n\n除了寻找空投项目外，我还顺带把其他不会发币但是值得了解的项目也在本文中做了介绍。虽然不是我们的主业，**但是多了解了解这个市场，多见见世面，长长见识，也能提高眼光，慢慢学会鉴别项目的好坏。**\n\n最后再做一个说明，除非有大量的需求，我一般很少会做那种手把手的教程。一来是我时间不够，写长文的同时也是对自己知识储备的一个扩充和加固；二来我更倾向于多讲讲撸空投的逻辑和方法，以及尽量按照官方的指引去完成操作，提升自己的能力，这样才能在不变中应对万变。\n\n## 一、空投项目\n\n### zkSync\n\n状态：未发币，公开测试\n\n最近大火的zkSync就是由A16z投资的，之前已经详细介绍过了。\n\n顺便一说，同样采用zkrollup技术的stark则是主要由红衫投资。\n\n[史上最长万字长文带你详细了解L2网络和空投方法（ZK-rollup篇）](https://mirror.xyz/yourairdrop.eth/kxkmRkwe_MdCEA9OBb5C3W1Te368Nq8ric8tGNELkU8)\n\n[由于L2的知识繁杂又零碎，所以这篇文章准备将L2剩下的几个网络都做一个汇总，一块来说一下空投的策略。](https://mirror.xyz/yourairdrop.eth/kxkmRkwe_MdCEA9OBb5C3W1Te368Nq8ric8tGNELkU8)\n\n[mirror.xyz](https://mirror.xyz/yourairdrop.eth/kxkmRkwe_MdCEA9OBb5C3W1Te368Nq8ric8tGNELkU8)\n\n### Apotos\n\n状态：未发币，节点测试中\n\n简述：这个有别于普通测试网，需要运行验证节点，建议网上组一个云服务器，比家用电脑更稳定。腾讯云比较便宜、适合新手使用，可以提供基本的功能。 \n 最好配置4核8G内存以上，Ubuntu 20.04系统，可以满足大部分节点测试的需要。\n\n按照这个配置\n\n配置以后按照以下说明部署网络即可\n\n[Introduction | Aptos Labs](https://aptos.dev/tutorials/validator-node/intro)\n\n[This tutorial describes how to run Aptos nodes for the Aptos Incentivized Testnet 1 (AIT1) program. It explains the following:](https://aptos.dev/tutorials/validator-node/intro)\n\n[aptos.dev](https://aptos.dev/tutorials/validator-node/intro)\n\n### Iron Fish\n\n状态：未发币，节点测试中\n\n简述：同上个项目，目前正在节点测试，需要配置服务器参加测试，这种节点测试是肯定会给空投的，而且A16z投资的项目，应该不会小气。\n\n除了节点测试，还有一些其他的任务可以完成，十分推荐。按照下面链接参加即可，谷歌浏览器自带翻译的哦。\n\n[about](https://testnet.ironfish.network/about)\n\n[testnet.ironfish.network](https://testnet.ironfish.network/about)\n\n### Eco\n\n状态：未发币，已上线\n\n简述：一个类似于余额宝的钱包，年收益2.5%（推荐用户后为5%），存款可获得积分，积分以后可能兑换成空投。\n\n[Eco — It’s time for smart money](https://www.eco.com/)\n\n[Eco is one simple balance that lets you spend, send, save and make money at the same time.](https://www.eco.com/)\n\n[www.eco.com](https://www.eco.com/)\n\n### Syndicate\n\n状态：未发币，已上线\n\n简述：Syndicate 允许用户自由创建投资dao，目前还没发币。 \n 比较可能的空投的方式是投资或者自己创建一个dao，可以自己建立一个，然后用几个小号打钱过来“投资”，目前还没研究好怎么“跑路”，大概0.03左右eth就能创建一个dao了。 \n 想撸这个空投的话，一定要加入他的discord获得进一步的资讯。\n\n[Syndicate](https://syndicate.io/)\n\n[A decentralized investing protocol and social network that’s transforming how the world creates value.](https://syndicate.io/)\n\n[syndicate.io](https://syndicate.io/)\n\n此外，syndicate还有一个内测的NFT项目，填表就有机会参加。\n\n[Syndicate Membership NFT Interest Form](http://docs.google.com/forms/d/e/1FAIpQLSf0Ss7TQH5LNWE5DganDox3M5iFXiXsPdzKe9pcIcDKXrQniA/viewform)\n\n[Thank you for your interest in Syndicate membership NFTs! We are currently heads down building our product and running pilots with a handful of groups. We anticipate launching publicly in the next few months. If you are interested in being a part of our pre-release pilot, please fill out the form.…](http://docs.google.com/forms/d/e/1FAIpQLSf0Ss7TQH5LNWE5DganDox3M5iFXiXsPdzKe9pcIcDKXrQniA/viewform)\n\n[docs.google.com](http://docs.google.com/forms/d/e/1FAIpQLSf0Ss7TQH5LNWE5DganDox3M5iFXiXsPdzKe9pcIcDKXrQniA/viewform)\n\n### Forta\n\n状态：未发币，已上线\n\n简述：主要面向商用的安全监测平台，目前来看不会发币。\n\n[Forta Network](https://forta.org/)\n\n[Forta Network](https://forta.org/)\n\n[forta.org](https://forta.org/)\n\n### Spruce\n\n状态：明确不发币，已上线\n\n简述：目前开发了SpruceID 和 Kepler两个产品，面向商用 \n 项目方口口声声说不发币并不可靠，可关注该项目发展。\n\n[Spruce - Decentralized Identity and Storage](https://spruceid.com/spruceid)\n\n[Empowering developers, SpruceID and Kepler let your users collect their data in one place that they control, and show their cards however they want.](https://spruceid.com/spruceid)\n\n[spruceid.com](https://spruceid.com/spruceid)\n\n### World Coin\n\n状态：未发币，未上线\n\n简述：有一个很中二的名字，号称要基于Proof-of-Personhood，给全世界的人发币，不知道要怎么实现，关注着吧\n\n[Worldcoin](https://worldcoin.org/)\n\n[Worldcoin is a digital currency that launches by giving away a piece to every person in the world](https://worldcoin.org/)\n\n[worldcoin.org](https://worldcoin.org/)\n\n### Kosen\n\n状态：未发币，未上线\n\n简述：这是一个为链上做市商提供ai方案的的项目，目前还没项目实体，明确会发币，但方式不明确，可关注\n\n[Kosen Labs](https://www.kosen.ai/)\n\n[AI for the decentralised world.](https://www.kosen.ai/)\n\n[www.kosen.ai](https://www.kosen.ai/)\n\n### MEM\n\n状态：未发币，内测中\n\n简述：这是一个社交协议，目前还没对外公布具体信息，可持续关注\n\n[Mem](https://mem.co/)\n\n[Sign in as you](https://mem.co/)\n\n[mem.co](https://mem.co/)\n\n### Nova labs\n\n状态：未发币，未公布内容\n\n简述：计划今年上线，可持续关注\n\n[Nova Labs (@novalabs_) / Twitter](https://twitter.com/novalabs_)\n\n[Freedom to Connect. Built on the @Helium Network. Coming 2022.](https://twitter.com/novalabs_)\n\n[twitter.com](https://twitter.com/novalabs_)\n\n### EveryRealm\n\n状态：未发币，未开放测试\n\n简述：数字房地产投资公司Republic Realm 已经筹集了6000 万美元的A 轮融资，并宣布更名。\n\n[Leaders in metaverse innovation and development | Everyrealm](https://everyrealm.com/)\n\n[Everyrealm is one of the most active players in the metaverse ecosystem. We invest in, manage, and develop assets including NFTs, metaverse platforms, and more.](https://everyrealm.com/)\n\n[everyrealm.com](https://everyrealm.com/)\n\n## 二、A16z投资的其他项目\n\n仔细研究A16z，你会发现，其投资的项目中NFT相关的项目几乎占了大头，其次是游戏类，虽然不一定能得出结论，但是我们可以有一个推断——或许下一轮牛市游戏和NFT还会继续起飞，当然这需要在漫长的熊市中进一步论证，都是后话了。\n\n### 游戏类\n\n[Home - Core Loop](http://coreloop.ai/)\n\n[Core Loop Games, Inc. Building the next generation MMOs](http://coreloop.ai/)\n\n[coreloop.ai](http://coreloop.ai/)\n\n元宇宙MMO+沙盒游戏\n\n[Mythical Games - Games](http://mythicalgames.com/games)\n\n[We are Mythical Games, a Venture-backed next-generation game technology company at the intersection of video games and economics led by industry veterans.](http://mythicalgames.com/games)\n\n[mythicalgames.com](http://mythicalgames.com/games)\n\n一个游戏工作室，目前开发了游戏[blankos.com](http://blankos.com/)\n\n[Sky Mavis](http://www.skymavis.com/)\n\n[Blockchain: Gamified - We build games with player owned economies – true digital nations.](http://www.skymavis.com/)\n\n[www.skymavis.com](http://www.skymavis.com/)\n\n游戏众多，AXS就是这个项目方开发的\n\n[Battlebound - Building Games Players Love](http://battlebound.io/)\n\n[Our games are built for players to share the value generated by playing video games they love. Where world-class gameplay meets web3.](http://battlebound.io/)\n\n[battlebound.io](http://battlebound.io/)\n\n需完成白名单购买NFT才能参与\n\n### NFT类\n\n[BreederDAO | $BREEDing life into the Metaverse, one game at a time.](https://www.breederdao.io/)\n\n[BreederDAO is the NFT asset factory of blockchain games. We provide high-volume asset production, tailored to specification, for some of the largest guilds in the Metaverse so they can supercharge their play-to-earn economies.](https://www.breederdao.io/)\n\n[www.breederdao.io](https://www.breederdao.io/)\n\n为各项目订制NFT，已发币\n\n[Bitski](http://www.bitski.com/)\n\n[Create, sell, and own NFTs with Bitski](http://www.bitski.com/)\n\n[www.bitski.com](http://www.bitski.com/)\n\nNFT钱包，可以去商店里下载一个自行体验，多参与交易或许有空投，DYOR。\n\n[Home - Forte](http://www.forte.io/)\n\n[www.forte.io](http://www.forte.io/)\n\n提供定制化的NFT工具，主要面向商用，不太可能发币\n\n[Foundation](https://foundation.app/)\n\n[Foundation is a creative playground for artists, curators and collectors to experience the new creative economy.](https://foundation.app/)\n\n[foundation.app](https://foundation.app/)\n\n为NFT创作者提供开发平台和交易市场，也许参与mint和交易会获得空投，DYOR。\n\n[Leaders in metaverse innovation and development | Everyrealm](http://everyrealm.com/)\n\n[Everyrealm is one of the most active players in the metaverse ecosystem. We invest in, manage, and develop assets including NFTs, metaverse platforms, and more.](http://everyrealm.com/)\n\n[everyrealm.com](http://everyrealm.com/)\n\n元宇宙虚拟土地NFT，购买NFT或许有空投，DYOR。\n\n[FingerprintsDAO](https://fingerprintsdao.xyz/)\n\n[NFTs that can be fully recreated from their fingerprints on the blockchain are cultural artefacts that can live as long as the internet exists. The innovation of NFTs is not in linking to an artwork stored elsewhere, but in the token being the artwork itself.](https://fingerprintsdao.xyz/)\n\n[fingerprintsdao.xyz](https://fingerprintsdao.xyz/)\n\n这是一个收藏家组织，已发币但方案似乎还在讨论中，早期参与者和质押相关NFT和代币的人有可能获得空投，DYOR。\n\n[Pleasr](http://pleasr.org/)\n\n[×](http://pleasr.org/)\n\n[pleasr.org](http://pleasr.org/)\n\nPeasrDao也是一个众筹NFT的组织，未发币。参与该组织应该会有空投，DYOR。\n\n[Crypto for Creative Communities](http://rally.io/)\n\n[Rally enables creators to launch independent micro economies for their fan communities via ethereum-powered creator coins.](http://rally.io/)\n\n[rally.io](http://rally.io/)\n\nrally是一个创作者平台，允许创作者、名人、社区和品牌发布他们的公共代币和NFT，已发币。\n\n[VHS | Virtually Human](http://www.vhslab.com/)\n\n[Builders of ZED RUN](http://www.vhslab.com/)\n\n[www.vhslab.com](http://www.vhslab.com/)\n\nNFT开发商，著名的zed run就是他开发的。\n\n[Autograph: The new era of collecting](http://autograph.io/)\n\n[Autograph is an NFT platform that brings together the most iconic brands and legendary names in sports, entertainment and culture to create unique digital collections and experiences.](http://autograph.io/)\n\n[autograph.io](http://autograph.io/)\n\n一个体育类的NFT。\n\n### 音乐NFT\n\n[Sound.xyz](https://sound.xyz/)\n\n[Own A Song, Join A Community](https://sound.xyz/)\n\n[Sound.xyz](https://sound.xyz/)\n\n[Royal - Own your favorite music. | Royal](http://royal.io/)\n\n[Own music and earn royalties alongside artists, on Royal](http://royal.io/)\n\n[royal.io](http://royal.io/)\n\n### 社交类\n\n[Deso | The Decentralized Social Blockchain](http://www.deso.org/)\n\n[www.deso.org](http://www.deso.org/)\n\n可快速订制代币的一个粉丝经济平台，已发币。\n\n### 其他\n\n[Fei Protocol](https://app.fei.money/)\n\n[The Stablecoin for DeFi](https://app.fei.money/)\n\n[app.fei.money](https://app.fei.money/)\n\n稳定币工具，farm的收益还算不错吧\n\n[Home](http://www.trusttoken.com/)\n\n[Last Modified: November 20, 2020](http://www.trusttoken.com/)\n\n[www.trusttoken.com](http://www.trusttoken.com/)\n\nTrustUSD算法稳定币的制造商，没什么可以撸的\n\n[Goldfinch](https://goldfinch.finance/)\n\n[goldfinch.finance](https://goldfinch.finance/)\n\n借贷工具，已发币\n\n[Dapper Labs - Fun and games on the blockchain](http://www.dapperlabs.com/)\n\n[Dapper Labs uses the power of play to deliver blockchain-based experiences that are made for you and ready for the real world.](http://www.dapperlabs.com/)\n\n[www.dapperlabs.com](http://www.dapperlabs.com/)\n\n区块链开发商，Flow和CryptoKitties就是他的作品，值得关注的公司\n\n公司创始人，伊朗出生的温哥华居民，Roham Gharegozlou\n\n### 开发平台/基础设施\n\n这些都是开发者使用的工具，知道有这个项目就行了，不会给用户空投的\n\n[Alchemy - Blockchain APIs and Node Infrastructure](http://www.alchemy.com/)\n\n[Whether you’re a beginner developer, startup, web3 market leader, or a large enterprise, Alchemy makes multichain web3 development easy with reliable and scalable node infrastructure, enhanced APIs, and developer tools. Get started for free!](http://www.alchemy.com/)\n\n[www.alchemy.com](http://www.alchemy.com/)\n\n开发者工具\n\n[CoinSwitch Kuber: Buy Bitcoin and Cryptocurrency at India’s Leading Crypto Exchange](http://coinswitch.co/)\n\n[Made in India, for Indians - CoinSwitch is India’s simplest and most trusted Crypto app. Buy, sell, and trade in Bitcoin and altcoins at the tap of a button](http://coinswitch.co/)\n\n[coinswitch.co](http://coinswitch.co/)\n\n手机上的交易app\n\n[Please Wait... | Cloudflare](http://www.aleo.org/)\n\n[Completing the CAPTCHA proves you are a human and gives you temporary access to the web property.](http://www.aleo.org/)\n\n[www.aleo.org](http://www.aleo.org/)\n\n开发者工具\n\n[OnChain Studios](https://www.onchainstudios.com/)\n\n[www.onchainstudios.com](https://www.onchainstudios.com/)\n\n状态：NFT游戏开发工具，目前开发的项目有cryptoys.com\n\n[Home](http://www.improbable.io/)\n\n[Improbable delivers technology, expertise, creativity and services to help you unleash the full potential of virtual worlds and the metaverse](http://www.improbable.io/)\n\n[www.improbable.io](http://www.improbable.io/)\n\n元宇宙开发工具，1.6亿美元融资，应该不会发币\n\n[Protocol Labs](http://protocol.ai/)\n\n[Protocol Labs is building the next generation of the internet.](http://protocol.ai/)\n\n[protocol.ai](http://protocol.ai/)\n\n2014年就成立协议开发实验室，著名的IPFS就是他们开发的\n\n[Talos - Home](http://talos.com/)\n\n[Home-Talos delivers infrastructure for institutional asset trading to the most sophisticated investors, primes, exchanges & custodians.](http://talos.com/)\n\n[talos.com](http://talos.com/)\n\nDex开发工具\n\n[Valora | A mobile payments app that works worldwide](http://valoraapp.com/)\n\n[The crypto wallet with 25% rewards to buy, send, spend, grow, and collect NFTs on the Celo blockchain.](http://valoraapp.com/)\n\n[valoraapp.com](http://valoraapp.com/)\n\n一个手机上的交易app\n\n## 三、结语\n\n到此为止，A16z所有的项目就介绍完了。最后我提醒一下大家，虽然我一直强调在空投的时候做好项目研究，但千万不要相信项目方的花言巧语入戏太深，随时都想all in。\n\n实际上，目前的币圈并没有任何一个项目是真正产出了任何价值的，即没有一个项目可以不依靠外部投入，像一个工厂一样生产出一件有价值的商品。他既没有提升生产力，也没有改变生产关系，所有人心心念念的去中心化也不见得就实现了，基本上就是一个零和博弈的市场。\n\n随时从一个理性投资人的角度看待这个市场，虽然不一定让你像网上看到的极少数人那样搞搞合约就立刻赚到大钱，但至少可以在很多时候抛弃fomo的情绪，慢慢积累资金，厚积薄发。不断量变的时候在某一个临界点迎来质变，才是让大多数普通人获得成功的正确路径。\n\n[ARWEAVE TX→](https://viewblock.io/arweave/tx/aBG-XueIEsN91bfLifqukCH9dWajLMJq9AvazRAUCVE)\n\n[aBG-XueIEsN91bfLifqukCH9dWajLMJq9AvazRAUCVE](https://viewblock.io/arweave/tx/aBG-XueIEsN91bfLifqukCH9dWajLMJq9AvazRAUCVE)\n\n[ETHEREUM ADDRESS→](https://etherscan.io/address/0x1320d47e264FeA17fC428A95f8A8f94531E7F75f)\n\n[0x1320d47e264FeA17fC428A95f8A8f94531E7F75f](https://etherscan.io/address/0x1320d47e264FeA17fC428A95f8A8f94531E7F75f)\n\nCONTENT DIGEST\n\nw1os2B3WTz-8KUcoCoRQSd65p1q8iadZCVnYtEyxiqA", "timestamp": 1653239898, "digest": "Iun-DO6SI7AyPospFiODVCDsE6WPSy9oX3Ov96bfMik", "contributor": "0x6C40E5BBf4949bdbFDd48e01988CAFb490023cD2"}
{"id": "_ktngwZJ72RXGj0I_4cUM294Ldr98gZkzACwhLcru1c", "title": "常见缩写", "body": "eta（Estimated Time of Arrival） 预计到达时间\n\nimho（In My Humble Opinion）恕我直言\n\ndm（Direct Message） 私信", "timestamp": 1653240217, "digest": "zekP1XQqQpJWS_csjonTt-38GS7aT_-UBroadxDYcx0", "contributor": "0x8e45a27bf4Da9dA4B8B941B69E27107a025D7FC9"}
{"id": "l5UF_vuCanTR12l4OciB1z_OMSvMAAg9N3f18-Up1N4", "title": "ASX Genesis Event", "body": "## Not you usual TGE\n\nThere have been many debates about what the fairest token generation event mechanism would be, but a consensus has yet to be reached. With that in mind, we’ve decided to do things a little differently and base our launch on (possibly) the rarest commodity in this market: awareness. Welcome to our stealth launch.\n\n\n---\n\n*The ASX Genesis Event has arrived. Please read this article carefully to understand the novel mechanics of this event.*\n\n\n---\n\n## TL;DR\n\n*Values in US$ consider ETH priced at $1,925.*\n\n* **Token:** ASX (ERC-20) → Governance Token of the ASX Protocol\n* **Network:** Ethereum Mainnet\n* **Total / Max Supply:** 1,000,000,000 ASX\n* **Genesis Event Allocation:** 800,000,000 ASX\n* **Initial Liquidity Allocation:** 200,000,000 ASX\n* **Mint Rate:** 1 ASX / 0.000004 ETH or 250,000 ASX / 1 ETH\n* **Venue:** Self-hosted at <https://mint.asx.st/>\n* **Mode:** First-come, first-served basis (FCFS)\n* **Start date**: Live now\n* **End date**: 10 days after the soft cap is reached\n* **Soft Cap:** 1000 ETH | 250,000,000 ASX minted\n* **Hard Cap:** 3200 ETH | 800,000,000 ASX minted\n* **Fully Diluted Market Cap / Value (FDV)**\n  * **at Soft Cap:** 312,500,000 ASX \\~ $2,406,250 | 687,500,000 ASX burned\n  * **at Hard Cap:** 1,000,000,000 ASX \\~ $7,700,000 | 0 ASX burned\n* **Initial Liquidity (40% of FDV)**\n  * **at Soft Cap:** 62,500,000 ASX + 250 ETH | \\~ $962,500\n  * **at Hard Cap:** 200,000,000 ASX + 800 ETH | \\~ $3,080,000\n* There's no founders or team allocation, no seed or private sale, no liquidity mining, and no airdrop. The Genesis Event is the first and only place to get ASX tokens before listing.\n* Team and partners are allowed to participate after the progress bar reaches 50%.\n* Participants can claim their ASX tokens once the event is completed. There's no vesting. 100% of the max supply will be unlocked and circulating on day one.\n* Once the soft cap is reached (250,000,000 ASX minted), a countdown of 10 days will start. When it hits zero, the Genesis Event will end, the initial liquidity pool on Uniswap will be created and the remaining ASX will be burned along with the liquidity provider (LP) token.\n* ASX ERC-20 smart contract address: **0x5313235002b9F11698D7B9187Be44f836FEbD6b5**.\n\n\n---\n\n## A unique token launch\n\nAs a community-focused project committed to the ethos and founding principles of the blockchain space, we are pleased to announce the official launch of **ASX**, the governance token of the ASX Protocol.\n\nIn the spirit of equal distribution, fairness, decentralization, and a community-first ideology, the launch event is taking place on our [custom-made platform](https://mint.asx.st/) and it's the first and only opportunity for anyone to get access to the ASX Protocol's native token, **ASX**, which will give holders the power to govern and curate essential infrastructure components of the network.\n\nOur mission is to give everyone in our community an opportunity to become a stakeholder in the ecosystem, and we want to extend that opportunity as fairly as possible. Launching ASX on our own platform, with a mechanism that is fair and transparent for all participants, drastically increases the chances of achieving this mission.\n\nApart from building our own token launch platform, we made sure everyone was on a level playing field. There's no seed or private sale, no liquidity mining, no emission (zero inflation), zero tokens to influencers or promoters, no airdrop, and zero Treasury, Company, Founders, Team, or Partners allocation.\n\n### 1 billion ASX tokens. 800 million to be minted, 200 million for liquidity. That's it.\n\n> *The protocol's revenue will exclusively serve ASX holders and all operations will be funded with ETH or stablecoins.*\n\nThe ASX Genesis Event is open to all interested and qualifying parties. It's a major milestone for the ASX Protocol ecosystem and speaks to the viability of our core technology and business model as we aim to become the ultimate permissionless omnichain liquidity hub for staked assets.\n\nAt ASX Labs, we believe in creating a global staking ecosystem of the people, by the people, for the people, that shall not perish under any threats. The crypto dream has never been about creating an instrument that can easily be put in a box, but about creating global assets that can govern and manage these new decentralized global networks.\n\n## Understanding the mechanics\n\nTo mint 1 ASX you need to contribute 0.000004 ETH. A total of 800,000,000 ASX will be available for minting. Due to the low fully diluted market cap of the project and to ensure as broad a distribution as possible and dramatically soften the potential for a massive gas war, we decided to operate in stealth mode until 50% of the tokens are minted.\n\nThere's a minimum of 1 ASX per mint and no maximum. Setting up a max cap per wallet without KYC is foolish and we're not big fans of KYC in DeFi. For us, privacy and freedom are paramount, and we respect and stand by yours. With that said, there's a cap of 100 ETH per mint on our Interface just to slow things down, if they get a bit crazy.\n\nIf you're lucky enough to hear about the ASX Protocol early, you'll have enough time to participate. Otherwise, you can get ASX tokens on Uniswap, after the Genesis Event is completed.\n\n## How to participate\n\nParticipating in the ASX Genesis Event is simple, quick, and intuitive, and getting prepared is even easier. Here’s what you’ll need:\n\n→ **An Ethereum-compatible web3 browser wallet**, such as MetaMask. You can generate a wallet address from these web3 wallets directly, or use your seeds to import an existing wallet address.\n\n→ **Sufficient ETH**, which you will need in order to contribute and pay for transactions gas fees.\n\nOnce you’ve got your checklist all set, here’s what the process will look like:\n\n1. To get started, head to our custom-made [Launch Platform](https://mint.asx.st/).\n2. You’ll be prompted with a welcome message. Click on \"**PARTICIPATION TERMS**\". Read everything and, if you agree, click on \"**I AGREE**\". Next, click on \"**CONTINUE**\".\n3. The next message will be a TL;DR of the ASX Genesis Event. Carefully read everything and click on \"**CONTINUE**\".\n4. You can now connect your wallet. We support almost any web3 injected wallet, but for a flawless experience, we recommend using MetaMask. Click on \"**CONNECT WALLET**\", either in the center or on the upper right-hand corner of the page.\n5. Once your wallet is connected, the ETH and ASX input fields will become available to you. You may either insert the amount of ASX you would like to receive or the amount of ETH you would like to contribute. Enter the desired amount and click on \"**MINT**\". Please make sure you have enough ETH in your wallet to pay for transaction fees.\n6. You will see a popup from your MetaMask wallet. Confirm the transaction and then wait for it to go through. Once it is validated on the Ethereum blockchain, your ASX balance, on the top of the page, will update and a \"CLAIM\" button will appear. You will be able to claim your ASX tokens once the event is completed.\n7. That's it! You successfully participated in the ASX Genesis Event.\n\n*Once your transaction is validated, a smart contract, that works like an escrow, will receive your ASX tokens and keep them safe until the end of the Genesis Event, when you will be able to claim them. Claimed ASX tokens are not locked and there is no vesting.*\n\n*Team and partners are allowed to participate in the Genesis Event after the progress bar reaches 50%. If the desired amount of ASX that those parties intend to hold can't be fully minted during this event, the remaining amount will be purchased on Uniswap.*\n\n## Liquidity\n\nBy the end of the Genesis Event, the initial liquidity of the ASX token will be immediately provided as a full range position on Uniswap V3. Since the resulting liquidity provider (LP) token will be directly burned, this initial position will be perpetual.\n\nThe liquidity depth will represent 40% of the FDV (Fully Diluted Value) and its absolute value will be based on the total ASX minted.\n\n* At soft cap, 250 ETH will be paired with 62,500,000 ASX, pricing the token at $0.0077 / ASX with $962,500 of liquidity depth.\n* At hard cap, 800 ETH will be paired with 200,000,000 ASX, pricing the token at $0.0077 / ASX with $3,080,000 of liquidity depth.\n\n*The Genesis Event will end in 10 days after the soft cap is reached or when all ASX tokens are minted, whichever comes first. Any unminted ASX will be burned.*\n\n## Security\n\nWe were very careful when deciding the code for the ASX ERC-20 smart contract and, to make it the safest possible, we only allowed the absolutely necessary lines of code. There's no mint function, no pause function and the contract is not upgradeable. It is an immutable token on the Ethereum Mainnet Network.\n\nBoth the ERC-20 and the Genesis Event smart contracts were developed with the highest levels of security, leveraging the battle-tested OpenZeppelin standard. With the entire supply circulating by the end of the Genesis Event plus the immediate burn of the liquidity provider (LP) token, you can rest assured that the ASX token can never be hacked or rugged.\n\n### Important Notes\n\nThe team at ASX Labs will NEVER DM YOU FIRST or ask you for money on any platform. You should be very skeptical of any DMs received by anyone claiming to be from ASX Labs.\n\nOnly trust ASX Protocol's official channels at the bottom of this announcement for information surrounding the event.\n\nThe ASX token will only be available once the Genesis Event is completed. Only then you will be able to trade it on Uniswap. Be sure to always check the smart contract address before trading.\n\n\n---\n\nThis is the first step towards an omnichain yield future. Welcome aboard.\n\n\n---\n\n* Participate in the [ASX Genesis Event →](https://mint.asx.st/)\n* Access our [Interface →](https://asx.st/)\n* Follow us on [Twitter →](https://twitter.com/asxlabs)\n* Join us on [Telegram →](https://t.me/asxprotocol)\n\n\n---\n\n## Legal Disclaimers\n\n*You understand that the ASX tokens have no intrinsic value and are solely tools of governance, and as such have no intrinsic potential for future appreciation in any form whatsoever. You further represent and warrant that you are an active user of blockchain technology and blockchain-based software systems and have the pre-requisite technical knowledge to understand what has been mentioned in this announcement and the risks that follow*.\n\n*The information provided within this announcement is for general informational purposes only pertaining to the governance tool. You understand that the ASX Protocol governance structure is an experiment in the field of decentralization and community governed structures, in which participation via the ASX token and otherwise is entirely at your own risk*.\n\n*Information contained in this announcement should not be relied upon at any time as advice to buy or sell or hold the aforementioned governance tokens and a particular note should be made to emphasize the solely governance-based nature of the ASX tokens and their lack of intrinsic ownership or economic value. This announcement does not take into account nor does it provide any tax, legal, or investment advice or opinion regarding the specific investment objectives or financial situation of any person.*\n\n*ASX Protocol and its associated parties, as appropriate, make no representation or warranties, expressed or implied, as to the accuracy of such information and ASX Protocol expressly disclaims any liability that may be based on such information or errors or omissions thereof. ASX Protocol reserves the right to amend or replace the information contained herein, in part or in its entirety, at any time, and undertakes no obligation to provide the recipient with access to the amended information or to notify the recipient thereof. The information contained in this announcement supersedes any prior representation, post, or conversation whether informal or formal, concerning the same, similar, or related information*.\n\n*This communication is not for distribution to U.S. newswire or similar services or any dissemination in the United States. This communication shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of, ASX tokens to any U.S. person (including, without limitation, any citizen or resident of the United States) or in the United States or in any jurisdiction in which such offer, solicitation, or sale would be unlawful before registration or qualification under the laws of any such jurisdiction*.\n\n*Any reference or mention of the ASX Genesis Event being open or accessible to the “public” should be understood to refer only to qualified individuals and entities under the applicable law.*\n\n*The ASX token is not an investment contract or security and should not be treated as such.*\n\n\n---\n\n## Restricted List of Countries\n\n*The ASX Genesis Event is not available to anyone located, incorporated or otherwise established in, or a citizen or resident of the United States of America, Afghanistan, Albania, American Samoa, Angola, Antigua and Barbuda, Aruba, Bangladesh, Barbados, Belarus, Benin, Bermuda, Bhutan, Bolivia, Bosnia and Herzegovina, Botswana, Brunei Darussalam, Burkina Faso, Burundi, Cabo Verde, Cambodia, Cameroon, Canada, Cayman Islands, Central African Republic, Chad, China, Comoros, Congo, Côte D'ivoire, Crimea and Sevastopol, Cuba, Democratic People's Republic of Korea, Democratic Republic of the Congo, Djibouti, Dominica, Ecuador, Egypt, El Salvador, Equatorial Guinea, Eritrea, Eswatini, Ethiopia, Fiji, Gabon, Gambia, Ghana, Guam, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, Hong Kong, Iran, Iraq, Jamaica, Jordan, Kenya, Kyrgyzstan, Lao People's Democratic Republic, Lebanon, Lesotho, Liberia, Libya, Macao, Madagascar, Malawi, Maldives, Mali, Malta, Mauritania, Mauritius, Micronesia, Moldova, Mongolia, Montenegro, Morocco, Mozambique, Myanmar, Nauru, Nepal, New Caledonia, Nicaragua, Niger, Nigeria, Niue, Northern Mariana Islands, Oman, Pakistan, Palau, Palestine, Panama, Papua New Guinea, Puerto Rico, Russian Federation, Rwanda, Samoa, Sao Tome and Principe, Senegal, Serbia, Seychelles, Sierra Leone, Somalia, South Georgia, South Sudan, Sri Lanka, Sudan, Suriname, Syrian Arab Republic, Tajikistan, Tanzania, Thailand, Timor-Leste, Togo, Tonga, Trinidad and Tobago, Tunisia, Turkey, Turkmenistan, Uganda, Ukraine, United Kingdom, United States Minor Outlying Islands, US Virgin Islands, Uzbekistan, Vanuatu, Venezuela, Western Sahara, Yemen, Zambia, Zimbabwe, or any state, country, or jurisdiction where it would be illegal, according to applicable law, to participate in this event*.", "timestamp": 1653239923, "digest": "SPP24Za2i393DM3Tx2hJqKXW0GYafuXHOu-pvMLcjNg", "contributor": "0x1be3C6a0a7617CE21Ca1765917629629787b48aD"}
{"id": "oDl3S6NLz6jyBZU4S_OERuLb8Pur0FpWyGB5nTiXtME", "title": "Keystone 如何防護供應鏈攻擊——官網真機驗證", "body": "當我們收到心心念念的硬件錢包，應該如何辨別真偽，以防供應鏈攻擊？\n\n供應鏈攻擊是硬件錢包安全性的主要威脅之一。從下單到我們收到包裹的這段时间，不可控因素非常之多，供應鏈攻擊就是发生在物流環節中。\n\n在此給到大家兩個建議，所有硬件錢包通用：\n\n1、不要從非官方渠道購入硬件錢包，如..閑..魚..等；\n\n2、收到硬件錢包後，先不要急於拆開，仔細檢查包裝是否有被拆過。\n\n與其他競品一樣，Keystone 的物流包裹上有防拆貼紙，我們拿到錢包的第一步就是檢查防拆貼紙是否有被撕掉過的痕跡。\n\n但是，防篡改包裝只是增加攻擊成本的一种方式，[不足以完全防住](https://www.youtube.com/watch?v=Y1OBIGslgGM&t=434s)供應鏈攻擊，因為防篡改包裝是可以被仿造的。\n\n## 官網真機驗證原理\n\n為了更好的防止供應鏈攻擊，我們在您初始化 Keystone 時，設備會提示用戶進行[官網真機驗證](https://keyst.one/authentication)。如果運輸過程中設備被篡改，將無法通過官網真機驗證。與比特幣签名算法相同， Keystone 的官網真機驗證也采用了非對稱加密算法，可以實現機密信息的交換和驗證。非對稱加密算法需要兩個密鑰：一個私鑰與一個公鑰（兩者是一一對應關系，我們稱之為“密鑰對”）。私鑰可用於簽名和解密公鑰加密的信息，公鑰可用於驗證私鑰的簽名和加密信息。由於公鑰是私鑰通過不可逆算法派生的，僅持有公鑰無法反推私鑰，所以我們通常將公鑰信息公開，供驗證使用。\n\n在生產環節中，我們在每台 Keystone 的安全芯片內都預錄入了一對專門用於官網真機驗證的密鑰對，這對密鑰對和 Keystone 在初始化期間由安全芯片通過[物理熵](https://blog.keyst.one/secure-elements-harnessing-a-force-of-nature-14a959da7b54)生成的真隨機錢包私鑰無關。\n\nKeystone 官網真機驗證頁面的後端是由 HSM（ Hardware Security Module ）服務器操作，HSM 是由 AWS（ Amazon Web Servce ，也就是大名鼎鼎的亞馬遜雲服務。AWS 是雲服務的鼻祖，相比於大家耳熟能詳的阿里雲，亞馬遜雲的誕生，早了足足九年）提供的高度安全加密服務。HSM 服務器中同樣有一對密鑰對，還同時保存了 Keystone 官網真機驗證密鑰對中的公鑰。Keystone 的[安全芯片](https://blog.keyst.one/secure-elements-the-last-line-of-defense-4669012d4edc)保存官網真機驗證密鑰對的同時，也保存了 HSM 服務器密鑰對的公鑰。\n\n用戶進行官網真機驗證時，系統會提示用戶使用 Keystone 掃描官網真機展示的二維碼。這個二維碼的原始信息是一串由 HSM 生成的8位隨機字符，這個字符串先由 Keystone 的官網真機驗證公鑰進行加密，然後由 HSM 的私鑰簽名，最終以二維碼形式展示在網頁上供 Keystone 掃描。當 Keystone 掃描官網真機驗證二維碼獲得加密信息後，會先用 HSM 公鑰驗證簽名，這一步可以確保用戶是通過 Keystone 官網真機進行官網真機驗證的，而不是釣魚網站。\n\n然後 Keystone 再用官網真機驗證的私鑰對 HSM 服務器加密的信息進行解密，得到原始信息（8位字符）。將 Keystone 解析的數據輸入到官網真機進行驗證，HSM 服務器會將我們輸入的信息與原始數據進行比對，數據一致就會提示驗證成功。如果驗證失敗，就意味著用戶手中的 Keystone 已經被篡改過（替換安全芯片或者修改固件文件，甚至整個硬件錢包都是偽造的），建議立即停止使用。\n\n# 官網真機驗證是否容易被攻破？\n\n黑客需要同時攻破我們的 HMS 服務器和 Keystone 設備的安全芯片。Keystone 使用的 HSM 服務器是由 AWS（亞馬遜雲）提供的安全加密服務，是我們評估的所有同類服務供應商中安全性最高。而且，眾所周知，安全芯片被攻擊的難度也非常大，因此黑客很難同時破壞兩者。所以，Keystone 的官網真機驗證可以有效預防供應鏈攻擊。\n\nKeystone 專業版還增加了[拆機自毀機制](https://mirror.xyz/keystonecn.eth/A5blBF-KWF5sGCm5TzCXpmQj_5xy3wUYYXjUeCInWrM)，試圖打開 Keystone 並篡改內部組件時，會觸發自毀機制，安全芯片內的敏感信息將全部自動擦除，設備也將無法繼續使用。", "timestamp": 1653239884, "digest": "SFGEVsIQOPls5SGV2CBr54tj6KNpCs5hoqXE-WlPa5M", "contributor": "0xaFEF3a80B6A205d1F74aaC7887e96A0F6F6051e0"}
{"id": "unvlAgmTvlRocBCcV7DaNgw1grxQvqJDVTrrs6jy04s", "title": "Exclusive | Tesla's response to the letter of apology was deleted: no clear release deadline was required", "body": "Related news: Wenzhou Tesla lost control of the owner’s apology letter has disappeared", "timestamp": 1653240062, "digest": "F6eOHGF9xlBNOsWe0WFg7qtXTFcFwn11oQO51hthfvE", "contributor": "0xA14377962A351067404A8374d7d4a99A7eD9cc4A"}
{"id": "zgyg4fNCEROuqXP07QAAHOtZxZJNGMi3neWcVAJ9cQY", "title": "The rental of small power charging treasure has been returned in time, but it has been charged 99 yuan", "body": "Home > details\n\nHello, brother duck, charge 177399 yuan in time\n\n17347320179 object of complaint: Xiaodian Technology\n\nSmall power technology complaint requirements: return the amount wrongly deducted and generate the correct order\n\nRefund the wrongly deducted amount and generate the correct order. Litigation amount: 99 yuan\n\n99 yuan complaint progress: the complaint has been completed 1 0 microblog\n\nWeChat\n\nQQ\n\nQQ Zone\n\nHello, little brother. How do you evaluate the service attitude:\n\nProcessing speed:\n\nSatisfaction: timely refund\n\nHello, little brother. Duck, confirm it’s finished\n\nShangxiaodian technology reply has hidden content\n\nSmall power technology has been allocated to merchants in the merchant processing of black cat consumer service platform\n\nBlack cat consumer service platform approved\n\nLittle brother Hello duck initiated a complaint. At about 6:30 p.m. on February 14, Alipay was used by live fish in an village, Beiting lane, Nanjing to rent a small battery charger. The charger was returned at about 7:25 p.m. that night. The card slot was inserted correctly, and the indicator light of the charger was on. At about 7:30 a.m. on February 19, I received the message that Alipay deducted 99 yuan.\n\n1. The above contents only represent the complainants themselves and do not represent the complaint position of black cat.\n2. 2. Without authorization, any reprint of cases on this platform is prohibited, and violators will be investigated for legal responsibility.\n3. 3. No fee will be charged for handling complaints of black cat. Those charged in the name of black cat complaints are acts of impersonation and deception. Please call the police in time and give feedback to the official of black cat. Report Mailbox heimaotousu@vip.sina.com 。\n4. 4. Please choose official channels to solve consumption disputes. Don’t trust third-party institutions or individuals to refund fees to avoid being cheated. Please don’t add strangers through QQ or wechat, and don’t remit money to strangers. Beware of being cheated. In case of fraud, please call the police in time.\n5. ", "timestamp": 1653240241, "digest": "txg1dwXBd9kSiqFe5aT3JUqwmvR4iAETJWNFDRUR7AQ", "contributor": "0xeB7bb78f39c083EBa00b77D7665256920B66FF9A"}
{"id": "4xS_nxRe5b9daVqKi9j_htvPIpxRGJp98bz5Z6gxEPI", "title": "《The Survival Ape 幸存猿》调研简报", "body": "`——TSA 调研组：兔子头 制作`\n\n**// 特别强调：**\n\n1. NFT 项⽬均为⾼⻛险项⽬，流动性较差\n2. 此份研报初衷在于项⽬分享，仅以目前（2022.3.11）的信息归纳分析汇总，情况可能不准确，不作为投资建议。\n\n## 项目链接\n\n`Twitter：`\n\n[https://twitter.com/survival_ape ](https://twitter.com/survival_ape )\n\n`Instagram:` \n\n[https://www.instagram.com/survivalape/ ](https://www.instagram.com/survivalape/ )\n\n`Website:` \n\n[https://www.survivalape.art/](https://www.survivalape.art/)\n\n## 项目亮点\n\n* 发行量6666张，数量并不是很多，holder可以瓜分80个ETH\n* 项目本身有给一些大蓝筹项目发白，持有者将会有一定的钻石手\n* 社区比较活跃，有很多抽奖和活动\n* 有和Women of World旗下的Alpha社区，World of Alpha做英文AMA\n* 有一定的商业路线图，团队来自金融科技，Defi以及NFT领域，并且和设计师有紧密联系\n* Holder不少福利，对未来项目方发行的NFT享有折扣，代币质押额外收益，参与决策和利润分成\n* 团队保证每个季度至少发行一个NFT项目，NFT长期赋能\n* 据传设计师是名牌院校的，有一定的艺术背景，真实身份有待考量\n\n![](https://images.mirror-media.xyz/publication-images/OUcajs2jV2wa-cH4TS1rl.png?height=1332&width=1080)\n\n## 总结简版\n\n项目方本身有一定的计划和想法，但能否按照线路图说的完全做到还有待考量，社区可以通过质押和持续发放二期和三期来保证项目活跃度，但最终呈现效果也是至关重要的。比较有意思的是holder等级制度，不同holder等级享受到的折扣和分成也不一样。本身mint价格有点小贵，是否mint可以观察一下市场，本身猴子项目都会有一些小加分\n\n## 项目背景\n\n项目方背景未公布具体细节\n\n## 项目远景\n\n会有代币系统，但具体经济模型还未公布，不确定以后代币的具体用处，并未说明未来代币发行价和回购价格\n\n![](https://images.mirror-media.xyz/publication-images/7V25LE4xtnrwndDVgmZCt.png?height=3519&width=1080)\n\n## 总结\n\n项目方有想法，有路线图，整体风格和运营方法比较像港台同胞。开盘可以观察地板再考虑是否mint\n\n \n ", "timestamp": 1653240671, "digest": "NQO5o26zDNCmLK7k51VHuAf9wz9WV00mz38tmCxR2kM", "contributor": "0xeF96650E66688D5Fedb995432E28cdadDCcCBF71"}
{"id": "BKQhoh_s1Bdrw5oyCIv0nmMAPkZkFIfdmWH4GWykQJs", "title": "Why are these young people keen to celebrate Internet anniversary?", "body": "Today, let’s take a test and answer a question\\~\n\nIf it’s important to say it again: Send a code - “5g surfer” on the background of wechat to get the answer.\n\nOK, officially enter today’s theme. (the full text is 3588 words and takes about 5 − 10 minutes to read.)\n\nWe mean that as long as we have chased and loved each other, we can have an “Internet anniversary” every day, every year, for this young people to have fun and celebrate. If we are not even, we can also find online confidants. (I really hope that KK’s birthday can also catch this carnival on May 11 next year.)\n\n0406, 0505, seventh and ninth anniversaries… Looking back on these anniversaries this year, it is really more and more lively, and the more lively it is, the more prominent the coldness of the Internet. Youdao is in response to that sentence - busy anniversary, barren Internet.\n\nSo, do the beautiful days that I’ve heard of really exist?\n\n“The reason why we are here today is to celebrate the birthday of our best friend, Gu Li…”\n\nThe standard script for Ms. Gu Li’s birthday, oh, the same day is also her father’s memorial day, or the “rotten and smelly day” of the time sisters. From birthday greetings, birthday entries, birthday posters to outdoor screens, the little rich woman of the times is no less than an artist.\n\nMr. Liu mintao’s “red high heels” is the first direct shot actress in the history of internal entertainment. One must be arranged to commemorate the direct shot.\n\nIn the twinkling of an eye, sister Xun’s “a lot of people” expression bag has been for several years. By the way, it is Lu Fei and crayon Xiaoxin’s birthday on the same day. I wish the two Taurus children a happy birthday.\n\nAs for the grand carnival of “Internet anniversary”, at least not the draft.\n\nFrom 2018 to 2021, we watched the domestic entertainment talent show from the first year to hot and then to quietly end.\n\nThe first year, the day when the limited group ninepercent became a group, announced the arrival of a new era, and many people’s dreams began from this day;\n\nIn the second year, unine, a limited group, successfully promoted the era of draft automation because of its random ranking distribution;\n\nIn the third year, there was no debut night and no group. The building of internal entertainment draft was stopped when it was built to the second floor, which indirectly became a “uncompleted residential building”. Since then, it has become Xiufen’s “Qingming Festival”.\n\n“Youth 3” ixform made its debut quietly in an unnamed music. The debut night of the finals that failed to be broadcast was quietly buried together with the draft, which is sad.\n\nThe internal entertainment talent show has changed for only three or four years. Seeing him rise from a tall building, see his banquet guests, and see his building collapse, now, Xiufen people recall their youth by relying on the pictures of memories and on a special anniversary day.\n\nDo you want this blessing?\n\nA “Legend of Zhen Huan” can be said to have kept LETV I prosperous.\n\nMany years later, there are still a large number of audiences “passing the love pass”. The founder of Hua’er film and television, the producer of the legend of Zhen Huan, said: “the legend of Zhen Huan can bring more than 10 million profits to Hua’er film and television (which has been acquired by LETV) every year.”\n\nWell, why not?\n\nWhether it’s the birthday of ANN bird, the memorial day of Zhen Huan’s return to the palace, or the 300 year anniversary of the legend of Zhen Huan, it’s the audience’s real love for the play,\n\nThe audience is willing to look at a carefully carved work with a magnifying glass and see it again and again, which also shows that the audience has enough patience and appreciation ability for the work with real intention.\n\nFrom the examination questions of level 10 of the legend of Zhen Huan to how many episodes you can live in the palace, a variety of extended topics and challenges are still active on the platform today. This play seems to have become the spice of public life. Every day in the real-time square, people will plead with the creators of the legend of Zhen Huan to abide by the law and discipline, so as not to get the work off the shelves and become a public enemy of the whole people.\n\nSource: microblog screenshot\n\nThis year marks the ninth anniversary of the launch of the legend of Lu Zhen. Looking back on the whole story, Lu Zhen, an outstanding female representative of the Northern Qi Dynasty who was brave and firm and earned the position of Prime Minister for herself under the rule of the imperial power by relying on her own wisdom, is still a unique presence in the current TV series market.\n\nIn the past nine years, the actor himself has been in hot demand since his unknown place of origin. After a rough and hard journey, he finally got to Xintiandi and became the “85 flower” in the front line. I don’t know how ah Zhen, who is parallel to time and space, has also experienced unknown hardships. Is he happy with ah Zhan?\n\nOn the anniversary of another variety show “informal talks”, which has been with you for seven years, Chen Mingfa said that seven years is not a short life journey. His eldest daughter is seven years old. He saw some friends offline and told him that they were accompanying them from junior high school / high school to University / graduate school. He felt very honored to accompany you through your youth. These seven years of unhealthy time are also his youth and his UFO.\n\nThis UFO is straight ahead in any direction. It can take him to any place he wants to go, see the scenery, talk about any topic, and never die. He has been looking forward to seeing you again.\n\n“I can’t live without you.”\n\nLove me, scold me, whatever you want\n\n“Of course, I will be very moved. It shows that my acting skills have been recognized. We believe that there are such people around us. We believe that he (the role) has really come to the world. As an actor, there is nothing happier than this.” This is the true feeling of an actor who once worked with KK.\n\nThe time spent with the character is three months, six months or even longer to enter another person’s life and become this person. Experience his life and experience his joys and sorrows. “Sometimes it’s difficult to say goodbye. The hardest thing is to convince yourself that he doesn’t exist. If someone can remember him except me, at least he’s not so lonely.”\n\nThe audience can remember their own plays and characters, and even celebrate their birthdays and anniversaries outside the play. Remembering his life is a great affirmation for the actors.\n\nAt the most beautiful night BiliBili party in 2021, Zhang Wanyi, the actor of Chen Yannian in the awakening age, played a song “misplaced time and space”.\n\nPicture by network picture by network\n\nWhen the sound of leather shoes and chain rings at the same time, roles and players meet across time and space, maybe I", "timestamp": 1653240614, "digest": "RFaxcNKON4OJ8eGGLNGtFmiAL-IzfYeP6LeOFCsUZM4", "contributor": "0x1a79643D49D2C41D0E17B3Ad0DB838a27F85679a"}
{"id": "ID2VDvxQLTLDX4NJONhVShcga_zvVZ9CWUSq4YmAwjI", "title": "Heroines", "body": "So, we are very excited to announce \"The Heroines\" finally.\n\nBack in October, when we first started working on Heroes of the Metaverse,  one of the first decisions we had to make was how we would deal with the percentages of characters that would be males vs. females.\n\n***Who decides what?***\nHistorically, both in the NFT space and in the RPG/D&D world, women have been infra represented, and we did not want to reproduce the same stereotypes.\n\nThe logical decision was to divide the % of male characters vs. female characters by 50/50, closing the issue. Anything else would have been either negative or positive discrimination.\n\nAnd, of course, we didn’t want to dillute the series unnecessarily.\n\n## The five male founders dilemma\n\nAdditionally, the fact that the five founders are male heroes made us feel highly uncomfortable with the fact of creating Female Characters. Cesar Drawss -our Creative Director and artist- was the first one to raise the voice that he should not be the one designing female characters.\n\nBut in that early stage, the only members of Heroes of the Metaverse were the five founders.\n\nSo, all of these facts made us realize we were not comfortable or ready to launch the Heroines simultaneously as the Heroes.\n\n## Doodles: the inspiration\n\nAs everyone in this space wants to make something lasting and beautiful, we like to learn from everyone. And if there's someone we love about the NFT space is the creativity, the rule-breaking attitude, and the possibility of using technology to disrupt the status quo of what is possible and what's not.\n\n![Space Doodles is a subtle and brilliant innovation](https://doodles.app/images/doodle_plane.gif)\n\nAnd when Doodles announced the Space Doodles, what caught our attention was the technology they used. For us, the wrapped NFTs technology is one of the greatest innovations in the NFT space since the Azuki's ERC721A smart contract.\n\nEven if only a tiny percentage of people realize what this could become in the future, we also see this could be a great way to transform your Male Hero into a Female Hero. And, with it, let the market choose the % of female heroes vs. male heroes.\n\n## The Heroines\n\nAfter learning how the wrapped NFTs work, we decided not to use this technology.\n\nSince the change of sex is a variable and an image, we didn't need it as it does not bring any other value to the user. If we had wanted to use the wrapped NFTs, we would have required a second contract and a utility tool to enable the wrapping for the user. That would represent an unnecessary cost for the holder since the gas fee would have been much higher than how we are doing it.\n\nWe will create the Heroines transformation by ***uploading different JSON and image files to IPFS, and only modifying the file names while retrieving the token URI*.** As if it were two sides of one same coin. There is no tech innovation here, but this will ensure as much gas as possible as no extra code is written in the contract.\n\n![Switch from Hero to Heroine whenever you want. Cost = 0ETH + gas.](https://images.mirror-media.xyz/publication-images/XI7iZg3UIJ-wbq2WqCrte.jpg?height=1080&width=1080)\n\n***These are the essential points of the transformation:***\n\n* You will be able to transform your Hero into a Heroine whenever you want and vice-versa.\n* The Heroines will be available some weeks after the first King's election.\n* The cost for converting your Hero will be 0ETH + gas.\n* Female artists have created our Heroes to ensure they lead the way of \"how a heroine should look like.\"\n* There will be a tool so everyone can see what the counterpart version would look like -even if not visible on marketplaces.", "timestamp": 1653240694, "digest": "rwRckqLH7RZ-zCPspfmfa64oUFMrJ0cwjbSvVT0JJrE", "contributor": "0x3cD877CF87DE6Bfc7f23eB4D0B3C20cb5a6FD080"}
{"id": "SP0amJQRswucseBr26SpAQHMxcEctuc50OFjcAN9AyM", "title": "《The Survival Ape 幸存猿》调研简报", "body": "`——TSA 调研组：兔子头 制作`\n\n**// 特别强调：**\n\n1. NFT 项⽬均为⾼⻛险项⽬，流动性较差\n2. 此份研报初衷在于项⽬分享，仅以目前（2022.3.11）的信息归纳分析汇总，情况可能不准确，不作为投资建议。\n\n## 项目链接\n\n`Twitter：`\n\n[https://twitter.com/survival_ape ](https://twitter.com/survival_ape )\n\n`Instagram:` \n\n[https://www.instagram.com/survivalape/ ](https://www.instagram.com/survivalape/ )\n\n`Website:` \n\n[https://www.survivalape.art/](https://www.survivalape.art/)\n\n## 项目亮点\n\n* 发行量6666张，数量并不是很多，holder可以瓜分80个ETH\n* 项目本身有给一些大蓝筹项目发白，持有者将会有一定的钻石手\n* 社区比较活跃，有很多抽奖和活动\n* 有和Women of World旗下的Alpha社区，World of Alpha做英文AMA\n* 有一定的商业路线图，团队来自金融科技，Defi以及NFT领域，并且和设计师有紧密联系\n* Holder不少福利，对未来项目方发行的NFT享有折扣，代币质押额外收益，参与决策和利润分成\n* 团队保证每个季度至少发行一个NFT项目，NFT长期赋能\n* 据传设计师是名牌院校的，有一定的艺术背景，真实身份有待考量\n\n![](https://images.mirror-media.xyz/publication-images/OUcajs2jV2wa-cH4TS1rl.png?height=1332&width=1080)\n\n## 总结简版\n\n项目方本身有一定的计划和想法，但能否按照线路图说的完全做到还有待考量，社区可以通过质押和持续发放二期和三期来保证项目活跃度，但最终呈现效果也是至关重要的。比较有意思的是holder等级制度，不同holder等级享受到的折扣和分成也不一样。本身mint价格有点小贵，是否mint可以观察一下市场，本身猴子项目都会有一些小加分\n\n## 项目背景\n\n项目方背景未公布具体细节\n\n## 项目远景\n\n会有代币系统，但具体经济模型还未公布，不确定以后代币的具体用处，并未说明未来代币发行价和回购价格\n\n![](https://images.mirror-media.xyz/publication-images/7V25LE4xtnrwndDVgmZCt.png?height=3519&width=1080)\n\n## 总结\n\n项目方有想法，有路线图，整体风格和运营方法比较像港台同胞。开盘可以观察地板再考虑是否mint\n\n \n ", "timestamp": 1653240574, "digest": "NQO5o26zDNCmLK7k51VHuAf9wz9WV00mz38tmCxR2kM", "contributor": "0xeF96650E66688D5Fedb995432E28cdadDCcCBF71"}
{"id": "VlOwH3hRwLpzkf-cM4KI3L5w7VW0V9Bs5aG4iZfOM_U", "title": "How we found our Teddy :)", "body": "Last summer Sam FaceTime'd me & was talking to me about NFT’s. I knew what NFT’s were before we had that conversation but just never paid attention to it. He said : bro this space is perfect for you, don’t ask me why just go on twitter & join any NFT twitter space and you’ll find your journey, I am so excited to see where this story goes from here…\n\nI still remember saying : bro it’s 4 in the morning rn on a Saturday night and you’re telling me to go on twitter space rn and follow some monkey’s??? lol\n\nIn my mind I was like this dude’s lit & out of his right frame of mind. Finishing our sentences he said Teddy trust me, I know you and I am telling you this is a one way ticket to the life you have always dreamed but never lived and opportunities like this are very hard to find. I just laughed at it and I was like I’ll think about it and let you know…\n\nThen after a week I was playing soccer with Shadow in my backyard thinking about what Sam said the other day and the way he said it it was full of light. I could literally feel those good vibes. Btw Sam is a well known artist in the space, and now after spending all this time in this space I get it why he was hyper that day. Anyways, then I went on my twitter and switched my profile form private to public. I joined my first twitter space, It was with @NFTPrince & NFTsquirrels. Both are living legends and I respect them a lot. They shared tons of selfless advice to me on first day without even knowing who I was, what my real name is, or how I looked like. The knowledge was so valuable that basically I’ve never been rugged / scammed in this space till date. \n\nAfter spending some time in different spaces and observing how everything is working in this ecosystem, I focused on the fundamentals, the way people interact and react with certain things, what values they carried, and how do they find their feeling of importance. It was’nt very difficult for me to figure these things out because of my knowledge & experience with Social Media for over 5 years. I grew 36 million+ followers on Instagram via different entertainment pages and a network of over 250 million+ followers via networking in less than 6 months with just 2,000$ to start with from my college dorm.\n\nDuring that time Bored Ape’s were just flying and they still are but the vibes were immaculate last year you can’t deny that. I literally did a PHD on them and I was just astounded by their story but I was able to relate a lot of it to my life, it was so inspiring and fascinating. I was thinking so much about it, that even in my dreams I was seeing NFT’s all around me and my life changed the night of September 30 when i had that one lucid dream, I decided to do a project to share my story so that others can relate to it and be a part of it. \n\n( Note : This was’nt the main reason for me to do a NFT project. My main goal was and is still the same today that I want to leave this NFT space better than how I found it. )\n\nBack to the story, why Teddy? Well obviously. My friend’s call me Teddy and Teddies have been a part of everyone’s childhood and I believe people will hold on to that tradition forever. They provide us the comfort & companionship, a friend to talk to, and it’s not just kids who benefit from the positive effects of a comforting Teddy squeeze. Teddies are just universal and timeless.\n\nI put all of my traits and character and imagination’s in the art, from my expressions to the way I dress. Some of the assets are added for the aesthetics of the collection. I am not an artist but since I was the character I worked with few freelance artist’s to bring my idea on paper. They asked me for a sketch to give an idea of what I wanted and this is what I sent them lmao 😂😂😂😂😂😂\n\n![ That Yu-Gi-Oh and LV belt part has my heart lmaoooo😭😭😭. Tbh this image is still a lot better than my first one. Btw I am not rich lol, I don't have a AP watch or fancy items.](https://images.mirror-media.xyz/publication-images/p7SJwXfpBXm-_G9fiTlu0.jpg?height=1280&width=960)\n\n![This looks decent lol. Lot better than what I came up with.](https://images.mirror-media.xyz/publication-images/Vxl5Z9dogU0G7wxHt-euI.png?height=1280&width=720)\n\n![That's me on the Left! Dw I am doxed to all our past holder's and lot of people in NFT space know me irl. My identity is just not public in the space atm. I'll reveal it when time is right.](https://images.mirror-media.xyz/publication-images/CL1JyGEQS_ynX1v0M1WGn.png?height=1280&width=1280)\n\nBack to the story, so once I got this I reached out to few professional artist’s in my network and I worked with multiple of them to find the perfect Teddy. We wanted to stick with 2D because 3D art is great but the market seemed to be doing well with 2D more than 3D collections. Ofcs art style isn’t the main reason for it but it does play a role. But then I am like let’s take the challenge and create something insane. During the time when I started the project, their were’nt any 3D project’s coming out just yet nor there were any noticeable Teddy Bear collections popping as long as I know. So then we decided to turn this into 3D. During this process one 3D artist reached out to me in my DM’s of one our meme page asking to collab, I am like okay cool lets give it a shot and see what you got. \n\n![This is what he came up with as base model. 💀💀💀](https://images.mirror-media.xyz/publication-images/FcshCcWqBzufElk9puKnW.png?height=772&width=778)\n\nYeah he just lost me on that base model. If ur surprised, I did’nt see this coming either, when I saw it for the first time I was out of words just like you are rn. I seriously had no comments on this image. So yeah I had to say no to that dude and look for another artist. The fact that people fake their LinkedIn and show you proof of work of other artist is just hilarious. So I asked one of my friend on telegram if he knew any artist to connect me and he did. \n\n![Idk tbh, it was just not it.](https://images.mirror-media.xyz/publication-images/Z3yiJzSTaGmqQdaHZroTJ.png?height=1280&width=1280)\n\nIt just did’nt feel right going with the full body at this point, gave pfp style a shot and see how it does. Initially the idea was, we will do pfp collection and in a seperate contract and we will give the holders full body version of their Teddy so they have both and can use it the way they like whether to animate or so with the source file…\n\n![I finally said yes to this one and made a deal with the artist and gave her an upfront amount for her time that we both agreed on. ](https://images.mirror-media.xyz/publication-images/ef-d0SnN5nrZH4EpHIfbn.png?height=1280&width=1280)\n\nThe reason why I paid upfront was because she told me she had financial instability and urgently need of money for rent and expenses so she would’nt be able to work full time on this project and it would take lot longer to complete the collection than what I was expecting. Plus I genuinely wanted to help her regardless of if she would work for the project or not due to her situation.\n\n![My mind, Her skills.](https://images.mirror-media.xyz/publication-images/Q7q8YdENYDP5zDlajLh05.png?height=1280&width=1280)\n\nWe decided to fully render and rigg the collection in the end after all the traits and assets are illustrated and confirmed so that their isn't any confusions and nothing is left out. But unfortunately she died in a car accident 3 days before our launch. I found out about it next day of her death from my friend I was completely devasted but I was more sad for her and her family. I communicated with our community and told them that guys we do not have the collection fully rigged and its in between 2D and 3D so we would have to pause the project for now until we find another artist and see how things go from there. \n\nBut then I was also out of funds because I put everything I had in the project initially. So I communicated this with the community in our discord and 34 people ended up minting 100 regardless of the situation. 10 were minted for team and 1 was minted by me personally to participate in the process just like any other member of community. They knew that mint had zero value and won’t have a secondary market value but yet they still supported. All they asked me was to not quit on my dream and to the challenge to make a come back from this situation. The collection won’t ever be revealed for the respect and honor of our artist. We communicated this with our holders as well and they are okay with it. A small portion of funds from royalties of our new collection will go towards her Family. Here’s the OpenSea link to that collection :\n\n[https://opensea.io/collection/toxicteddyclub](https://opensea.io/collection/toxicteddyclub)\n\nThen after I did an outreach again and managed to find a team of 4 professional 3D artist’s. Their past ventures have involved working with brands like Puma, Bangs and Lulu Lemon. Their Identities are anon as they wish to keep it that way but I have confirmed the veracity of their credentials. When I presented this entire idea and vision of the collection to them, after hearing me they instantly said yes and told be that we’re gonna make the best collection of 2022. We started working on it the same day and even with this team, I worked 1 on 1 with the team over screen shares for every single trait’s and asset’s and outcomes are just fantastic. Look It does’nt matter what people think of it but we do believe it is one of the greatest NFT collections that will ever be deployed on Blockchain. We’ve put our blood, sweat and tears in this collection as a team day in and day out. The collection is timeless & it will age well I can make that one promise for sure. \n\n![This collection is dedicated to someone who does'nt need to own it. ](https://images.mirror-media.xyz/publication-images/wKl-h3xgt9G73xjvxW_7_.png?height=1280&width=1280)\n\nThe story will never have an end to be honest and I am just the captain of the boat as of now but at some point I want to hand the dream over to the community in a position that even if I am not present the story live forever as long as their is imagination left in this world. ", "timestamp": 1653240742, "digest": "jXakHBEnxedF5bMQUOTPHsvphMBn1UFjwFtoIfaSDUo", "contributor": "0x8a2ea19fA95e874BE84Fb2B34Fd6099C71aDD8A8"}
{"id": "BP74txOc00TTeVD2kQylwZ1VdsGjRjxfpCppIQdqxFw", "title": "Two new Omicron subtypes found in Japan are more infectious", "body": "Beijing epidemic prevention and control > > check the anti epidemic News > >\n\nEnter the epidemic Map > > “anti epidemic” toolbox > >\n\n\\[\\\\japan finds two new subtypes of Omicron virus \\\\more infectious\\] the Ministry of health, labor and welfare of Japan announced on the 12th that two new subtypes of novel coronavirus Omicron virus, known as “ba.4” and “ba.5”, have been identified for the first time in Japan’s quarantine, and their transmissibility is stronger than that of Omicron subtype virus “ba.2”. (CCTV)\n\nRelated news:\n\nSouth Korea: Omicron has the most stable combination with human body cells, and the virus is evolving in a more infectious direction\n\nAccording to the report of Korean International Radio on May 12, the genetic analysis results of the new coronavirus variant strain in China by the South Korean Central Disaster Safety Countermeasures headquarters show that the combination of Omicron and human body cells is the most stable. The epidemic prevention department said that the novel coronavirus is continuing to evolve towards a more susceptible direction.\n\nSubject to 0:00 on the 12th, there were more than 35900 newly confirmed cases in South Korea. Although the epidemic momentum continued to slow down, the epidemic prevention department still said that the fifth round of pandemic caused by Omikron was not over and called for compliance with the interval of vaccination.", "timestamp": 1653241053, "digest": "FmnYvlKtWTt_tyIxexIVbowoN5YzeFZcyFCQHIykqlQ", "contributor": "0xBEFf7D1CC7d1372B4F948dFf6f2092C1Ef7295b6"}
{"id": "H10xVtvH81Tg-mCCAo_o54RRmbkXP0mXimQjNKIyxd4", "title": "Introduce MySelf", "body": "I’m Anees ur Rehman. I want to create my empire in ASIA.", "timestamp": 1653240914, "digest": "isTRfiIgMfEx1To7P4XNjhuJEIZJbzLSPaluYaYatDk", "contributor": "0x74f21A2c296C1Dd38e2c20cEffF2b5D23210B294"}
{"id": "lIHG8Eoa04PwKjNsr4-_J18_bDEbzLsPrMtXL0oy2uQ", "title": "How we found our Teddy :)", "body": "Last summer Sam FaceTime'd me & was talking to me about NFT’s. I knew what NFT’s were before we had that conversation but just never paid attention to it. He said : bro this space is perfect for you, don’t ask me why just go on twitter & join any NFT twitter space and you’ll find your journey, I am so excited to see where this story goes from here…\n\nI still remember saying : bro it’s 4 in the morning rn on a Saturday night and you’re telling me to go on twitter space rn and follow some monkey’s??? lol\n\nIn my mind I was like this dude’s lit & out of his right frame of mind. Finishing our sentences he said Teddy trust me, I know you and I am telling you this is a one way ticket to the life you have always dreamed but never lived and opportunities like this are very hard to find. I just laughed at it and I was like I’ll think about it and let you know…\n\nThen after a week I was playing soccer with Shadow in my backyard thinking about what Sam said the other day and the way he said it it was full of light. I could literally feel those good vibes. Btw Sam is a well known artist in the space, and now after spending all this time in this space I get it why he was hyper that day. Anyways, then I went on my twitter and switched my profile form private to public. I joined my first twitter space, It was with @NFTPrince & NFTsquirrels. Both are living legends and I respect them a lot. They shared tons of selfless advice to me on first day without even knowing who I was, what my real name is, or how I looked like. The knowledge was so valuable that basically I’ve never been rugged / scammed in this space till date. \n\nAfter spending some time in different spaces and observing how everything is working in this ecosystem, I focused on the fundamentals, the way people interact and react with certain things, what values they carried, and how do they find their feeling of importance. It was’nt very difficult for me to figure these things out because of my knowledge & experience with Social Media for over 5 years. I grew 36 million+ followers on Instagram via different entertainment pages and a network of over 250 million+ followers via networking in less than 6 months with just 2,000$ to start with from my college dorm.\n\nDuring that time Bored Ape’s were just flying and they still are but the vibes were immaculate last year you can’t deny that. I literally did a PHD on them and I was just astounded by their story but I was able to relate a lot of it to my life, it was so inspiring and fascinating. I was thinking so much about it, that even in my dreams I was seeing NFT’s all around me and my life changed the night of September 30 when i had that one lucid dream, I decided to do a project to share my story so that others can relate to it and be a part of it. \n\n( Note : This was’nt the main reason for me to do a NFT project. My main goal was and is still the same today that I want to leave this NFT space better than how I found it. )\n\nBack to the story, why Teddy? Well obviously. My friend’s call me Teddy and Teddies have been a part of everyone’s childhood and I believe people will hold on to that tradition forever. They provide us the comfort & companionship, a friend to talk to, and it’s not just kids who benefit from the positive effects of a comforting Teddy squeeze. Teddies are just universal and timeless.\n\nI put all of my traits and character and imagination’s in the art, from my expressions to the way I dress. Some of the assets are added for the aesthetics of the collection. I am not an artist but since I was the character I worked with few freelance artist’s to bring my idea on paper. They asked me for a sketch to give an idea of what I wanted and this is what I sent them lmao 😂😂😂😂😂😂\n\n![ That Yu-Gi-Oh and LV belt part has my heart lmaoooo😭😭😭. Tbh this image is still a lot better than my first one. Btw I am not rich lol, I don't have a AP watch or fancy items.](https://images.mirror-media.xyz/publication-images/p7SJwXfpBXm-_G9fiTlu0.jpg?height=1280&width=960)\n\n![This looks decent lol. Lot better than what I came up with.](https://images.mirror-media.xyz/publication-images/Vxl5Z9dogU0G7wxHt-euI.png?height=1280&width=720)\n\n![That's me on the Left! Dw I am doxed to all our past holder's and lot of people in NFT space know me irl. My identity is just not public in the space atm. I'll reveal it when time is right.](https://images.mirror-media.xyz/publication-images/CL1JyGEQS_ynX1v0M1WGn.png?height=1280&width=1280)\n\nBack to the story, so once I got this I reached out to few professional artist’s in my network and I worked with multiple of them to find the perfect Teddy. We wanted to stick with 2D because 3D art is great but the market seemed to be doing well with 2D more than 3D collections. Ofcs art style isn’t the main reason for it but it does play a role. But then I am like let’s take the challenge and create something insane. During the time when I started the project, their were’nt any 3D project’s coming out just yet nor there were any noticeable Teddy Bear collections popping as long as I know. So then we decided to turn this into 3D. During this process one 3D artist reached out to me in my DM’s of one our meme page asking to collab, I am like okay cool lets give it a shot and see what you got. \n\n![This is what he came up with as base model. 💀💀💀](https://images.mirror-media.xyz/publication-images/FcshCcWqBzufElk9puKnW.png?height=772&width=778)\n\nYeah he just lost me on that base model. If ur surprised, I did’nt see this coming either, when I saw it for the first time I was out of words just like you are rn. I seriously had no comments on this image. So yeah I had to say no to that dude and look for another artist. The fact that people fake their LinkedIn and show you proof of work of other artist is just hilarious. So I asked one of my friend on telegram if he knew any artist to connect me and he did. \n\n![Idk tbh, it was just not it.](https://images.mirror-media.xyz/publication-images/Z3yiJzSTaGmqQdaHZroTJ.png?height=1280&width=1280)\n\nIt just did’nt feel right going with the full body at this point, gave pfp style a shot and see how it does. Initially the idea was, we will do pfp collection and in a seperate contract and we will give the holders full body version of their Teddy so they have both and can use it the way they like whether to animate or so with the source file…\n\n![I finally said yes to this one and made a deal with the artist and gave her an upfront amount for her time that we both agreed on. ](https://images.mirror-media.xyz/publication-images/ef-d0SnN5nrZH4EpHIfbn.png?height=1280&width=1280)\n\nThe reason why I paid upfront was because she told me she had financial instability and urgently need of money for rent and expenses so she would’nt be able to work full time on this project and it would take lot longer to complete the collection than what I was expecting. Plus I genuinely wanted to help her regardless of if she would work for the project or not due to her situation.\n\n![My mind, Her skills.](https://images.mirror-media.xyz/publication-images/Q7q8YdENYDP5zDlajLh05.png?height=1280&width=1280)\n\nWe decided to fully render and rigg the collection in the end after all the traits and assets are illustrated and confirmed so that their isn't any confusions and nothing is left out. But unfortunately she died in a car accident 3 days before our launch. I found out about it next day of her death from my friend I was completely devasted but I was more sad for her and her family. I communicated with our community and told them that guys we do not have the collection fully rigged and its in between 2D and 3D so we would have to pause the project for now until we find another artist and see how things go from there. \n\nBut then I was also out of funds because I put everything I had in the project initially. So I communicated this with the community in our discord and 34 people ended up minting 100 regardless of the situation. 10 were minted for team and 1 was minted by me personally to participate in the process just like any other member of community. They knew that mint had zero value and won’t have a secondary market value but yet they still supported. All they asked me was to not quit on my dream and to the challenge to make a come back from this situation. The collection won’t ever be revealed for the respect and honor of our artist. We communicated this with our holders as well and they are okay with it. A small portion of funds from royalties of our new collection will go towards her Family. Here’s the OpenSea link to that collection :\n\n[https://opensea.io/collection/toxicteddyclub](https://opensea.io/collection/toxicteddyclub)\n\nThen after I did an outreach again and managed to find a team of 4 professional 3D artist’s. Their past ventures have involved working with brands like Puma, Bangs and Lulu Lemon. Their Identities are anon as they wish to keep it that way but I have confirmed the veracity of their credentials. When I presented this entire idea and vision of the collection to them, after hearing me they instantly said yes and told be that we’re gonna make the best collection of 2022. We started working on it the same day and even with this team, I worked 1 on 1 with the team over screen shares for every single trait’s and asset’s and outcomes are just fantastic. Look It does’nt matter what people think of it but we do believe it is one of the greatest NFT collections that will ever be deployed on Blockchain. We’ve put our blood, sweat and tears in this collection as a team day in and day out. The collection is timeless & it will age well I can make that one promise for sure. \n\n![This collection is dedicated to someone who does'nt need to own it. ](https://images.mirror-media.xyz/publication-images/wKl-h3xgt9G73xjvxW_7_.png?height=1280&width=1280)\n\nThe story will never have an end to be honest and I am just the captain of the boat as of now but at some point I want to hand the dream over to the community in a position that even if I am not present the story live forever as long as their is imagination left in this world. \n\nBig hug & Thank you for your time and consideration for reading this. I genuinely appreciate your presence here with all my heart. ", "timestamp": 1653240901, "digest": "jXakHBEnxedF5bMQUOTPHsvphMBn1UFjwFtoIfaSDUo", "contributor": "0x8a2ea19fA95e874BE84Fb2B34Fd6099C71aDD8A8"}
{"id": "oMjQ0u-UU1n1GECQKPz5CoeMIF0fozmsbKedme4f11M", "title": "Redéfinir la scalabilité", "body": "*[Initialement publié](https://medium.com/starkware/redefining-scalability-5aa11ffc5880) en anglais par StarkWare le 1 décembre, 2021*\n\n![](https://images.mirror-media.xyz/publication-images/s1QnLNurUtY9KLaR3Gtub.png?height=473&width=1400)\n\n## Redéfinir la scalabilité\n\nLa scalabilité des blockchains a toujours été un sujet brûlant. Presque tous les réseaux blockchain vantent le nombre élevé de transactions par seconde (TPS) comme un argument de vente. Cependant, le TPS n'est pas une mesure valable pour comparer les réseaux blockchain, ce qui rend difficile l'évaluation de leurs performances relatives. De plus, les grands nombres de TPS ont généralement un coût, ce qui pose la question suivante : ces réseaux sont-ils réellement évolutifs ou se contentent-ils d'augmenter leur débit ?\n\nExaminons donc comment définir la scalabilité, quels compromis sont faits pour y parvenir et pourquoi les Validity Rollups constituent la solution la scalabilité par excellence.\n\n### Toutes les transactions ne sont pas égales\n\nTout d'abord, nous devons établir notre affirmation selon laquelle la mesure simple et pratique des TPS ne sont pas une mesure précise de la scalabilité.\n\nPour compenser les nœuds pour l'exécution des transactions (et pour dissuader les utilisateurs de spammer le réseau avec des calculs inutiles), les blockchains facturent des frais proportionnels à la charge de calcul imposée à la blockchain. Dans Ethereum, la complexité de la charge de calcul est mesurée en gas. Le gas étant une mesure très pratique de la complexité des transactions, le terme sera utilisé tout au long de cet article pour les blockchains autres qu'Ethereum, même s'il est généralement spécifique à Ethereum.\n\nLes transactions diffèrent considérablement en termes de complexité et, par conséquent, de quantité de gas qu'elles consomment. Bitcoin, le pionnier des transactions de pair à pair (P2P) trustless, ne prend en charge que le rudimentaire script Bitcoin. Ces simples transferts d'adresse à adresse consomment peu de gas. En revanche, les chaînes de smart contract comme Ethereum ou Solana prennent en charge une machine virtuelle et des langages de programmation complets de Turing qui permettent des transactions beaucoup plus complexes. Par conséquent, les dApps comme Uniswap nécessitent beaucoup plus de gas.\n\nC'est pourquoi il est absurde de comparer les TPS de différentes blockchains. Ce que nous devrions plutôt comparer, c'est la capacité de calcul ou débit.\n\nToutes les blockchains ont une taille de bloc (variable) et un temps de bloc qui déterminent combien d'unités de calcul peuvent être traitées par bloc et à quelle vitesse un nouveau bloc peut être ajouté. Ensemble, ces deux variables déterminent le débit d'une blockchain.\n\n## Qu'est-ce qui limite la scalabilité ?\n\nLes blockchains s'efforcent d'être des réseaux inclusifs et décentralisés au maximum. Pour y parvenir, deux propriétés fondamentales doivent être contrôlées.\n\n### 1. Exigences matérielles\n\nLa décentralisation d'un réseau blockchain est déterminé par la capacité du nœud le plus faible du réseau à vérifier la blockchain et à en conserver l'état. Par conséquent, les coûts de fonctionnement d'un nœud (matériel, bande passante et stockage) doivent être maintenus aussi bas que possible afin de permettre à un maximum d'individus de devenir des participants permissionless au réseau trustless.\n\n### 2. Croissance de l'État\n\nLa croissance de l'état (state growth) fait référence à la vitesse de croissance de la blockchain. Plus le débit d'une blockchain est élevé par unité de temps, plus la blockchain se développe rapidement. Les nœuds complets stockent l'historique du réseau, et ils doivent être en mesure de valider l'état du réseau. L'état d'Ethereum est stocké et référencé à l'aide de structures efficaces telles que des arbres ([arbre de Merkle](https://fr.wikipedia.org/wiki/Arbre_de_Merkle)). Au fur et à mesure que l'état se développe, de nouvelles feuilles et branches sont ajoutées, ce qui rend l'exécution de certaines actions toujours plus complexe et plus longue. Au fur et à mesure que la blockchain s'agrandit, elle empire l’exécution par les nœuds dans le pire des cas, ce qui entraîne un temps toujours plus long pour valider les nouveaux blocs. Au fil du temps, cela augmente également le temps total nécessaire à la synchronisation d'un nœud complet.\n\n## Impacts néfastes de l'augmentation du débit\n\n### 1. Nombre de nœuds\n\nLes exigences minimales pour faire fonctionner un nœud et le nombre de nœuds sont les suivants :\n\n* Bitcoin¹ : 350 Go d'espace disque, connexion 5 Mbit/s, 1 Go de RAM, CPU >1 Ghz. **Nombre de nœuds : \\~10 000**\n* Ethereum² : 500GB+ espace disque SSD, connexion 25 Mbit/s, 4-8GB RAM, CPU 2-4 cores. **Nombre de nœuds : \\~6 000**\n* Solana³ : 1,5 To+ d'espace disque SSD, connexion 300 Mbit/s, 128 Go de RAM, CPU 12+ cœurs. **Nombre de nœuds : \\~1 200**\n\nNotez que plus les exigences en matière de CPU, de bande passante et de stockage pour les nœuds nécessaires au débit d'une blockchain sont élevées, moins il y a de nœuds sur le réseau, ce qui entraîne une décentralisation plus faible et un réseau moins inclusif.\n\n### 2. Temps de synchronisation d'un nœud complet\n\nLorsqu'un nœud fonctionne pour la première fois, il doit se synchroniser avec tous les nœuds existants, télécharger et valider l'état du réseau depuis le bloc de genèse jusqu'à l'extrémité de la chaîne. Ce processus doit être aussi rapide et efficace que possible pour permettre à quiconque d'agir en tant que participant permissionless du protocole.\n\nEn prenant comme indicateur les tests de synchronisation des [nœuds Bitcoin 2020](https://blog.lopp.net/2020-bitcoin-node-performance-tests/) et [2021](https://blog.lopp.net/2021-altcoin-node-sync-tests/) de Jameson Lopp, le tableau 1 compare le temps nécessaire à la synchronisation d'un nœud complet de Bitcoin, d'Ethereum et de Solana sur un PC grand public moyen.\n\n![Tableau 1. Comparaison du débit de la blockchain et de la synchronisation des nœuds](https://images.mirror-media.xyz/publication-images/S0FjQNLqB60bURgiddwGb.png?height=450&width=1400)\n\nLe tableau 1 montre que l'augmentation du débit entraîne des temps de synchronisation plus longs, car de plus en plus de données doivent être traitées et stockées.\n\nBien que des améliorations soient constamment apportées au logiciel des nœuds pour atténuer le défi posé par la croissance de la blockchain (réduction de l'empreinte du disque, vitesses de synchronisation plus rapides, meilleure résistance aux pannes, modularisation de certains composants, etc.\n\n### Comment définir la scalabilité ?\n\nLa scalabilité est le terme le plus mal représenté dans l'espace blockchain. Si l'augmentation du débit est souhaitable, elle n'est qu'une partie du puzzle.\n\n***La scalabilité*** *signifie* ***plus de transactions*** pour le ***même matériel***.\n\nPour cette raison, la scalabilité peut être séparée en deux catégories.\n\n### La scalabilité du séquenceur\n\nLe séquençage décrit l'acte d'ordonner et de traiter les transactions dans un réseau. Comme il a été établi précédemment, toute blockchain pourrait trivialement augmenter son débit en augmentant la taille des blocs et en raccourcissant leur durée jusqu'à un point où l'impact négatif sur sa décentralisation est jugé trop important. Mais le fait d'ajuster ces simples paramètres ne permet pas d'obtenir les améliorations nécessaires. L'EVM d'Ethereum peut, en théorie, [gérer jusqu'à environ 2 000 TPS](https://twitter.com/dankrad/status/1459607325854121989), ce qui est insuffisant pour répondre à la demande d'espace de bloc à long terme. Pour mettre à l'échelle le séquençage, Solana a fait quelques innovations impressionnantes : tirer parti d'un environnement d'exécution parallélisable et d'un mécanisme de consensus astucieux, qui permet un débit bien plus efficace. Mais, malgré ses améliorations, il n'est ni suffisant ni évolutif. À mesure que Solana augmente son débit, les coûts matériels pour faire fonctionner un nœud et traiter les transactions augmentent également.\n\n### Scalabilité de la vérification\n\nLa scalabilité de la vérification décrit des approches qui augmentent le débit sans imposer aux nœuds des coûts matériels toujours plus élevés. Plus précisément, elle fait référence aux innovations cryptographiques telles que les preuves de validité. Elles sont la raison pour laquelle les Validity Rollups peuvent faire évoluer une blockchain de manière durable.\n\n### **Qu'est-ce qu'un Validity Rollup ?**\n\nLes Validity Rollups (également connus sous le nom de \"ZK-Rollups\") déplacent le calcul et le stockage d'état off-chain mais conservent une petite quantité de certaines données on-chain. Un smart contract sur la blockchain sous-jacente maintient la racine de l'état du Rollup. Sur le Rollup, un lot de transactions hautement compressées, ainsi que la racine de l'état actuel, sont envoyés à un Prouveur off-chain. Le Prouveur calcule les transactions, génère une preuve de validité des résultats et de la nouvelle racine d'état, et l'envoie à un Verifieur on-chain. Le vérifieur vérifie la preuve de validité et le smart contract qui maintient l'état du rollup, le met à jour avec le nouvel état fourni par le vérifieur.\n\n### **Comment les Validity Rollup évoluent-ils avec les mêmes exigences matérielles ?**\n\nMême si les Prouveurs nécessitent du matériel haut de gamme, ils n'ont pas d'impact sur la décentralisation d'une blockchain, car la validité des transactions est garantie par des preuves mathématiquement vérifiables.\n\nCe qui importe, ce sont les exigences pour vérifier les preuves. Comme les données impliquées sont hautement compressées et largement abstraites par le calcul, leur impact sur les nœuds de la blockchain sous-jacente est minime.\n\nLes vérifieurs (nœuds Ethereum) n'ont pas besoin de matériel haut de gamme, et la taille des lots n'augmente pas les exigences matérielles. Seules les transitions d'état et une petite quantité de données d'appel doivent être traitées et stockées par les nœuds. Cela permet à tous les nœuds Ethereum de vérifier les lots Validity Rollup en utilisant leur matériel existant.\n\n### **Plus il y a de transactions, moins c'est cher**\n\nDans les blockchains traditionnelles, plus il y a de transactions, plus le coût est élevé pour tout le monde, car l'espace du bloc se remplit et les utilisateurs doivent surenchérir sur le marché des frais pour que leurs transactions soient incluses.\n\nPour un Validity Rollup, cette dynamique est inversée. La vérification d'un lot de transactions sur Ethereum a un certain coût. Au fur et à mesure que le nombre de transactions dans un lot augmente, le coût de vérification du lot augmente à un rythme exponentiellement plus lent. L'ajout d'un plus grand nombre de transactions à un lot entraîne des frais de transaction moins élevés, même si le coût de vérification du lot augmente, car il est amorti sur toutes les transactions du lot. Les modules d'extension de validité veulent qu'un lot contienne le plus grand nombre possible de transactions, afin que les frais de vérification puissent être répartis entre tous les utilisateurs. Au fur et à mesure que la taille du lot augmente jusqu'à l'infini, les frais amortis par transaction convergent vers zéro, c'est-à-dire que plus il y a de transactions dans un Validity Rollup, moins c'est cher pour tout le monde.\n\ndYdX, une dApp alimentée par un Validity Rollup, voit fréquemment des lots de plus de 12 000 transactions. La comparaison de la consommation de gas des mêmes transactions sur le Mainnet et sur un Validity Rollup illustre les gains de scalabilité :\n\nRèglement d'une transaction dYdX sur Ethereum Mainnet : **200 000 gas**\n\nRèglement d'une transaction dYdX sur StarkEx : <**500 gas**\n\nUne autre façon de voir les choses : Le coût principal des Validity Rollups évolue linéairement avec le nombre d'utilisateurs d'un même lot.\n\n### **Pourquoi les Optimistic Rollups ne sont pas aussi scalable qu'on pourrait le penser ?**\n\nEn théorie, les Optimistic Rollups offrent presque les mêmes avantages de scalabilité que les validity rollups. Mais il existe une distinction importante : Les Optimistic Rollups sont optimisés pour le cas moyen, alors que les Validity Rollups sont optimisés pour le cas le plus défavorable. Les systèmes de blockchain fonctionnant dans des conditions extrêmement défavorables, l'optimisation pour le pire des cas est le seul moyen d'assurer la sécurité.\n\nDans le pire cas du **Optimistic Rollups,** les transactions d'un utilisateur ne seront pas vérifiées par les contrôleurs de fraude. Ainsi, pour contester une fraude, l'utilisateur doit synchroniser un nœud complet Ethereum, un nœud complet L2, et calculer lui-même la transaction suspecte.\n\nDans le pire des cas, un utilisateur n'aurait qu'à synchroniser un nœud complet Ethereum pour vérifier la preuve de validité, s'épargnant ainsi la charge de calcul.\n\nContrairement aux Validity Rollups, le coût des Optimistic Rollups s'échelonne linéairement avec le nombre de transactions au lieu du nombre d'utilisateurs, ce qui les rend plus chers.\n\n### **Dernière pièce du puzzle - Accès permissionless à l'état du rollup**\n\nPour garantir la validité des transactions, les utilisateurs doivent exécuter un nœud Ethereum uniquement. Cependant, les utilisateurs et les développeurs peuvent vouloir voir, et exécuter, l'état et l'exécution du Rollup à diverses fins. Un nœud L2 d'indexation répond parfaitement à ce besoin. Non seulement il permet aux utilisateurs de voir les transactions dans le réseau, mais il s'agit également d'une pièce essentielle nécessaire au fonctionnement de l'infrastructure de l'écosystème. Les indexeurs comme The Graph, Alchemy, Infura, les réseaux Oracle comme Chainlink, et les explorateurs de blocs, tous sont entièrement pris en charge par un nœud L2 d'indexation permissionless.\n\n## Conclusion\n\nDe nombreuses approches pour aborder la scalabilité des blockchains se concentrent à tort sur l'augmentation du débit. Mais cela néglige l'impact des débits sur les nœuds : les exigences matérielles toujours croissantes pour traiter les blocs et stocker l'historique du réseau, et la façon dont cela inhibe la décentralisation d'un réseau.\n\nAvec l'avènement de la cryptographie à l'épreuve de la validité, une blockchain peut atteindre **une véritable scalabilité** qui n'impose pas aux nœuds des coûts toujours plus élevés et permet une large décentralisation. Il est désormais possible d'effectuer davantage de transactions avec des calculs plus puissants et plus complexes pour le même matériel, ce qui inverse le dilemme du marché des frais dans le processus plus il y a d'activité sur un Validity Rollup, moins il est cher !\n\n[SwagtimusPrime.eth](https://twitter.com/SwagtimusP?t=pO0L1vGIhuC-ZgWOusQYtA&s=09) and [Louis Guthmann](https://twitter.com/GuthL)\n\n¹ de <https://bitcoin.org/en/bitcoin-core/features/requirements>\n\n² de <https://ethereum.org/en/developers/docs/nodes-and-clients/>\n\n³ de <https://docs.solana.com/running-validator/validator-reqs>\n\n⁴ Fortement simplifié et ajusté pour les tailles moyennes de blocs dynamiques\n\n*Traduction faite par [@Valentin Negro](https://twitter.com/Vngr1)*", "timestamp": 1653240940, "digest": "OwvP9lXT5trVaeaQN5p42AkUn9QLaiCZAumU4S4XmWA", "contributor": "0x568B12eBBE85521D2cd8a2C9B7a8EF3f48aa2d66"}
{"id": "oWp_J9zP0XxpwzCkHLI1wr7LhXE_vOHlKxSQAKrzn5I", "title": "Bitcoin fell below $27000! The money circle leaders suffered heavy losses, and the maximum value decreased by nearly 90%", "body": "Cryptocurrency is still being sold, and bitcoin has fallen to its lowest level since December 2020.\n\nMarket data show that bitcoin has fallen for seven consecutive days - the longest consecutive decline since March 2020. On May 12, bitcoin fell below US $27000 / piece again, and other cryptocurrencies such as Ethereum could not hide the decline. It fell 13% to less than US $1800 / piece, continuing to brush the new low since July last year. Ethereum fell 19.6% in 24 hours. As of press time, Ethereum has fallen by more than 16% to US $1770 / piece.\n\nIn fact, analysts have always regarded $30000 as an important milestone of bitcoin, and many people expect that once it falls below, its decline may accelerate. Technical analysts said bitcoin now needs to hold the $28000 mark, which could trigger a new wave of selling.\n\nRecently, the US stock market has continued to plummet. Some analysts believe that as traditional funds such as hedge funds and family trusts have entered the field of cryptocurrency in the past two years, digital assets have developed more and more synchronously with stocks. Such funds are more likely to sell cryptocurrency assets during market fluctuations.\n\nAt the same time, cryptocurrency has also been hit by the decoupling of stable currency. The stable currency was originally regarded as the least volatile currency in the cryptocurrency world, linked to the value of the currency issued by the government. However, in the past week, ust was decoupled from the US dollar exchange rate twice. The lowest value of UST, which was supposed to be the anchor of US $1, fell to US $0.65, triggering a crisis of confidence and impacting the overall cryptocurrency market.\n\nPreviously, the sister token Luna of ust was once called “coin circle Maotai” by coin circle players. It soared from the lowest point of US $0.12 to US $119.5, with a maximum market value of US $41 billion (about more than 270 billion yuan). Recently, its price once fell below US $2 and its market value once fell to US $1.1 billion.\n\nAccording to the data of on-line masters under okcloud chain, up to now, 43 companies or institutions, including gray-scale investment, hold 1225600 bitcoins. More than $13 billion of bitcoin held by institutions and companies including Tesla has evaporated. Among them, Aker ASA lost US $21.62 million, metu lost US $19.75 million and plunwra lost US $16.95 million, ranking in the top three. In addition, Tesla holds 40900 bitcoins, with an average price of $32000.\n\nAt the same time, the value of investment leaders has also shrunk due to the recent sharp decline. According to the Bloomberg billionaire index, the personal wealth of coinbase founder Brian Armstrong was $13.7 billion in November last year. So far, his wealth has evaporated by about 83% to $2.3 billion.\n\nCHANGPENG Zhao, chief executive of coin security, suffered more losses than Armstrong. According to the Bloomberg billionaire index in January, Zhao CHANGPENG’s personal wealth was $96 billion, which had been reduced to $11.6 billion as of May 11, with an evaporation rate of nearly 90%.", "timestamp": 1653240790, "digest": "URcFj5oYwpD6ozNBQkZu2SIHPlr-d5wYDqokFQHsLRo", "contributor": "0x50BbaEA569F29abd3c0d95e75A09E4f1876c98E4"}
{"id": "W3BkVnrb-U2Uf5hjTnX7iRxCbztWuxx7jfzT7o4PIpY", "title": "2022年中旬", "body": "开始有自己的思路\n\n不要把生活绝大多数时间放在圈子里\n\n这样会影响自己的判断\n\n不被fomo fud 有自己的判断", "timestamp": 1653240811, "digest": "HhW8oJR_KE5URgAfdweTpIjFEFwCzEqkouy6mmWDXi4", "contributor": "0x54059E7917E2B8765f666075facA9aaf72637595"}
{"id": "fvriJzpsiCcLtJt-7DuscjXPP6_AW1HKGYjMWvOU5fE", "title": "The national unified medical insurance information platform was established, effectively covering 400000 designated medical institutions", "body": "PinWan, May 12, according to the people’s daily, after more than two years, the national unified medical security information platform has been basically completed.\n\nAt present, the medical insurance information platform has been launched in 31 provinces and Xinjiang production and Construction Corps, effectively covering about 400000 designated medical institutions and 400000 designated retail pharmacies, providing high-quality medical insurance services for 1.36 billion insured people.\n\nIt is reported that the medical insurance information platform covers 14 subsystems such as payment method, cross provincial and remote medical treatment, public service, bidding and purchase of drugs and medical consumables. At present, it has been successively applied, which can meet the diversified business needs of hundreds of overall planning areas. The new platform has played an important role in remote medical settlement, payment method reform, intelligent supervision of medical insurance, centralized drug procurement, drug price monitoring and other fields. The new platform has complete functions, efficient response and stable operation. The average response time of hospitalization settlement is about 0.8 seconds, which is 3 to 5 times higher than the average performance of the old system.", "timestamp": 1653241083, "digest": "3o2i2-AFijNFHFXi6JDIQir1mFNsBJSZ-TStIgMshNw", "contributor": "0xe85A46783aB77155f58C19093282B98BdCCC2e01"}
{"id": "_JlEEPEaYZYjnl5-Gd_UL4q6sI3g6HDVEUh7t-HQRTA", "title": "On Nowness and Collective Memory", "body": "> “It is obvious to everybody that the phenomena of the world are evidently irreversible. I mean things happen that do not happen the other way. You drop a cup and it breaks, and you can sit there a long time waiting for the pieces to come together and jump back into your hand. If you watch the waves of the sea breaking, you can stand there and wait for the great moment when the foam collects together, rises up out of the sea, and falls back farther out from the shore — it would be very pretty!” - Richard Feynman\n\nWe all have an immediate, almost visceral understanding of the distinction between the past and the future, even from the most mundane experiences. We learn from the past, and we plan for the future. We celebrate, we commemorate, we mourn, and we hope. Yet, as Feynman notes, no one would sit and wait after a long enough time for the cup to come back together.\n\nBut although we so clearly understand the distinction between past and future so many of us spend surprisingly little time thinking about the present - the way we cultivate it and the way we become inspired by it. The more I think about it the more surprising this is, since in a sense there is no period quite so long as right now.\n\nMore than anything else this is because *now* is such a slippery concept in the first place. On the one hand, there is a standard notion of *nowness* we’re all naturally in tune with as we check our calendars, our watches, and our phones. On the other, there’s the time we truly *experience*. In ancient Greek, the distinction between kronos (*chronological, measured time*) and [kairos](https://en.wikipedia.org/wiki/Kairos) (*qualitative, lived time*) helped us better understand what we mean by the present moment. Similarly, in Sanskrit, *[ritu](https://www.wisdomlib.org/definition/ritu#sanskrit)* played a key cultural (and often spiritual) role marking meaningful moments of change.\n\nIn the current day, especially in light of the pandemic, our attention has slowly returned to the concept of lived time as a [subject of analysis](https://www.discovermagazine.com/mind/how-the-coronavirus-pandemic-is-warping-our-sense-of-time). As we all experienced time dilation together, it became more relevant, and in some ways easier for us to pinpoint just how much of an impact new experiences (and hence new memories) can have on our ability to move from one moment to the next.\n\n## Rhythm, Ritual, and Collective Memory\n\nIn every era the way we each individually interpret time comes with collective consequences. As the origins of words like kairos and ritu suggest, there has always been a sense of life and ripeness that comes with a change in environment, and with new experiences.\n\nSimultaneously, there is a sense of punctuation that comes with *ritual* which guides our ability to recollect our collective memory. Rituals are intentional, repeated moments with others or even with ourselves, which somehow, incredibly, cleanse our spirits and create a renewed sense of novelty (and alter our sense of time). But the types of rituals we take part in have changed extensively over time, with the rise and fall variations of social, political, theological / ecclesiastic tradition, and perhaps most importantly with the rise of new technologies.\n\nThese times of change in ritual haven’t been left unexplored. The ethnographer Arnold van Gennep, anthropologist Victor Turner, and even the psychologist Carl Jung all touched on the notion of liminal phases in which changes in rituals and customs occur – another kind of collective present. Today, people might like to call these changes [vibe shifts](https://www.thecut.com/2022/02/a-vibe-shift-is-coming.html).\n\nWith the ever increasing pace of technology, these shifts are occurring faster than ever. With the introduction of the [printing press](https://fs.blog/memory-printing-press/), we moved from spoken words held in memory to books as the main store of human knowledge.\n\nAs Marshall McLuhan noted, computers, connected via the internet, have further complicated the way we remember and the way we flow through time. Especially in the modern day, we’re constantly bouncing between algorithmically generated and distributed narratives that lack the same weight, the same auras as those that we collectively imagined together.\n\nIt’s no surprise then that the idea of [lore](https://twitter.com/rafathebuilder/status/1503415155975204864) has resurfaced. But perhaps the most important questions remain unasked: namely, what actions can we take to collectively maintain it?\n\nThere are many answers to this question, and I’m not even certain there’s a right one, but it certainly feels like we need new forms of ritual that we can enact together to draw ourselves back to [intentionality](https://scott.mirror.xyz/U8aWHSX_HHHYcN1GvbTcBnZbAR7eNeJ_61WIOuSguF8); to regain a sense of focus and in turn a sense of true belonging.\n\nExploring these rituals, however, can’t be done in writing. It can’t be done between a writer and an audience. It has to be done together.\n\n*Thanks as always to Andy Tudhope, David Phelps, and Vivek Singh for graciously reviewing this draft. Please note, this draft will likely change over time as I update my thinking and continue to add more depth and context. Feel free to check back soon!*", "timestamp": 1653241200, "digest": "7BUcgznodOW5B8yITMsc1gTOmkeNjgOFwGgYfrN6jWc", "contributor": "0x48A63097E1Ac123b1f5A8bbfFafA4afa8192FaB0"}
{"id": "MUCciHkwEGQiXX9WzteecbxnP8m4xbp8sBoyP8-TtHU", "title": "Redéfinir la scalabilité", "body": "*[Initialement publié](https://medium.com/starkware/redefining-scalability-5aa11ffc5880) en anglais par StarkWare le 1 décembre, 2021*\n\n![](https://images.mirror-media.xyz/publication-images/s1QnLNurUtY9KLaR3Gtub.png?height=473&width=1400)\n\n## Redéfinir la scalabilité\n\nLa scalabilité des blockchains a toujours été un sujet brûlant. Presque tous les réseaux blockchain vantent le nombre élevé de transactions par seconde (TPS) comme un argument de vente. Cependant, le TPS n'est pas une mesure valable pour comparer les réseaux blockchain, ce qui rend difficile l'évaluation de leurs performances relatives. De plus, les grands nombres de TPS ont généralement un coût, ce qui pose la question suivante : ces réseaux sont-ils réellement évolutifs ou se contentent-ils d'augmenter leur débit ?\n\nExaminons donc comment définir la scalabilité, quels compromis sont faits pour y parvenir et pourquoi les Validity Rollups constituent la solution la scalabilité par excellence.\n\n### Toutes les transactions ne sont pas égales\n\nTout d'abord, nous devons établir notre affirmation selon laquelle la mesure simple et pratique des TPS ne sont pas une mesure précise de la scalabilité.\n\nPour compenser les nœuds pour l'exécution des transactions (et pour dissuader les utilisateurs de spammer le réseau avec des calculs inutiles), les blockchains facturent des frais proportionnels à la charge de calcul imposée à la blockchain. Dans Ethereum, la complexité de la charge de calcul est mesurée en gas. Le gas étant une mesure très pratique de la complexité des transactions, le terme sera utilisé tout au long de cet article pour les blockchains autres qu'Ethereum, même s'il est généralement spécifique à Ethereum.\n\nLes transactions diffèrent considérablement en termes de complexité et, par conséquent, de quantité de gas qu'elles consomment. Bitcoin, le pionnier des transactions de pair à pair (P2P) trustless, ne prend en charge que le rudimentaire script Bitcoin. Ces simples transferts d'adresse à adresse consomment peu de gas. En revanche, les chaînes de smart contract comme Ethereum ou Solana prennent en charge une machine virtuelle et des langages de programmation complets de Turing qui permettent des transactions beaucoup plus complexes. Par conséquent, les dApps comme Uniswap nécessitent beaucoup plus de gas.\n\nC'est pourquoi il est absurde de comparer les TPS de différentes blockchains. Ce que nous devrions plutôt comparer, c'est la capacité de calcul ou débit.\n\nToutes les blockchains ont une taille de bloc (variable) et un temps de bloc qui déterminent combien d'unités de calcul peuvent être traitées par bloc et à quelle vitesse un nouveau bloc peut être ajouté. Ensemble, ces deux variables déterminent le débit d'une blockchain.\n\n## Qu'est-ce qui limite la scalabilité ?\n\nLes blockchains s'efforcent d'être des réseaux inclusifs et décentralisés au maximum. Pour y parvenir, deux propriétés fondamentales doivent être contrôlées.\n\n### 1. Exigences matérielles\n\nLa décentralisation d'un réseau blockchain est déterminé par la capacité du nœud le plus faible du réseau à vérifier la blockchain et à en conserver l'état. Par conséquent, les coûts de fonctionnement d'un nœud (matériel, bande passante et stockage) doivent être maintenus aussi bas que possible afin de permettre à un maximum d'individus de devenir des participants permissionless au réseau trustless.\n\n### 2. Croissance de l'État\n\nLa croissance de l'état (state growth) fait référence à la vitesse de croissance de la blockchain. Plus le débit d'une blockchain est élevé par unité de temps, plus la blockchain se développe rapidement. Les nœuds complets stockent l'historique du réseau, et ils doivent être en mesure de valider l'état du réseau. L'état d'Ethereum est stocké et référencé à l'aide de structures efficaces telles que des arbres ([arbre de Merkle](https://fr.wikipedia.org/wiki/Arbre_de_Merkle)). Au fur et à mesure que l'état se développe, de nouvelles feuilles et branches sont ajoutées, ce qui rend l'exécution de certaines actions toujours plus complexe et plus longue. Au fur et à mesure que la blockchain s'agrandit, elle empire l’exécution par les nœuds dans le pire des cas, ce qui entraîne un temps toujours plus long pour valider les nouveaux blocs. Au fil du temps, cela augmente également le temps total nécessaire à la synchronisation d'un nœud complet.\n\n## Impacts néfastes de l'augmentation du débit\n\n### 1. Nombre de nœuds\n\nLes exigences minimales pour faire fonctionner un nœud et le nombre de nœuds sont les suivants :\n\n* Bitcoin¹ : 350 Go d'espace disque, connexion 5 Mbit/s, 1 Go de RAM, CPU >1 Ghz. **Nombre de nœuds : \\~10 000**\n* Ethereum² : 500GB+ espace disque SSD, connexion 25 Mbit/s, 4-8GB RAM, CPU 2-4 cores. **Nombre de nœuds : \\~6 000**\n* Solana³ : 1,5 To+ d'espace disque SSD, connexion 300 Mbit/s, 128 Go de RAM, CPU 12+ cœurs. **Nombre de nœuds : \\~1 200**\n\nNotez que plus les exigences en matière de CPU, de bande passante et de stockage pour les nœuds nécessaires au débit d'une blockchain sont élevées, moins il y a de nœuds sur le réseau, ce qui entraîne une décentralisation plus faible et un réseau moins inclusif.\n\n### 2. Temps de synchronisation d'un nœud complet\n\nLorsqu'un nœud fonctionne pour la première fois, il doit se synchroniser avec tous les nœuds existants, télécharger et valider l'état du réseau depuis le bloc de genèse jusqu'à l'extrémité de la chaîne. Ce processus doit être aussi rapide et efficace que possible pour permettre à quiconque d'agir en tant que participant permissionless du protocole.\n\nEn prenant comme indicateur les tests de synchronisation des [nœuds Bitcoin 2020](https://blog.lopp.net/2020-bitcoin-node-performance-tests/) et [2021](https://blog.lopp.net/2021-altcoin-node-sync-tests/) de Jameson Lopp, le tableau 1 compare le temps nécessaire à la synchronisation d'un nœud complet de Bitcoin, d'Ethereum et de Solana sur un PC grand public moyen.\n\n![Tableau 1. Comparaison du débit de la blockchain et de la synchronisation des nœuds](https://images.mirror-media.xyz/publication-images/S0FjQNLqB60bURgiddwGb.png?height=450&width=1400)\n\nLe tableau 1 montre que l'augmentation du débit entraîne des temps de synchronisation plus longs, car de plus en plus de données doivent être traitées et stockées.\n\nBien que des améliorations soient constamment apportées au logiciel des nœuds pour atténuer le défi posé par la croissance de la blockchain (réduction de l'empreinte du disque, vitesses de synchronisation plus rapides, meilleure résistance aux pannes, modularisation de certains composants, etc.\n\n### Comment définir la scalabilité ?\n\nLa scalabilité est le terme le plus mal représenté dans l'espace blockchain. Si l'augmentation du débit est souhaitable, elle n'est qu'une partie du puzzle.\n\n***La scalabilité*** *signifie* ***plus de transactions*** pour le ***même matériel***.\n\nPour cette raison, la scalabilité peut être séparée en deux catégories.\n\n### La scalabilité du séquenceur\n\nLe séquençage décrit l'acte d'ordonner et de traiter les transactions dans un réseau. Comme il a été établi précédemment, toute blockchain pourrait trivialement augmenter son débit en augmentant la taille des blocs et en raccourcissant leur durée jusqu'à un point où l'impact négatif sur sa décentralisation est jugé trop important. Mais le fait d'ajuster ces simples paramètres ne permet pas d'obtenir les améliorations nécessaires. L'EVM d'Ethereum peut, en théorie, [gérer jusqu'à environ 2 000 TPS](https://twitter.com/dankrad/status/1459607325854121989), ce qui est insuffisant pour répondre à la demande d'espace de bloc à long terme. Pour mettre à l'échelle le séquençage, Solana a fait quelques innovations impressionnantes : tirer parti d'un environnement d'exécution parallélisable et d'un mécanisme de consensus astucieux, qui permet un débit bien plus efficace. Mais, malgré ses améliorations, il n'est ni suffisant ni évolutif. À mesure que Solana augmente son débit, les coûts matériels pour faire fonctionner un nœud et traiter les transactions augmentent également.\n\n### Scalabilité de la vérification\n\nLa scalabilité de la vérification décrit des approches qui augmentent le débit sans imposer aux nœuds des coûts matériels toujours plus élevés. Plus précisément, elle fait référence aux innovations cryptographiques telles que les preuves de validité. Elles sont la raison pour laquelle les Validity Rollups peuvent faire évoluer une blockchain de manière durable.\n\n### **Qu'est-ce qu'un Validity Rollup ?**\n\nLes Validity Rollups (également connus sous le nom de \"ZK-Rollups\") déplacent le calcul et le stockage d'état off-chain mais conservent une petite quantité de certaines données on-chain. Un smart contract sur la blockchain sous-jacente maintient la racine de l'état du Rollup. Sur le Rollup, un lot de transactions hautement compressées, ainsi que la racine de l'état actuel, sont envoyés à un Prouveur off-chain. Le Prouveur calcule les transactions, génère une preuve de validité des résultats et de la nouvelle racine d'état, et l'envoie à un Verifieur on-chain. Le vérifieur vérifie la preuve de validité et le smart contract qui maintient l'état du rollup, le met à jour avec le nouvel état fourni par le vérifieur.\n\n### **Comment les Validity Rollup évoluent-ils avec les mêmes exigences matérielles ?**\n\nMême si les Prouveurs nécessitent du matériel haut de gamme, ils n'ont pas d'impact sur la décentralisation d'une blockchain, car la validité des transactions est garantie par des preuves mathématiquement vérifiables.\n\nCe qui importe, ce sont les exigences pour vérifier les preuves. Comme les données impliquées sont hautement compressées et largement abstraites par le calcul, leur impact sur les nœuds de la blockchain sous-jacente est minime.\n\nLes vérifieurs (nœuds Ethereum) n'ont pas besoin de matériel haut de gamme, et la taille des lots n'augmente pas les exigences matérielles. Seules les transitions d'état et une petite quantité de données d'appel doivent être traitées et stockées par les nœuds. Cela permet à tous les nœuds Ethereum de vérifier les lots Validity Rollup en utilisant leur matériel existant.\n\n### **Plus il y a de transactions, moins c'est cher**\n\nDans les blockchains traditionnelles, plus il y a de transactions, plus le coût est élevé pour tout le monde, car l'espace du bloc se remplit et les utilisateurs doivent surenchérir sur le marché des frais pour que leurs transactions soient incluses.\n\nPour un Validity Rollup, cette dynamique est inversée. La vérification d'un lot de transactions sur Ethereum a un certain coût. Au fur et à mesure que le nombre de transactions dans un lot augmente, le coût de vérification du lot augmente à un rythme exponentiellement plus lent. L'ajout d'un plus grand nombre de transactions à un lot entraîne des frais de transaction moins élevés, même si le coût de vérification du lot augmente, car il est amorti sur toutes les transactions du lot. Les modules d'extension de validité veulent qu'un lot contienne le plus grand nombre possible de transactions, afin que les frais de vérification puissent être répartis entre tous les utilisateurs. Au fur et à mesure que la taille du lot augmente jusqu'à l'infini, les frais amortis par transaction convergent vers zéro, c'est-à-dire que plus il y a de transactions dans un Validity Rollup, moins c'est cher pour tout le monde.\n\ndYdX, une dApp alimentée par un Validity Rollup, voit fréquemment des lots de plus de 12 000 transactions. La comparaison de la consommation de gas des mêmes transactions sur le Mainnet et sur un Validity Rollup illustre les gains de scalabilité :\n\nRèglement d'une transaction dYdX sur Ethereum Mainnet : **200 000 gas**\n\nRèglement d'une transaction dYdX sur StarkEx : <**500 gas**\n\nUne autre façon de voir les choses : Le coût principal des Validity Rollups évolue linéairement avec le nombre d'utilisateurs d'un même lot.\n\n### **Pourquoi les Optimistic Rollups ne sont pas aussi scalable qu'on pourrait le penser ?**\n\nEn théorie, les Optimistic Rollups offrent presque les mêmes avantages de scalabilité que les validity rollups. Mais il existe une distinction importante : Les Optimistic Rollups sont optimisés pour le cas moyen, alors que les Validity Rollups sont optimisés pour le cas le plus défavorable. Les systèmes de blockchain fonctionnant dans des conditions extrêmement défavorables, l'optimisation pour le pire des cas est le seul moyen d'assurer la sécurité.\n\nDans le pire cas du **Optimistic Rollups,** les transactions d'un utilisateur ne seront pas vérifiées par les contrôleurs de fraude. Ainsi, pour contester une fraude, l'utilisateur doit synchroniser un nœud complet Ethereum, un nœud complet L2, et calculer lui-même la transaction suspecte.\n\nDans le pire des cas, un utilisateur n'aurait qu'à synchroniser un nœud complet Ethereum pour vérifier la preuve de validité, s'épargnant ainsi la charge de calcul.\n\nContrairement aux Validity Rollups, le coût des Optimistic Rollups s'échelonne linéairement avec le nombre de transactions au lieu du nombre d'utilisateurs, ce qui les rend plus chers.\n\n### **Dernière pièce du puzzle - Accès permissionless à l'état du rollup**\n\nPour garantir la validité des transactions, les utilisateurs doivent exécuter un nœud Ethereum uniquement. Cependant, les utilisateurs et les développeurs peuvent vouloir voir, et exécuter, l'état et l'exécution du Rollup à diverses fins. Un nœud L2 d'indexation répond parfaitement à ce besoin. Non seulement il permet aux utilisateurs de voir les transactions dans le réseau, mais il s'agit également d'une pièce essentielle nécessaire au fonctionnement de l'infrastructure de l'écosystème. Les indexeurs comme The Graph, Alchemy, Infura, les réseaux Oracle comme Chainlink, et les explorateurs de blocs, tous sont entièrement pris en charge par un nœud L2 d'indexation permissionless.\n\n## Conclusion\n\nDe nombreuses approches pour aborder la scalabilité des blockchains se concentrent à tort sur l'augmentation du débit. Mais cela néglige l'impact des débits sur les nœuds : les exigences matérielles toujours croissantes pour traiter les blocs et stocker l'historique du réseau, et la façon dont cela inhibe la décentralisation d'un réseau.\n\nAvec l'avènement de la cryptographie à l'épreuve de la validité, une blockchain peut atteindre **une véritable scalabilité** qui n'impose pas aux nœuds des coûts toujours plus élevés et permet une large décentralisation. Il est désormais possible d'effectuer davantage de transactions avec des calculs plus puissants et plus complexes pour le même matériel, ce qui inverse le dilemme du marché des frais dans le processus plus il y a d'activité sur un Validity Rollup, moins il est cher !\n\n[SwagtimusPrime.eth](https://twitter.com/SwagtimusP?t=pO0L1vGIhuC-ZgWOusQYtA&s=09) et [Louis Guthmann](https://twitter.com/GuthL)\n\n¹ de <https://bitcoin.org/en/bitcoin-core/features/requirements>\n\n² de <https://ethereum.org/en/developers/docs/nodes-and-clients/>\n\n³ de <https://docs.solana.com/running-validator/validator-reqs>\n\n⁴ Fortement simplifié et ajusté pour les tailles moyennes de blocs dynamiques\n\n*Traduction faite par [@Valentin Negro](https://twitter.com/Vngr1)*", "timestamp": 1653241218, "digest": "OwvP9lXT5trVaeaQN5p42AkUn9QLaiCZAumU4S4XmWA", "contributor": "0x568B12eBBE85521D2cd8a2C9B7a8EF3f48aa2d66"}
{"id": "zJpE8OHVx55v9gJWZ_9K9MVL0frct99xEWC7sVtc22A", "title": "Beijing Badachu Park was temporarily closed from May 13 to 15", "body": "Beijing news according to the official wechat of Badachu Park in Beijing, Badachu Park will be temporarily closed from May 13 to May 15 according to the latest requirements for epidemic prevention and control in Beijing.\n\nThank you for your understanding and cooperation!\n\nWarm tips: the park tickets purchased through the official account platform will be refunded according to the original channel. Please understand the inconvenience caused to your travel.\n\nBeijing Badachu Park Management Office\n\nMay 12, 2022", "timestamp": 1653241138, "digest": "_rqVpQ9FKXObg7cUy9lPx9Nir87qIh4uilaBztC96ow", "contributor": "0x1963c18F1bc892F2582686783224dF7b7017F958"}
{"id": "zOua3d8dTXEkPSMIOOZ13EYJbWwi2v80nZWTpSr1huI", "title": "Daily thoughts...", "body": "12 Gwei gas trends, nothing is happening on chain. Perfect time to enjoy nature and go offline… ", "timestamp": 1653241107, "digest": "hVEFPF5-Md90bR6y7w2IuKS19G-j8ggcOjKj4J1tHOI", "contributor": "0xE80B8ae6C98e66eE6995f547cd425a29086F9259"}
{"id": "rPBNfJQ1QAgTwWJsofVA7RXpd3zI1Z9Z64Nb5lmh4Qk", "title": "Can roast + complaining solve the problem? CBA signboards need to be jointly maintained", "body": "In the ninth round of CBA League, in a focus duel between Liaoning and Shanxi, the scores of the two teams have been completely opened in the second half, and the game has lost suspense early. However, Guo Allen, a player of Liaoning team, complained that the referee was expelled after an attack, which has become the focus of the game.\n\nAfter the game, Guo Allen directly made a comment on social media, “I can’t understand. It’s a joke. I’ll play games. Bye.”\n\nComments about referees and players spread all over the comment area. Soon after, the topic of “Guo Allen was expelled” rushed to the microblog hot search, and it still topped the list hot search this morning. It can be seen that everyone’s attention to this matter is far more than the game itself.\n\nFrom the perspective of slow motion, Aaron Guo’s layup was indeed suspected of being violated, but the referee could not guarantee that every penalty would be foolproof for other objective reasons such as angle on the court. We can only maximize the fairness of the players of the two teams, not to mention the uncertainty of competitive sports is also an attractive factor.\n\nOf course, Aaron Guo’s complaint has his reasons, but his improper speech directly led him to two consecutive technical fouls and was finally expelled. For Guo Allen, it’s natural that some dumb people have a hard feeling of eating Coptis chinensis. They themselves suffer a loss. They find the referee to reason, but they suffer again.\n\nAs a player, respect the rules and face up to the problems. Even if you suffer a loss on the court, you can go through the appeal channel and ask the relevant departments to watch the video. If you compete directly with the referee on the court, the irrational athlete will naturally become the object of punishment. He will be wronged himself, which will only make him more embarrassed.\n\nAfter Aaron Guo was expelled, I believe the CBA alliance will not turn a blind eye to his words on social media. According to the ticket issued by CBA League this season, Aaron Guo may be fined or even suspended.\n\nIn the match between Guangzhou and Jilin this week, Guangzhou head coach Guo Shiqiang was directly suspended for five games and fined 20000 yuan because he complained about the referee and made a scene on the technical stage. Zhao Rui was suspended for one match and fined 50000 yuan for judging with his fingers and using insulting language. These two tickets related to referees can be seen from a certain extent that the CBA alliance is protecting referees and strictly implementing the rules. Of course, the protection of referees is not biased. There are major omissions and misjudgments, and CBA also has a corresponding punishment mechanism for referees. For example, the referees and technical representatives of law enforcement Guangzhou and Jilin have been criticized internally, and there is even news that they have been suspended.\n\nAlthough referees often become the object of roast, people should communicate or appeal in appropriate ways. Blindly pushing the referee to the commanding height of public opinion will only make everyone watch the game with colored glasses and can’t appreciate the charm of competitive sports itself.\n\nOf course, the remarks made by Liaoning team head coach Yang Ming at the post game press conference are worth praising for him. As the coach of the team and the coach of Aaron Guo, he apologized to the outside world for his players in front of the media. “The only deficiency is that Allen apologized to everyone and the referee through the media lens. (Guo Allen) the team will summarize the complaints about the referee’s decision, and strive for the coaching team to master the field environment and the scale of the referee’s decision in the future, so as not to make similar mistakes.” Yang Ming’s remarks set a good example for the whole team and even the whole league.\n\nUnder the background of the epidemic, CBA League has always been forging ahead and continuing the closed management of the tournament system. It is very difficult for 20 teams, including the referees. When the CBA League is in trouble, we need to work together to maintain the image of the league. Superstars, CBA League and fans are duty bound to work together to overcome difficulties and create a better environment for the CBA League.", "timestamp": 1653241471, "digest": "MvchtL0K7JdHYg3PAiFK7SvGq73X2FUulwe2RNjuTzA", "contributor": "0x2eC42C830Ed1356983C3818DFf57B51C4b60bbe9"}
{"id": "3uEv8Ewj-PG7gJasmJ0aBy1LiK0YG2F2CL1BVDCPm1E", "title": "The auto market falls into recession, and the repair must grasp three key points", "body": "The supply chain crisis, accompanied by the conversion of popular models, jointly led to the decline of the car market in early 2022. After the market has identified the new hot spot of “new energy + economic models”, whether several star products can be born in the second quarter to stimulate the rapid recovery of the market has become the key to whether China’s auto market can maintain growth or at least avoid a serious recession in 2022.\n\nWen Yinlu editor mark\n\nThe passenger car market joint conference (hereinafter referred to as the passenger car Association), China Automobile Industry Association and China Automobile Circulation Association have successively released the key operation data of China’s automobile market in April 2022 in the past few days. The data performance is expected to be very depressed. In addition, more than expected, not only the production end is seriously damaged, but also the sales end data is obviously weak, and the production and sales ends are under pressure. The second quarter of this year has become a key window period for the repair of the automobile market.\n\nAfter in-depth communication with many OEMs and dealers, Caijing eleven believes that there are three key points to repair the car market:\n\n 1. Dredge the capillaries of the supply chain.\n 2. 2. It is urgent to bail out dealers.\n 3. 3. The integration of car enterprises follows the hot spot transformation of the car market.\n 4. Supply chain repair more difficult than expected\n 5. The impact of this round of epidemic on automobile production is comparable to that when the epidemic just broke out in 2020. According to the data released by the passenger Federation, 969000 passenger cars were produced in April, down 41.1% year-on-year and 46.8% month on month, which is under great pressure. The last time the monthly output of passenger cars was less than one million was in February and March 2020, 208000 and 975000 respectively.\n 6. The decline rates of production at different levels are as follows: luxury brands decreased by 57% year-on-year and 43% month on month; Joint venture brands decreased by 56% year-on-year and 58% month on month; Independent brands decreased by 20% year-on-year and 38% month on month. The biggest reason for the decline of joint venture brands is that many car companies are located in Shanghai and Changchun, which are seriously affected by the epidemic. In April, the production of five major automobile enterprises in Shanghai decreased by 75% month on month compared with March, the production of joint venture major automobile enterprises in Changchun decreased by 54% month on month, and the overall decline in other regions was 38%.\n 7. The supply chain crisis has led to more than one million production cuts. After entering may, although the situation has improved, the impact is still not optimistic. Changchun has basically completed the restoration of production order, but there are many difficulties in resuming production in Shanghai. The automobile supply chain is very long. It is difficult to cover all key enterprises in the supply chain through the permission of the white list.\n 8. Chen Yudong, President of Bosch China, said that although the two batches of white lists released in Shanghai have covered more than 2000 enterprises, and most of the first-class suppliers of Bosch and Bosch are in the “white list”, the suppliers of Bosch suppliers are not necessarily in the “white list”, and the supply chain cannot form a chain, so products cannot be produced in the end.\n 9. For example, Chen Yudong said, “we have a coating supplier. The company is in Shanghai and the scale is very small. In this case, it is difficult to resume work, but if the supplier does not resume work, it will affect the production of the whole chain. In the later stage, we also helped the company resume work through various coordination.”\n10. The madness of competing for upstream supply is also affecting the progress of resumption of production. At present, the supply capacity of upstream suppliers is very limited. When competing for the supply of goods, there are even buyers blocking the door with cash. As long as there are goods, the buyer will take care of them all. This gave birth to a phenomenon. One of the two enterprises grabbed part a and the other grabbed Part B. as a result, the two enterprises didn’t spend less money, but the parts were still incomplete and could not resume production smoothly.\n11. Logistics and accessories are the two major problems faced by the current auto enterprises. If these problems are not solved, even if the workers can return to their posts smoothly, they will face the situation of no work to start. From April 18 to the end of the month, there are 11 working days. SAIC passenger car port base produced more than 2400 vehicles in April and Tesla produced 10757 vehicles in April, both of which are less than half of the normal production capacity. Chen Yudong also confirmed that although Bosch’s factories are in production and operation, the degree of capacity recovery is not optimistic. On the whole, the degree of capacity recovery is about 30% - 75%.\n12. Although the repair road of the whole automobile supply chain is blocked and long, the trend is obviously improving. Cui Dongshu, Secretary General of the Federation, revealed at the sales data release and communication meeting on May 10 that the delivery data in the first week of May had been significantly improved compared with the last week of April. With the continuous improvement of epidemic control in Shanghai, the repair of supply chain will be significantly accelerated. At present, compared with the difficulties of vehicle manufacturers, the plight of dealers in direct contact with consumers needs more attention.\n13. Dealers are more difficult than vehicle manufacturers\n14. The difficulties of vehicle manufacturers have become the focus of the whole society, but the difficulties of dealers have not been paid enough attention. According to the data released by China Automobile Circulation Association, among the 94 City samples surveyed, dealers in 34 cities have closed their stores due to epidemic prevention and control, mostly in first tier cities. More than 60% of the dealers who closed their stores for more than a week. Most dealers said they could not complete the sales task of the current month. More than 70% of dealers with a completion rate of less than 70% and more than 40% of dealers with a completion rate of less than half. At present, some car enterprises have reduced the task assessment indicators for dealers.\n15. Key data reflect the severity of the problem. At present, the dealer’s inventory coefficient (inventory coefficient = ending inventory / current sales volume) is 1.91, which is the highest value since March 2020. From February to April this year, the inventory coefficients are 1.85, 1.75 and 1.91 respectively, significantly exceeding the boom and bust line of 1.50, and increasing year-on-year for three consecutive months.\n16. Source: China Automobile Circulation Association\n17. According to the analysis of the passenger Association, the proportion of in transit inventory has increased, and the production of some popular models is in shortage, resulting in the mismatch of supply and demand structure and great difficulty in adjustment; The lack of retail increment of popular models also makes the inventory coefficient falsely high.\n18. However, the false high coefficient does not mean that the damage to dealers is false. The dealer inventory early warning index released by China Automobile Circulation Association in April was 66.4%, while the rise and fall line of this index was 50%. The early warning index in April was the highest value since February 2020, and the early warning index has risen continuously since February 2022. Unlike the inventory coefficient, which only calculates a single index, the early warning index integrates the total demand of the automobile market, the customer volume of 4S stores, the transaction rate, price changes and sales changes\n19. ", "timestamp": 1653241551, "digest": "v2_Z1l9jBr__JY4njwpJScLMEPwpyIGNenqcNJHVz8o", "contributor": "0x63572E6fDEBABF055aC591891088b45E4CcfbC80"}
{"id": "Khem5wcUzM1ZVWmJKtRaBZu5dHidsoeFEyT7UNDRU7Q", "title": "Building Web3 Worlds to provoke future realities into existence. ", "body": "**Web3 has become a future reality system. The community can create any World that can be prototyped.**\n\nThe idea that web3 can inform the design of a better tomorrow, and that the Web3 community is a disrupting force that can provoke better societies into existence is a powerful one to explore, envision, and question. If proven true then it is a movement.\n\n**Web3 systems can provoke themselves into existence**\n\n\"Web3 has stunned the world by forging a parallel system of finance of unprecedented flexibility and creativity in less than a decade.\" This demonstrates that within the online bubble of the internet \"Web3 systems can provoke themselves into existence\". This is largely true because social consensus and economic incentives are embedded into their design and enforced at deployment. \n\n**Can we design and build cyber-physical systems to capitalize on the promise of Web3 and provoke a better future?**\n\nThis promising transformational power, if indeed exists, remains unused in large-scale constructs that bridge the cyber and physical worlds such as private cities, because it is too complex and daunting for anyone to tackle alone. \n\nIn one aspect this is because web3 technology is a stack of abstract protocols that makes it very difficult for technical and non-technical users to imagine future realities and alternative worlds that may become available to us by hierarchical assemblies of lego-code blocks. \n\n**Is there a need for a decentralized agency to design, research, and prototype future realities?**\n\nIn this era of unprecedented change, no single team or organization can begin to design unexpected solutions that disrupt conventional thinking without deep collaboration between ecosystem players, communities, and local governance. The fact that there is no easy way to imagine future worlds build with this futuristic technologies, the uncertainty, and other factors are limiting the potential of society to use Web3 in full force. As an example we bring the potential of a Web3 city of 5 M people that could generate an annual product of five hundred Million Ether the equivalent of one Trillion USD.\n\n**Why the Web3 community needs World Building Prototyping?**\n\nWeb3 Synthetic Worlds provides the opportunity for a unique and unparallel experimental environment to: design, prototype, and test complex \\[socio-economic and political \\] systems of regional scale. In doing so, they allow us to not just tinker with the status quo, but to dismantle it and build something better in its place. \n\nBy prototyping projective futures we can show people that other realities are possible and that web3 can help us get there. If we can show that web3 can help to create a brighter future and we map the path to it, many of us will all rush towards that outcome. \n\n**What kind of a decentralized design agency do we imagine?**\n\nThis design initiative finds it attractive to follow an approach modeled as an agency that works on behalf of the Web3 community and ecosystem to help envision the potential of Web3 to its fullest extent through prototyping new worlds that we haven't seen before. This d.agency, is coming together to work with the community to drive the future of Web3 and help put the community at the center of this movement. \n\nThe success of this experiment is based on our ability to create value for citizens and society. Providing a way to align incentives to attract participation and share the benefits of future outcomes is central to our vision for fairness and justice.\n\n\\[This is a draft, a living document. It will be updated and edited often\\]", "timestamp": 1653241553, "digest": "AaveFvFY7e8jEnrDljjXQF9kAAqu8tRkf8qHyANoWYs", "contributor": "0x427759bFe7b72E06eC6c8a4DA9AB1994F8315A29"}
{"id": "VYtztVIYBariJT3ACrqqBhvt50HfXElo3EKdgqUWi-k", "title": "Revoland: ", "body": "# 1. 项目概述\n\nRevoland是一款基于BNB Chain的GameFi项目**。**\n\n在游戏中玩家需要在自己的英雄池挑选要使用的英雄组成队伍与其他玩家展开战斗，从而获得游戏代币奖励。当前已知的游戏模式包括：PVP（1V1和3V3，1v1中每个玩家需使用自己的3名英雄组成队伍，3V3中则每名玩家只需挑选一名英雄）和PVE（单人挑战BOSS）。\n\n项目使用双代币模型，游戏治理代币REVO和游戏内奖励代币LAND。\n\n# 2. 游戏模式\n\n**2.1 游戏玩法**\n\n不同于Axie的回合制战斗模式，Revoland使用即时对战的类似王者荣耀的战斗模式，大大提高了游戏的可玩性和玩家的可操作性。游戏中共设定了六种游戏模式，四种团队作战，两种单人作战。从演示视频来看，已知的玩法包括：\n\n1\\.大逃杀：玩家需要面对源源不断的系统AI的攻击，控制自己英雄拾取道具以壮大自己的队伍，在有限的地图内坚持的时间越久则获得的奖励越多。\n\n2\\.PVP-抢水果：通过攻击对方英雄以获取敌方英雄掉落的水果，并将其搬运回自己的营地，水果获得多的一方获胜。\n\n3\\.PVP-占点：占据地图中心节点时间越久的队伍获胜。\n\n4\\.PVE：挑战敌方BOSS，有TPS（第三人称射击）和RPG（角色扮演游戏）两类。\n\n**2.2 人物系统**\n\n在开始游戏前，玩家可获得由官方提供的三名免费英雄来进入游戏（因此游戏本身无进入门槛），同样也可在游戏商城购买NFT宝箱来获取英雄。英雄分为普通、稀有和史诗三个等级，不同等级的英雄会提供不同的代币奖励和属性加成。除此以外，玩家还可获得英雄的皮肤和自己的宠物。皮肤的稀有度除影响特效和外观以外，还会影响游戏代币奖励，皮肤可在NFT市场开盲盒获得。宠物则会为英雄提供一定程度的属性加成和特殊能力，同样在NFT市场开盲盒获得。\n\n**2.3 代币经济学**\n\n游戏使用双代币模型：\n\n原生代币$REVO：REVO主要用于生态治理，包括但不限于用于筹划电竞比赛、用作大型赛事奖池、社区投票和生态贡献奖励，总供应量为120,000,000枚。\n\n游戏代币$LAND：玩家在游戏内获得奖励的主要载体，可用于英雄和皮肤的升级等，总供应量为1000亿枚。\n\n除此以外，REVO还可用于购买NFT盲盒，开启可获得不同的游戏奖励。\n\n游戏收入主要有三个来源：1.NFT市场交易收入；2.生态治理中产生的收入；3.玩家出售、升级英雄，参与排位赛等收取的费用。\n\n# 3. 游戏发展\n\n**3.1 当前进度**\n\n目前游戏正在进行IDO抽白活动，用户需要在gleam上完成一些列任务参与抽奖。\n\n游戏正式版本预计于今年7月份上线。\n\n**3.2 社交媒体状况**\n\nTwitter粉丝数：50.5K\n\nTelegram用户数：108,706\n\nDiscord成员数：50,998\n\nYoutube订阅数：9,790（视频播放连都不高，除了一些游戏演示视频）\n\n合作情况：\n\n1\\.获得Bitkeep钱包的支持\n\n2\\.邀请Global Rashid在Youtube上专题分享（14.7万订阅的专门讲加密领域的印度博主）\n\n[https://www.youtube.com/watch?v=-pDK81U-fVg](https://www.youtube.com/watch?v=-pDK81U-fVg)\n\n3\\.团队一直在做事，推特发布频率很高，也会提前好几天开始预热下阶段的项目。之前为上线NFT市场，最近为IDO。\n\n**3.3 投资背景**\n\n![](https://images.mirror-media.xyz/publication-images/VlF71FN5QgXWkKtA7SU49.png?height=343&width=1496)\n\n用到了华为云所以合作伙伴里面有华为", "timestamp": 1653237949, "digest": "5apgEIcQ01ww3K0p_BFoIqV6Ni6l1ifWtslyHNtAmvg", "contributor": "0x7722a8853e29290381D7d28fB244Fe7A01d392E9"}
{"id": "9nCms4dUHAF8DSdT214TMJ58asKG0IDfKeUljr27R2s", "title": "關於 Keystone 产品開源的介紹", "body": "在 Keystone 的開源之路上，我們又往前邁出了重要一步。本文將全面介紹我們已經開源的所有項目，以及 Keystone 如何實現開源和我們未來的開源理念。\n\n# Keystone 開源了哪些代碼和設計\n\n在 Keystone 中，已經[開源的項目](https://github.com/KeystoneHQ/Keystone-developer-hub)有：安全芯片的固件代碼、硬件電路設計和 BOM 物料清單、錢包應用層代碼和部分安卓系統層代碼。同時还發布了第三方[代碼審計報告](https://github.com/KeystoneHQ/Keystone-developer-hub/tree/main/audit-report)，我們也是首家公開此報告的硬件錢包公司。\n\nKeystone 設備原理圖（電路圖）和物料清單（BOM）都已經在 [GitHub](https://github.com/KeystoneHQ/Keystone-developer-hub/tree/main/hardware) 發布。如果您對 DIY 自己的硬件錢包特別感興趣，那這些內容就為您展示了如何一步一步 DIY Keystone 硬件錢包，同時你也可以通過這些內容來研究 Keystone 的內部構造。\n\n我們是第一家開源[安全芯片固件代碼](https://github.com/KeystoneHQ/keystone-se-firmware)的硬件錢包公司（也是目前已知的硬件錢包中唯一一家開源硬件錢包廠商），另外，我們的[安全芯片 Datasheet](https://github.com/KeystoneHQ/Keystone-developer-hub/blob/main/se/Keystone_Secure_Element_Datasheet.md) 也是開源的。由於涉及到安全芯片廠商的知識產權，我們與其他硬件錢包一樣，只能實現部分開源（通用微控制器 MCU 也無法開源底層代碼）。但是，由於安全芯片固件代碼是開源的，您可以驗證以下重要的加密操作：\n\n* 如何根據隨機熵生成助記詞和主私鑰\n* 如何派生子私鑰和公鑰\n* 如何在安全芯片中完成整個簽名過程\n* 如何讓私鑰永遠不離開安全芯片\n\nKeystone 还允許用戶自行[投擲骰子生成隨機熵值](https://support.keyst.one/v/traditional-chinese/gao-ji-gong-neng/zhu-ji-ci/shi-yong-tou-zi-chuang-jian-zhu-ji-ci)，進而派生私鑰，從而減少了對安全芯片底層代碼（真隨機數生成器）的依賴。如何驗證這個結果，您可以在[此處](https://blog.keyst.one/how-to-verify-the-recovery-phrase-created-by-dice-rolling-af01c16b765e)找到答案。對於想要進一步驗證安全元件操作過程的測試人員，可以在與我們簽署保密協議之後，拿到開發版。\n\nKeystone 使用的是安卓操作系統，它為我們的開發提供了成熟的工具鏈，比如相機（用來掃描二維碼）、觸摸屏（增強可讀性，預防錯誤）以及其他功能，讓用戶有更好的操作體驗。安卓的安全芯片在許多支付程序和銀行終端中普遍應用，所以安全係數很高，因此我們在安卓操作系統上構建了一個[完全開源的錢包應用層](https://github.com/KeystoneHQ/Keystone-developer-hub/blob/main/se/Keystone_Secure_Element_Datasheet.md)。但是，由於操作系統層某些部分的所屬權屬於各個廠商，所以這部分也不能完全開源。為了進一步提高安全性，防止安卓系統可能發生的攻擊，您可以在我們的[開源代碼](https://github.com/KeystoneHQ/Keystone-system)中查看我們做了哪些操作：\n\n* 關閉 adb 並刪除 adb 後台進程\n* 刪除不相關的系統進程和應用程序\n* 阻止安裝第三方應用程序\n* 修補 Linux 內核漏洞\n\n在 Keystone 開源這件事情上，我們还接受了具有公信力的第三方代碼審核，並將[審計報告](https://github.com/KeystoneHQ/Keystone-developer-hub/tree/main/audit-report)發布在了 Github 上。我們選擇了中國最好的代碼審計供應商之一：一家由前 360 公司的核心人員和主要項目負責人創建的[審計公司](https://peckshield.com/)，他們在區塊鏈相關產品和防禦安卓黑客方面經驗豐富。大家可以看到，我們已經修復了報告中提到的大大小小所有問題，僅有的兩個未修復的問題，其本身是低風險問題，未修復的原因主要是跟我們業務邏輯有沖突。具體如下：\n\n* PVE010：這個問題與我們的業務邏輯有沖突——我們允許用戶使用指紋授權交易。並且，在安全芯片內，有多重機製確保種子或助記詞不被泄露。比如，安全芯片的所有數據全部默認加密，而且想要竊取種子或者助記詞，主要方式是安裝病毒固件到 Keystone 中，但是只有我們官方簽名的固件包才能進行固件升級，並且，固件升級也依賴用戶的密碼授權，這就杜絕了廠商作惡的可能性。\n* PVE011：這個問題也與我們的業務邏輯有沖突——為了保護用戶的硬件錢包[免受旁路攻擊](https://mirror.xyz/keystonecn.eth/SFGEVsIQOPls5SGV2CBr54tj6KNpCs5hoqXE-WlPa5M)，我們設計了多重[拆機自毀機製](https://mirror.xyz/keystonecn.eth/A5blBF-KWF5sGCm5TzCXpmQj_5xy3wUYYXjUeCInWrM)。Keystone 設備一旦檢測到暴力拆機，可以主動銷毀私鑰等敏感數據。如果刪除數據依賴用戶輸入密碼，那拆機自毀機製就無法發揮作用。\n\n# 使用多重簽名實現信任最小化\n\n實現信任最小化最有效的方法之一就是支持比特幣 PSBT [多重簽名](https://support.keyst.one/v/traditional-chinese/gao-ji-gong-neng/duo-qian-gong-neng)或者以太坊的 Gnosis Safe 多簽。\n\nAs Michael Flaxman suggests [in this podcast](https://stephanlivera.com/episode/97/), each additional signature required to spend from a multisig PSBT wallet increases security by “orders of magnitude,” even if the additional signature is done by a hardware wallet that is not open-source or considered particularly trustworthy. This is because all hardware wallets that require signing of transactions would have to be compromised *simultaneously* in order for an attacker to steal the funds, which would be extremely hard to do if you use hardware wallets from different vendors.\n\n正如 Michael Flaxman 在此[播客](https://stephanlivera.com/episode/97/)中所提到的，多重簽名錢包中每增加一個簽名者，安全性就會提高一個等級，即使增加的簽名方是閉源硬件錢包。因為如果攻擊著想要攻擊一筆多簽交易，他就必須攻擊所有參與簽名的硬件錢包。如果您使用的是來自不同供應商的硬件錢包，那這種情況將難以實現。\n\n目前，我們以經完成了與 [Gnosis Safe](https://support.keyst.one/3rd-party-wallets/defi-dapp-with-keystone/gnosis-safe)、 [Blue Wallet](https://support.keyst.one/v/traditional-chinese/di-san-fang-qian-bao/bi-te-bi-qian-bao/bluewallet)、[Spectre](https://support.keyst.one/v/traditional-chinese/di-san-fang-qian-bao/bi-te-bi-qian-bao/specter)、[Wasabi Wallet](https://support.keyst.one/v/traditional-chinese/di-san-fang-qian-bao/bi-te-bi-qian-bao/wasabi)、[Sparrow](https://support.keyst.one/v/traditional-chinese/di-san-fang-qian-bao/bi-te-bi-qian-bao/sparrow)、[BTCPay Server](https://support.keyst.one/v/traditional-chinese/di-san-fang-qian-bao/bi-te-bi-qian-bao/btcpay-server)、[Electrum Wallet](https://support.keyst.one/v/traditional-chinese/di-san-fang-qian-bao/bi-te-bi-qian-bao/electrum)、Fully Noded 等多個數字貨幣錢包的兼容，並且支持 PSBT 多重簽名。多重簽名被認為是安全儲存數字貨幣的[最佳選擇](https://twitter.com/mflaxman/status/1310580116808970240)，用戶可以使用 Keystone 硬件錢包作為簽名者創建多重簽名錢包，以此驗證未簽名的多重簽名交易。您可以在[本文](https://medium.com/shiftcrypto/the-pitfalls-of-multisig-when-using-hardware-wallets-9b0e98e4c19c)中查看此功能的重要性。\n\n## 下一步計畫\n\n目前，為了防止網絡釣魚攻擊，Keystone 僅允許用戶通過簽名的固件包進行升級， Ledger、Trezor 和 Keepkey 用戶最近都成為網絡釣魚攻擊的受害者。所以只是單單提醒用戶謹慎安裝第三方固件不足以應對威脅，因為並非所有用戶都具備必要的背景知識，能意識到固件升級過程中潛在的網絡攻擊。\n\n僅允許由我們簽署的固件包進行升級確實防範了大量網絡攻擊，但也有缺點，那就是用戶必須信任我們發布的固件升級包。為了減小這種信任，並滿足那些想要自定義固件的高級用戶，我們未來會發布 Cypherpunk 版本的 Keystone，這個版本的 Keystone 不再預裝任何固件，因此用戶必須編譯自己的固件，在 Github 上選擇可用的私鑰進行簽名，並且，用戶可以自行替換升級包校驗的秘鑰對，從而只識別用戶自行簽名的升級包。\n\n作為目前區塊鏈社區中支持[多重簽名這一最佳解決方案](https://twitter.com/mflaxman/status/1310580116808970240)的一員，我們非常自豪地告訴大家，我們與 [Nunchuk](https://nunchuk.io/)、[ColdCard](https://coldcard.com/) 和 [BitBox](https://shiftcrypto.ch/) 的開發人員一起起草了 [BIP129](https://github.com/bitcoin/bips/blob/master/bip-0129.mediawiki)（比特幣安全多重簽名設置，BSMS ）。該 BIP 將比特幣多重簽名的安全性，提升到了一個全新的水平。不久的將來，我們也將實施此 BIP 準則。\n\n# 羅馬不是一天建成的\n\n關於開源，我們為什麼要一步一步實現？有這樣幾個原因。首先，我們有責任保護我們的用戶免受日益增加的黑客攻擊，而將代碼開源的同時也將暴露漏洞，行業內有一句話：「security through obscurity」。所以，Keystone 硬件錢包開源的同時也產生了新的潛在威脅。我們需要執行更嚴格的代碼標準，對這些漏洞進行分析修復，然後才能發布。\n\n世界上沒有絕對的事情，也沒有任何電子產品永遠是完全透明100%開源的，但開源對區塊鏈社區來說仍然非常重要。開源代碼不僅使內部工程師作惡變得更加困難，而且還能促進硬件錢包與軟件錢包等其他產品的集成。現在我們的產品與其他軟件錢包的兼容性越來越高，這也是我們理應為比特幣社區做出的貢獻，同時這也有助於減少用戶對我們產品的信任依賴。", "timestamp": 1653241826, "digest": "iLJF6Da4LgtnfdhIyWtNW67rEij1ld6pwxItNlN9_6w", "contributor": "0xaFEF3a80B6A205d1F74aaC7887e96A0F6F6051e0"}
{"id": "kpd38LOG21kTvS7mFuBW6KtqIIxAFpJJbMCOxz3l-mA", "title": "Aster Protocol 投研", "body": " **项目介绍**\n\nAster Protocol 创造了网络世界中第一个链上身份聚合协议。并提供去中心化的商业基础设施（用于在线和离线世界的商品和服务）以加速所有权经济（“创造者经济”）。受到 Loot、ENS、1inch 等先驱者的启发，该平台提供了一个多链 Web3 协议集合，赋予传统社交媒体平台 Web3 与区块链的功能，将当前所有的 Web2 社交平台与 Web3 应用进行无缝连接。使用 NFT、DeFi、SocialFi、DAO 以及元宇宙的相关应用，为区块链行业带来更多使用场景。Aster 通过 Web2.0 互联网的并行网络，以 OpenMeta 基础设施将人们引导到 Web3.0 时代。致力于解决社交、商业和营销方面的问题。\n\nStar 专注于提供以下产品和解决方案：\n\n·        社交服务、Aster 名称服务、Aster DID、混合社交图、社交时刻和社交资产管理\n\n·        Web2社交平台的营销服务、链上空投、抽奖、协作活动\n\n·        商务服务，\n\n·        NFT 商店构建器（Web3 中的 Shopify）\n\n·        实物资产通证化\n\nStar 是一个多链平台，支持以太坊、BNB、Avalanche、Polygon 等。基于路线图，开发团队计划未来打造社交区块链。考虑到链上社交需求，高性能的公链是必不可少的，Star 团队将使用 Avalanche 子网等技术栈。该社交区块链将促进以下功能的开发：\n\n1\\.社交功能，包括赠送NFT和小费\n\n2\\.奖励计划，如优惠券、彩票等\n\n3\\.粉丝俱乐部服务\n\n4\\.版税计划\n\n5\\.企业级实物资产代币化、保管、兑换、未来on-chain Ecommerce的物流服务\n\n在多链的支持下，它将促进Aster DID被商业和内容行业合作伙伴广泛使用，目标是10万亿美元的市场。同时，Star 会将 Web2 用户迁移到 Web3，将 10 亿用户带入 Web3 生态系统。目前，Star 正在与 club-metaverse 平台合作，支持 DJ 在社交平台上发布 EDM 的 NFT，例如在社交网络上拥有数百万粉丝的 Dannic、Thomas Gold、Vini Vici。除了音乐产业，Star 还支持 Skyfall Inc 推广日本动画作品的 NFT。Skyfall由著名动画制作人上田益夫先生创立，他是Aniplex的前总裁兼执行董事，以创作高达、钢之炼金术士、犬夜叉、妖精的尾巴、Fate Grand等100多部动画系列和电影而闻名订单、刀剑神域在线等。凭借创新的设计，Star 致力于在从 Web2 到 Web3 时代的过渡中发挥主导作用，并推动 Web3 中代币化的大规模采用。\n\n演示demo（在推特上将NFT送给其他用户）：<https://www.bilibili.com/video/BV1bS4y1a7s8>\n\n 另一个技术方面是：Aster Name Service（星辰域名服务），连接web2和web3的社交身份聚合器。\n\n根据演示，用户可以通过浏览器扩展aster将NFT传递到任何社交网络上。\n\n**当前用例**\n\n1\\.与skyfall合作：该公司有意将IP制作成NFT，aster协助skyfallmint自己的NFT，建立NFT商店，并且助其NFT在社交媒体上传播。\n\n2\\.与DiscoverFeed合作：DiscoverFeed的EDM NFT目前面临着问题：缺乏将其NFT公开在社交媒体上以进一步吸引粉丝的工具。Aster给出的解决方案是通过ANS系统直接触达该DJ在twitter、Instagram、Facebook等社交网站上的大量粉丝。\n\n3\\.与三井不动产的合作：数字艺术的展示\n\n4\\.与BetaMars的合作：目前BetaMars仍然是通过收集用户钱包地址的市场活动来收集目标用户，缺乏web2到web3的桥梁，aster可以通过自己的市场工具（例如通过空投、抽奖的方式）触达游戏爱好者。\n\n **联合创始人**\n\n*Michael Huang*（中国人）：推特：@michael_web3，领英：<https://www.linkedin.com/in/michael-huang-651754233/>（没有相关信息）。\n\nErvin Zhuang（中国人）：推特：@ Ervin_Zhuang，本科上海外国语日语专业，2014年就读中欧国际工商学院（应该算是亚洲地区最好的MBA），曾就职：2020年2月-2021年3月：Laox Co Ltd（日本，跨境贸易、商贸服务）的战略发展部副主任，2018-2019年ACG network（日本-新加坡，加密货币领域，结合了数字内容和区块链技术的平台，主要是动漫游戏）的CFO，以及国内的投资机构（2017-2019年：ChenYao Capital 晨曦资本，2014-2017年：Purestone Capital Group 璞石资本集团）。 \n\n **融资情况**\n\n种子轮融资：100万美元，由 Youbi Capital、Pluto Capital、Lancer Capital、Lucid Blue Ventures 等机构参投，投资者还包括：Republic亚洲合伙人Zhen Cao，FBG合伙人区块链行业连续创业者Hitters Xu，OP Crypto COO Lucas He，以及其他多位知名风投机构创始人。\n\n **社交媒体关注度**\n\n推特关注人数：6774（2022-5-22）\n\n \n\n**动态**\n\n5月刚参加了币安冠名的的DoraHacks的黑客松（亚洲地区）。\n\n目前aster protocol正在DoraHacks上参加BNB捐赠，投票网址：<https://dorahacks.io/zh/buidl/2522>\n\n \n\n**总结**\n\n项目仍处于较早期，目前还未发币，其目标在于构建web2.0用户便于进入web3.0的桥梁，目前主要专注于NFT的应用场景。个人认为web2.0到web3.0一定会有一个循序渐进的过程，这个过程除了技术和监管等因素外，还需要用户的知识和意识提高，类似aster protocol这种建立在现有的web2.0社交网络上面的web3.0应用会是当下比较容易和合适的选择，降低了传统web2.0用户进入web3.0的门槛。\n\n项目优点：项目选择的方向，前景比较好；项目落地比较好，目前已经有许多用例；创始人有传统web2.0的商业经验和投资机构人脉。\n\n项目缺点：目前属于较为早期的阶段，热度不高，团队没有特别厉害的人物。并且网站、社群都没有建立的很好。护城河较浅，未来不排除会有强大竞争对手出现，尤其是传统web2.0的公司；该项目不仅需要web3.0的经验，更需要web2.0的经验，所以有可能传统web2.0的公司竞争力更强。目前也没有相关的代币经济模型。\n\n总之，很早期的项目，赛道不错，可以持续关注，尤其是后续上线可以亲自使用下，看看使用体验如何。\n\n \n\n \n\n \n\n ", "timestamp": 1653241957, "digest": "6xDUp0lz3GK1Oem6P9i4Rdz6DKMK71l1Zd_b_0BTIcA", "contributor": "0x7591dDC0cEc44843CecD94b01A94357cB339E458"}
{"id": "pmDzYvnFIT9dwlGHOPtNRvmSZmbAZzKOkY_2Wo6CBFc", "title": "Both men were sentenced to four years in prison for fighting with others and causing the death of their wives", "body": "Release time: 2022-05-11 18:02:19 source: Sina News comprehensive\n\nIntroduction:", "timestamp": 1653242152, "digest": "lIgnByV6emD9YI5outrhL8AuiCWKTQ07atBFE2dIoEM", "contributor": "0x4EfDBE6ee9E7f70c28BcFCAa9315b35b170e2E68"}
{"id": "fMLKbst-Jhs9nWHQ_9D9spTjziB9IN1vPrnEmUSkzEk", "title": "The China Meteorological Administration further deployed meteorological disaster prevention and mitigation of heavy precipitation in the south", "body": "Beijing, May 12 (Xinhua) according to the wechat official account of the China Meteorological Administration, on May 12, after the National Weather consultation, the China Meteorological Administration, in combination with the current situation of heavy rainfall in the south, redeployed, strengthened and implemented the meteorological disaster prevention and reduction work. Zhuang Guotai, Secretary of the Party group and director of the China Meteorological Administration, put forward clear requirements for strengthening meteorological disaster monitoring and early warning and cooperating with relevant departments to do a good job in disaster prevention and reduction. Yu Yong, member of the Party group and deputy director of the Bureau, deployed the next work.\n\nThe meeting pointed out that the China Meteorological Administration attached great importance to the strongest precipitation process in the South since the flood season. Local meteorological support services continued to follow up and took strong actions, showing a good trend of early prediction, early service, good linkage and good effect. Meteorological departments at all levels should implement the concept of “people first and life first”, continue to cooperate with relevant departments to do a good job, and earnestly build the first line of defense for meteorological disaster prevention and reduction.\n\nThe meeting made arrangements for the next work:\n\nFirst, we should strengthen monitoring, forecasting and early warning services. The heavy precipitation process is still continuing and is in the critical period of defense. Meteorological departments at all levels should continue to maintain the combat state, make persistent efforts, strengthen rolling monitoring, consultation, research and judgment, give full play to the advantages of modern meteorological monitoring means, strengthen short-term approach prediction, and go all out to provide monitoring and prediction services.\n\nSecond, service tips should be provided for possible subsequent secondary disasters. The precipitation lasts for a long time. We should pay close attention to the secondary disasters that may induce mountain torrents, geological disasters and other disasters, as well as the disaster risks such as over alarm of small and medium-sized rivers and waterlogging in urban and rural areas, and timely follow up and optimize the service tips.\n\nThird, we should continue to strengthen information submission and public science popularization. Fully understand the importance of all parties to the heavy precipitation process, timely and authoritative release of meteorological monitoring actual information and rolling forecast and early warning, strengthen close cooperation with relevant departments, timely report to Party committees and governments at all levels, timely inform the public and popularize science.\n\nFourth, we should make an overall plan for the current cold air in the north and heavy rainfall in the south. At present, the process of cold air in the north is extreme. In particular, it is necessary to strengthen the analysis of the impact of cold air on epidemic prevention and control and agricultural production, and provide targeted decision-making services by comparing historical data with big data. The South should beware of secondary disasters that may be induced by early precipitation accumulation.", "timestamp": 1653242336, "digest": "8tkoBLJtPE_0rze45uBwUt3Dz1EvGQ0Fic_Gzm4yThQ", "contributor": "0xeb948025a9113a2390E01a455Fda18B2D425254B"}
{"id": "TF9IuvHHS6uDG36t4pgLcC3e2obCoQGRSKTdYI4xCnY", "title": "Gruyères\n", "body": "![](https://images.mirror-media.xyz/publication-images/1Wq_Bq5_4BYYQzw2mW3mS.jpg?height=2176&width=3264)\n\n", "timestamp": 1653242417, "digest": "MuEB4FCJlGCjxd0nceb59bVN6EwX1n1bZsXiBHOyXY4", "contributor": "0x31C97E17c26E156559e7b99e6F1298eb42537836"}
{"id": "u2LPeX1HRpuJXB2VnJ1Le3T8aXPViNG_XuRUNqBEI3Q", "title": "Orchestra — “The pretty obvious if you think about it accord”", "body": "![\"The pretty obvious if you think about it accord\"](https://images.mirror-media.xyz/publication-images/55otcJuX2dNf8NokaFJjB.png?height=561&width=1111)\n\n# Context — Twisted Selection\n\nAs mentioned in our first piece, [An Indictment](https://mirror.xyz/orchestradao.eth/dK2KF3Cnlxq6YgYgXTx3_TrTU9eo47IHZaW-nTU_R7o), the current crypto/web3 innovation ecosystem makes it very difficult for innovators and supporters to find each other and collaborate. The big publishing platforms and leading influencers control most of the traffic which allows them to charge exorbitant pay-to-be-seen fees. This and other supporting factors, especially the drive to boost revenue by publishing a lot of content, result in a prohibitively over-priced and over-crowded innovation showcase stage that favors the rich and savvy over the viable, technologically-sound and value-adding. It is like looking for someone you haven’t met yet, in a dark and noisy nightclub with a high probability they didn’t even clear the bouncer…\n\n# Mission — Marco! Polo!\n\nOrchestra’s mission is to help all interested parties in the Crypto/web3 innovation space to find each other on a level playing field.\n\n# Strategy — Come together\n\n![Come together](https://images.mirror-media.xyz/publication-images/Z546IYK0oa5WrqwBNjuFt.png?height=787&width=1400)\n\nWe’ll do this by both removing obstacles and by paving inroads.\n\nIn removing obstacles we mean getting rid of the “noise” created by the current unnatural selection process, i.e., merit-centric curation of strong and reputable pool of Good Innovation Projects (GIPs). In “paving inroads” we mean providing a communal virtual space and conditions that would foster interactions with and in a community of innovation supporters (e.g., investors, partners, OGs, KOLs, journalists, publishers, influencers, and other interested parties we can’t think of right now).\n\nAs can be inferred, we believe that collaboration is a necessary condition for effective innovation. We also believe that given the right conditions, collaboration happens naturally. What we mean is that if we are able to bring people together in a way that provides a good match in terms of resources, needs and mutual interests, they will do the rest on their own.\n\n# Organization — Orchestra is a {Set}\n\nOrchestra is not a website (mobile or otherwise), not a Discord channel (nor Telegram group or any other social platform collective noun), not a platform, not a company, an association or any other legal entity. Orchestra will most probably include some or all of the objects above. However, Orchestra is not defined by any of them.\n\nOrchestra is an organization. In “organization” we mean that it is a set of people that 1) identify as belonging to that set, and 2) are accepted by (enough) other members of the set as belonging to that set, and 3) that act in a way that affects other members of the set. The source of the sense of belonging in our case stems from a shared purpose. That was a rigorous and perhaps a bit long-winded way of saying that Orchestra is a community of people working together towards a shared purpose.\n\n# Purpose — Save the world. Make it a better place.\n\n![](https://images.mirror-media.xyz/publication-images/MJ5BKorfm5FtVUGUPp575.png?height=841&width=1400)\n\nTo drive high-impact, valuable, and sustainable web3 innovation.\n\n# Execution in tranches\n\nOrchestra’s purpose is big. Providing a merit-based curation (both of GIPs and of the audience) and a showcase stage is Orchestra’s “beach-head” strategy and perhaps demonstration of concept that can later be expanded to include all the dimensions and stages of innovation development (inc. market access).\n\nWe believe it is possible to do this with minimal centralized direction (with it further diminishing as the DAO community grows).\n\nMore to come.\n\n[@OrchestraDAO](https://twitter.com/OrchestraDAO)", "timestamp": 1653242546, "digest": "jO5jEwPVt-uN8_F4e5gGc-MhloB74WUSh4syZ83Aw9s", "contributor": "0xAAc91DDFFD51f7D17a5C2d2CE4DD43876E1ede2C"}
{"id": "WVpcwb4MC6DUMBZO8tPuObA63m2qDYULmn1xW20gwac", "title": "Since the strongest rainfall hit this year, what are the shortcomings of flood control? How to make up for it?", "body": "Xinhua news agency, Beijing, May 12 - question: what are the shortcomings of flood control since the strongest rainfall this year? How to make up for it?\n\nXinhua News Agency reporter\n\nAt 18:00 on the 11th, the Central Meteorological Observatory issued the first orange rainstorm warning this year, suggesting that many provinces in southern China will usher in heavy rain, and there will be heavy rain in some areas. It is reported that this is the strongest rainfall since the flood season in the south. What are the shortcomings of flood control in China? How to make up the local short board? Xinhua News Agency reporters conducted interviews in many places.\n\nThe flood control situation is still grim\n\nIn recent days, Guo Jianliang, director of the office of the flood control and drought relief headquarters in Nanxian County, Yiyang City, Hunan Province, has been busy. He should not only organize flood fighting and rescue training, but also arrange personnel to keep an eye on the changes of the flood situation. Once the water situation is severe, he should also organize personnel to patrol the embankment for danger investigation. He told reporters: “Dongting Lake area is the ‘main battlefield’ for flood control and flood fighting. After entering the flood season, we are highly nervous.”\n\nAccording to the analysis and prediction from meteorological and hydrological departments, the flood control situation in many places this year is relatively severe.\n\nMa Jianhua, executive deputy commander-in-chief of the Yangtze River flood control and Drought Relief Headquarters, said that it is predicted that the precipitation in the flood season of the Yangtze River Basin this year is normal and less, but the temporal and spatial distribution of precipitation is extremely uneven, the risk of regional floods in the upstream is high, the probability of drought and water shortage in the middle and lower reaches is high, and the possibility of drought and flood coexisting is high.\n\n“Flood risk is still the biggest threat to the Yellow River Basin this year.” Wang Annan, executive deputy commander-in-chief of the Yellow River flood control and Drought Relief Headquarters, said. The prediction and analysis data show that there is more precipitation in the Yellow River Basin this summer. Among them, the precipitation in the north of Hetao is close to the whole year, the precipitation in the South and lower reaches of the middle reaches is 20-40% more, and that in other areas is less than 20%. It is reported that most of the areas with excessive rainfall forecast are the main source areas of flood and sediment caused by the Yellow River. Once a large flood is formed, both water and sediment will fall, making it very difficult to defend. In addition, with the increasing impact of global climate change in recent years and the further increase of flood disaster risk in the Yellow River Basin, the flood control situation of the Yellow River this year is still grim.\n\nThere are multiple short boards in flood control\n\nMa Jianhua said: “at present, the flood control and disaster reduction capacity of the Yangtze River Basin has been significantly improved, but the weak links are still prominent. It will take a long time to improve the flood control and disaster reduction system.”\n\nThe shortage of manpower and great financial pressure have been the short board of flood control in various places for many years. Huarong County, Yueyang City, Hunan Province, is known as “standing on the Yangtze River and stepping on the Dongting”. The first-line flood control dike is 325km long, accounting for about 10% of the total length of the first-line flood control dike in Hunan Province. Wang Zhong, deputy director of Huarong County Water Conservancy Bureau, introduced that Dongting Lake area is the main agricultural production area. A large number of young and strong labor force go out to work, and the left behind personnel are difficult to bear the heavy flood control work. Cadres in Henan, Hubei and other places also reported that the shortage of flood control manpower means that investment should be increased. At the same time, some water conservancy facilities also need to be improved, and local financial pressure is also great.\n\nThe 2022 Yellow River flood control and drought relief work conference revealed that there are many weak links in the flood control engineering system of the Yellow River Basin. Including the low embankment standard of some sections of the upper reaches of the Yellow River, the flood control project in the middle reaches has not yet formed a system, and the downstream “secondary suspended river” channel shape, wandering channel and “moving bed” situation exacerbate the flood risk. “The river conditions in the lower reaches of the Yellow River, with high hanging rivers, wide beaches and many people, and the coexistence of flood and sediment, have not changed, and the situation is still grim,” Wang Annan said\n\nUrban flood control also faces multiple weaknesses. Yuan Zhenlong, director of the Institute of comprehensive management of the Beijing Academy of Social Sciences, said that many old urban areas lack the overall planning of flood control functions in the early stage of construction, or the planning is not scientific and accurate enough, the building density in the central urban area is high, and the flood control standards of bungalow areas and old residential areas are low, which makes these areas easy to become weak links of urban flood control. “In some areas, rivers, wetlands and depressions have been occupied, and the urban water storage space is narrow, which can not give full play to the water storage function when the rainstorm comes.” Yuan Zhenlong said.\n\nStrong ability, build team and make up for weaknesses\n\nRecently, in some concave bridge areas in Beijing, the staff of Beijing Drainage Group are installing surveillance cameras to monitor the ponding in the bridge area in real time during the flood season, so as to find the ponding in time and dispose it quickly.\n\nBeijing Drainage Group has increased the total pumping capacity of 88 rainwater pump stations of the group to 750000 cubic meters per hour since 2013. “Last year, we further improved emergency rescue equipment, with a total emergency rescue capacity of 205000 cubic meters per hour, an increase of 17 times compared with 2011.” Beijing Drainage Group official said.\n\nIn rural areas, all localities try their best to make up for the shortcomings of flood control and emergency response capacity by strengthening real-time monitoring, information construction and establishing professional teams. Huarong County investigated the rural young and middle-aged labor force at home before the flood season, organized 17453 assault and patrol personnel and registered them, and established a 100 person county-level flood control emergency rescue militia company and an 80 person County rescue emergency engineering team. “Putting the work ahead avoids the difficulty of organizing temporary personnel.” Wang Zhong told reporters.\n\n“The accumulated rainfall of Xuanmiaoguan reservoir has exceeded 100 mm. We must increase patrols and pay attention to prevent mountain torrents and landslides.” Recently, with the continuous rainfall, Chen Jiangling, a government worker in Leizu Town, Yuan’an County, Yichang City, Hubei Province, received a number of messages on her mobile phone.\n\nThe situation of rainwater in mountainous areas is relatively complex, and people live scattered. According to chenjiangling, a monitoring cloud platform has been established locally, so that the rain information can be monitored in real time, and can be seen at a glance on the platform. Then, the disaster early warning information can be timely released to flood control personnel and people in flood threatened areas through various media such as mobile phone short message platform, wechat official account and video number.\n\n“For the 63 hidden geological hazards identified, we not only put forward preventive and rectification measures, but also establish an on-site inspection mechanism. In case of flood, village cadres and emergency team members will be required to dispatch quickly for emergency disposal to ensure that the hidden risks are controlled and build a safety screen for the people.” Chen Jiangling said. (reporter Zhou Nan, Li Siyuan, Zhang Xingjun, Tai Sicong)", "timestamp": 1653242604, "digest": "edT96ytW5i9SWlAO9nUtFCcN_OKKkYFdrplIkI1dSZ8", "contributor": "0x19932B427Bd6E226F6AbBe77c0D22A5f03Dc2d9e"}
{"id": "wvyFfEuxD5eTHIyc8RS1SQ85TLzJG8K8FPD31_TGmGM", "title": "Ren Ziwei's Enlightenment Coach: his mother was distressed and once advised him to give up training", "body": "Release time: 22:08:42, February 11, 2022 source: Red Star News\n\nIntroduction:\n\nOn the evening of February 5, five members of the Chinese short track team, including Ren Ziwei, worked together to win the first gold medal of the Chinese delegation to the 2022 Winter Olympics in Beijing. Ziwei celebrates after the game on July 2. On February 7, Ren Ziwei won the men’s 1000m short track speed skating final of this winter Olympic Games and became the first “double gold” winner of the Chinese ice and snow corps at this winter Olympic Games. “The students I took have won various awards, but I have a dream that has not come true. That is, no child has won the Olympic champion yet.” Two years ago, Wang Beiming, Ren Ziwei’s Enlightenment coach, expressed this regret in a conversation with Ren Ziwei. At that time, Ren Ziwei said with determination that he was confident to help the teacher realize this dream. In 2010, Ren Ziwei suffered an accidental fracture during the competition. At that time, Ren Ziwei’s mother didn’t want him to continue training, so Wang Beiming personally communicated with his parents. Later, Wang Beiming went to work for Ren Ziwei and asked him if he liked the sport and whether he wanted to continue practicing. He replied that he still wanted to, but his parents disagreed. “Miss Wang, do you think I’m ok?” Ren Ziwei was very confused at that time. Wang Beiming replied, “if you say you can, I’ll say you can. If you say you can’t, I’ll say you can’t.” Ren Ziwei said he would do it. Wang Beiming led Ren Ziwei to train for 10 years and witnessed Ren Ziwei grow from a child to the provincial team and national team, and then to win two gold medals in the Beijing Winter Olympics. Ren Ziwei is still expected to win the gold medal in the next two events of the men’s 500 meter relay and the men’s 5000 meter relay in the Winter Olympics.", "timestamp": 1653242497, "digest": "0J84WDUaqTDQdxrjeobNOzYhzDq5NEEA7e1yyGiUlMU", "contributor": "0x4fd71871D9FA215D255E2297B5aB0C8e756e7Dc7"}
{"id": "2VxEwhbaCw6m19U7XDdSK0q5gGA0k1bN0JNwF1yVMxY", "title": "BBRC&常春藤男孩研报", "body": "一、基本信息\n\n（1）BBRC Studios 的创始项目，共计7777个\n\n（2）项目亮点：穿搭服装特色&整体画风\n\n（3）推特关注：251.5K；DC关注：98k 截至2022.5.20\n\n（4）艺术家：Aaron Chang\n\n（5）mint价格：0.12eth（公售）当前价格0.3eth\n\n（6）Market Cap：$5,208,710.09\n\n（7）交易量：发售后保持在os前40\n\n（8）NBCP：15.56%（中等）\n\nLinktree：\n\n[https://linktr.ee/bbrcofficial](https://linktr.ee/bbrcofficial)\n\nOS：\n\n[https://opensea.io/collection/bbrcofficial-ivyboys](https://opensea.io/collection/bbrcofficial-ivyboys)\n\nDC：\n\n[https://discord.com/invite/bbrcofficial](https://discord.com/invite/bbrcofficial)\n\nTitter\n\n[https://twitter.com/BBRCOfficial](https://twitter.com/BBRCOfficial)\n\n二、项目整体画风\n\n![](https://images.mirror-media.xyz/publication-images/qg9EHy7WP-PET6my_41Kz.png?height=545&width=1321)\n\n![](https://images.mirror-media.xyz/publication-images/4-6YuJoVRsHToQaap2SaQ.png?height=360&width=360)\n\n![](https://images.mirror-media.xyz/publication-images/DefpT3VSz56iJddiqbBtc.png?height=600&width=600)\n\n![](https://images.mirror-media.xyz/publication-images/oIsNOuvbYbTqs0OuQXqzH.png?height=512&width=512)\n\n三、团队情况\n\n（1）艺术家Aaron Chang：韩国知名艺术家，也是韩国newbalance的艺术指导，再设计行业有十多年的耕耘经验，与多个品牌进行合作Percival、New Balance及Baracuta，他的ivy style的插画风格，让人过目难忘。\n\n（2）bbrc Studios 负责人Nelson：男装品牌**[Benjamin Barker ](https://www.benjaminbarker.co/)**的主理人，在新加坡有18家门店，并且还有多家餐厅，在潮流艺术上有比较深的经验，使得作品具有非常强的设计感和时尚感。Nelson之前买了Clonex，卖了35e。卖了保时捷车买了一个BAYC。\n\n（3）团队的其他成员包括：大企业CFO，为优衣库 adidas topshop 工作过\n\n四、项目路线\n\n1\\.项目发售:5.17晚上9：00-11：00（已发售）\n\n2\\.五月底空投行李箱：\n\n快照日期：IVY 行李箱空投 \n\n第一張快照：北京時間 5/23 日 晚上 11 點 \n\n第二張快照：北京時間 5/27 日 晚上 11 點 5 月底進行空投\n\n官方已经说明空投行李箱中有3件藏品，猜测与潮流穿搭相关.\n\n3\\.洛杉矶实体画廊--五月\n\n4\\.纽约实体活动--六月\n\n6\\.后续计划（未明确）\n\n（1）新的ivyboys宇宙\n\n（2）持有者优先与品牌合作\n\n（3）ivyboys宇宙拓展\n\n五、项目特色与个人评价\n\n（1）项目整体的设计师和运营方在潮流、穿搭、服装等领域有非常久的经验，项目图片非常精致，在一些小细节（手表、宠物）也展示的非常优秀，在社区的传播中，起到了非常好的作用，推特官方也在积极的在平台互动，效果非常显著。\n\n（2）项目授权IP，可以自行合作与衍生创作，和BAYC一样，希望可以链接实体和数字，短期的利益较难体现，但是长期或许会有比较多的运营价值，可以构架比较良好的生态。可以看到项目方后续的行动也偏线下的实体活动为主。\n\n（3）画风原创且标识感强，在虚拟与现实的链接上有比较好的抓手，比较其他项目，在后续元宇宙建设上面其实可以起的非常快，后续的二创、动漫、衍生品制作也是因为这个画风其实很好落地，潜力还是巨大的。\n\n（4）个人感觉在社群的合作运营相对较少，除了holder之外在公域的合作、运营上下的功夫比较少，可能是还在肝空投。\n\n个人总结：短期炒的价值不大，但是整个项目比较有潜力，可以挖的更深，比较期待项目方后续能有更多东西出来，在与现实世界的链接上，元宇宙的建设上，都有很多可以继续推进的，属于钻石手压箱底的东西。", "timestamp": 1653242735, "digest": "4N6zJT34Nn_TdKQHIA0ymVHE05QvyMjuUT-avInRhYI", "contributor": "0xF3EB08fFc1d11AC470fE8a0E48547DE851b562c5"}
{"id": "lzbPz01EV1axrcRzq8LYLakWKByXIAxFd-AQ3-WSfOk", "title": "whoever, wherever, whenever ", "body": "Your life is your eternity, but only a blink in the universe's history. Everything we do in life gets lost in time; eventually, no one will remember us. For that reason, the only thing that matters is living and doing what we love.\n\nDo not think things will always be as they are; everything can change from one moment to another. If you're not happy with something, change it. Everything is in our minds; if you can change your mind, you will be able to change your reality.\n\nDo not accept things for the sake of it. Question why things should be that way and how you could make them different. At the end of the day, the only thing that matters is you. If I were you, I would make myself the number one priority.\n\nYour happiness is yours. Luckily being happy, you can make others happy. If life is a game, we should have fun playing it. If we decide to suffer, let it be for something worth it.\n\nWhy wait so long to do something you want to do? How many people have ended up doing nothing? Nothing in life is permanent. The only thing that will be permanent for the course of your life is you. So fall in love with yourself since it's the only permanent thing.\n\nPeople come and go, thoughts and emotions come and go, and nothing stays put. The only thing that comes and goes is time. Time passes but never returns. Every second that passes is one second closer to death. Make your time the most important asset you have. Learn to spend it. There is nothing more valuable than time.\n\nLove with all your being, do not shy away from loving. Loving is our nature. No one should prevent you from living. Learn to love; if I were you, I would start with myself. Loving yourself is the most extraordinary act of love you will do in your life. The moment you learn to love yourself, you will be reborn.\n\nLife is simple; our human mind complicates it. We spend so much time wanting things, aching for those things, and so little time appreciating what we already have. Be thankful for everything you have, and being alive is more than enough to feel grateful.\n\nThis message is for whoever, wherever, and whenever. No one will know who you were, who you will be, or who you were. In the end, I don't know anything more than anyone else, these are my thoughts. As time passes, the more I realize we're a bunch of idiots trying to find meaning and purpose. We are human. We all are. We all want to be loved and wanted. We all have different ways of feeling loved and wanted.\n\nRest assured that life will be whatever you want it to be. Figure out what you want your life to be. Regardless of what we all think, life is a game. You have to know how to play it, and above all, have fun.\n\n\"We have two lives, and the second begins when we realize that we only have one.\"\n\n― Confucius", "timestamp": 1653242753, "digest": "VuCOuNy8k4ErWpUcHQCBP8Zqfh9UdOwJnjUGFrmIqJs", "contributor": "0x1db19B9903c5510AA5a866ea643Eb021CD12Bda0"}
{"id": "aIQ7ljoO0JhEIFPIiug02aBMxY5-uDv9tK9dp8moXX4", "title": "Solidity极简入门: 27. Hash", "body": "我最近在重新学solidity，巩固一下细节，也写一个“Solidity极简入门”，供小白们使用（编程大佬可以另找教程），每周更新1-3讲。\n\n欢迎关注我的推特：[@0xAA_Science](https://twitter.com/0xAA_Science)\n\n欢迎加入WTF科学家社区：[discord](https://discord.gg/5akcruXrsk)\n\n所有代码开源在github(64个star开微信交流群；128个star录教学视频): [github.com/AmazingAng/WTFSolidity](https://github.com/AmazingAng/WTFSolidity)\n\n\n-----\n\n哈希函数（`hash function`）是一个密码学概念，它可以将任意长度的消息转换为一个固定长度的值，这个值也称作哈希（`hash`）。这一讲，我们简单介绍一下哈希函数及在`solidity`的应用\n\n## Hash的性质\n\n一个好的哈希函数应该具有以下几个特性：\n\n* 单向性：从输入的消息到它的哈希的正向运算简单且唯一确定，而反过来非常难，只能靠暴力枚举。\n* 灵敏性：输入的消息改变一点对它的哈希改变很大。\n* 高效性：从输入的消息到哈希的运算高效。\n* 均一性：每个哈希值被取到的概率应该基本相等。\n* 抗碰撞性：\n  * 弱抗碰撞性：给定一个消息`x`，找到另一个消息`x'`使得`hash(x) = hash(x')`是困难的。\n  * 强抗碰撞性：找到任意`x`和`x'`，使得`hash(x) = hash(x’)`是困难的。\n\n## Hash的应用\n\n* 生成数据唯一标识\n* 加密签名\n* 安全加密\n\n## Keccak256\n\n`Keccak256`函数是`solidity`中最常用的哈希函数，用法非常简单：\n\n```\n哈希 = keccak256(数据);\n```\n\n### 生成数据唯一标识\n\n我们可以利用`keccak256`来生成一些数据的唯一标识。比如我们有几个不同类型的数据：`uint`，`string`，`address`，我们可以先用`abi.encodePacked`方法将他们打包编码，然后再用`keccak256`来生成唯一标识：\n\n```\n    function hash(\n        uint _num,\n        string memory _string,\n        address _addr\n    ) public pure returns (bytes32) {\n        return keccak256(abi.encodePacked(_num, _string, _addr));\n    }\n```\n\n### 弱抗碰撞性\n\n我们用`keccak256`演示一下之前讲到的弱抗碰撞性，即给定一个消息`x`，找到另一个消息`x'`使得`hash(x) = hash(x')`是困难的。\n\n我们给定一个消息`0xAA`，试图去找另一个消息，使得它们的哈希值相等：\n\n```\n    // 弱抗碰撞性\n    function weak(\n        string memory string1\n    )public view returns (bool){\n        return keccak256(abi.encodePacked(string1)) == _msg;\n    }\n```\n\n大家可以试个10次，看看能不能幸运的碰撞上。\n\n### 强抗碰撞性\n\n我们用`keccak256`演示一下之前讲到的强抗碰撞性，即找到任意不同的`x`和`x'`，使得`hash(x) = hash(x’)`是困难的。\n\n我们构造一个函数`strong`，接收两个不同的`string`参数`string1`和`string2`，然后判断它们的哈希是否相同：\n\n```\n    // 强抗碰撞性\n    function strong(\n        string memory string1,\n        string memory string2\n    )public pure returns (bool){\n        return keccak256(abi.encodePacked(string1)) == keccak256(abi.encodePacked(string2));\n    }\n```\n\n大家可以试个10次，看看能不能幸运的碰撞上。\n\n## 总结\n\n这一讲，我们介绍了什么是哈希函数，以及如何使用`solidity`最常用的哈希函数`keccak256`。", "timestamp": 1653243013, "digest": "csiRSVEpEwj7f0OOtSpm1KdGHRqD4fNogmiahHx60nE", "contributor": "0x25df6DA2f4e5C178DdFF45038378C0b08E0Bce54"}
