{"id": "wlYRKzIHMU97G7tJ5nrJbB74ZZ1k4-x0OHcsuKCj51o", "title": "Test", "body": "[Test Vanilla Crowdfund v2.3](crowdfund://0x8bB8D7Ab0f9cFe4098750025b39A580eC6918806?version=3&network=rinkeby&features=overview,editions,backers,podium&podium_media=https%3A%2F%2Fimages.mirror-media.xyz%2Fnft%2Fstateful-crowdfund.jpg&endsAt=1628006400000)", "timestamp": 1627612649, "digest": "dbUoB3opFBa7qmbPWOMxFdWB4ghbuIoXkd5Qkl95fFk", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "m5kfuQFBTi7wXvJRySeUA-Sfq4iat9PAgNub6Q5pLXg", "title": "Test", "body": "[Test Vanilla Crowdfund v2.3](crowdfund://0x8bB8D7Ab0f9cFe4098750025b39A580eC6918806?version=3&network=rinkeby&features=overview)\n\nThe Beacon Book was our first project along this path: a piece of Ethereum history featuring profiles, reflections, and stories of the contributors that brought the Eth2 Beacon Chain to life. This book is a snapshot of sentiment from around the launch in December 2020, neatly packaged into a 5.5x8.5\" (140x215mm) soft cover book. In line with our founding ethos, any ETH generated from the project goes directly to project contributors, which includes the Eth2 researchers.\n\n[Test Vanilla Crowdfund v2.3](crowdfund://0x8bB8D7Ab0f9cFe4098750025b39A580eC6918806?version=3&network=rinkeby&features=backers)\n\nStateful Works began in August 2020 with a simple thesis: maintainers of Public Goods should be celebrated! And not just through monetary rewards: we should also be creating artifacts and traditions that accrue cultural capital.\n\n[Test Vanilla Crowdfund v2.3](crowdfund://0x8bB8D7Ab0f9cFe4098750025b39A580eC6918806?version=3&network=rinkeby&features=podium&podium_media=https%3A%2F%2Fimages.mirror-media.xyz%2Fnft%2Fstateful-crowdfund.jpg&endsAt=1628006400000)", "timestamp": 1627613238, "digest": "dbUoB3opFBa7qmbPWOMxFdWB4ghbuIoXkd5Qkl95fFk", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "r3KNpZms4618M_UYmnfaO-qq3Tz-lRWrkAXdPn-TdtM", "title": "Test", "body": "[Test Vanilla Crowdfund v2.3](crowdfund://0x8bB8D7Ab0f9cFe4098750025b39A580eC6918806?version=3&network=rinkeby&features=overview)\n\nThe Beacon Book was our first project along this path: a piece of Ethereum history featuring profiles, reflections, and stories of the contributors that brought the Eth2 Beacon Chain to life. This book is a snapshot of sentiment from around the launch in December 2020, neatly packaged into a 5.5x8.5\" (140x215mm) soft cover book. In line with our founding ethos, any ETH generated from the project goes directly to project contributors, which includes the Eth2 researchers.\n\nStateful Works began in August 2020 with a simple thesis: maintainers of Public Goods should be celebrated! And not just through monetary rewards: we should also be creating artifacts and traditions that accrue cultural capital.\n\n[Test Vanilla Crowdfund v2.3](crowdfund://0x8bB8D7Ab0f9cFe4098750025b39A580eC6918806?version=3&network=rinkeby&features=backers,podium&podium_media=https%3A%2F%2Fimages.mirror-media.xyz%2Fnft%2Fstateful-crowdfund.jpg&endsAt=1628006400000)", "timestamp": 1627613313, "digest": "dbUoB3opFBa7qmbPWOMxFdWB4ghbuIoXkd5Qkl95fFk", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "TbI0rp9XYPUeZ2jmXlsoNBAxVLCwYR60QocJPLXlar0", "title": "Crowdfunding 100 Physical Beacon Books", "body": "**This post outlines the final component of the Beacon Book project, an open Crowdfund for 100 physical Genesis Edition prints.**\n\n---\n\nStateful Works began in August 2020 with a simple thesis: maintainers of Public Goods should be celebrated! And not just through monetary rewards: we should also be creating artifacts and traditions that accrue cultural capital.\n\nThe Beacon Book was our first project along this path: **a piece of Ethereum history** featuring profiles, reflections, and stories of the contributors that brought the Eth2 Beacon Chain to life. This book is a snapshot of sentiment from around the launch in December 2020, neatly packaged into a 5.5x8.5\" (140x215mm) soft cover book. In line with our founding ethos, any ETH generated from the project goes [directly](https://mirror.xyz/splits/0x4Eb0D2b356da831aC613aEf9EC3D705d78DFd197) to project contributors, which includes the Eth2 researchers.\n\nThe Beacon Book is your chance to contribute directly to the Ethereum story. Own part of its past, and a key to the future.\n\nThe project includes three main components:\n\n- The text itself: [Read here](https://stateful.mirror.xyz/Y1ED9RorG9OvEUXD8NBmXgYhSVhjj8H537-I2SZJkYA)\n- mintable NFTs of book graphics: [Mint Here](https://stateful.mirror.xyz/Y1ED9RorG9OvEUXD8NBmXgYhSVhjj8H537-I2SZJkYA)\n- 100 physical Genesis Editions **↓ excerpts and crowdfund below ↓**\n\n![](https://images.mirror-media.xyz/publication-images/19464179-8493-4f3e-837b-292981b97486.png?height=2500&width=4000)\n\n*back and front covers*\n\n![](https://images.mirror-media.xyz/publication-images/d4141985-ce60-4d8d-9da8-9b136454566c.png?height=2500&width=3000)\n\n*pages 19-20*\n\n![](https://images.mirror-media.xyz/publication-images/d6efc87d-590a-43e1-afef-4743e1c5934e.png?height=2500&width=3000)\n\n*\"Traditions\" NFT, pages 35-36*\n\n![](https://images.mirror-media.xyz/publication-images/49f3aedc-f5f1-4a42-91c7-9723d0ace474.png?height=2500&width=3000)\n\n*pages 27-28*\n\n![](https://images.mirror-media.xyz/publication-images/332b986c-c12f-47ff-af03-2391f3378892.png?height=2500&width=3000)\n\n*pages 55-56*\n\nCheck out a complete breakdown of the imagery in [Beacon Book: Graphics and Narratives](https://stateful.mirror.xyz/jOFMjyRtgT0KPbeWgysDp1HM4mQnlWKeQA3HQ2SJpbA).\n\n[Stateful Crowdfund](crowdfund://0x6458b744375ABaB0779df9e79d6B30E192513D16?network=mainnet&features=overview)\n\n## Crowdfunding 100 Physical Genesis Editions\n\nWe will be using the crowdfund leaderboard to simulate an auction and select the winners of 100 Genesis Editions. While there may be future prints, this edition is notable for being the inaugural print run. Please read the following information before participating:\n\n1. The crowdfund will last until **August 3rd, 16:00 UTC.**\n2. The top 100 contributors will receive physical Genesis Edition books 1-100, according to their ranking in the crowdfund leaderboard below. In addition, their copy of the book will have the final rank, eg. 1/100, inscribed on the pages 1-2, the provenance page ([see here](https://stateful.mirror.xyz/jOFMjyRtgT0KPbeWgysDp1HM4mQnlWKeQA3HQ2SJpbA)). Finally, the top 100 contributors will also receive a unique NFT featuring the the cover of the book (see below).\n3. **Contributions are final and non-refundable**, so make sure to bid strategically. Your ranking will likely change over the course of the crowdfund, and you can even be pushed out of the top 100, therefore ineligible for the physical book. All ETH contributions go to the project contributors, including the featured Eth2 developers.\n3. Our recommended minimum bid for a book is **.05 ETH (~$100)**. This considers the cost of production over the past 9 months / +500 hours, the effort and time put in by Eth2 contributors, the work of the artists, printing, packaging, shipping, and various other costs. \n4. Please be aware in order to receive their copy, the top 100 contributors will need to supply a **street address**. After delivery confirmation, your address will be deleted. \n5. Once you have submitted a contribution, please remember to complete the email form below. This signed message proves you participated in the crowdfund, and lets us get in touch for shipping info if you are in the top 100.\n4. All crowdfund participants will also get a commemorative token ($STATEFUL), regardless of their final ranking. This represents your participation in a novel cultural Ethereum event as a thank you from the team!\n5. [Sign up here](https://forms.gle/mBLSmZfxM8RmMJ9F7) to be reminded 24 hours and 6 hours before the crowdfund closes.\n\n[Stateful Crowdfund](crowdfund://0x6458b744375ABaB0779df9e79d6B30E192513D16?network=mainnet&features=podium,backers&podium_media=https%3A%2F%2Fimages.mirror-media.xyz%2Fnft%2Fstateful-crowdfund.jpg&endsAt=1628006400000)\n\n[Stateful Crowdfund Survey](survey://2?address=0x6458b744375ABaB0779df9e79d6B30E192513D16&title=Verify%20your%20email%0A&description=Once%20you%27ve%20contributed%2C%20please%20fill%20out%20this%20form.%20It%20will%20cryptographically%20sign%20a%20message%2C%20and%20allow%20us%20to%20contact%20the%20top%20100%20contributors%20after%20the%20Crowdfund%20concludes.%20This%20feature%20may%20not%20work%20with%20multisig%20wallets%20(eg.%20Argent,%20Gnosis)%20-%20please%20join%20our%20discord%20for%20manual%20verification.%20Your%20information%20will%20never%20be%20sold%20or%20shared%20with%20a%20third%20party.%0A&question=Enter%20your%20preferred%20email%20address.)\n\n→ Join the [Stateful Works Discord](https://discord.gg/dQftW5bNQy) for manual verification.\n\n## Contributors\n\nThanks again to all of our 51 contributors - whose perspectives are included in the book - and where applicable, them forwarding on their share of the proceeds to Stateful Works:\n\nAditya Asgaonkar\nAdrian Manning\nAdrian Sutton\nAfri Schoedon\nAlex Stokes\nAlex Vlasov\nAnon\nAnon\nBen Edgington\nCarl Beekhuizen\nCayman Nava\nCeleste Seberras\nCem Ozer\nChaz Schmidt\nChih Cheng Liang\nDankrad Feist\nDanny Ryan\nDmitriy Ryajov\nHsiao-Wei Wang\nIvan Martinez\nJacek Sieka\nJonny Rhea\nJoseph Delong\nJosephC \nJustin Drake\nKarl Floersch\nKirk Baird\nMamy André-Ratsimbazafy\nMatt Garnett \nMehdi Zerouali\nMeredith Baxter\nMichael Sproul\nMiguel Piedrafita\nMikhail Kalinin\nNathaniel Jensen\nNishant Das\nPaul Hauner\nPawan Dhananjay\nPreston Van Loon\nProtolambda\nRadosław Kapka\nRaul Jordan\nRobert Drost \nSam Wilson \nShay Zluf\nStefan Talpalaru\nTerence Tsao\nTrent Van Epps\nVictor Farazdagi\nVitalik Buterin\nWill Villanueva\n\n---\n\nIt's been an amazing experience working with everyone! To the entire Ethereum community: you made this project possible, we can't thank you enough. Here's to the Merge and beyond.\n\n❤️ Stateful Works", "timestamp": 1627619719, "digest": "-NLDSw0mA2vjtvqQYpXBOa3H38HXMmIdaw2KwI1A0y8", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "VbcZb9_qEhoBbfs93o2uSQ0tyFpsmTrB4VjPbj0DOTo", "title": "A brief introduction to Derive", "body": "### A new and experimental web3 platform for 7-track compilations called *chains* put in the world to explore new models for funding, curating and distributing music.\n----\nDerive is founded on the premise that the ways in which we create, share and convene around music should spring from the creators, their work and their audience. It is an attempt at locating positive alternatives to the commonplace modes of operation in the music industry. Alternatives that are **sustainable and transparent** and work for both the creators and their audience.\n\n### How does it work?\n\nA token is passed from creator to creator allowing the holder to add a work to the chain whereby the token's path through the network of contributors function as the curation mechanism.\n\nEach chain is funded by the sale of **100 collector edition tokens** that grant access to downloads, special discord channels and further perks down the line.\n\n### How do I get involved?\n\nFirst ting to do is to pick up one of the collector tokens listed on OpenSea for a mere 0.01 ETH. Doing so directly supports the contributing artists and their work.\n[https://opensea.io/assets/0xderive](https://opensea.io/assets/0xderive)\n\nSecondly there's the Discord. It's open for everyone to join and we encourage you to do so if you're just remotely interested in learning more about Derive and where we're going with this.\n[https://discord.gg/q4FJBkXF8Y](https://discord.gg/q4FJBkXF8Y)\n\n### How far is the project?\n\nThe first two of four genesis chains have been launched and the first music has already been added. We've sold the first collector tokens and funds have been transferred to the creators in accordance with the funding model. It dictates a **direct 10% share** for each contributing artist or group. The collector tokens are being released as the chain progresses and new contributors are onboarded.\n\n### What's the plan?\n\nBecause much of the process at the moment is manual the four genesis chains allow us to tweak and refine the process and models as we set them in motion. The idea is to figure out what parts work and improve and automate things as Derive progresses. That means developing new smarts contracts, improve and add more features to the UI and work on including the community in more and more processes. We want to develop the project in a direction that best suits the two main groups of the project: contributors and collectors aka artist and audience.\n\nConcerning the latter we are actively working to form a **DAO** around Derive. A community platform owned, operated and developed by the people contributing to it is the end goal for this project.\n\nThanks for reading and stay tuned for more!\n\n💿⛓️\n\n[derive.works](https://derive.works)", "timestamp": 1627624982, "digest": "VohVXHjolw1NuuzpwZmfRTuJO9qdRrPAQH0w8IQc1FU", "contributor": "0x59abbee2F246946Dba01fb037Be603CC0B2B3909"}
{"id": "ykaPYVsbiP0NwLn9Y7JSGsR_CoYrhHjQIMSAx9hLhpo", "title": "The Three \"U\"s of DeFi Ubiquity", "body": "_Mapping out the hurdles DeFi will face in its quest for mainstream adoption 🗺_\n\n![](https://images.mirror-media.xyz/publication-images/fb74026e-512e-4592-a5ec-dfe8f42d7c4e.png?height=1500&width=2500&refresh=true)\n\nDecentralised Finance, DeFi, is thought by many to be the future of the financial services industry and is expected to completely change the way people think about money and the systems and institutions they entrust to look after their money. The space has you covered for anything ranging from [peer-to-protocol lending protocols](https://aave.com/) to [insurance policies that protect users from loss of funds due to protocol bugs](https://nexusmutual.io/). Derivative protocols like [Synthetix](https://synthetix.io/) have you covered for any investments in non ETH-based assets, and you need look no further than [Opyn](https://www.opyn.co/) for all your cash-settled options trading needs. \n\nThe space is quickly starting to resemble a fully functional financial system, with all the applications and systems needed for standard retail investor transactions established and regularly audited, but also the most niche structured products thriving and innovating further with every passing day. \n\nHowever, the most striking difference is that DeFi is trying to do what TradFi (Traditional Finance) did over the past 2,000 years in just a couple of years. This pace of innovation is in large part aided by the true and native [composability](https://medium.com/coinmonks/the-true-power-of-defi-composability-14fe8355e0d0#:~:text=Composability%2C%20in%20DeFi%2C%20is%20the,and%20therefore%20each%20other's%20utility.) of DeFi which allows projects to seamlessly integrate with each other like Lego and create mind-blowing synergies. DeFi is well on its way to catching up to TradFi in terms of functionality and has its eyes set on surpassing it as soon as the mainstream is ready. \n\n![](https://images.mirror-media.xyz/publication-images/6d974fc1-8031-47f3-9f5b-4bda5509abc9.png?height=700&width=1801)\n\nThe future is bright for DeFi, and the space is always vibrant and full of energy, no matter the state of the overall crypto market. We are still a while away from widespread adoption of DeFi, and as many people often say, *we are still early*. [Metamask](https://metamask.io/), the most popular chrome extension based wallet used to interact with DeFi, only recently reached 5 million monthly active users. Mainstream adoption too soon would potentially come at the wrong time for DeFi as the applications may not be properly optimised to support the large and sudden influx of users, but I have had a lot of time to think about this problem lately and have come to some conclusions about what I believe are the main hurdles DeFi needs to surpass before it is truly ready for the *mainnet* to hit the *mainstream*.\n\n![](https://images.mirror-media.xyz/publication-images/76a440fa-1ae5-443a-97fd-356ebd1a0f25.png?height=848&width=2152)\n\nI call these hurdles **the Three \"U\"s of DeFi Ubiquity**.\n\n## Usability\n\nThe first, and arguably most important of these hurdles to ubiquity, is usability. Many of the most successful DeFi protocols are advanced, regularly audited and professionally run but have user interfaces that are unapproachable to all but the most sophisticated investors. In reality, the underlying service these protocols are offering is groundbreaking in the quest for the democratisation of many of the world's most powerful financial instruments which were previously unavailable to most retail investors. Consequently it is important that the people set to benefit the most from this democratisation are also able to understand and use these tools without having to resort to financial advisors.\n\nThe key to this issue is going to be knowing which parts of the UI to hide, and which to display prominently. [Uniswap](https://uniswap.org/) is one of the market leaders in keeping its UI simple yet powerful. Still, there will eventually be a divergence of the consumer level interfaces and pro-level interfaces using the same backend, a bit like [Coinbase](https://www.coinbase.com) vs [Coinbase **Pro**](https://pro.coinbase.com) to really drive this point home. [Metamask](https://metamask.io/) does not focus greatly on UI refinement at the moment, but it will take a [beginner-friendly browser wallet](https://rainbow.me) that has a good fiat on-ramp and perhaps doesn't even refer to itself as a wallet but more as a key to Web3 to really help push DApps into the mainstream. \n\nIncreasingly we will start to see startups cropping up worldwide in various industries focusing on leveraging DeFi technologies to verticalise and fine-tune the experience for different audiences with different financial preferences. The technology behind many of the most popular DeFi protocols is optimised for scale, performance and reliability, so there is a wide-open opportunity for startups to come into specific geographies such as developing economies, where debt financing for small businesses is harder to come by, and build a straightforward front end. This front end could then automatically tap into the sea of open-source protocols and liquidity that is readily available. It could then focus on making it accessible to non-crypto-native audiences with seamless on-ramps for Fiat which, in the future, could allow someone in Venezuela to take out a loan using stablecoins on [AAVE](http://aave.com/) using an [L2 solution like Polygon](https://polygon.technology/) without ever noticing that they have done all of this on a trustless and decentralised back end. \n\nIdeally, customers would eventually be aware of the fact that they are interacting with DeFi, but in order to reach a truly mainstream audience there will be a transitionary period where perhaps these front ends do not lean too heavily into the crypto angle. This movement comes straight out of the playbook of new Fintech startups like [Monzo](https://monzo.com/) and [Revolut](https://www.revolut.com/) that have spent the past decade taking complex financial systems, reducing their complexity and making them accessible to retail investors. These startups often build on top of TradFi and reduce friction for retail users by bending the rules or by [bundling transactions together](https://www.freetrade.io). DeFi could use the same approach and reduce friction even further by abstracting away the complexities of the Ethereum blockchain and presenting a seamless solution to the end-user. It is unlikely that this simplified DeFi front end innovation will come from the existing Fintech incumbents because the way they are used to working is so different to the way DeFi works. TradFi Fintech startups are used to pushing up against and fighting the traditional systems to try and squeeze them into a user experience that is pleasant to use. The DeFi space is flexible by design so the approach taken by these verticalised DeFi gateways will be simple, and even encouraged by the protocols themselves, contrary to the struggles faced by TradFi Fintech startups where in this case the incumbent banks are constantly trying to play catch-up with the challenger Fintech startups . \n\n![](https://images.mirror-media.xyz/publication-images/619cb9ed-b108-46e9-af75-3b211568bb06.png?height=806&width=1825)\n\nWhile there will be many independent startups fulfilling this function and maybe even getting funded through the protocols' own grants DAOs, many of these usability improvements will also come from the protocols' own core teams, especially on the institutional side. Institutional TradFi, at least in the short term, tends to prefer interacting directly with the people that built the technology they are going to be leveraging. [AAVE](https://www.aave.com) has actually started experimenting with [permissioned pools for institutional investors](https://cointelegraph.com/news/defi-lending-platform-aave-reveals-private-pool-for-institutions) because institutional investors previously found it tough to use the protocol due to lack of [KYC and AML](https://complyadvantage.com/knowledgebase/kyc-aml-know-your-customer-vs-anti-money-laundering/) compliance, and this has allowed banks and other institutional clients using [AAVE](https://www.aave.com) to know that the other parties in the network are compliant and vetted not to be on an [OFAC sanctions list](https://home.treasury.gov/policy-issues/office-of-foreign-assets-control-sanctions-programs-and-information). This is just another example of DeFi slightly adapting to TradFi without compromising on their core principles as an almost intermediate stage to mainstream adoption. Whether that be through making it feel like Fiat through stable-coins, or increasing KYC for institutions to help them to feel more at ease about the protocols they are transacting with, these measures all go a long way towards lowering hurdles to mass adoption. \n\nIt is also likely that whilst at this early stage the protocol teams themselves are working on the UI and UX as well as the underlying infrastructure, they may slowly start to shift their focus away from the consumer side and specialise more on the protocol itself. This would likely manifest itself in protocols keeping their existing UIs more as a reference with the aim of slowly phasing them out in the very long-term. Platforms like [Zapper](https://www.zapper.fi) and [Zerion](https://zerion.io/), which are focused almost exclusively on usability and accessibility, will then step in to focus on the front ends and leave the protocol teams free to optimise their platforms.\n\nThe runway is wide open, and the tech is ready. These protocols exist and are being built and tested by thousands of users every day. The best part is that anyone can come in and make them more useful to any specific demographic. Look no further than projects like [Ribbon](https://www.ribbon.finance) to see this in action. [Ribbon](htts://www.ribbon.finance) has made some sophisticated covered call strategies available to anyone with a [Metamask wallet](https://metamask.io/) by building directly on [Opyn's](https://www.opyn.co/) cash-settled ETH options protocol, all while making it feel as simple as an, admittedly high-risk, savings account to the end-user.\n\n![](https://images.mirror-media.xyz/publication-images/ea0ec888-d3db-4856-af1d-48280478715d.png?height=851&width=2325)\n\n## Undercolateralisation \n\nThe second hurdle is the issue of overcolateralisation in DeFi lending protocols. When you put the whole DeFi stack together, what you are left with is essentially a fully decentralised crypto bank that runs itself in the most traditional sense of the word. DeFi, just like a bank, allows you to convert between currencies, deposit money and receive interest in return for providing liquidity to the bank to then allow them to loan it back out. On the other side of the equation, anyone can then go to the bank, take out a loan and then pay it back at a rate most suited to their risk profile and time horizon. In TradFi some loans are unsecured, but many are secured in that they have some form of collateral backing the loan. If you fail to pay back said loan, the traditional bank has the legal authority to repossess that asset and liquidate it in exchange for cash. The percentage of the total loan required as collateral often depends on a credit score and past successful repayment of loans. Some traditional bank loans are overcollateralised when the asset is highly illiquid to make sure that enough cash can be recouped in the event of a loan default. Conversely in most DeFi lending protocols, you need to provide significantly more crypto as collateral than the stable-coins you are borrowing, sometimes as much as 700%.\n\nIt can be hard to understand why someone would ever want to take out a loan worth less than the amount they are putting down as collateral, and whilst there are some valid reasons for this such as delaying a taxable event or increasing leverage on positions through complex financial gymnastics, the vast majority of the world is **unwilling** or, more importantly, **unable** to borrow money in this way. \n\nThe main reason people borrow money is precisely because they do not have the spare capital available at that time. People take out mortgages to buy houses, or take out loans to start a small business in their hometown. Sometimes a mortgage may even start highly collateralised but later turn undercollateralised if the value of the house goes down, however due to the credit history of the borrower the loan is still able to remain a [_performing loan_](https://pocketsense.com/difference-between-performing-nonperforming-loans-12224160.html). The downside of undercollateralisation is of course that if the loan were to default, the collateral would not be able to cover the principal. In this case, the borrower would step in to cover the difference if they are in fact creditworthy and have some reputational skin in the game not to run off with the money with no consequence. \n\n![](https://images.mirror-media.xyz/publication-images/17b662fe-a9af-4b5c-afda-aeb07b88e131.png?height=845&width=2138)\n\nTo cater properly to these kinds of users it is important that DeFi eventually gets to a point where loans can be undercollateralised in some way. The difficulty is that DeFi is by its very nature anonymous and trustless, which means that the concept of social proof and credit scores becomes very difficult to handle and potentially even ideologically problematic. A potential solution could be a quasi-anonymous loan passport solution in which the user is anonymous on one dimension but not on another, i.e. their wallet address is public, but the owner of the wallet is not. One could, in theory, understand someone's creditworthiness through their DeFi loans history, which is of course publicly visible on Web3 or even decrease the user's collateral requirement for their next loan by a certain percentage every time they repay successfully. Another alternative is allowing user loans to be secured and guaranteed by other individuals they know in real life that trust the borrower enough to guarantee their loan and [delegate their credit](https://docs.aave.com/developers/guides/credit-delegation).\n\nPerhaps we could even see some CeFi institutions step in to perform credit checks on DeFi users on a per address basis. This solution would, of course, introduce some centralisation as it would involve real-identity based KYC, but may be a necessary interim solution for users that prioritise a low collateral ratio over absolute anonymity as lending protocols could eventually introduce pools of loans where a trusted third party has verified creditworthiness in advance. This CeFi verification could also be a [Zero Knowledge Proof](https://www.wired.com/story/zero-knowledge-proofs/), in that the verifying party would know that the borrower is creditworthy but would essentially allow the borrowers to prove their creditworthiness to another party without having to reveal their identity. When the borrower proves their creditworthiness with zero knowledge, they would display the fact that the CeFi institution has deemed them creditworthy as a boolean value in their wallet, perhaps as a non-transferrable NFT.\n\nThere are already some great projects being built in this space like [teller.finance](https://www.teller.finance/) which is taking a similar approach to the aforementioned CeFi integration by connecting to your bank account through [Plaid](https://plaid.com/) and then offering risk-assessed DeFi loans on their platform without the need for collateral. Although we are still a while away from a foolproof creditworthiness checker solution in DeFi there are many different approaches one can take and I believe a combination of these approaches will play a large part in solving the issue of collateralisation in the quest for widespread adoption.\n\nAside from lending protocols, there is also a significant level of overcollateralisation across the whole DeFi universe which was initially there for the sake of simplicity including in options protocols. There has been some great research done into [improving the collateral efficiency of these protocols](https://medium.com/opyn/partially-collateralized-options-now-in-defi-b9d223eb3f4d) to allow for partial collateralisation without having to worry about creditworthiness through strategic liquidations with a \"shock buffer\" of a size large enough to withstand a Black Thursday event.\n\n## Understandability\n\nThe final hurdle that, depending on how you look at things could be the hardest or easiest of these to solve, is the difficulty around understandability and education. This hurdle may ultimately solve itself if the first two issues are solved and DeFi starts to resemble the way in which users are used to dealing with and thinking about finances. However, it is still important to acknowledge that for non-technical people, the DeFi space can be very opaque and consequently more difficult to trust.\n\n![](https://images.mirror-media.xyz/publication-images/46fc773f-114b-42c0-b1db-eade3492e306.png?height=697&width=2015)\n\nFiat money and the way centralised traditional financial systems work is deeply ingrained in our culture and is a little easier to properly comprehend because many parts of the system rely on trust and simple written agreements which come together to form financial systems. Understanding the way these systems work in DeFi is a lot less straightforward. While in TradFi it is relatively straightforward to explain the basics of how a bank works, in that one can deposit money, and in return the bank lends that money out and pays interest for that privilege. There are very few parts of that process that are opaque because, ultimately, it just involves numbers moving from one spreadsheet to another.\n\nThe difference with DeFi is that you first have to feel comfortable with the concept of decentralisation, anonymity, trustless systems, distributed ledgers, and then you have to try and explain how all of this functions automatically through smart-contracts. There are many parts of DeFi that have to be hand-waved away and perhaps this could become a hindrance to trust. \n\nOne could also, of course, argue that many people implicitly trust the banking system because enough other trusted people do and not because they understand every part of the process. The same could eventually be true when enough knowledgeable people trust DeFi and understand a good enough percentage of the current information gaps. \n\nThere are some great resources out there like [Finematics](https://finematics.com/) and [Bankless](https://banklesshq.com/) doing amazing things in the education space and teaching newcomers about all things DeFi. This will be crucial in making sure people are comfortable enough with the technology to use it, especially when currently decentralisation slightly goes against the grain and users may be met with scepticism from friends and family. \n\n![](https://images.mirror-media.xyz/publication-images/56920551-f6e6-47ad-b44d-493b815bc264.png?height=589&width=1262)\n\nIt should, however, be noted that the younger digital-native generation finds the concept of digital money extremely intuitive as they have grown up interacting with various in-game currencies, and the youngest among them have potentially never even used physical cash in their lives. This will undoubtedly make the proliferation of DeFi a more natural process as Gen-Z is starting to trust the digital world more than physical and may even start to learn about finance through DeFi in context rather than adapting antiquated financial concepts to fit the DeFi world as in the current status-quo.\n\n\n\nOverall the space is going in all the right directions. It will take a while for these ideas to materialise fully, but this is the part that interests me the most about the DeFi space. There is so much mind-blowing R&D going on every day, and people are experimenting, taking risks and breaking boundaries. I'm very passionate about making sure as many people as possible have access to these tools and can take part in the revolution. Understanding the pieces of the puzzle left to fill will become increasingly important as the protocols we rely on are built out and refined and start to look towards the next steps.\n\nThank you for taking the time to read this piece 💙 \n\nIf you enjoyed the piece and are interested in receiving more of my content or keeping up to date with anything else I get up to a follow on [Twitter](https://www.twitter.com/coconidodev) would be great... or if you're more of an email person that works too - **subscribe to my infrequent mailing list** via the link below.", "timestamp": 1627625929, "digest": "klQF-dVD9TOVI288YuTObvBVY5_GsrmBGDunRoWpYt8", "contributor": "0xcde3725B25D6d9bC78CF0941cC15Fd9710c764b9"}
{"id": "WVZEYCN5RAmlQA2m5_xGRD2XAOFnmc64HqwMYX1MPrc", "title": "The Three \"U\"s of DeFi Ubiquity", "body": "_Mapping out the hurdles DeFi will face in its quest for mainstream adoption 🗺_\n\n![](https://images.mirror-media.xyz/publication-images/549eeeb5-1813-412b-95c6-e98fed96906a.jpg?height=1500&width=2500&refresh=true)\n\nDecentralised Finance, DeFi, is thought by many to be the future of the financial services industry and is expected to completely change the way people think about money and the systems and institutions they entrust to look after their money. The space has you covered for anything ranging from [peer-to-protocol lending protocols](https://aave.com/) to [insurance policies that protect users from loss of funds due to protocol bugs](https://nexusmutual.io/). Derivative protocols like [Synthetix](https://synthetix.io/) have you covered for any investments in non ETH-based assets, and you need look no further than [Opyn](https://www.opyn.co/) for all your cash-settled options trading needs. \n\nThe space is quickly starting to resemble a fully functional financial system, with all the applications and systems needed for standard retail investor transactions established and regularly audited, but also the most niche structured products thriving and innovating further with every passing day. \n\nHowever, the most striking difference is that DeFi is trying to do what TradFi (Traditional Finance) did over the past 2,000 years in just a couple of years. This pace of innovation is in large part aided by the true and native [composability](https://medium.com/coinmonks/the-true-power-of-defi-composability-14fe8355e0d0#:~:text=Composability%2C%20in%20DeFi%2C%20is%20the,and%20therefore%20each%20other's%20utility.) of DeFi which allows projects to seamlessly integrate with each other like Lego and create mind-blowing synergies. DeFi is well on its way to catching up to TradFi in terms of functionality and has its eyes set on surpassing it as soon as the mainstream is ready. \n\n![](https://images.mirror-media.xyz/publication-images/6d974fc1-8031-47f3-9f5b-4bda5509abc9.png?height=700&width=1801)\n\nThe future is bright for DeFi, and the space is always vibrant and full of energy, no matter the state of the overall crypto market. We are still a while away from widespread adoption of DeFi, and as many people often say, *we are still early*. [Metamask](https://metamask.io/), the most popular chrome extension based wallet used to interact with DeFi, only recently reached 5 million monthly active users. Mainstream adoption too soon would potentially come at the wrong time for DeFi as the applications may not be properly optimised to support the large and sudden influx of users, but I have had a lot of time to think about this problem lately and have come to some conclusions about what I believe are the main hurdles DeFi needs to surpass before it is truly ready for the *mainnet* to hit the *mainstream*.\n\n![](https://images.mirror-media.xyz/publication-images/76a440fa-1ae5-443a-97fd-356ebd1a0f25.png?height=848&width=2152)\n\nI call these hurdles **the Three \"U\"s of DeFi Ubiquity**.\n\n## Usability\n\nThe first, and arguably most important of these hurdles to ubiquity, is usability. Many of the most successful DeFi protocols are advanced, regularly audited and professionally run but have user interfaces that are unapproachable to all but the most sophisticated investors. In reality, the underlying service these protocols are offering is groundbreaking in the quest for the democratisation of many of the world's most powerful financial instruments which were previously unavailable to most retail investors. Consequently it is important that the people set to benefit the most from this democratisation are also able to understand and use these tools without having to resort to financial advisors.\n\nThe key to this issue is going to be knowing which parts of the UI to hide, and which to display prominently. [Uniswap](https://uniswap.org/) is one of the market leaders in keeping its UI simple yet powerful. Still, there will eventually be a divergence of the consumer level interfaces and pro-level interfaces using the same backend, a bit like [Coinbase](https://www.coinbase.com) vs [Coinbase **Pro**](https://pro.coinbase.com) to really drive this point home. [Metamask](https://metamask.io/) does not focus greatly on UI refinement at the moment, but it will take a [beginner-friendly browser wallet](https://rainbow.me) that has a good fiat on-ramp and perhaps doesn't even refer to itself as a wallet but more as a key to Web3 to really help push DApps into the mainstream. \n\nIncreasingly we will start to see startups cropping up worldwide in various industries focusing on leveraging DeFi technologies to verticalise and fine-tune the experience for different audiences with different financial preferences. The technology behind many of the most popular DeFi protocols is optimised for scale, performance and reliability, so there is a wide-open opportunity for startups to come into specific geographies such as developing economies, where debt financing for small businesses is harder to come by, and build a straightforward front end. This front end could then automatically tap into the sea of open-source protocols and liquidity that is readily available. It could then focus on making it accessible to non-crypto-native audiences with seamless on-ramps for Fiat which, in the future, could allow someone in Venezuela to take out a loan using stablecoins on [AAVE](http://aave.com/) using an [L2 solution like Polygon](https://polygon.technology/) without ever noticing that they have done all of this on a trustless and decentralised back end. \n\nIdeally, customers would eventually be aware of the fact that they are interacting with DeFi, but in order to reach a truly mainstream audience there will be a transitionary period where perhaps these front ends do not lean too heavily into the crypto angle. This movement comes straight out of the playbook of new Fintech startups like [Monzo](https://monzo.com/) and [Revolut](https://www.revolut.com/) that have spent the past decade taking complex financial systems, reducing their complexity and making them accessible to retail investors. These startups often build on top of TradFi and reduce friction for retail users by bending the rules or by [bundling transactions together](https://www.freetrade.io). DeFi could use the same approach and reduce friction even further by abstracting away the complexities of the Ethereum blockchain and presenting a seamless solution to the end-user. It is unlikely that this simplified DeFi front end innovation will come from the existing Fintech incumbents because the way they are used to working is so different to the way DeFi works. TradFi Fintech startups are used to pushing up against and fighting the traditional systems to try and squeeze them into a user experience that is pleasant to use. The DeFi space is flexible by design so the approach taken by these verticalised DeFi gateways will be simple, and even encouraged by the protocols themselves, contrary to the struggles faced by TradFi Fintech startups where in this case the incumbent banks are constantly trying to play catch-up with the challenger Fintech startups . \n\n![](https://images.mirror-media.xyz/publication-images/619cb9ed-b108-46e9-af75-3b211568bb06.png?height=806&width=1825)\n\nWhile there will be many independent startups fulfilling this function and maybe even getting funded through the protocols' own grants DAOs, many of these usability improvements will also come from the protocols' own core teams, especially on the institutional side. Institutional TradFi, at least in the short term, tends to prefer interacting directly with the people that built the technology they are going to be leveraging. [AAVE](https://www.aave.com) has actually started experimenting with [permissioned pools for institutional investors](https://cointelegraph.com/news/defi-lending-platform-aave-reveals-private-pool-for-institutions) because institutional investors previously found it tough to use the protocol due to lack of [KYC and AML](https://complyadvantage.com/knowledgebase/kyc-aml-know-your-customer-vs-anti-money-laundering/) compliance, and this has allowed banks and other institutional clients using [AAVE](https://www.aave.com) to know that the other parties in the network are compliant and vetted not to be on an [OFAC sanctions list](https://home.treasury.gov/policy-issues/office-of-foreign-assets-control-sanctions-programs-and-information). This is just another example of DeFi slightly adapting to TradFi without compromising on their core principles as an almost intermediate stage to mainstream adoption. Whether that be through making it feel like Fiat through stable-coins, or increasing KYC for institutions to help them to feel more at ease about the protocols they are transacting with, these measures all go a long way towards lowering hurdles to mass adoption. \n\nIt is also likely that whilst at this early stage the protocol teams themselves are working on the UI and UX as well as the underlying infrastructure, they may slowly start to shift their focus away from the consumer side and specialise more on the protocol itself. This would likely manifest itself in protocols keeping their existing UIs more as a reference with the aim of slowly phasing them out in the very long-term. Platforms like [Zapper](https://www.zapper.fi) and [Zerion](https://zerion.io/), which are focused almost exclusively on usability and accessibility, will then step in to focus on the front ends and leave the protocol teams free to optimise their platforms.\n\nThe runway is wide open, and the tech is ready. These protocols exist and are being built and tested by thousands of users every day. The best part is that anyone can come in and make them more useful to any specific demographic. Look no further than projects like [Ribbon](https://www.ribbon.finance) to see this in action. [Ribbon](htts://www.ribbon.finance) has made some sophisticated covered call strategies available to anyone with a [Metamask wallet](https://metamask.io/) by building directly on [Opyn's](https://www.opyn.co/) cash-settled ETH options protocol, all while making it feel as simple as an, admittedly high-risk, savings account to the end-user.\n\n![](https://images.mirror-media.xyz/publication-images/ea0ec888-d3db-4856-af1d-48280478715d.png?height=851&width=2325)\n\n## Undercolateralisation \n\nThe second hurdle is the issue of overcolateralisation in DeFi lending protocols. When you put the whole DeFi stack together, what you are left with is essentially a fully decentralised crypto bank that runs itself in the most traditional sense of the word. DeFi, just like a bank, allows you to convert between currencies, deposit money and receive interest in return for providing liquidity to the bank to then allow them to loan it back out. On the other side of the equation, anyone can then go to the bank, take out a loan and then pay it back at a rate most suited to their risk profile and time horizon. In TradFi some loans are unsecured, but many are secured in that they have some form of collateral backing the loan. If you fail to pay back said loan, the traditional bank has the legal authority to repossess that asset and liquidate it in exchange for cash. The percentage of the total loan required as collateral often depends on a credit score and past successful repayment of loans. Some traditional bank loans are overcollateralised when the asset is highly illiquid to make sure that enough cash can be recouped in the event of a loan default. Conversely in most DeFi lending protocols, you need to provide significantly more crypto as collateral than the stable-coins you are borrowing, sometimes as much as 700%.\n\nIt can be hard to understand why someone would ever want to take out a loan worth less than the amount they are putting down as collateral, and whilst there are some valid reasons for this such as delaying a taxable event or increasing leverage on positions through complex financial gymnastics, the vast majority of the world is **unwilling** or, more importantly, **unable** to borrow money in this way. \n\nThe main reason people borrow money is precisely because they do not have the spare capital available at that time. People take out mortgages to buy houses, or take out loans to start a small business in their hometown. Sometimes a mortgage may even start highly collateralised but later turn undercollateralised if the value of the house goes down, however due to the credit history of the borrower the loan is still able to remain a [_performing loan_](https://pocketsense.com/difference-between-performing-nonperforming-loans-12224160.html). The downside of undercollateralisation is of course that if the loan were to default, the collateral would not be able to cover the principal. In this case, the borrower would step in to cover the difference if they are in fact creditworthy and have some reputational skin in the game not to run off with the money with no consequence. \n\n![](https://images.mirror-media.xyz/publication-images/17b662fe-a9af-4b5c-afda-aeb07b88e131.png?height=845&width=2138)\n\nTo cater properly to these kinds of users it is important that DeFi eventually gets to a point where loans can be undercollateralised in some way. The difficulty is that DeFi is by its very nature anonymous and trustless, which means that the concept of social proof and credit scores becomes very difficult to handle and potentially even ideologically problematic. A potential solution could be a quasi-anonymous loan passport solution in which the user is anonymous on one dimension but not on another, i.e. their wallet address is public, but the owner of the wallet is not. One could, in theory, understand someone's creditworthiness through their DeFi loans history, which is of course publicly visible on Web3 or even decrease the user's collateral requirement for their next loan by a certain percentage every time they repay successfully. Another alternative is allowing user loans to be secured and guaranteed by other individuals they know in real life that trust the borrower enough to guarantee their loan and [delegate their credit](https://docs.aave.com/developers/guides/credit-delegation).\n\nPerhaps we could even see some CeFi institutions step in to perform credit checks on DeFi users on a per address basis. This solution would, of course, introduce some centralisation as it would involve real-identity based KYC, but may be a necessary interim solution for users that prioritise a low collateral ratio over absolute anonymity as lending protocols could eventually introduce pools of loans where a trusted third party has verified creditworthiness in advance. This CeFi verification could also be a [Zero Knowledge Proof](https://www.wired.com/story/zero-knowledge-proofs/), in that the verifying party would know that the borrower is creditworthy but would essentially allow the borrowers to prove their creditworthiness to another party without having to reveal their identity. When the borrower proves their creditworthiness with zero knowledge, they would display the fact that the CeFi institution has deemed them creditworthy as a boolean value in their wallet, perhaps as a non-transferrable NFT.\n\nThere are already some great projects being built in this space like [teller.finance](https://www.teller.finance/) which is taking a similar approach to the aforementioned CeFi integration by connecting to your bank account through [Plaid](https://plaid.com/) and then offering risk-assessed DeFi loans on their platform without the need for collateral. Although we are still a while away from a foolproof creditworthiness checker solution in DeFi there are many different approaches one can take and I believe a combination of these approaches will play a large part in solving the issue of collateralisation in the quest for widespread adoption.\n\nAside from lending protocols, there is also a significant level of overcollateralisation across the whole DeFi universe which was initially there for the sake of simplicity including in options protocols. There has been some great research done into [improving the collateral efficiency of these protocols](https://medium.com/opyn/partially-collateralized-options-now-in-defi-b9d223eb3f4d) to allow for partial collateralisation without having to worry about creditworthiness through strategic liquidations with a \"shock buffer\" of a size large enough to withstand a Black Thursday event.\n\n## Understandability\n\nThe final hurdle that, depending on how you look at things could be the hardest or easiest of these to solve, is the difficulty around understandability and education. This hurdle may ultimately solve itself if the first two issues are solved and DeFi starts to resemble the way in which users are used to dealing with and thinking about finances. However, it is still important to acknowledge that for non-technical people, the DeFi space can be very opaque and consequently more difficult to trust.\n\n![](https://images.mirror-media.xyz/publication-images/46fc773f-114b-42c0-b1db-eade3492e306.png?height=697&width=2015)\n\nFiat money and the way centralised traditional financial systems work is deeply ingrained in our culture and is a little easier to properly comprehend because many parts of the system rely on trust and simple written agreements which come together to form financial systems. Understanding the way these systems work in DeFi is a lot less straightforward. While in TradFi it is relatively straightforward to explain the basics of how a bank works, in that one can deposit money, and in return the bank lends that money out and pays interest for that privilege. There are very few parts of that process that are opaque because, ultimately, it just involves numbers moving from one spreadsheet to another.\n\nThe difference with DeFi is that you first have to feel comfortable with the concept of decentralisation, anonymity, trustless systems, distributed ledgers, and then you have to try and explain how all of this functions automatically through smart-contracts. There are many parts of DeFi that have to be hand-waved away and perhaps this could become a hindrance to trust. \n\nOne could also, of course, argue that many people implicitly trust the banking system because enough other trusted people do and not because they understand every part of the process. The same could eventually be true when enough knowledgeable people trust DeFi and understand a good enough percentage of the current information gaps. \n\nThere are some great resources out there like [Finematics](https://finematics.com/) and [Bankless](https://banklesshq.com/) doing amazing things in the education space and teaching newcomers about all things DeFi. This will be crucial in making sure people are comfortable enough with the technology to use it, especially when currently decentralisation slightly goes against the grain and users may be met with scepticism from friends and family. \n\n![](https://images.mirror-media.xyz/publication-images/56920551-f6e6-47ad-b44d-493b815bc264.png?height=589&width=1262)\n\nIt should, however, be noted that the younger digital-native generation finds the concept of digital money extremely intuitive as they have grown up interacting with various in-game currencies, and the youngest among them have potentially never even used physical cash in their lives. This will undoubtedly make the proliferation of DeFi a more natural process as Gen-Z is starting to trust the digital world more than physical and may even start to learn about finance through DeFi in context rather than adapting antiquated financial concepts to fit the DeFi world as in the current status-quo.\n\n\n\nOverall the space is going in all the right directions. It will take a while for these ideas to materialise fully, but this is the part that interests me the most about the DeFi space. There is so much mind-blowing R&D going on every day, and people are experimenting, taking risks and breaking boundaries. I'm very passionate about making sure as many people as possible have access to these tools and can take part in the revolution. Understanding the pieces of the puzzle left to fill will become increasingly important as the protocols we rely on are built out and refined and start to look towards the next steps.\n\nThank you for taking the time to read this piece 💙 \n\nIf you enjoyed the piece and are interested in receiving more of my content or keeping up to date with anything else I get up to a follow on [Twitter](https://www.twitter.com/coconidodev) would be great... or if you're more of an email person that works too - **subscribe to my infrequent mailing list** via the link below.", "timestamp": 1627625757, "digest": "klQF-dVD9TOVI288YuTObvBVY5_GsrmBGDunRoWpYt8", "contributor": "0xcde3725B25D6d9bC78CF0941cC15Fd9710c764b9"}
{"id": "W53izE5fpjBqvYrBJ05Tw7JgJWgC7tkq2aWwpumPkm0", "title": "A Prehistory of DAOs", "body": "## Cooperatives, gaming guilds, and the networks to come\n\n_This essay is the second in a [Gnosis Guild](https://twitter.com/gnosisguild?lang=de) series by [@keikreutler](https://twitter.com/keikreutler?lang=de) bridging cryptonetworks, web3, and gaming. The first essay [Inventories, Not Identities](https://blog.gnosis.pm/inventories-not-identities-7da9a4ec5a3e) focuses on collective, composable web3 identity._\n\n_Follow [@GnosisGuild](https://twitter.com/gnosisguild?lang=de) on Twitter to learn about a new constellation of DAO tools launching in early August._\n\nThe year is 1996. John Perry Barlow is about to declare, “The internet consists of transactions, relationships, and thought itself” ([1](https://www.eff.org/de/cyberspace-independence)). \n\nFrom the vantage point of today’s web, someone might argue that only the first part of Barlow’s statement is correct. The spectacle surrounding digital assets suggests that we’ve reached a new level of financialization, continuing a trajectory in which more of our actions online become direct economic interactions. While blockchain-based digital assets are amenable to speculative financial markets, they are not the only application of the technology. During this crest of the hype cycle, we could see relationships forged by new peer-to-peer institutions take root underneath.\n\n![**An early world computer?** Ruzname-i dairevi astronomical tables for both the Arebi (Islamic) and Rumi (Julian) calendars providing chronological accounts of seasonal change, entry of the sun into signs of the zodiac, and times of summer and sunset. Image: [Wellcome Collection](https://wellcomecollection.org/works/wu9m85d6/images?id=p9zusnmd)](https://images.mirror-media.xyz/publication-images/38e90c0a-c2e5-4d73-bcac-daf0bb452bec.jpg?height=1176&width=2330)\n\nOne of the first core applications of public blockchains is global digital assets. Global in the sense that they do not rely on institutions to prove they are not being [double spent](https://en.wikipedia.org/wiki/Double-spending): the mystical cat on the moon NFT is, verifiably, the only mystical cat on the moon NFT corresponding to its token. The utility of provable uniqueness extends to types of relations beyond direct economic exchange as well, which has led many people to think as much about new forms of finance as about new forms of organizations. \n\nYet the promise of new forms of organizations aided by information technology cannot be separated from the context of the internet’s invention. In 1995, a year before John Perry Barlow’s [Declaration of the Independence of Cyberspace](https://www.eff.org/de/cyberspace-independence), another written work that would impact the political ideology of the early internet appeared: [Tribes, Institutions, Markets, Networks (TIMN)](https://www.rand.org/content/dam/rand/pubs/papers/2005/P7967.pdf) by David Ronfeldt. The TIMN report was funded by the RAND Corporation. Darkly parodied in _Dr. Strangelove_ as the BLAND Corporation, it is a non-profit, research and development think tank founded in 1948, which is responsible for informing the policies of the United States military, government, and industry to the present day. Because the internet begins amidst this militarized context, we will start here too ([2](https://www.rand.org/about/history/baran.list.html)).\n\nThe TIMN report creates a narrative of societal evolution in which humans have progressed through four distinct organizational forms:\n\n![(T) **Tribes** have the societal organizing principle of kinship, clans, and lineages. (I) **Institutions** have the societal organizing principle of hierarchy. (M) **Markets** have the societal organizing principle of competitive exchange. (N) **Networks** have the societal organizing principle of heterarchic collaborative exchange (Ronfeldt). [Heterarchic](https://en.wikipedia.org/wiki/Heterarchy) here denotes \"organizations that are non-hierarchical, unranked, _or_ possess the ability to be ranked in multiple ways\" (Wikipedia).](https://images.mirror-media.xyz/publication-images/ccfc3b17-2054-4305-b705-bd23ec2e5598.png?height=1076&width=1872)\n\nWhile new organizational forms evolve over time, preceding organizational forms “grow within their scope of activity, even though that scope is newly circumscribed”, citing how markets increased tax revenues to bolster the institutional state despite curtailing its participation in direct economic exchange in other respects ([3](https://www.rand.org/content/dam/rand/pubs/papers/2005/P7967.pdf)). \n\n![Sam Hart, Laura Lotti, Toby Shorin, [Squad Wealth](https://otherinter.net/squad-wealth/), 2020](https://images.mirror-media.xyz/publication-images/80498627-0fad-4e56-9afe-848f8f50a539.png?height=1640&width=2798)\n\nThe report’s institutional biases are clear, such as equating progress with Western liberal democracy, and its narrative of societal evolution may appear reductive at best. Its argument, however, provides an historical background to the political ideology from which decentralized organizations draw, knowingly or not. This is most apparent in the report’s identification of the newest organizational form: networks.\n\nThe report defines networks somewhat open-endedly. A key distinguishing feature between networks and the organizational forms preceding them is that networks are described as **_multi-organizational_**, emphasizing collaboration between “small, scattered, and autonomous” groups over larger distances. These groups do not necessarily share a distinct organizational unity. While networks have existed throughout history, new information technology emphasizes cooperative relations that greatly impact institutions, through cutting across jurisdictions, and through markets, “facilitating the growth of [keiretsus](https://en.wikipedia.org/wiki/Keiretsu) and other distributed, web-like global enterprises and, increasingly, so-called ‘virtual corporations’”, Ronfeldt notes ([4](https://www.rand.org/content/dam/rand/pubs/papers/2005/P7967.pdf)). Yet multi-organizational networks’ primary domain is neither the public nor private sector, at least as both are traditionally conceived. Instead, they will most transform a third, “autonomous social sector” (5), identified in the report as civil society. Painted in the 1995 landscape to include non-governmental organizations (NGOs), grassroots organizations, and private voluntary organizations, civil society will be strengthened by multi-organizational networks and perhaps address issues surrounding inequality, bureaucracy, and accessibility where preceding organizational forms failed.\n\nThe report presents a saccharine political image of networks: “While the development of the institutional and market forms of organization led to an emphasis on competitive advantages, development of the multi-organizational network form may shift the emphasis to cooperative advantages” ([6](https://www.rand.org/content/dam/rand/pubs/papers/2005/P7967.pdf)). The underside of this political presentation is the imperial soft power NGOs would globally export in the following decade. For those currently working on web3, all of this language may feel familiar, although this questionable ideological inheritance often goes unremarked ([7](https://www.wsj.com/articles/SB10001424052748703983004575073911147404540)).  \n\nWith the report’s final emphasis on civil society’s three letter acronyms for organizations, NGOs, NPOs, and PVOs, a future one is naturally missing: DAOs.\n\n## A Chimeric Term\n\nDAO stands for _decentralized autonomous organization_. \n\nDAO comes from imagining how features of decentralized technology, such as global digital assets, censorship resistance, and automated actions, will change how organizations operate. Initially called _[decentralized autonomous corporations](https://bitcoinmagazine.com/technical/bootstrapping-a-decentralized-autonomous-corporation-part-i-1379644274)_ (DACs), the more generalizable term DAO emerged from the Ethereum blockchain community. Based on Vitalik Buterin’s [DAOs, DACs, DAs and More: An Incomplete Terminology Guide](https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/) from 2014, a DAO could be described then as a capitalized organization in which a software protocol informs its operation, placing automation at its center and humans at its edges. For example, a software protocol could specify the conditions upon which an organization automatically distributes capital to its members. This led to the idea that organizational values could be automated and executed by code, a lingering idea that perhaps falsely suggests [tacit knowledge](https://en.wikipedia.org/wiki/Tacit_knowledge) can be fully expressed in a software protocol. While the term’s hypothetical ideas abounded, by the time a DAO went from theory into experiment, the community largely reframed the term DAO to indicate “unstoppable”, or censorship-resistant, businesses. The first DAO, called [The DAO](https://en.wikipedia.org/wiki/The_DAO_(organization)), became one of the biggest spectacles in the Ethereum blockchain community to date when in 2016 it raised over $150m equivalent in ETH as a decentralized venture fund (8). However, the experiment proved short-lived when The DAO was hacked one month after launch.\n\nIt was not until several years later that larger initiatives related to DAOs gained traction again. From then until now, DAO has strayed from its initial signifiers to continue as a chimeric term, with both the term and its implementations varying depending on its cultural context. Each speculative run in the market, for all its noise, creates new signals of what DAOs can be deployed towards, bringing descriptive, technical, and cultural refinement to the concept in practice. While some quip that a [group splitting a lunch bill](https://twitter.com/DnlKlr/status/1398219740489859073) may be a DAO, in order to avoid its overgeneralization ([9](https://j.mirror.xyz/RUeJfZEZxr-hkuzUCakQyUuf2kOJVMPPiAWBaQFhhqc)), DAOs will be circumscribed here to focus on examples in the Ethereum blockchain community, despite the importance of other [communities similarly coordinating](https://twitter.com/helveticade/status/1400946733249662978). In 2021, a DAO could be described as a voluntary association with the operating principles of digital cooperativism. As voluntary associations, they are a cross-jurisdictional way for strangers, friends, or unlikely allies to pseudonymously come together toward common goals, supported by a token model, incentives, and governance. Members of a DAO can have representative ownership of its digital assets through a token, which often simultaneously acts as a governance right. \n\nAlthough many DAOs would not embrace the label of digital cooperative, one could say DAOs embrace cooperativism as a _protocol_, meaning an evolving set of relational practices that are distinct from traditional corporate structures or decentralized autonomous corporations, because they prioritize member ownership. The label cooperative is further qualified here by digital because today DAOs act primarily to coordinate around digital assets. However, as the concept of DAOs evolves in practice, [its digital primacy will fade](https://medium.com/regen-network/community-stake-governance-model-b949bcb1eca3). DAOs, as we will see, also introduce new dimensions that exceed what the operating principles of a digital cooperative notionally encompass.\n\n[https://twitter.com/evabeylin/status/1396184123761303554](https://twitter.com/evabeylin/status/1396184123761303554) \n\nDecentralized technology ecosystems tend to describe a phenomenon through its technical products. Yet as Ruth Catlow, co-founder of Furtherfield and DECAL decentralized arts lab, notes, “We need to be building cultures before structures” ([10](https://so-far.online/many-headed-hydras/)). While the overview below of DAO tools provides a concrete description of the concept in practice, it feels critical to keep in mind that DAOs ultimately coordinate through collective vibes.\n\n![DAO Starter Pack, 2021](https://images.mirror-media.xyz/publication-images/b277c810-3d61-4766-979c-af9d8b063e7e.png?height=1350&width=2400)\n\nIn its simplest form, DAO tools have been described as a group chat and a bank account ([11](https://www.patreon.com/posts/wyoming-dao-bill-51387956)). In 2021, this generally takes the form of a Discord server and a [Gnosis Safe Multisig](https://gnosis-safe.io/), which is a web3 platform for creating [multi-signature accounts](https://blog.gnosis.pm/inventories-not-identities-7da9a4ec5a3e). Multi-signature accounts allow pseudonymous groups, across jurisdictions, to pool and manage funds within minutes, a capacity far beyond a [traditional joint bank account](https://twitter.com/ctbeiser/status/1399196774967898113). This “minimum viable” DAO, or MVD, tooling shone in the first half of 2021 with initiatives like PleasrDAO. \n\n[PleasrDAO](https://twitter.com/pleasrdao?lang=de) is a collective that came together to bid on an NFT by the artist [pplpleasr](https://foundation.app/pplpleasr). Given escalating NFT digital art auction prices, the idea behind PleasrDAO was simple: a collective of fans using a multi-signature account could pool funds to place bids, and through holding in common, compete with other major bidders to win the auction. After winning their first eponymous auction, PleasrDAO went on to collect other works such as [Stay Free](https://foundation.app/Snowden/stay-free-edward-snowden-2021-24437), the NFT by Edward Snowden charitably supporting independent press, for a total of 2.2K ETH or USD 5.4 Million equivalent at the time. Their repeatedly successful missions means that while still acting as collectors, PleasrDAO will [broaden their scope](https://decrypt.co/66933/why-this-dao-bought-snowden-nft) to begin incubating projects by their community. Initiatives like PleasrDAO most promisingly challenge institutional collectors through their expanded membership, inviting artists they collect like pplpleasr to become members of the collective in turn. \n\n![Gnosis Safe multi-signature account owned by PleasrDAO, in which they hold collected NFTs in common.](https://images.mirror-media.xyz/publication-images/c9904c31-747e-4b83-aee1-0a2208b1f338.png?height=1800&width=2880)\n\nThough a group chat and multi-signature account may be enough to initialize a DAO mission, a token often becomes the next step toward embracing the principles of a digital cooperative. For example, PleasrDAO issued $PEEPS, a token distributed internally to represent members’ stake in the collection ([12](https://foundation.app/blog/pleasrdao)), which they are considering making public to fractionalize ownership of their collection. Similar experiments like [PartyDAO](https://twitter.com/prtydao?lang=de) employ a token, with the $PARTY token representing membership to a group chat, governance rights, and co-ownership of productive value managed by the DAO. It’s important to note PleasrDAO and PartyDAO are not flat hierarchies, as they both have elected groups of individuals that manage their multi-signature account treasuries. Though PleasrDAO and PartyDAO focused on shorter missions initially, they are both evolving toward a longer term vision, as collectors, investors, and incubators that use tokens to represent co-ownership in the spirit of a digital cooperative. Tokenization creates both opportunities and challenges for the networks to come.\n\n### A New Dimension in the Cooperative Movement\n\nReturning to their origin, DAOs today resemble _The_ _DAO_ in their emphasis on open participation and economic value creation, while their culture has shifted more toward specific niches and social connection. In the examples above, one term has been left intentionally vague: governance. Many DAOs today use the lightweight [Snapshot](https://snapshot.org/) platform for governance ([13](https://deepdao.io/#/deepdao/dashboard)). On Snapshot, DAOs each have a space to create and vote on proposals. For example, both [PleasrDAO](https://snapshot.org/#/pleasrdao.eth) and [PartyDAO](https://snapshot.org/#/partydao.eth) have a Snapshot space, on which they hold public votes for collective decisions. Snapshot weights votes by the amount of DAO-specific tokens an address holds, such as $PEEPS tokens in PleasrDAO.\n\n![PleasrDAO Snapshot space displaying the vote on whether to acquire the [Dreaming at Dusk](https://foundation.app/torproject/dreaming-at-dusk-35855) NFT benefitting the Tor Project. The vote passed with a total of 396.69k $PEEPS tokens voting in favor.](https://images.mirror-media.xyz/publication-images/f09da5e4-c7e9-4dd4-b736-f6a504f02606.png?height=1800&width=2880)\n\nThe [topic of governance](https://technosphere-magazine.hkw.de/p/The-Byzantine-Generalization-Problem-Subtle-Strategy-in-the-Context-of-Blockchain-Governance-8UNNcM8VShTpBGWRuob1GP) has its own history within the crypto ecosystem that won’t be fully expounded upon here. Notably the initiative [MolochDAO](https://www.molochdao.com/), which uses the classic font Papyrus and heavily references gaming guilds, rekindled the fire of decentralized governance after The DAO hack. MolochDAO went on to inspire a legion of new DAOs, many direct forks, in its wake.\n\n[https://twitter.com/pet3rpan_/status/1399411511869665285](https://twitter.com/pet3rpan_/status/1399411511869665285) \n\nThis essay’s history of DAOs is far from complete, as other projects like [Aragon](https://aragon.org/), [Colony](https://colony.io), [DAOhaus](https://daohaus.club/), and [DAOstack](https://daostack.io/) continue to develop their platforms for DAOs and modular initiatives like [Block Science](https://block.science/) and [Commons Stack](https://commonsstack.org/) arise. These projects offer DAO tools supporting many [governance mechanisms](https://blog.gnosis.pm/a-brief-discussion-of-the-protocol-governing-the-dxdao-7331407a2555). However, a prehistory of DAOs is also incomplete without its less frequently mentioned relation to platform cooperativism.\n\nBuilding on decades of commons initiatives, the term “platform cooperativism” coined by Trebor Scholz as well as the concept “[exit to community](https://hackernoon.com/startups-need-a-new-option-exit-to-community-ig12v2z73)” outlined by Nathan Schneider have intersected with the crypto space through essays like Jesse Walden’s [The Ownership Economy](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/). These catchphrases advocate for platforms owned, developed, and stewarded by their community of users. Specifically, the concept “exit to community” influenced decentralized governance through its clear exposition of a third way for companies to evolve their ownership.\n\n![Nathan Schneider, [Startups Need a New Option: Exit to Community](https://hackernoon.com/startups-need-a-new-option-exit-to-community-ig12v2z73), 2019](https://images.mirror-media.xyz/publication-images/d14efc42-4c3c-4e7b-a6c9-b760a118e7c5.jpeg?height=579&width=1159)\n\nExit to community grew in practice through initiatives such as [DXdao](https://twitter.com/dxdao_?lang=de), which launched with the aim to give community ownership, governance, and value to software protocols. Today, with many decentralized finance software protocols guiding their development through DAOs, it's become clear that software protocols can both exit to, and [build with community](https://twitter.com/VENTURE_DAO/status/1395544596550062080). Because DAOs use early stage software tools, it makes sense that their first users and use cases would involve the governance of digital assets, such as software protocols. DAOs’ digital primacy is perhaps one reason that their resemblance to earlier cooperative movements often goes unremarked. \n\nToday, the International Cooperative Alliance defines cooperatives as “an autonomous association of persons united voluntarily to meet their common economic, social, and cultural needs and aspirations through a jointly-owned and democratically-controlled enterprise” ([14](https://www.ica.coop/en/cooperatives/cooperative-identity)). A cooperative can also be defined by the structure of its legal entity, which dictates that cooperatives are companies not owned by shareholders but by their members. A key moment in the history of cooperatives was the establishment of the [Rochdale Principles](https://en.wikipedia.org/wiki/Rochdale_Principles), formulated by a society of weavers in 1844. The International Cooperative Alliance adopted these operating principles, which still guide cooperatives globally:\n\n1. Voluntary and Open Membership\n2. Democratic Member Control\n3. Member Economic Participation\n4. Autonomy and Independence\n5. Education, Training, and Information\n6. Cooperation among Cooperatives\n7. Concern for Community\n\nWhile these operating principles have evolved over the last two centuries, they could easily have been formulated by a DAO today. The principles of Voluntary and Open Membership, Member Economic Participation, and Concern for Community translate to the examples of DAOs above. The principles of Autonomy and Independence and Cooperation among Cooperatives are key for DAOs to flourish as multi-organizational networks, strengthening an autonomous social sector built through cross-DAO collaboration. \n\nDAOs could set more thoughtful norms around democratic member control, which cooperatives typically define as one member, one vote. Most DAOs employ token voting, that is, one token, one vote. DAOs reason that token ownership represents stakeholdership, with the token model often directly economically tied to the DAO, for example through fees on software protocols it owns. This allows DAO members with greater financial stake to have proportionally greater influence. Token voting does not directly contradict cooperative principles, as there are some cooperatives that weight votes by qualities such as production ([15](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3356774)). In certain cases this may feel apt, but as some DAOs evolve toward maintaining basic infrastructure such inequality becomes undesirable. This is in part because not all stakeholders have the purchasing power representative of their stake, and their practical knowledge may be excluded from governance.  \n\nProjects such as Tornado Cash privacy protocol have approached this distribution problem by retroactively sending tokens to prior users, in a step toward making users stakeholders of the protocol ([16](https://tornado-cash.medium.com/tornado-cash-governance-proposal-a55c5c7d0703)). The [Regen Network](https://www.regen.network/) project, a public blockchain for ecosystem services, takes another approach to this distribution problem. They have set aside 30% of their tokens for land stewards, climate scientists, and other stakeholders in regenerative land management to form [community DAOs](https://medium.com/regen-network/community-stake-governance-model-b949bcb1eca3) that participate in network governance. Because tokens can be distributed more easily than traditional corporate interests, memberships, or shares, this creates the possibility for a new form of token holder company, which can incorporate deeper practical knowledge in governance without increasing operational transaction costs. Stakeholders with practical knowledge, or [“tacit” knowledge](https://en.wikipedia.org/wiki/Tacit_knowledge), like land stewards in the case of Regen Network, benefit governance by incorporating informal practices in decision making. Here, DAOs begin to introduce new dimensions that exceed what the operating principles of a digital cooperative notionally encompass. For this reason, as much innovation and emphasis should be placed on token distribution mechanisms that identify broader stakeholder participation as on decision making mechanisms. \n\nThe tokenization of online communities could be the subject of a longer debate. Far from the best answer to the social media woes of web 2.0, tokenization introduces more financialized relations. As a guiding star, web3 applications could aim to introduce value in relations which have been historically denied it, such as labor and environment, rather than creating new financialized relations. In this context, for DAOs with the mission of economic value creation, a token becomes a useful mechanism on three fronts:\n\n1. Bootstrapping Funding\n2. Distributing Governance Rights\n3. Aligning Ecosystem of DAOs\n\nTokenization introduces a powerful cultural norm into early stage organizations: the expectation of transparent co-ownership of its assets _from the start_. The tension between more traditional corporate structures that pay dividends and DAOs persists ([17](https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/)). Because most DAOs represent governance rights through a token, in some sense tokens Trojan horse principles of cooperatives directly into highly financialized spaces. These are two important sides of, quite literally, one coin, and for this reason, tokenization should not be dismissed. Tokens may be one key to unlock the ownership economy, but to reach a more equitable version of this future, we must participate in crafting the culture around token distribution, mediation, and governance now. This becomes important because, unlike shares in cooperatives, many tokens that double as governance rights can be sold on secondary markets. While this makes the conditions for entrance into an organization easier, DAOs can learn from cooperatives’ emphasis on long termism, through establishing more cultural patterns around token vesting, limited transferability, or more experimental mechanisms.\n\nJust as DAOs can learn from case studies of cooperatives, in a two-way exchange DAOs could introduce more forms of decentralized governance into cooperatives. This is the case made by Morshed Mannan in [Fostering Worker Cooperatives with Blockchain Technology: Lessons from the Colony Project](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3356774), which cites how cooperatives often face “coordination problems as the entity scales across borders,” with a “negative trend in participatory management, mutual monitoring, and solidarity” as they internationalize. Dilemmas that cooperatives face, such as funding, governance, and alignment across jurisdictions, DAOs directly address. Embracing cooperativism as a _protocol_ rather than as a corporate structure, in their neologism, DAOs could encourage a cultural space that can be crafted beyond traditional divisions.\n\n## The Guilded Age\n\n[https://twitter.com/karakittel/status/1404510598033985548](https://twitter.com/karakittel/status/1404510598033985548) \n\nAs much as DAOs may accidentally embrace the operating principles of cooperatives preceding them, they also slyly resemble enclaves from other online cultures. They have the most to learn from guilds in massively multiplayer online games (MMOs). \n\nAs role playing computer games went online in the 1990s, this meant large numbers of players could share in one game world: an environment with a diverse array of objectives, activities, and subplots. Early integral examples of MMOs include The Realm Online, Ultima Online, and EverQuest, which lead to more classics like World of Warcraft and EVE Online. In many of these examples, players are mostly free to set their own goals loosely guided by the open game world narrative, affordances, and risks ([18](https://en.wikipedia.org/wiki/Sandbox_game)), and because of this narrative freedom, players form groups to accomplish common goals out of the reach of single players. Referred to broadly as guilds, clans, or alliances, these groups can range from 40 to 1000 participants, and their goals could include defeating difficult enemies or constructing useful tools.\n\nTo accomplish these goals, cultural patterns emerge in guilds, and there can sometimes be a mismatch between the tools game world developers release for guilds and their actual needs. In an example from EVE Online, the game world developers created an interface for players to create corporations that allowed players to distribute shares. In practice, this feature to distribute shares was rarely used because it did not enhance existing cultural patterns. Instead, using EVE Online’s in-game browser and data API, many guilds developed their own tools needed to accomplish goals (19). A parallel between gaming guilds and DAOs could be drawn here, as the current wave of DAOs tend to use a combination of composable tools, such as bridging the Snapshot voting platform to a Gnosis Safe multi-signature account, rather than platforms which overly anticipate use cases for participants. \n\n[https://twitter.com/dankvr/status/1386007400033959938](https://twitter.com/dankvr/status/1386007400033959938)\n\nThough the specific feature to distribute corporate shares may not have taken off in EVE Online, gaming guilds frequently embrace economic practices of redistribution. The vast importance of MMO marketplaces, from [Varrock](https://runescape.salmoneus.net/archived-projects-and-content/site-content/tips/world-1-trading.html) to [gold farming](https://en.wikipedia.org/wiki/Gold_farming), for decentralized finance will be the subject of a later essay, but one economic practice may be keenly relevant for DAOs: Dragon-kill points (DKP). Taking their name historically from when dragons were the most frequently encountered enemies in MMOs, DKP emerged as an allocation system within and sometimes across guilds.\n\nComplex, sustained missions undertaken by guilds, such as killing a dragon, are usually referred to as raids, and can range in length from several hours to several days. At the end of a raid, the slain enemy drops in-game items called loot, and guilds must decide how to distribute it. Because guilds require diverse and complementary player skill sets over extended time periods, “It matters that the same people work together again” ([20](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=958945)) and the perceived fairness of often-scarce loot distribution is critical for this. As guilds grow in maturity, they often evolve different systems of loot distribution, for example beginning with random distribution, moving toward random distribution weighted by participation, and commonly arriving at distribution through an informal scoring system such as DKP. DKP act as a private money system, separate from any existing currency in a game world, and guild members earn them based on their participation in raids ([21](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=958945)). Guild members can then choose to spend these points in exchange for loot after a raid.\n\nInitially designed by a guild in 1999 for the EverQuest MMO, the [practice of DKP](https://en.wikipedia.org/wiki/Dragon_kill_points) has been embraced by many guilds across many game worlds, albeit with slight adjustments. Ed Castranova and Joshua Fairfield detailed one example in [Dragon Kill Points: A Summary Whitepaper](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=958945): the Leftovers DKP system, which maximizes the number of participants by not being tied to one specific guild. As Castranova and Fairfield write, “Indeed, this organization is effectively the highest allocative body in the population. If there is an emergent government on [the World of Warcraft server] Silver Hand, it is The Leftovers.” The Leftovers DKP system arises from a few limitations: loot can only be picked up at the aftermath of battle and, in World of Warcraft, cannot be transferred between players. The Leftovers DKP system has a small group of informally appointed governors: players who laboriously, through public dialogue, set and maintain a database of loot item prices in DKP. When loot drops, players with DKP can choose to spend them for a specific item, with all bids and transactions public. Being zero sum, the Leftovers DKP system then equally distributes _spent_ DKP points to all other guild members that participated in the raid. \n\nAs Castranova and Fairfield note, DKP supplements the existing currencies of a game world, as much for efficient allocation as for social cohesion, “making possible the exchange of time (spent on those raids in which an individual is not compensated) for goods (obtained on those raids in which an individual wins loot)” ([22](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=958945)). Especially in the case of World of Warcraft, because loot cannot be transferred between players, having loot itself also serves a strong signalling function, showing a player has meaningfully participated in raids over time. This DKP system precedes the mechanics of DAO platforms in development today, such as Aragon, Colony, and DAOstack, which all offer mechanisms to distribute reputational tokens based on the participation of members, rewarded for successful proposals, bounties, or campaigns: what might be called raids in other game worlds. These reputational tokens complement other economic systems enabled by DAO platforms, such as DAO-specific tokens or other assets in their multi-signature account treasuries. Often used as an alternative model to the plutocratic one token, one vote model, reputational tokens, earned through participation rather than purchasing power, provide greater voting power in DAOs that amasses over time. DAOs can learn from DKP, which in contrast, acts as a private money system based on participation that can be spent on other digital assets, instead of only amassing over time.\n\nIn addition to efficient allocation, contextual reputation, and signalling functions, the DKP system holds another significance for DAOs: generally all guilds resolve disputes independently from traditional court systems, despite these disputes involving expensive stakes. This becomes highly relevant for DAO tooling like Aragon’s digital jurisdictions or [Kleros](https://kleros.io/)’s decentralized arbitration service that aim to provide internet native dispute resolution tools. In fact, DAO tooling often tries to technically solve problems that gaming guilds have already culturally refined for several decades, and it may be time for DAOs and gaming guilds to merge their practical knowledge more closely.\n\n![A [collage of alliance logos](https://eve-search.com/thread/306423) in EVE Online, 2006](https://images.mirror-media.xyz/publication-images/5504ac03-20c1-4dba-83a6-efda8d3a4077.jpg?height=806&width=1339)\n\nAnother subtle cultural pattern of gaming guilds relates to their articulated economic structure. As researcher Joshua Citarella points out, many DKP systems resemble a form of market socialism, in which goods are publicly owned but allocated by markets ([23](https://soundcloud.com/joshuacitarella/memes-as-politics-ep-13-dkp-is-market-socialism)). Citarella also goes on to note that despite the resemblance of DKP systems to market socialism, and the general happiness of players who participate in them, many of those players would decidedly not politically embrace the label market socialism. Shadow economics may be an apt term for when a group operates through an economic form it would not label itself as: DAOs as cooperative protocols and gaming guilds as market socialism. This tendency leaves interesting political territory like gaming guilds underexplored, because gaming guilds do not often need to wear their own flags. In one light, this could be more of a feature than a bug, as the invention of new terms like DAO, rather than reliance on canon, in part fuels their enthusiastic embrace. \n\n[https://twitter.com/TBSocialist/status/1402270439167037440](https://twitter.com/TBSocialist/status/1402270439167037440) \n\nWhile it may result in ignoring their prehistory, DAOs still retain a powerful ambiguity, in which their burgeoning political ambitions do not yet possess fully familiar aesthetic articulations. This could be co-opted toward several different ends. For example, one could imagine a DAO whose treasury self-destructs, [like terra0's NFT](https://terra0.medium.com/two-degrees-nft-5af1263bfcc), when global temperatures rise over 2 degrees Celsius, accompanied by a sparkly, unassuming mascot avatar. \n\nSuch a DAO might attract participation from those not drawn to the familiar green aesthetics of most climate initiatives, and it could have the effect of broadening participation in a political objective through creating new cultures around it. The momentum of the questionably new can always be good for something, and the question becomes how to cultivate DAOs that can build surreptitious solidarity across ideological divides. \n\n\n## A Constellation is Born\n\n![Actually, it might be.](https://images.mirror-media.xyz/publication-images/482156a6-7f32-475a-b467-0e0b8c4648c7.png?height=534&width=880)\n\nWhile a comprehensive prehistory of decentralized autonomous organizations could take us much further into the past ([24](https://en.wikipedia.org/wiki/Rule_of_Saint_Benedict)), many proponents of DAOs have a core belief about their impact on the future: DAOs could out-compete by out-cooperating the modern firm. \n\nIn the twentieth century, many economists asked why companies arose when services priced by the market should, in theory, be more efficient. Ronald Coase explored the answer to this question in [The Nature of the Firm](https://en.wikipedia.org/wiki/The_Nature_of_the_Firm), coming to the conclusion that markets create unaccounted for transaction costs. These transaction costs could arise from price discovery, contract negotiation, or onboarding for a service, which can be mitigated by retaining services in a company. Following from this theory, the size of firms may have practical limits they won’t exceed, because eventually transaction costs increase through developments like departmental bureaucracy. Though this theory has many critiques, the promise of DAOs can be positioned in relation to it: DAOs aspire to become _more_ efficient as they scale ([25](https://github.com/gnosis/dx-daostack/blob/master/dxdao_whitepaper_v1.pdf)). While in practice this aspiration has been far from proven, in some respects the promise of DAOs lies in using technical governance protocols to reduce transaction costs. To return to an example above, DAO tooling like Gnosis Safe enables pseudonymous groups, across jurisdictions, to pool and manage funds within minutes. The equivalent process to establish a traditional joint bank account could take months, and in some cases, it wouldn’t be possible for individuals from different jurisdictions to jointly manage a bank account. Through the affordances of public blockchains, DAOs can incorporate deeper practical knowledge in governance without increasing operational transaction costs: aspiring to become more efficient as they scale. \n\nWhile DAO tooling like Gnosis Safe enables this today, overall, the promise of infinitely scalable organizations still has a long way to go. Often even the promise of DAOs can obscure their utility in practice. In [The Dissensus Protocol: Governing Differences in Online Peer Communities](https://www.frontiersin.org/articles/10.3389/fhumd.2021.641731/full), Jaya Klara Brekke, Kate Beecroft, and Francesca Pick focus on a case study of the Genesis DAO, a collective centered around the DAOstack platform. They write:\n\n> The Genesis DAO is a good example of a unique trait common to many DAOs, namely, that they comprise highly motivated groups that have formed around a set of ideas about governance, rather than governance being a means in order to achieve some shared mission. In other words, it was tool-centric and focused on one main action: allocating funds to proposals. It is unusual for people who are strangers to start making financial decisions together immediately without having time to develop coherence and trust. And this was in fact the very promise of projects like the Genesis DAO: that the technology would bypass the need to develop trusted relationships, meaning thousands of people would be able to coalesce around objectives, take actions, and even spend money together as a group ([26](https://www.frontiersin.org/articles/10.3389/fhumd.2021.641731/full)). \n\nMuch like the earlier example above of EVE Online players not using the interface to distribute corporate shares released by the game developers, tool-centric development, as well as the assumption that tools automatically create useful cultural patterns, must be reconsidered. Rather than technical protocols for governance that diminish the need for trusted relationships, DAOs can be approached through iteratively developing highly composable tools to coordinate across different levels of coherence and trust. Ultimately, the efficiency DAOs aspire to may not be defined as an economic function but as a matter of “better,” situated governance: one supported by deeper practical knowledge within an [infinite game](https://en.wikipedia.org/wiki/Finite_and_Infinite_Games).\n\n## Layers of the DAO\n\nDAOs will not be the uniformly non-hierarchical networks some imagine. Instead, DAOs coordinate across different levels of coherence and trust. In [Ownership in Cryptonetworks](https://blog.curvelabs.eu/ownership-in-cryptonetworks-96f13f4a113e), Patrick Rawson argues that for DAOs, “distributing ownership to squadlike entities with more specialized objectives is the key long-term problem to solve” in order to enable meaningful work. These “squadlike entities” are smaller teams with trust relationships, perhaps not unlike the gaming guilds in the examples above, which execute on value aligned missions with DAOs. At a closer look, effective DAOs start behaving much more like networks of teams, like the [MONDRAGON Corporation](https://en.wikipedia.org/wiki/Mondragon_Corporation) network with 100 affiliated cooperatives, rather than the loosely coordinated swarm intelligence that they might appear as from a distance. Inspired by Rawson’s analysis, we can roughly sketch three layers of a DAO:\n\n![](https://images.mirror-media.xyz/publication-images/e7260512-1458-4aac-bc0a-cbca9d6d532d.png?height=1202&width=2136)\n\n1. **Token**: Multi-organizational networks aligned by token ownership\n2. **Teams**: Teams, guilds, and squads represented by token ownership\n3. **Missions**: Missions, milestones, and raids financed by token ownership\n\nFrom these layers, a **_heterarchical_** network emerges, meaning an organization that possesses the ability to be ranked in multiple ways. \n\n![](https://images.mirror-media.xyz/publication-images/3aedd8d4-58c2-4273-bc91-3761d7f8a995.png?height=1982&width=3524)\n![An example of DAOs in which tokens, teams, and missions are distributed across several DAO networks, which can be ranked or assorted in multiple ways.](https://images.mirror-media.xyz/publication-images/143cbda3-249a-495b-84de-0803e9c07c59.png?height=1982&width=3524)\n\nIn ecosystems that prioritize distributing ownership, tokens encourage DAO networks to be managed by their members. Tokens, teams, and missions are not confined to the quasi-institutional boundaries of a single DAO but can and, in order to meaningfully decentralize the control network, _should_ be represented by token ownership in multiple DAOs. An ecosystem not unlike the control networks of transnational corporations emerges, but importantly, one without monocentric command and with reduced transaction costs across different levels of trust. As Rawson writes, “As long as the collective memory freely circulates within a given [DAO network], discovered solutions to problems can be reused.” When we view DAOs as multi-organizational networks aligned by token ownership, the purpose of DAO tooling becomes not only to support the operations of one team but to facilitate collaborations across many. Funded by PrimeDAO, [DAO-to-DAO (D2D) collaboration mechanisms](https://medium.com/primedao/exploring-dao2dao-collaboration-mechanisms-c37218a17a21) appear the most forward thinking work along these lines, which may eventually overtake traditional business-to-business (B2B) products. A new squadlike entity emerging from stealth mode, the [Gnosis Guild](https://twitter.com/gnosisguild?lang=de) team embraces a similar emphasis on DAO-to-DAO tools, with a new constellation of DAO tools launching in early August. \n\nRevisiting the promise of DAOs, their potential to incorporate deeper practical knowledge in governance does not mean that decision making must involve an ever-larger number of members in every proposal, but rather that within a DAO network, teams who possess the most relevant expertise can easily share it with the ecosystem. When we view DAOs as constellations of teams, not monoliths, DAOs become networks to allow collective memory to flow freely.\n\n## The Networks to Come\n\nThe TIMN RAND report this essay began with closes on a curious note. It reads: \n\n> Much of the literature about redesigning organizations for the information-age focuses on production—on improving productivity, or manufacturing something new like the Boeing 777 jetliner. Yet, does this not reflect a lingering industrial-age mentality? Production organizations remain a crucial part of the organizational ecology. However, we should also be thinking about “sensory organizations.” Sensory functions are quite different from production functions, and require different modes of organization—e.g., more networks connected to the world outside an office’s boundaries. Determining appropriate designs for all manner of sensory organizations may become a good meta-theme for innovative research and development in the years ahead ([27](https://www.rand.org/content/dam/rand/pubs/papers/2005/P7967.pdf)). \n\nThis closing sentiment echoes the popularity in that era of the twentieth century media theorist Marshall McLuhan, who emphasized how digital media impacts our sensory nervous systems. If digitally prime networks like DAOs operate on our nervous system first, it does not mean they won’t come to reorganize, reshape, and redistribute our material world. Some still refuse to take seriously the fact that cooperative principles, gaming guilds, and odd imaginaries like DAOs present an emergent organizational form with legitimate political relevance. We must take them politically seriously now, so that they don’t remain shaped only by those on one side of the digital divide. The days of DAOs versus [PACs](https://en.wikipedia.org/wiki/Political_action_committee), political action committees that fundraise for electoral candidates in the United States, will be with us soon. Just as markets did not make states obsolete, but diminished some of their operations while strengthening others, DAOs introduce new forms into traditional political participation that emerge from the autonomous social sector: [the network union](https://1729.com/network-union/).\n\n![Character from Trust’s [Mascot Streams](https://trust.support/feed/mascot-streams), [ARB](https://twitter.com/ArthurRoingBaer)  and [GVN908](https://twitter.com/GVN908), 2021\n](https://images.mirror-media.xyz/publication-images/f59011fe-b6aa-42e6-9344-daab85c5976a.jpg?height=720&width=1280)\n\nTo call attention to the chimeric’s term failings at seriousness, many return to its misnomer: the “A” in DAO does not live up to its autonomous reference; while others like researcher [Aude Launay gracefully invoke](https://twitter.com/audelau/status/1413731529042321410) the political, rather than the technical, spirit of autonomy in DAOs. Even though the term DAO remains poetically correct, we could propose an occasional replacement: decentralized avatar organizations. Such organizations would take their political stakes both lightly and heavily. As poetitician and Digital Minister of Taiwan Audrey Tang notes, the days of avatar politicians are already here ([28](https://interdependence.fm/episodes/radical-transparency-humor-disinformation-poetry-for-machines-avatar-politicians-and-giving-non-human-entities-a-vote-with-digital-minister-of-taiwan-audrey-tang-X36XnWVg)). Avatar politicians are [virtual beings](https://www.virtual-beings-summit.com/) that represent, rally, and advocate on behalf of political platforms, and when automation increases, they may even spawn their own political platforms. A decentralized avatar organization would recognize the coming virtual zeitgeist: this could look like a [collectively managed cyborg](https://twitter.com/cjliu49/status/1345110226744184833) like [Lil Miquela](https://de.wikipedia.org/wiki/Lil_Miquela) or an entire environment shaped by members, like [Trust’s moving castles](https://trust.support). Decentralized avatar organizations will have collectively developed, interoperable game worlds, engines, or virtual being mascots at their core, which co-creates the culture around which their members organize.\n\n![Jay Springett, [worldrunning.guide](https://worldrunning.guide): A Speculative Document About Worlding Worlds, and Running Them, 2020-](https://images.mirror-media.xyz/publication-images/6fa40349-2cd0-41c2-8680-ffde9154743b.png?height=1036&width=706)\n\nBy learning from their prehistory, DAOs can move towards a syncretic theory of organizations, meaning a theory which incorporates a wide range of cultural patterns, practices, and influences while recognizing its inherited political biases. To escape the tendency to fetishize technical protocols for governance, decentralized avatar organizations must cultivate compelling environments players want to inhabit, recognizing narratives, aesthetics, and goals held in common are key to their success. Making the internet a place not only for transactions but for relationships and thought itself, as Barlow wrote, relies on the depth of these narratives. As is the case with massively multiplayer online games, DAOs are less technical protocols for governance and more high stakes game worlds that interweave. \n\nWe should aim for rough consensus and running worlds. \n\n_This essay is the second in a [Gnosis Guild](https://twitter.com/gnosisguild?lang=de) series by [@keikreutler](https://twitter.com/keikreutler?lang=de) bridging cryptonetworks, web3, and gaming._\n\n_Follow [@GnosisGuild](https://twitter.com/gnosisguild?lang=de) on Twitter to learn about a new constellation of DAO tools launching in early August._\n\n_Cover Image: Leonora Carrington, El mundo mágico de los mayas (1964) meets CLIP. Many thanks to Mat Dryhurst for the assist._\n\n_Deepest thanks for feedback while developing this essay to [Other Internet](https://otherinter.net/) Peer Review: Toby Shorin, Sam Hart, Laura Lotti, Bryan Lehrer, Jay Springett, Arthur Röing Baer, John Palmer, Callil Capuozzo, Tom Critchlow, and Kara Kittel as well as Auryn Macmillan, Sam Panter, Patrick Rawson, Scott Moore, Wassim Alsindi, and Brett Scott._\n\n![\"-kin, Guilds, Markets, Cryptonetworks\" entered into CLIP. Thanks again to Mat Dryhurst for the assist.](https://images.mirror-media.xyz/publication-images/d16c88bf-40e3-4266-b9a8-64fe2840cc25.jpg?height=720&width=1280&size=large)\n\n[1]: “A Declaration of the Independence of Cyberspace”, John Perry Barlow, 1996: [https://www.eff.org/de/cyberspace-independence](https://www.eff.org/de/cyberspace-independence)  \n[2]: “Paul Baran and the Origins of the Internet”: [https://www.rand.org/about/history/baran.list.html](https://www.rand.org/about/history/baran.list.html)   \n[3]: “Tribes, Institutions, Markets, Networks: A Framework About Societal Evolution”, David Ronfeldt, RAND Corporation, 1995: [https://www.rand.org/pubs/papers/P7967.html](https://www.rand.org/pubs/papers/P7967.html)  \n[4]: Ibid  \n[5]: _Post-Capitalist Society_, Peter F. Drucker, HarperCollins Publishers, 1993 (171)  \n[6]: “Tribes, Institutions, Markets, Networks: A Framework About Societal Evolution”, David Ronfeldt, RAND Corporation, 1995: [https://www.rand.org/pubs/papers/P7967.html](https://www.rand.org/pubs/papers/P7967.html)  \n[7]: “The Digital Dictatorship”, Evgeny Morozov, 2010: [https://www.wsj.com/articles/SB10001424052748703983004575073911147404540](https://www.wsj.com/articles/SB10001424052748703983004575073911147404540)   \n[8]: Notably, at the time, The DAO was nearly the largest crowdfunding campaign in history, second only to the in-development, massively multiplayer online game Star Citizen.  \n[9] “Scissor Labels”, John Palmer, 2021: [https://j.mirror.xyz/RUeJfZEZxr-hkuzUCakQyUuf2kOJVMPPiAWBaQFhhqc](https://j.mirror.xyz/RUeJfZEZxr-hkuzUCakQyUuf2kOJVMPPiAWBaQFhhqc)   \n[10]: “Many-Headed Hydras: DAOs in the Art World”, Aude Launay, Penny Rafferty, and Ruth Catlow, 2020: [https://so-far.online/many-headed-hydras/](https://so-far.online/many-headed-hydras/)   \n[11]: “The Wyoming DAO bill, DAO art collections, Autonomous DAOs, DAO templates and more DAOs with Priyanka Desai & Aaron Wright of OpenLaw”, Interdependence, 2021: [https://www.patreon.com/posts/wyoming-dao-bill-51387956](https://www.patreon.com/posts/wyoming-dao-bill-51387956)  \n[12]: “PleasrDAO’s $5.5M purchase of Edward Snowden’s genesis NFT.”, Lindsay Howard and Jamis Johnson, 2021: [https://foundation.app/blog/pleasrdao](https://foundation.app/blog/pleasrdao)  \n[13]: “DAO Ecosystem Overview”, Deep DAO, 2021: [https://deepdao.io/#/deepdao/dashboard](https://deepdao.io/#/deepdao/dashboard) \n[14]: “Cooperative identity, values & principle”, International Cooperative Alliance, 2021: [https://www.ica.coop/en/cooperatives/cooperative-identity](https://www.ica.coop/en/cooperatives/cooperative-identity)  \n[15]: “Fostering Worker Cooperatives with Blockchain Technology: Lessons from the Colony Project”, Morshed Mannan, 2018: [https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3356774](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3356774)  \n[16]: “Tornado.Cash Governance Proposal”, 2020: [https://tornado-cash.medium.com/tornado-cash-governance-proposal-a55c5c7d0703](https://tornado-cash.medium.com/tornado-cash-governance-proposal-a55c5c7d0703)  \n[17]: “DAOs, DACs, DAs and More: An Incomplete Terminology Guide”, Vitalik Buterin, 2014: [https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/](https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/)  \n[18]: “Sandbox game”: [https://en.wikipedia.org/wiki/Sandbox_game](https://en.wikipedia.org/wiki/Sandbox_game)   \n[19] _Virtual Economies_, Vili Lehdonvirta and Edward Castronova, MIT Press, 2014 (159)\n[20]: “Dragon Kill Points: A Summary Whitepaper”, Edward Castronova and Joshua Fairfield, 2007: [https://papers.ssrn.com/sol3/papers.cfm?abstract_id=958945](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=958945)  \n[21]: Ibid\n[22]: Ibid\n[23]: “Memes as Politics: Ep 13: DKP is Market Socialism”, Joshua Citarella, 2021: [https://soundcloud.com/joshuacitarella/memes-as-politics-ep-13-dkp-is-market-socialism](https://soundcloud.com/joshuacitarella/memes-as-politics-ep-13-dkp-is-market-socialism)  \n[24]: One account of the prehistory of DAOs could begin with the [Rule of Saint Benedict](https://en.wikipedia.org/wiki/Rule_of_Saint_Benedict): “a book of precepts written for monks living communally under the authority of an abbot.” Written in 516 AD, the Rule of Saint Benedict acted as a social protocol that spawned a decentralized network of autonomous monasteries. \n[25]: “dxDAO: Toward super-scalable organizations”, 2019: [https://github.com/gnosis/dx-daostack/blob/master/dxdao_whitepaper_v1.pdf](https://github.com/gnosis/dx-daostack/blob/master/dxdao_whitepaper_v1.pdf)  \n[26]: “The Dissensus Protocol: Governing Differences in Online Peer Communities”, Jaya Klara Brekke, Kate Beecroft, and Francesca Pick, 2021: [https://frontiersin.org/articles/10.3389/fhumd.2021.641731/full](https://frontiersin.org/articles/10.3389/fhumd.2021.641731/full)  \n[27]: “Tribes, Institutions, Markets, Networks: A Framework About Societal Evolution”, David Ronfeldt, RAND Corporation, 1995: [https://www.rand.org/pubs/papers/P7967.html](https://www.rand.org/pubs/papers/P7967.html)  \n[28]: “Radical Transparency, humor > disinformation, poetry for machines, avatar politicians and giving non-human entities a vote with Digital Minister of Taiwan Audrey Tang”, Interdependence, 2021: [https://interdependence.fm/episodes/radical-transparency-humor-disinformation-poetry-for-machines-avatar-politicians-and-giving-non-human-entities-a-vote-with-digital-minister-of-taiwan-audrey-tang-X36XnWVg](https://interdependence.fm/episodes/radical-transparency-humor-disinformation-poetry-for-machines-avatar-politicians-and-giving-non-human-entities-a-vote-with-digital-minister-of-taiwan-audrey-tang-X36XnWVg) \n", "timestamp": 1627641827, "digest": "t4F5rItMw4-mlpLZf5JQhElbDfQ2JRVKAzEpanyxW1Q", "contributor": "0x9887D70d026818CA841BE7d41AE1AdACc5cB9903"}
{"id": "cqGMnjmKv9i6qqKS_ITpQK4-MoyG-BqymMGS9PcCGhM", "title": "Funding Friday: Still Standing", "body": "I backed a [documentary project](https://www.kickstarter.com/projects/206483373/still-standing) this morning about two 80-year-olds pursuing their lifelong dreams to be stand-up comedians.\n\nI think people of any age should chase their dreams and I can’t wait to watch this film.\n", "timestamp": 1627647732, "digest": "VXoUvZex2JWSeTzd9e-dkNp1TZT9gpCvs40lLapZ17E", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "sfwVU6XAMvKDypmXApXAToiEJKhbEXCIi5_o1oHpt7k", "title": "Crowdfunding 100 Physical Beacon Books", "body": "**This post outlines the final component of the Beacon Book project, an open Crowdfund for 100 physical Genesis Edition prints.**\n\n---\n\nStateful Works began in August 2020 with a simple thesis: maintainers of Public Goods should be celebrated! And not just through monetary rewards: we should also be creating artifacts and traditions that accrue cultural capital.\n\nThe Beacon Book was our first project along this path: **a piece of Ethereum history** featuring profiles, reflections, and stories of the contributors that brought the Eth2 Beacon Chain to life. This book is a snapshot of sentiment from around the launch in December 2020, neatly packaged into a 5.5x8.5\" (140x215mm) soft cover book. In line with our founding ethos, any ETH generated from the project goes [directly](https://mirror.xyz/splits/0x4Eb0D2b356da831aC613aEf9EC3D705d78DFd197) to project contributors, which includes the Eth2 researchers.\n\nThe Beacon Book is your chance to contribute directly to the Ethereum story. Own part of its past, and a key to the future.\n\nThe project includes three main components:\n\n- The text itself: [Read here](https://stateful.mirror.xyz/Y1ED9RorG9OvEUXD8NBmXgYhSVhjj8H537-I2SZJkYA)\n- mintable NFTs of book graphics: [Mint Here](https://stateful.mirror.xyz/Y1ED9RorG9OvEUXD8NBmXgYhSVhjj8H537-I2SZJkYA)\n- 100 physical Genesis Editions **↓ excerpts and crowdfund below ↓**\n\n![](https://images.mirror-media.xyz/publication-images/19464179-8493-4f3e-837b-292981b97486.png?height=2500&width=4000)\n\n*back and front covers*\n\n![](https://images.mirror-media.xyz/publication-images/d4141985-ce60-4d8d-9da8-9b136454566c.png?height=2500&width=3000)\n\n*pages 19-20*\n\n![](https://images.mirror-media.xyz/publication-images/d6efc87d-590a-43e1-afef-4743e1c5934e.png?height=2500&width=3000)\n\n*\"Traditions\" NFT, pages 35-36*\n\n![](https://images.mirror-media.xyz/publication-images/49f3aedc-f5f1-4a42-91c7-9723d0ace474.png?height=2500&width=3000)\n\n*pages 27-28*\n\n![](https://images.mirror-media.xyz/publication-images/332b986c-c12f-47ff-af03-2391f3378892.png?height=2500&width=3000)\n\n*pages 55-56*\n\nCheck out a complete breakdown of the imagery in [Beacon Book: Graphics and Narratives](https://stateful.mirror.xyz/jOFMjyRtgT0KPbeWgysDp1HM4mQnlWKeQA3HQ2SJpbA).\n\n## Crowdfunding 100 Physical Genesis Editions\n\nWe will be using the crowdfund leaderboard to simulate an auction and select the winners of 100 Genesis Editions. While there may be future prints, this edition is notable for being the inaugural print run. Please read the following information before participating:\n\n1. The crowdfund will last until **August 3rd, 16:00 UTC.**\n2. The top 100 contributors will receive physical Genesis Edition books 1-100, according to their ranking in the crowdfund leaderboard below. In addition, their copy of the book will have the final rank, eg. 1/100, inscribed on the pages 1-2, the provenance page ([see here](https://stateful.mirror.xyz/jOFMjyRtgT0KPbeWgysDp1HM4mQnlWKeQA3HQ2SJpbA)). Finally, the top 100 contributors will also receive a unique NFT featuring the the cover of the book (see below).\n3. **Contributions are final and non-refundable**, so make sure to bid strategically. Your ranking will likely change over the course of the crowdfund, and you can even be pushed out of the top 100, therefore ineligible for the physical book. All ETH contributions go to the project contributors, including the featured Eth2 developers.\n3. Our recommended minimum bid for a book is **.05 ETH (~$100)**. This considers the cost of production over the past 9 months / +500 hours, the effort and time put in by Eth2 contributors, the work of the artists, printing, packaging, shipping, and various other costs. \n4. Please be aware in order to receive their copy, the top 100 contributors will need to supply a **street address**. After delivery confirmation, your address will be deleted. \n5. Once you have submitted a contribution, please remember to complete the email form below. This signed message proves you participated in the crowdfund, and lets us get in touch for shipping info if you are in the top 100.\n4. All crowdfund participants will also get a commemorative token ($STATEFUL), regardless of their final ranking. This represents your participation in a novel cultural Ethereum event as a thank you from the team!\n5. [Sign up here](https://forms.gle/mBLSmZfxM8RmMJ9F7) to be reminded 24 hours and 6 hours before the crowdfund closes.\n\n[Stateful Crowdfund](crowdfund://0x6458b744375ABaB0779df9e79d6B30E192513D16?network=mainnet&features=podium,backers&podium_media=https%3A%2F%2Fimages.mirror-media.xyz%2Fnft%2Fstateful-crowdfund.jpg&endsAt=1628006400000)\n\n[Stateful Crowdfund Survey](survey://2?address=0x6458b744375ABaB0779df9e79d6B30E192513D16&title=Verify%20your%20email%0A&description=Once%20you%27ve%20contributed%2C%20please%20fill%20out%20this%20form.%20It%20will%20cryptographically%20sign%20a%20message%2C%20and%20allow%20us%20to%20contact%20the%20top%20100%20contributors%20after%20the%20Crowdfund%20concludes.%20This%20feature%20may%20not%20work%20with%20multisig%20wallets%20(eg.%20Argent,%20Gnosis)%20-%20please%20join%20our%20discord%20for%20manual%20verification.%20Your%20information%20will%20never%20be%20sold%20or%20shared%20with%20a%20third%20party.%0A&question=Enter%20your%20preferred%20email%20address.)\n\n→ Join the [Stateful Works Discord](https://discord.gg/dQftW5bNQy) for manual verification.\n\n## Contributors\n\nThanks again to all of our 51 contributors - whose perspectives are included in the book - and where applicable, them forwarding on their share of the proceeds to Stateful Works:\n\nAditya Asgaonkar\nAdrian Manning\nAdrian Sutton\nAfri Schoedon\nAlex Stokes\nAlex Vlasov\nAnon\nAnon\nBen Edgington\nCarl Beekhuizen\nCayman Nava\nCeleste Seberras\nCem Ozer\nChaz Schmidt\nChih Cheng Liang\nDankrad Feist\nDanny Ryan\nDmitriy Ryajov\nHsiao-Wei Wang\nIvan Martinez\nJacek Sieka\nJonny Rhea\nJoseph Delong\nJosephC \nJustin Drake\nKarl Floersch\nKirk Baird\nMamy André-Ratsimbazafy\nMatt Garnett \nMehdi Zerouali\nMeredith Baxter\nMichael Sproul\nMiguel Piedrafita\nMikhail Kalinin\nNathaniel Jensen\nNishant Das\nPaul Hauner\nPawan Dhananjay\nPreston Van Loon\nProtolambda\nRadosław Kapka\nRaul Jordan\nRobert Drost \nSam Wilson \nShay Zluf\nStefan Talpalaru\nTerence Tsao\nTrent Van Epps\nVictor Farazdagi\nVitalik Buterin\nWill Villanueva\n\n---\n\nIt's been an amazing experience working with everyone! To the entire Ethereum community: you made this project possible, we can't thank you enough. Here's to the Merge and beyond.\n\n❤️ Stateful Works", "timestamp": 1627657176, "digest": "-NLDSw0mA2vjtvqQYpXBOa3H38HXMmIdaw2KwI1A0y8", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "KWmKcFtTylq3nVwF3S85JfThD6fBxYJUY-Ckt_GGk54", "title": "Beacon Book: Read and Mint now!", "body": "*This post contains the complete text of the **Beacon Book**: a collection of perspectives from 46 researchers and implementers that worked on the Ethereum Beacon Chain. We hope you enjoy reading it! Join our [discord](https://forms.gle/jqrYHw9ykdSkW31YA) if you'd like to discuss.*\n\n1. ***The crowdfund for 100 physical prints is live now!!** [Contribute here](https://stateful.mirror.xyz/-NLDSw0mA2vjtvqQYpXBOa3H38HXMmIdaw2KwI1A0y8) to get a physical copy of the book*\n\n2. *In addition to the text, the book also features 7 full-spread illustrations, which can be minted as editional NFTs of varying exclusivity. They are placed below according to their position in the printed book. Only 10 full Genesis Edition sets (NFTs 1-7) can be minted. Check out this post for an exploration of the book's [Graphics and Narratives](**url**).*\n\n3. *In line with the goals set in our [Dec. 2020 announcement](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), any ETH from NFT minting and the auctions goes directly to the contributors that made the book possible: see the [Split Contract here](https://mirror.xyz/dashboard/splits/0x4Eb0D2b356da831aC613aEf9EC3D705d78DFd197). Please note that minting NFTs does not grant access to the printed books, nor should it be construed as an investment of any kind. This is a community based project.*\n\n---\n# Beacon Book \n\n![](https://images.mirror-media.xyz/publication-images/17a0e877-1b73-440e-a431-8de031e10c42.jpg?height=2625&width=3424)\n\n*Above: the back (left) and front (right) cover of the book*\n\n### Stateful Works\n\nWe are a group of community members interested in cultivating patronage culture around public goods. We can be reached at [@statefulworks](https://twitter.com/StatefulWorks) on Telegram or Twitter.\n\nWe're excited to continue creating Ethereum culture with all of you - to the merge and beyond.\n\n### Acknowledgments\n\nThis project would not have been possible without the time and effort of dozens of contributors, from Eth2 researchers and implementers to the broader Ethereum community.\n\nThanks as well to Y and C for their companionship.\n\n### Graphic Credits\n\nThanks to the following photographers for permission to use their work throughout the book: [Wesley Tingey](https://unsplash.com/@wesleyphotography), [Cytonn Photography](https://unsplash.com/@cytonn_photography), [Serge Kutuzov](https://unsplash.com/@serge_k), [Luis Quintero](https://unsplash.com/@jibarofoto), [Lawrson Pinson](https://unsplash.com/@lawrsonpinson), and [Gabriela Fechet](https://unsplash.com/@pt_graphy).\n\n### Introduction\n\nThe Beacon Book began its life in October 2020 as the first project from Stateful Works. While the content and framing has evolved over the past 6 months, the core vision has remained the same: to craft a crypto-native artifact that captures the humanity of the people building the future of Ethereum.\n\nIt contains the hopes, fears, and anticipations of the Eth2 researchers and client implementers directly responsible for bringing the Beacon Chain to life on December 1, 2020. The future of the Beacon Chain is the future of Ethereum, and we’re proud to tell part of its story this far.\n\nWe prompted contributors with a few questions - you'll find them in order in each response, some but not all answered.\n\n- Name / handle\n- Affiliated orgs\n- Primary role\n- Eth2 rough start date\n- General summary of experiences\n- Code or documentation they are particularly proud of\n- Most memorable or painful-to-discover Eth2 bug\n- Person you've come to admire or want to give a shoutout to\n\nKeep in mind that these responses were gathered both before and after the Beacon Chain launch, so references to launch expectations will vary. Profiles are ordered alphabetically by first name.\n\nFinally, while we made the utmost effort to include as many people as possible, it’s inevitable that we missed or were unable to feature some contributors. Eth2 wouldn’t be what it is without the input of hundreds of community testers and code contributors - thank you.\n\n---\n\n### Ethereum = Eth1 + Eth2\n\n- Ben Edgington\n- Originally [published on eth2.news](https://hackmd.io/@benjaminion/wnie2_210328), 28th March, 2021\n\nLet's start with a quick history of what's become known as Eth2, and where it's headed in the future.\n\nRecently, Danny Ryan has announced his [intent to deprecate](https://blog.ethereum.org/2021/03/11/finalized-no-23/) the use of the terms eth1 and eth2. As the creator and curator of “What’s New in Eth2,” this is a bit of a blow!\n\nBut, on the whole, I agree that these terms are beginning to outlive their usefulness, and are in danger of becoming quite misleading. It’s not really about fiddling with names; it’s about capturing fundamental changes in direction, and communicating them clearly. Changes in the roadmap are confusing for the community. Clarity in naming aids clarity of understanding.\n\nHere's a brief history of naming things in Ethereum’s roadmap.\n\nAs far as I can tell, the first use of the name “Ethereum 2” was by Vitalik in Hacker News, way back in [April 2014](https://news.ycombinator.com/item?id=7554923). He positioned Ethereum 2 as being a future step-change in the capability of Ethereum through the use of “fundamental cryptographic upgrades.”\n\nEthereum 2 then drops out of view, and the main narrative becomes the familiar Frontier → Homestead → Metropolis → Serenity progression, first described in [March 2015](https://blog.ethereum.org/2015/03/03/ethereum-launch-process/). In this scheme, Serenity is the network upgrade to Proof of Stake; Serenity isn’t Ethereum 2 per se. Interestingly, sharding/scaling doesn’t have a clear place in that roadmap, although it was certainly discussed [around that time](https://blog.ethereum.org/2015/04/05/blockchain-scalability-chain-fibers-redux/).\n\nProgress largely followed this plan for some years, with Homestead going live in March 2016, and Metropolis (in name at least) in a pair of upgrades in October 2017 and February 2019.\n\nSerenity was to have been delivered via a process of upgrading the existing Ethereum chain to bootstrap Proof of Stake. That upgrade was specified in [EIP-1011](https://github.com/ethereum/EIPs/blob/master/EIPS/eip-1011.md) and there was even a [testnet](https://hackmd.io/@aTTDQ4GiRVyyce6trnsfpg/Hk6UiFU7z?type=view) that went live on December 31st, 2017.\n\nHowever, the road to Serenity was found to be a dead-end, not least because of the vast amount of Ether that stakers would require - 1500 was the number back then.\n\nSo, in mid 2018, we tore up that roadmap and started afresh with Ethereum 2.0. Rather, we reverted to Vitalik’s original idea from 2014 of an Ethereum 2 that was to be a significant cryptographic step-change to the protocol. Calling this Eth 2.0 made sense: we were planning to change pretty much everything about the platform. Ethereum 1 would eventually be brought in as a kind of legacy system. This Ethereum 2.0 roadmap came with neat consecutive phases: Phase 0 for Proof of Stake; Phase 1 for data shards; Phase 2 for executable shards; and, finally, bring Eth1 over to Eth2 after all that.\n\nWe’ve now delivered Phase 0, but the rest of the plan has evolved. As per the latest Eth2 pages [on the ethereum.org website](https://ethereum.org/en/eth2/), “Eth2 [now] refers to a *set of interconnected upgrades* that will make Ethereum more scalable, more secure, and more sustainable” (emphasis mine). This looks much more like the old Serenity plan! We’re upgrading the Ethereum chain in-place rather than doing the old rip-and-replace.\n\nSo, you see, the roadmap narrative has vacillated over the years between effectively doing a replacement of Ethereum 1, referred to at various times as Eth2, and doing in-place upgrades to Eth1. Today, we’re more or less back in upgrade territory.\n\nIn view of all this, applying the Ethereum 2.0 moniker to the entire project is now seen as confusing: to some it implies a different chain to today’s Ethereum; to others, even [a different coin](https://www.reddit.com/r/ethereum/comments/md75k2/will_be_eth_20_a_new_coin_or_will_be_the_same_eth/). It suggests incompatibilities and problems ahead.\n\nThe [latest naming trend](https://blog.ethereum.org/2021/03/11/finalized-no-23/), then, is to limit Eth2 to refer only to the consensus layer upgrade of Ethereum to Proof of Stake, and to refer to all of today’s Ethereum (fka Eth1) as the execution layer.\n\nIt's good to see everything moving under a consistent terminology and a shared roadmap. I'm looking forward to a productive rest of 2021 and beyond!\n\n[Continuations [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=26)\n\n### Aditya Asgaonkar\n\n- Ethereum Foundation  \n- Researcher\n- 2019 \n\nEth2 promises to deliver a decentralized, scalable, and secure blockchain platform on which stateful applications can live. These three qualities will be the driving force towards the mass adoption of the Ethereum network.\n\nIn the quest to satisfy the design requirements, we've also seen some amazing research and engineering progress. We have pushed the frontier of computer science in areas such as Byzantine consensus, signature aggregation, and VDFs. With the launch of Phase 0, we created the largest BFT consensus network in existence, which is an awesome feat in itself!\n\nMy favorite bit of work was the [\"Weak Subjectivity Guide\"](https://github.com/ethereum/eth2.0-specs/blob/dev/specs/phase0/weak-subjectivity.md) - a document that outlines the weak subjectivity safety features of the Eth2.0 network. The goal is to prevent long range attacks that appear specifically in PoS consensus.\n\nAs for favorite bug, there was a consensus (fork-choice) issue discovered right before the Beacon Chain launch. The first priority was to assess the threat level of the attack -- it was critical and could have lead to a large-scale failure, but was extremely difficult to execute. Fixing this attack vector required a comprehensive review of the fork-choice component, and we had already identified a couple of solutions. At the end, there was agreement among the spec team that the attack didn't pose a critical threat because of its difficult execution, and we decided to publish a fix after further review was completed.\n\n### Adrian Manning\n\n- Sigma Prime  \n- Co-Lead Developer\n- Aug 2018 \n\nThe project has always been ambitious. The early designs were well thought out, but had shortcomings which became apparent when realising them through implementation. The collaboration between researchers and developers constantly iterated on these design specs for years, finally achieving a workable version of the original concept. The process was longer than expected, but it's been amazing to see the coordination and what has been achieved by a globally distributed group of implementers and researchers.\n\nOf all the work put into the Lighthouse client, I've changed and modified various architectures and designs and I'll likely continue to do so. I'm therefore not particularly fond of any individual piece relative to another. But I'm very proud of the end result. The resulting Lighthouse code-base that came together from everyone's hard work is what I'm most proud of.\n\nAs for person to give a shoutout to, I'm sure everyone has a similar answer, but for me it's Danny and Proto. Danny for the amazing organisational role and interfacing with all the client teams (especially on contentious topics) has sped up the development immensely. Proto (Diederick) for his relentless troubleshooting, bug-finding and research endeavours. He has been invaluable in interop testing, optimisation improvements and all round improving the general state of all clients and the eth2 ecosystem in general.\n\nAlso - there's an Australian saying, which I think applies to all eth2 researchers and developers: We're not here to f$!k spiders!\n\n### Adrian Sutton\n\n- Teku  \n- Client Implementer\n- July 2018 \n\nEth2 is this big idea that started as a seed right back when Ethereum began and then went on this crazy, messy, long journey as the details were thrashed out through open research and public collaboration. All that messiness and the length of the journey is a result of this unique, highly collaborative and distributed approach to designing it. Multiple times, concepts that had been thought settled were thrown out because a better idea came along. While that has been frustrating for on-lookers, it has led to and continues to lead to huge improvements in the resulting technology.\n\nThe interop lock-in in Canada was a major turning point in the progress of Phase 0. It forced the Beacon Chain out of that research mode. Suddenly, client development was less about translating the Python spec to another language and more about engineering all the other components that make a client actually usable. Client teams finally had a stable platform to work from and make clients interoperable. There was an explosion of tools to aid developers in debugging and testing across clients. The Beacon Chain had stopped being a research project and started being an engineering one. The road to Mainnet started to become clear.\n\nNow with the deposit contract launched and deposits flowing into it, the pressure to deliver the rest of Eth2 really amps up. Community pressure to unlock those funds again will become overwhelming and despite all the warnings that it won't be quick, people will be disappointed at how long it takes. But those locked funds will also be the equivalent of the interop lock-in, forcing work out of the research phase and into production. All that time spent researching led people to wonder if Eth2 will ever ship, but with the beacon chain launch and all that money locked in, Eth2 has almost unstoppable momentum.\n\nThe future of Ethereum is very bright.\n\nI'm quite proud of my blog post explaining the weak subjectivity period: [\"Exploring Ethereum 2: Weak Subjectivity Period.\"](https://www.symphonious.net/2019/11/27/exploring-ethereum-2-weak-subjectivity-period/) It was just me trying to get my head around a concept everyone seemed to be very hand-wavy about and put off solving to the future, yet it's become one of the standard reference points to explain the concept.\n\nI'm proud to have worked with Meredith Baxter and Cem Ozer. They have both been doing all the heavy lifting for Teku, almost entirely behind the scenes. They aren't flashy Twitter personalities, they just put their heads down and do the work.\n\nA few anecdotes to conclude: \n\n1. Family commitments mean I don't travel much, so when the first 7-client interop happened and a photo was posted of people crowded around the computer watching it, everyone in the photo was quickly identified but no one had any clue who I was. For a little while I was just \"that random guy in all the eth2 photos\".\n2. Before Ethereum, Ben Edgington only ever wore button-up, collared shirts. He's now exclusively dressed in Ethereum related T-shirts and has even picked up a penchant for Ethereum hoodies.\n\n[Caravans [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=27)\n\n### Afri Schoedon\n\n- Byzantine Fault / ESP Grantee  \n- Testnet Engineer\n- June 2018 \n\nI was working at Parity Technologies in 2018 which managed to implement EIP 1011, the \"Hybrid Casper FFG\" in the Parity Ethereum client. It was a hybrid proof-of-stake approach to the consensus engine and literally my first memory of seeing anything Eth2 related actually being implemented and run. There was Casper testnet up and running with Harmony, Pythereum, and Parity. It was exciting to see the idea of \"Serenity\" starting to materialize. \n\nHowever, it was the same year (only a few weeks later) that the Berlin Eth2 workshop decided to completely discard the hybrid Casper ideas in favor of the beacon chain. Admittedly, it was a massive undertaking. After all the ideation and the first implementations and testnets, we basically started from scratch. \n\nPrysmatic Labs first caught my attention when they launched their first public beacon chain testnets at the end of 2019. I was wondering why we had seven Eth2 clients but none of them was able to synchronize to the other clients' testnets. I was hooked and reached out to the Ethereum Foundation and the Goerli Initiative about contributing to multi-client testnets. And that's what I did in 2020, testnet after testnet up to the mainnet launch.\n\nWhen we launched the Goerli testnet in January 2019, it was not only an important milestone for Eth1 but it was also the perfect chance for Eth2 client teams to use this for their Eth1 integration leading up to the beacon chain genesis. Prysmatic Labs seized this moment and deployed all their Eth2 testnets to date to the Goerli testnet. Coindesk wrote a feature story with the headline [\"A New Test Network Just Activated and Ethereum 2.0 Will Be Using It.\"](https://www.coindesk.com/testnet-gorli-ethereum-serenity)\n\nAll my work on Eth2 concluded with the Eth2 mainnet launch in December 2020. The eight multi-client testnets are well documented on Github and received quite some [media attention](https://github.com/goerli/medalla).\n\nAs for bugs or missing features, that would be the lack of [BLS signature verifications](https://github.com/ethereum/eth2.0-specs/issues/2081) in the deposit contract.\n\nShoutout to Hsiao-Wei Wang!\n\n### Alex Stokes\n\n- Ethereum Foundation  \n- Researcher\n- 2018 \n\nWhat a ride it has been! The launch of the Beacon Chain in 2020 represents the culmination of years of research and development across countless contributors from every corner of the globe, reaching as far back as the Ethereum genesis block.\n\nIt has been exhilarating to watch this effort go from a collection of wild ideas (e.g. informal talks on Casper from Devcon 3) to today’s production-scale mainnet. Having been involved before the “casper + sharding” merge and the formation of the eth2 umbrella, I have seen time and again how a dedicated group of individuals adapts and responds to changes both inside and outside the community. It is this resilience that I find most exciting, and that gives me confidence in a very bright future for Ethereum.\n\nWe are ready to weather whatever challenges may come our way and I cannot wait as we deploy a scalable Ethereum in 2021 and beyond.\n\nI'll highlight [some of the early Casper work](https://github.com/ethereum/casper/pull/143) that got me involved directly with eth2 in mid-2018. Part of the original proof-of-stake design involved a validator registry contract hosted on the eth1 chain. As part of the deposit process, validators provided an arbitrary smart contract for signature verification. While an interesting application of account abstraction, this smart contract needed to be deterministic so that signatures could be independently verified on-chain. In order to ensure the smart contract had the desired properties, it was processed by another smart contract, the \"purity checker\" (in the sense of a pure computation), during the initial registration.\n\nAn early version of the purity checker was written in a now deprecated smart contract language called Serpent LLL. I created a Gitcoin bounty to port the Serpent LLL to a language stack used in the ethereum/casper project, Vyper LLL.\n\nMost painful bug would definitely have to be debugging cross-client interactions during the eth2 interop event in 2019. Fun times, good people and challenging bugs!\n\nShoutout to protolambda!\n\n### Alex Vlasov\n\n- TX/RX  \n- Applied Researcher\n- July 2019 \n\nMy predominant impression is that Eth2 poses problems, which are perhaps the most challenging from a software engineering point of view, at the moment. This is exciting from a researcher's perspective, but sometimes frustrating from a software engineer's one. We must adapt, in order to survive in the endeavor.\n\nOne aspect is that we, as software engineers, are used to optimizing for the common case, largely overlooking rare ones. But the latter ones are exactly what an attacker will thoroughly scrutinize! The habit is difficult to break, especially considering that it demands huge amounts of time to analyze and optimize the worst case behavior.\n\nI'm confident that we have to use Formal Methods, as testing is not able to explore the search space exhaustively (except for rare cases, when the space is relatively small).\n\nAnother important aspect is that modern DeFi is demanding on resources. And that is not only data throughput, but EVM/CPU throughput too. ZKP/zkRollups is an obvious example. However, asset pricing can be computation hungry too. And, as we can see now, DeFi asset pricing is an important topic. Unfortunately, EWASM turned to be a much harder idea to implement than initially expected. And it's basically for the same reason - WASM JIT compilers are optimized for a common case, while worst case scenarios can be exploited by an attacker. So, I treat it as another manifestation of the problem discussed above.\n\nWhile the problems are difficult, I am very excited to investigate and implement potential solutions.\n\nOne idea that I'm working on is a (semi-)automated transpilation of Eth2 beacon chain Python specs to Kotlin. The [resulting Kotlin code](https://github.com/ericsson49/research/blob/master/beacon_kotlin_generated/src/phase1/spec.kt) is beautiful, IMHO. Kotlin turned to be a pretty good match for (a statically-typed subset of) Python.\t\n\nAs for a specific bug, it's not yet made public (as it can turn to be a serious vulnerability). But the basic idea is that swapping two lines leaves a function 100% functionally correct, while an attacker can send the code into a practically endless loop.\n\nShoutout to Danny Ryan!\n\n[Discovery [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=28)\n\n### Ben Edgington\n\n- Teku  \n- Chronicler of Eth2 and Teku PM\n- January 2018 \n\nI could write a book on this, and perhaps one day I will. But the tl;dr is that getting to where we are has been the most incredible journey of my career.\n\nThe technology is thrilling, and the distributed development model no less so. But the highlight above all is getting to work every day with such a brilliant, thoughtful, capable, and generous group of people. If it's true that technology reflects the people who build it, then Eth2 is going to be a superb foundation for all the systems of the world.\n\nAs for the future, the beacon chain was designed, developed and delivered astonishingly quickly, having been conceived only in June 2018. Things get harder from now on: the beacon chain already carries so much value, and we need to begin taking into account the existing value on the Eth1 chain as we work on a merge. I think our main challenges ahead may not be technical, but more governance related. But I am confident that, with the ethos we've established and momentum we have as a community, we can bring this thing to a successful conclusion.\t\n\nI've enjoyed writing up regular digests of the latest developments in the spec since October 2018 at [eth2.news](https://hackmd.io/@benjaminion/eth2_news/), really with an audience of just the other Eth2 devs in mind. Over time it's grown and evolved, and now gets between three thousand and ten thousand views per edition. This amazes me.\n\nI am still happy with my one and only ethresear.ch post, co-written with Nicolas Liochon: [\"Exploring the Proposer Collator split.\"](https://ethresear.ch/t/exploring-the-proposer-collator-split/1632) While more of a design bug than a code bug, some credited it with finally finishing off the old sharding design, and precipitating the move to the beacon chain. I think things may have already been heading in that direction at the time.\n\nAs for individual shoutouts, what an incredible group of people - you are all amazing!\n\n### Carl Beekhuizen\n\n- Ethereum Foundation  \n- Researcher\n- April 2018 \n\nAlthough eth2 has taken longer to get off the ground than I think any of us imagined, the result is extremely robust, secure, and decentralised.\n\nIt is incredibly exciting to see how eth2 is evolving and maturing into the backbone of the decentralised future we all dream about.\n\nI'm most proud of the key-derivation EIPs (2333, 2334, 2335). Specifically, the quantum-secure backup keys built into EIP 2333. In the event of a quantum apocalypse, validators should be able to recover using these Lamport signatures.\n\nI'm also really proud of the Launchpad. 🦏 So many validators managed to deposit safely.\n\nSpecial shoutout to Hsiao-Wei Wang for the attention to detail and diligence she brings to everything she works on.\n\n### Cayman Nava\n\n- Chainsafe Systems  \n- Client Implementer\n- December 2018 \n\nThe past two years have been a blast. Looking back on the progress we've collectively made and the state of the ecosystem, I feel like we're on the cusp of something great. And I'm honored to be a part of it. I anticipate that Ethereum will be of critical importance for the future, as a rock-solid foundation that empowers ultimately successful experiments which aim to resolve many of the hardest problems facing society today.\n\nI'm proud of the [typescript implementation](https://github.com/ChainSafe/ssz) of SSZ (a copy of Proto's remerkleable). It fulfills the spec, but in an ergonomic way. You can operate on an ssz merkle tree as if it is a 'normal' javascript object. This required some exotic code, but the result is seamless [ssz <-> javascript interoperability](https://medium.com/chainsafe-systems/lodestar-medalla-update-59865a5cce1a).\n\nHuge thanks to Proto and his work! Many of the tools / algorithms / methods he's published are present in Lodestar: remerkleable, eth2-fastspec, protoarray fork choice, etc. the list goes on.\n\n### Celeste Seberras\n\n- Prysmatic Labs  \n- Technical Content Strategist\n- May 2018 \n\nIt has been a humbling experience to have witnessed the growth of Prysmatic from a small seedling with a dream to the robust and diverse community it harbours today; equally so for the broader Eth2 ecosystem. Hard work over the past two years has proven that, through all the speculative noise and interindustry drama, the things that truly speak are code and passion.\n\nI'm most proud of my work on the Prysm client usage manual.\n\nShout out to all the boys here at Prysmatic Labs. You are all fantastic to work with, here's to the future!\n\nShoot for the stars. Even if you miss, holy fuck you're in space!\n\n### Cem Ozer\n\n- Teku  \n- Client Implementer\n- January 2019 \n\nI’m blown away that the Eth2.0 beacon chain is now alive and well. For me it was such a complex undertaking, and deep down I was scared it would never launch or be successful.\t\n\nWhen I first joined Teku (called Artemis back then) we were almost only working on the state transition. The spec changed pretty rapidly at the time, and as a result we had to update our state transition many times. I found myself leading these changes at Artemis, and it would almost always be a week long intense marathon where we’d change thousands of lines of code as a team, and I’d try to make sure we did not break anything.\n\nLuckily this was in the prototyping phase, this is not how it’s done today in the production phase :). I’m also pretty proud of having worked on the Eth1 Deposit Management of Teku.\n\nMy best bug discovery is luckily documented by my team lead Adrian Sutton on his blog: [\"The Curious Case of the Invisible Fork.\"](https://www.symphonious.net/2020/07/06/exploring-ethereum-2-the-curious-case-of-the-invisible-fork/)\n\nShoutout to Johnny Rhea, Adrian Sutton, and Protolambda. These three people are all geniuses in their own unique ways. It was an honor and an incredible experience working with them.\n\n[Build - Maintain [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=29)\n\n### Chih Cheng Liang\n\n- Ethereum Foundation  \n- Client Implementer\n- November 2017 \n\nI'm glad to be part of Eth2 development. There are too many people; I can't express my gratitude enough. There are lots of beautiful memories that I'll cherish forever.\n\nI'm excited to see what Ethereum will be with fully-fledged PoS as well as sharding.\n\nI'm most proud of introducing the Milagro BLS binding to Trinity. BLS signatures are like the steroids of Eth2. Back then, only one Python library, py_ecc, met the requirements of the Beacon Chain spec. py_ecc is great for research or education purposes, but for things like client implementations, the performance of the library is not on par. The naïve alternative is to find a Python binding of a fast language. Chia's Python binding to C++ code was the low hanging fruit to pursue.\n\nAs the Beacon Chain BLS requirements became more specific, and we had to interop with other clients in a short timeframe, we decided to try using Python to wrap \"milagro_bls\" - Sigma Prime's Rust library. The result is the \"milagro_bls_binding\" library. I'm proud of it because that's my first Rust-ish project, and it was used in a real use case.\n\nAs for most challenging bug, in early 2018 I worked on the [Casper prototype testnet](https://github.com/ethereum/trinity/pull/954) that Karl and Vitalik built on pyethapp. Pyethapp had many issues, but the most difficult one to debug was the peer connection issue. I got a lot of help from Dmitry from the Harmony team, he discovered many peer connection issues with the Java client's logs. One of them was pyethapp's catastrophic peer-to-peer bug.\n\nSpecial thanks to Jannik Luhn - he contributed lots of quality work in peer to peer research/simulation and Trinity.\n\n### Dankrad Feist\n\n- Ethereum Foundation  \n- Researcher\n- June 2018 \n\nBy historical accident, one of my first ever involvements with Ethereum was the research workshop in Berlin 2018 where the Beacon chain design (and merging of Casper and Sharding) was first decided. I had only come to the workshop because I was in Berlin at the time for my startup and my former colleague and friend, Justin Drake, had invited me to check it out. The concepts that were talked about at this workshop immediately appealed to the nerd inside me -- deep maths and computer science problems, nevertheless approachable and worth exploring to find elegant solutions. \n\nOver the next few months, I tried my luck on some of the problems that were discussed, especially the randomness problem. However, it would only be March 2019 that I left my startup and went to work on Ethereum 2.0 full time, so I would say that the concept of the beacon chain was by then fairly mature and what was left to be done was more tinkering around the edges.\n\nI think it is always worth reminding ourselves that the beacon chain itself, while only one part of Eth2.0, is a very ambitious project. As far as I am aware, Proof of Stake has never been tried on this scale: neither economically nor in the networking sense. What I mean by this is the sheer amount of funds that can be staked on the beacon chain, which due to the Ether market cap can easily approach billions of dollars in value. This is one advantage smaller projects certainly do have over Ethereum -- they can increase stake gradually, whereas Eth2.0 will very quickly go all the way.\n\nNot only that, but most other projects have refrained from actually imposing penalties on validators -- which compromises the security of PoS networks, but obviously makes designing it much easier, because literally nothing is at stake except for some very minor rewards.\n\nFinally, and this is the most important distinction, Eth2.0 is designed so that it can literally accommodate a million validators. That's pretty impressive considering that most other projects only support around 100! Not only that, but this feat is achievable using fairly modest node requirements, in fact it seems perfectly plausible to run a validator on a mobile phone or a Raspberry Pi.\n\nWhen we do launch the beacon chain, which is now truly imminent (barring extreme surprises), we should keep in mind just how ambitious this project is even on its own. \n\nThe beacon chain was essentially frozen 3 months after I joined the team full time, so I would not claim that I have made any major contributions to it. My most important contribution to Eth2.0 that is slated for inclusion so far is re-architecting the Proof of Custody construction so that it is fully suitable for SSVs (Secret Shared Validators). While we weren't too sure of the experimental cryptographic Legendre pseudo-random function (PRF) when we first came across it in March 2019, it has successively improved to a truly impressive construction on all fronts that I am now very proud of:\n\n1. Extended cryptoanalysis has improved our confidence in the Legendre PRF a lot in response to several bounties that we have set out.\n2. The combination of the Legendre PRF with the Universal Hash Function primitive, suggested by Dmitry Khovratovich, means that only a single evaluation of the PRF is needed per proof of custody, and the rest of the computation is extremely efficient and even faster than regular (sha256) hashing.\n3. Thanks to the probabilistic 0.01 bit proof of custody idea, only a small amount of information is leaked from the proof of custody, such that it would be impossible to gain access to custody secrets even if the Legendre PRF were broken outright.\n\nFinally, I have huge respect for Danny Ryan. He is phenomenal at keeping everything together and making it work.\n\n### Danny Ryan\n\n- Ethereum Foundation  \n- Researcher\n- 2017 \n\nSurprise! Everything is a bit harder than originally expected (at least from my perspective) - I suppose most of the things worth doing in life are. Today, I am very excited about the project and the progress. Eth2 has an incredibly strong technical background and is ready for the next wave of upgrades. Huge shout-out to the hard work from client teams, as well as to the validator community keeping this thing running.\n\nI'm most proud of my work on the [beacon chain spec](https://github.com/ethereum/eth2.0-specs/blob/dev/specs/phase0/beacon-chain.md).\n\nFinally, I don't want to imagine how this would have gone without protolambda's insight and technical contributions over the past couple of years.\n\n### Dmitriy Ryajov\n\n- Status  \n- libp2p developer\n- August 2019 \n\nSuper grueling, but rewarding in terms of overall impact on the different ecosystems, Eth2 itself, the Nim language and libp2p.\n\nI'm most proud of my work on the Nim libp2p implementation.\n\n### Hsiao-Wei Wang\n\n- Ethereum Foundation  \n- Researcher\n- Summer 2017 \n\nMy journey started with implementing Serenity™. It was an ambitious and abstract concept. We've struggled with the design trade-offs for a long time, but with more and more contributors who devoted their efforts, and years of hard work, we were finally able to divide and conquer Eth2.\n\nIt was a fantastic journey to launch Phase 0 finally. I'm so grateful for the broad community support. And, of course, the Ethereum heroes who dove into Ethereum R&D.\n\nI'm very excited about the next Eth2 milestones and the creative ideas that the community will build on Eth2.\n\nI want to mention my admiration for Virgil Griffith, a pioneer that paved the way for Ethereum research work.\n\n[Seen and Seeing [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=30)\n\n### Ivan Martinez\n\n- Prysmatic Labs  \n- Engineer\n- August 2018 \n\nWorking on Eth2 has been an amazing adventure. It went from contributing in my free time to becoming my longest running full-time job. While there have been a few blocks on the way (unstable spec, implementation problems, testnet drama), it's been an absolute blast and this is just the start! Very excited to release, and move forward with future phases!\n\nI am particularly proud of building our [end-to-end testing suite](https://github.com/prysmaticlabs/prysm/pull/3932), which has proved incredibly useful for detecting issues before changes reach the canary. I've also helped build a lot of the [slasher](https://github.com/prysmaticlabs/prysm/pull/5043) and optimized it for mainnet usage.\n\nOne of the most memorable bugs I encountered would have to be: [\"Change StreamIndexedAttestations to use target root for state regen #5971.\"](https://github.com/prysmaticlabs/prysm/pull/5971)\n\nShoutout to Terence Tsao! His ability to understand the spec has constantly amazed me (he's the largest contributor to the spec outside of the EF!).\n\nAlso.. Danny Ryan is awesome :)\n\n### Jacek Sieka\n\n- Status  \n- Research Lead\n- March 2018 \n\nI was fortunate to join Eth2 at the very start - having worked on many open source projects before, for fun, peer-to-peer networks like DC++, compilers like nlvm, as well as high-frequency trading. It all came together at that point like a perfect fit - a giant stroke of good luck. Here we are, years later, with the baby well on its way to being delivered.\n\nThe work I'm most proud of is managing to restore sanity and switching [Eth2 to Little Endian](https://github.com/ethereum/eth2.0-specs/pull/139). It survived several high-profile attempts to swing it back to Big. I guess a more memorable, and certainly more involved feature, was the deep collaboration on the networking protocol that culminated with [what we have today](https://github.com/ethereum/eth2.0-specs/pull/1328) - this was quite the achievement made possible by some round-the-world collaboration with Adrian (of Sigma Prime), Raúl (of libp2p) and lots of others! Less known is that me and Adrian resorted to flipping an Ethereum block hash coin to see who would get to post the PR :)\n\nI'm most proud of when Paul Hauner and I managed to run a fully independent, self-sufficient [multi-client Eth2 network](https://twitter.com/jcksie/status/1171886857908609024) for the first time, at the Canada retreat!\n\n### Jonny Rhea\n\n- Teku, TX/RX  \n- Client lead & TX/RX co-founder\n- November 2018 \n\n\"It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness, it was the epoch of belief, it was the epoch of incredulity, it was the season of light, it was the season of darkness, it was the spring of hope, it was the winter of despair.\"\n\nParticularly proud of my Ethresearch post, [\"Packetology: Validator \nPrivacy.\"](https://ethresear.ch/t/packetology-validator-privacy/7547) \n\nMost memorable bug: [\"DoS Attack on Prysm Stops Finality.\"](https://github.com/ethereum/public-attacknets/issues/12)\n\nShoutout to the Russians! (former Harmony team) “You know that if we don't pull this off we are fired, right?” Joe Delong to me before the interop lock-in.\n\n### Joseph Delong\n\n- Teku  \n- Client Implementer, Researcher\n- December 2018 \n\nI hope we can move from the Beacon Chain to a practical implementation as fast as possible. Most proud of my implementation of the deposit tree logic in Teku. Toughest bug was getting the \"is_valid_merkle_branch\" method working in Teku.\n\nShoutout to Jonny Rhea & Mikhail!\n\n### JosephC \n\n- ConsenSys  \n- R&D\n- January 2019 \n\nThe Beacon Chain launch is like Project Mercury: getting into space/orbit. The equivalents of Project Gemini and Project Apollo are needed next. Rollups and Layer 2 will help improve scalability, but I believe there is much innovation that can and should continue to be done in Layer 1. There is a place for some execution, and cross-shard transactions in Layer 1. I also think that we should be careful about assumptions that we might make, like assuming that cross-shard transactions must be asynchronous. The challenges in the Ethresearch thread [“Cross-shard DeFi composability”](https://ethresear.ch/t/cross-shard-defi-composability/6268/9) need tackling with minimal assumptions.\n\nI dream of a system that is more scalable, performant, but preserves the default atomicity and synchronicity of Ethereum. I dream of shards that are transparent and automatically load-balancing. It may sound impossible, but can be used to inspire the engineers of the world to build the ambitious system that we can envision.\n\nDevelopments like Apollo and the Internet are an encouraging reminder to what humanity can accomplish: where there's a will, there's a way.\n\nWhy is this important? Why is a platform for decentralized systems important? John Perry Barlow may have answered it with his [“Declaration of the Independence of Cyberspace.”](https://www.eff.org/cyberspace-independence)\n\nPersonally, I'm delighted that [\"The Beacon Chain Ethereum 2.0 explainer you need to read first\"](https://ethos.dev/beacon-chain/) is usually on the first page of Google for \"beacon chain.\" I'm most proud of forming and recruiting a talented R&D group at ConsenSys that has made numerous Ethereum contributions. For Eth2, these include a review of the deposit contract and influencing an important Solidity implementation. More well known is the Quilt team, which started from R&D of Eth2 Phase 2 (execution, threads [quilting], rather than Plasma). Finally, years ago I helped connect Karl Floersch to the Casper \"team\" at EDCON Paris.\n\nShoutout to all of Ethereum Layer 0 -- its people -- without which there would be no Layer 1 or beyond. Layer 0 always welcomes you, and all contributions great and small :)\n\n### Justin Drake\n\n- Ethereum Foundation  \n- Researcher\n- Late 2017 \n\nLooking back, the beacon chain took longer than expected to ship and there is significant work remaining in the coming years. Having said that, I am incredibly optimistic and excited about the future of Ethereum—I could not be more bullish :)\n\nI'm pretty proud of the fact that the beacon chain spec is executable - it's pretty remarkable IMO. How many complex internet protocols have a full executable spec, not to mention four production-grade implementations on day 1?\t\n\nOne of the \"design bugs\" I was involved with early on was having PoS and sharding be separate cryptoeconomic systems as opposed to one unified design. Another big design flaw was using plain (as opposed to aggregatable) signatures. Looking back, in ~2 years we took a visionary but very rough design and made it orders of magnitude better.\n\nFolks dedicated to Eth2 are a rare breed (less than 100 of us) and I have tremendous respect for the team as a whole, as well as many individuals. I will note that, with where things are headed, we may soon have trillions of dollars running on Eth2 and we will need more manpower. So I want to give a shoutout to you—the reader—to consider joining the Ethereum mission :) Hit me up by email, on Twitter, or on Telegram!\n\n[Traditions [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=31)\n\n### Karl Floersch\n\n- prev. Ethereum Foundation  \n- Researcher\n- Winter 2017 \n\nIt has been a wild journey to scale Ethereum & we are ridiculously close to realizing the vision after all this time. It's pretty insane. I'm most proud of the early work I did on [Casper](https://github.com/ethereum/casper) and initial implementation of [Hybrid Casper](https://github.com/ethereum/pyethereum/tree/b704a5c6577863edc539a1ec3d2620a443b950fb/ethereum/hybrid_casper). As for bugs, the pyethereum p2p layer was absolutely terrible and really crippled the testnet :'''(\n\nShoutout to Vitalik, Hsiao-Wei Wang, & Justin Drake!\n\n### Kirk Baird\n\n- Sigma Prime  \n- Client Implementer\n- January 2018 \n\nIt's been a very busy two years; as only my second job working in IT, the learning curve has been massive. First and most importantly, my understanding of the core technologies around blockchains has matured from seeing them as a secure linked list to the complex beast they are. With the focus of my work being on integrating BLS into Lighthouse, a significant knowledge of pairing based cryptography was needed. The BLS signature scheme is far more complicated than the existing ECDSA used in Eth1. Luckily, there are a lot of good resources out there which explain how to progress from classical elliptic curve cryptography to pairing based cryptography.\n\nI was lucky enough to go to DevCon Osaka in 2019 which was an amazing experience! There were so many keen minds all meeting to relish and enjoy the progress Ethereum has made, but also to provide insights and ideas on how it will be improved and developed over the coming years. Japan itself is also an amazing place with so much to see, until we almost got stuck in a typhoon.\n\nI am most proud of the work done on [Milagro BLS](https://github.com/sigp/milagro_bls). This library was rough around the edges when I first inherited it, being a long way from the standardised signature scheme we have now.\n\nFinally, wanted to give a shoutout to Danny Ryan! The man is a weapon.\n\n### Mamy André-Ratsimbazafy\n\n- Status  \n- Client Implementer\n- July 2018 \n\nI remember reading the \"70% ready\" spec in july 2018, that was the wild wild west. Things were on a HackMD document, changes were made every 6 hours and very hard to track - as mentioned in the EthCC 2 talk [\"Tests and Simulations of Eth2.0.\"](https://www.youtube.com/watch?v=6c4mQg5L6Rs&t=597s)\n\nOne of the most significant milestones was when, out of nowhere, all 7 clients at the time were able to create a testnet back in September 2019 in Muskoka. Anticipation, apprehension, will the launch work? If yes, that is definitely a huge milestone!\n\nI'm proud of my work on the [\"Auditors Handbook to Nimbus Beacon Chain.\"](https://nimbus.guide/auditors-book/01_introduction.html) Nimbus uses a dark horse language called Nim. It happens to be easily picked up, and our 3 audit teams were pleasantly surprised by its features, including those related to correctness.\n\nThe most infamous bugs we had were related to fork choice / Proof-of-Stake. The most infamous one would be this one-liner hotfix, where some votes were skipped in period of non-finality: [\"hotfix fork choice score application #2041.\"](https://github.com/status-im/nimbus-eth2/pull/2041/files)\n\nBig respect to Protolambda! He came like the Hagibis storm.\n\n### Matt Garnett \n\n- Quilt  \n- Researcher\n- January 2019 \n\nMy perspective on eth2 is probably very different from many people who were focused on Phase 0. Although I compartmentalized Phase 0 and Phase 1 to a large degree to allow myself to consider the possibilities of Phase 2, I never considered the possibility that eth2 wouldn't ship. To me, it was not a matter of \"if\" but \"when.\"\n\nI'm proud of the work I did writing the first Execution Environment for eth2, called [\"sheth.\"](https://github.com/quilt/sheth) It was completely stateless and allowed Ether transfers within a shard. \n\nShoutout to Proto, he has been instrumental in making eth2 happen, I don't know how he manages to be so prolific.\n\nA quick story to wrap up. On the first day of the Canada interop, the Quilt team drove up from Toronto in a 15-person passenger van. It had rained a bit so the area was sort of wet. The venue was tucked away off on a gravel road, right beside the lake. We pulled the van up next to the parked cars and headed in to visit with the eth2 teams. \n\nAfter catching up with everyone, we returned to the van to drive over to the airbnb we were sharing with the ewasm team. Will Villanueva had driven us there, so he hopped in the driver's seat and began orienting the van forwards to head out. The area we had parked in was sort of a T-intersection and there were small drop-offs (0.5m maybe) into a heavily wooded ditch anywhere there wasn't road. Will backed into one of the legs of the T and started to drive forward to leave. Unfortunately, the exit path was a rather steep gravel hill. The 2WD van didn't have the traction climb out and now we were positioned at an awkward angle in the T. The van was perilously close to tipping over into the ditch. Will backed up to a flatter part to regroup. I offered to give it a shot and he obliged. \n\nAt this point, we had drawn a bit of a crowd. I recall having people at each corner of the van, keeping an eye out to help avoid falling off into the ditch. I gave it a few attempts, but realized how difficult of a situation we were in. At this point, it was unclear if we could even return to our starting place, as the front left and back right of the van were less than a foot away from falling into the ditch - a ditch that would no doubt require a tow truck to collect the van from. There was no other option than making it up the hill. Fortunately, there was a bit of flatter ground between the van and the beginning of the hill. Although it would be a tight fit, likely inches on either side into the wooded ditch, I thought that with speed we should be able to build enough momentum to get past the steep portion of the hill. I shared my plan with the spectators. Unsurprisingly, the uninvested patrons were eager to fill me with confidence so they could enjoy the spectacle. I backed up the van as far as the gravel road would allow and then slammed the gas down. The van lurched forward, albeit lethargically, towards the top of the hill. The eth2 gods were almost certainly looking down on us in that moment and guided that van safely to the hill's peak. \n\nAt the top of the hill, I collected my emotions and then stepped out to enjoy the laughing and cheering. We inspected the ridiculous situation we had been in, and examined the ruts that the tires had made spinning out on the fail attempts. After the excitement died down and the spectators returned to the venue to continue working on their clients, we headed back up the hill to our van and drove home. \n\nFor the rest of the time there, we parked the van at the top of the hill and walked down to the venue.\n\n### Mehdi Zerouali\n\n- Sigma Prime  \n- Security Engineer, Cofounder\n- October 2018 \n\nI find it hard to believe that we're finally launching the beacon chain! So much hard work from so many different entities has gone into this over the past couple of years. I'm extremely proud of what Sigma Prime has accomplished so far and look forward to the Lighthouse crew making Phase 1, Phase 1.5 and Phase 2 a reality.\n\nThe structural differential fuzzer I've helped build as part of Beacon Fuzz is definitely something I'm proud of. Over the last few months, Beacon Fuzz helped uncover more than 40+ bugs on all major client implementations, including critical consensus related vulnerabilities.\n\nIt's hard to pick one person to recognize, but Diederik Loerakker (aka protolambda) has done such an amazing job helping the client teams navigate the optimisations required to implement the eth2 spec in production. Of course, the coordination job done by Danny Ryan is second to none. I doubt we'd be where we are today without these two exceptional individuals.\n\nFun fact: Lighthouse releases are named after Rick & Morty characters!\n\n### Meredith Baxter\n\n- Teku  \n- Client Implementer, Software Engineer\n- November 2019 \n\nI was fortunate to join the Teku team at an exciting time (about a year ahead of the beacon chain launch) in November of 2019. We had a lot of work ahead of us and we weren't sure whether or not we would meet launch deadline with a fully functional, production-ready client. The learning curve to understanding eth2 is also pretty steep, which only increased the pressure. Luckily, the EF and other eth2 client teams have been an incredible resource for us throughout the development process. The engineers involved across the client teams have been very open and supportive. And the EF researchers have been amazingly welcoming, approachable, and responsive. They've always been there for us to answer questions and provide insights. It has been hugely gratifying to be a part of the successful launch of the beacon chain with the help of this incredible group of people. I'm very excited to continue the work as we look forward to upcoming changes including our first hard fork, sharding, and the merge.\t\n\nOne exciting milestone was getting [Teku syncing to a live](https://github.com/ConsenSys/teku/pull/1143) testnet (Prysm's Sapphire testnet).\n\nI'm also really proud of our [checkpoint sync feature](https://www.youtube.com/watch?v=Oz3flfj50Ig) which allows new nodes to sync up and become fully operational within minutes. See the issue as well: \"[Implement sync from a recent state #3063](https://github.com/ConsenSys/teku/issues/3063).\"\n\nThe instability on the Medalla testnet in the fall of 2020 was a trying moment across the client teams, but we came out stronger on the other side. We were all working overtime to improve performance and patch issues revealed by the long period of non-finalization. One big fix I managed to push during this time involved putting a hard limit on amount of work required to regenerate states that dropped out of our in-memory cache: [\"[Issue 2608] Add ability to periodically persist hot states #2611.\"](https://github.com/ConsenSys/teku/pull/2611) More context on the network instability can be found here: [\"Eth2 Implementers’ Call #46 - 2020-08-20.\"](https://hackmd.io/@benjaminion/S1b2sJhzv)\n\n### Michael Sproul\n\n- Sigma Prime  \n- Client Implementer\n- March 2019 \n\nAfter a brief foray into the blockchain world in 2017, I developed a taste for it and knew I had to come back. When I saw a job ad from SigP on Twitter for a proof-of-stake client in Rust, I dropped what I was doing and got involved ASAP. At the beginning I got deep into Lighthouse's consensus code which was then very much in flux due to lots of spec changes, and had been written in a gargantuan solo effort by Paul! From that foothold in consensus I then branched out into the database, op pool and slashing -- all of which captured my interest in a way no other project had. \n\nWhen we ran the first testnets in September 2019 off code I'd contributed to, I was kind of shocked the thing worked at all, and awed by all the hard work done by everyone else involved. This community of researchers, programmers and enthusiasts has been nothing but amazing, and I'm optimistic for a successful Phase 0 launch and the realisation of the Eth2 dream in Phase 1 and beyond. Personally, I can't wait until we can run some transactions, and look forward to getting into the minutiae of WebAssembly execution environments.\t\n\nI'm very proud of Lighthouse's slasher. I was able to draw inspiration from great foundational research laid by Proto, and dedicate myself to building a fast, concise implementation. Testing the implementation on Medalla and watching the carnage inflicted on other validators brought a perverse form of satisfaction ;)\n\nOne of my favorite bugs: [\"DB inconsistent after restart #1488.\"](https://github.com/sigp/lighthouse/issues/1488)\n\nShoutout to Cem Özer!\n\nI know of at least one core dev who force pushed a commit to master in the EthDenver bathrooms...\n\n### Mikhail Kalinin\n\n- PegaSys, TX/RX  \n- Applied Researcher\n- April 2018 \n\nIt's been exciting to see how Hybrid Casper FFG and the Sharding proposal have been merged into what is now called the Beacon Chain. And how this research is evolving, growing, attracting a lot of new people. And finally the result is about to be shipped pretty soon. This was a big part of my life for two and a half years. I anticipate rapid movement towards Shards and the Merge when Phase 0 is shipped. Though there are many things yet to deal with.\n\nI am proud of the [Eth1 Shard Demo](https://github.com/txrx-research/eth1-shard-demo) that we made together with Guillaume from EF with decent support from EF researchers.\n\nI can give recognition to a bunch of people tbh. But, narrowing down, Danny Ryan and Ben Edgington.\n\n### Nathaniel Jensen\n\n- Sigma Prime  \n- Security Engineer\n- September 2019 \n\nI'd heard a bit about Ethereum before but had not developed a solid understanding.\n\nAlthough relatively new, I'm glad to play a small part in such a technically impressive undertaking. I am continually appreciative that I can work in such an interesting space, with such friendly and impressive colleagues and community, and contribute to something that has the potential to be profoundly important. I'm excited to see Phase 0 mainnet kick off, the culmination of so much effort!\n\nI look forward seeing the space continue to develop with the incorporation of the EVM chain and Layer 2 solutions, and all the interesting use-cases that I can't begin to imagine.\n\nMy primary contribution to the Eth2 ecosystem had been taking on maintenance and development of a differential fuzzer that compares state transitions across the Eth2 clients: beacon-fuzz. In September 2019, Sigma Prime was engaged by the Ethereum Foundation to continue development of Guido Vranken's previous differential fuzzing solution - comparing ZRNT and Pyspec, the Go and Python Eth2.0 executable specifications.\n\nI was primarily responsible for building out [the fuzzing framework](https://github.com/sigp/beacon-fuzz) to include comparison of other client implementations: Lighthouse, Prysm, Nimbus, Teku, Trinity, as well as adding fuzzing targets for additional state transition functions.\n\nAs for most painful bug, see the [\"Beacon Fuzz update 001\"](https://blog.sigmaprime.io/beacon-fuzz-01.html) on the Sigma Prime blog, section \"Golang Library Linking Errors.\" How to try to get multiple Go implementations running without having their dependencies clash, and dealing with arcane linking issues using existing tooling to build a Go fuzzing library that exercises cgo/C code (as Prysm depends on a C/assembly BLS library).\n\nI want to give a shoutout to Protolambda (Diederik Loerakker). He reliably gets to the bottom of really obtuse fuzzing results. He's our consistent fallback for deciphering complicated results across multiple Eth2 client implementations. From our interactions, he clearly comes across as a friendly, genuine, and technically outstanding individual.\n\n### Nishant Das\n\n- Prysmatic Labs  \n- Client Implementer\n- June 2018 \n\nIt was a very difficult endeavour to get Eth2 running smoothly. Ultimately, with teams well distributed across the globe, constant communication is always a challenge. However, despite all that, I am really proud of the fact that we have launched Phase 0 with 4 different clients running. I'm very optimistic for the future and am looking forward to the merge. There have been too many bugs to count, and I keep on finding new ones every week.\n\nShoutout to Proto - cross client compatibility would be nowhere near what it is without him constantly monitoring and working on it.\n\n### Paul Hauner\n\n- Sigma Prime  \n- Client Implementer\n- January 2018 \n\nThe Ethereum Foundation has fostered an inclusive, open, and merit-based approach to technical collaboration. Under this environment we've seen many researchers, engineers and communicators flourish. This is a testament to what people can do when they share a common goal and are empowered to work on the things that interest them.\n\nAs Eth2 has progressed, Sigma Prime has grown steadily to include a team of talented engineers and computer scientists. I am grateful to work with these people and I learn from them every day.\n\nI hope to see Ethereum evolve into a tool that provides honest utility to everyday people, without jeopardising the sovereignty of their data or selves.\n\nRegarding work I'm proud of, I quite like the [minimal-allocation Merkle-tree hasher](https://github.com/sigp/lighthouse/blob/stable/consensus/tree_hash/src/merkle_hasher.rs) I built in 2018. It's simpler and more powerful than other algorithms I have seen.\n\nOne notable bug: [\"Manipulating deposit contract to gain an early majority #1446.\"](https://github.com/ethereum/eth2.0-specs/issues/1446)\n\n### Pawan Dhananjay\n\n- Sigma Prime  \n- Client Implementer\n- July 2019 \n\nI remember reading Vitalik's proof of stake blog posts in early 2018 and thinking that it sounds all good in theory, but no way we'll have a proof of stake protocol for more than a small number of participants which would work well in practice. Needless to say, it's been extremely impressive to see how far the effort has come in just a few years. Kudos to everyone involved, I'm glad to have been a part of the effort for the past year.\n\nAlso, a huge shoutout to the SigP crew! It has been an absolute blast working with these guys, learning from them and also indulging in their jolly Aussie humor :) Excited for the Phase 0 launch and geared up to begin work on Phase 1!\n\nMost memorable bug would have to be: [\"Update state before producing attestation #1596.\"](https://github.com/sigp/lighthouse/pull/1596)\n\nBig thanks to protolambda for sure. All his debugging tools have saved me (and many others I'm sure) hours of effort.\n\n### Preston Van Loon\n\n- Prysmatic Labs  \n- Cofounder, Client Implementer\n- January 2018 \n\nThe last few years have been an adventure, to say the least. At first, I had just a mild interest in Ethereum. I didn't own any cryptocurrencies or really understand how they worked. After a few months of reading, I started to realize two things: 1) Ethereum was this incredible technology that has an unlimited potential to change the world for the better, and 2) Ethereum is incredibly slow and desperately needed to scale. \n\nImmediately, I looked for ways to help contribute to the scaling effort and then I met Raul Jordan. We met together in NYC for coffee and talked about starting a project to work on sharding for Ethereum. We formed Prysmatic Labs. Since starting the company in January of 2018, I've met some of the most interesting people in the world - many have become close friends. Working in Ethereum continues to fulfill my desire to make a positive impact, and I'm very much looking forward to seeing the completed roll out of Eth2.\n\nMost memorable bug would have to be that time that all of Prysm nodes thought they were 4 hours in the future and thousands of validators were slashed in a testnet: [\"Roughtime reports clock offset by 4hrs #6825.\"](https://github.com/prysmaticlabs/prysm/issues/6825)\n\n### Protolambda\n\n- Ethereum Foundation  \n- Researcher\n- November 2018 \n\nThe main theme is that we - researchers and client devs - did not make our lives easy. Spec updates have continued to improve the protocol itself, but caused instability in the process of updating implementations. A new network stack was adopted, and many difficult research and implementation problems had to be solved. In the future, I do not think this will change, as Phase 1 and later are complicated too. But the approach can be improved. Exploratory single-client implementation ahead of others could avoid duplicating work for other clients, and enable faster spec updates.\n\nMost memorable bug: [\"247120: encoding/binary: read at most MaxVarintLen64 bytes in ReadUvarint.\"](https://go-review.googlesource.com/c/go/+/247120)\n\nShoutout to @Butta for his work on the beaconchain explorer.\n\n### Radosław Kapka\n\n- Prysmatic Labs  \n- Software Engineer\n- May 2020 \n\nWhat struck me most when I joined the project was the seemingly infinite amount of good will and patience from others when onboarding a new contributor. I really appreciate it. As for the future, I fail to see how Eth2 can not succeed when there are so many great people working on it.\n\nShoutout to the whole Prysmatic team! Everyone is so cool I can't just pick one person.\n\nI planned to visit Japan in the summer of 2020 and start learning Eth2 after coming back. The pandemic ruined my plans so I joined the Prysm project in May as a contributor. Three months later I got invited to be one of the core team members. Pretty cool, huh? I guess 2020 is not that bad after all.\n\n### Raul Jordan\n\n- Prysmatic Labs  \n- Cofounder, Client Implementer\n- January 2018 \n\nWe went from being a bunch of hobbyists and volunteers interested in Ethereum's future, to having a ton of responsibility with a client being used by a large portion of stakers today. Core dev work was indistinguishable from magic to me before starting on this, and it honestly still is. However, I am fortunate to be surrounded by people much smarter than I am, and constantly learning how to write better code. Every day, we feel the weight of the work we do and we foresee it will only keep getting more important, as Phases 1 and 2 develop and eventually Ethereum will be powering world-scale transaction volume, likely using the code we wrote. At some point, the blockchain we are building might have multinational implications, and the hard work from the research team to make it as robust as possible is very encouraging. I could not be any happier with how far it’s come along, and we'll ship it.\n\nI am most proud of our [original eth2 API](https://github.com/prysmaticlabs/ethereumapis). One day I was hanging out with Preston and Terence and we’re like “whoa! Etherscan built a block explorer using our API for eth2??” and then beaconcha.in popped up and it was honestly mind-blowing. We spent a lot of time putting it together and it contributed to the success of the Prysm client early on.\n\nOur most memorable bug would have to be the [Medalla Testnet Incident](https://medium.com/prysmatic-labs/eth2-medalla-testnet-incident-f7fbc3cc934a).\n\nI admire my team at Prysmatic Labs. I look up to them every week in awe of their resourcefulness, prescience, and just overall raw software engineering knowledge.\n\nOur journey with eth2 started with a few of us posting in a go-ethereum gitter channel regarding starting a prototype implementation of Vitalik’s sharding FAQ. Little did we know that just a few months later, we would be neck deep into everything about proof of stake and sharding with Vitalik and the Ethereum Research team in Taipei. Coincidentally, I was visiting New York the same week I met Preston online via gitter, and managed to meet up in his office and start Prysmatic Labs officially within the next few days!\n\n### Robert Drost \n\n- Quilt  \n- Project Manager\n- August 2018 \n\nLooking back, one remarkable thing that stands out to me is the unifying culture of optimism and positivity among the people who found Eth and Eth2 and dove into working on it. Kind of by self-selection over time, it's a community that wants to strive for the positive side of things. While it’s not always possible to maintain this, somehow over time it seems to always get back there again.\n\nMoving forward, two themes I look forward to will be the acceleration of innovation and delivery around Eth2, and the growth of bridging among Eth2 and most other crypto communities and protocols that matter.\n\nShoutout to Casey Detrio — I love how he always seems to find a novel analysis angle to things!\n\n### Sam Wilson \n\n- Quilt  \n- Protocol Research Engineer\n- October 2019 \n\nWell, I'm a relative newcomer to Ethereum. I'd been vaguely aware of Ethereum for years, and I had (and still have) a couple hundredths of a bitcoin lying around, but Devcon V was jumping head first into the space.\n\nThe Ethereum community, once you get past all the... crap on the fringe, is full of really welcoming people who come from really diverse philosophies. I found that particularly surprising, given how many scammers and hangers on there are.\n\nEth2, which is actually where I started learning Ethereum, is a huge undertaking being built by an equally huge amorphous conglomeration. Seeing the discussions from execution environments and WASM to pure data availability and minimal execution, and the journey from where we were a year ago to actually getting the beacon chain launched has been one of the most exciting periods of my career so far.\n\nI'm looking forward to the next phases, layers, and whatever else comes with Eth2, but more importantly, I'm excited for the memes, because really, that's what this is all about.\n\nIt's hard to compare what I've contributed with the amazing other things going on in the space, but I guess I'd have to say that the write-up on dynamic state access that Ansgar Dietrichs and I put together is probably the most influential thing I've worked on: [\"State Provider Models in Ethereum 2.0.\"](https://ethresear.ch/t/state-provider-models-in-ethereum-2-0/6750)\n\n### Shay Zluf\n\n- Prysmatic Labs  \n- Client Implementer\n- March 2019 \n\nLooking back on this past two years makes me feel how this space is being shaped by the people who build it, their values and their convictions. Working in Prysmatic Labs developed my skills and code quality in a way that I cannot describe. Raul Jordan and Preston van Loon make sure to lead by example. All the team members are super motivated and take eth2.0's success as their own responsibility. That kind of dedication comes only from taking part in a project that has higher purpose for each member of the team. Looking forward, I see those bright and enthusiastic figures attracting many more talented people into the eth2.0 effort, while step by step the Ethereum ecosystem becomes the collaboration infrastructure of humanity.\n\nI took part in kickstarting the slasher implementation in Prysm's code base. As context, old POS systems had a major flaw, called the \"nothing at stake problem.\" Policing the set of rules to avoid this on the massive scale of the beacon chain is a challenge. Solving this led to the design and implementation of the Prysmatic Labs slasher. Working with other team members and protolambda from the eth2.0 research team was a great privilege. I got a first hand experience of protolambda’s ingenuity in finding novel solutions to hard problems.\n\nShoutout goes to Preston Van Loon.\n\n### Stefan Talpalaru\n\n- Status  \n- Client Implementer\n- November 2018 \n\nWe're moving at what probably looks like a slow pace, from the outside, but I'm confident we'll be able to replace Proof of Work with Proof of Stake. I can't wait to see the estimates for energy consumption reduction in the years to come!\n\nI'm proud of the many changes that lead to reproducible builds. It all started with replacing a language-specific package manager with Makefiles and Git submodules, in order to have a fine-grained control over all our dependencies. Over time, it grew into a somewhat reusable [\"build system.\"](https://github.com/status-im/nimbus-build-system)\n\nI also liked designing and implementing well-defined components like our [metrics library](https://github.com/status-im/nim-metrics/) or the [NAT traversal library](https://github.com/status-im/nim-nat-traversal). Much messier, but equally rewarding, was changing the Nim compiler and standard library to implement [efficient stack traces](https://github.com/status-im/nim-libbacktrace).\n\nI like hunting down mysterious stack corruptions. A memorable one was due to the wrong calling convention being used in a [C library wrapper](https://github.com/status-im/nimbus-eth2/pull/677#issuecomment-575636421). Another [nice one](https://github.com/status-im/nimbus-eth2/issues/640#issuecomment-57008484) was triggered by a procedure parameter called \"errno\" (which the Nim compiler forgot to name-mangle).\n\n### Terence Tsao\n\n- Prysmatic Labs  \n- Cofounder, Client Implementer\n- January 2018 \n\nIt has been an amazing journey, we have learned and accomplished so much along the way. Lots of great memories and friendships were formed. \n\nWith Phase 0 heading towards finish line, I'm particular excited about Phase 1 and all its cutting edge research. Go Eth2!\n\n### Victor Farazdagi\n\n- Prysmatic Labs  \n- Engineer\n- February 2020 \n\nMy Ethereum journey started in 2016, when I joined Status in building a censorship-resistant messenger. It quickly became apparent that, despite all the goodness the Ethereum platform and its decentralized network brought, in its current implementation they are relatively limited. So, getting attracted to Ethereum 2, with all its ambitious plans to revamp an already hugely innovative product, was just a matter of time for me. Right now, being part of the amazing crowd of highly motivated, even idealistic, people - with a chance to participate in delivering on the original Ethereum promises - is nothing less than a dream come true. I love the community, the leadership, and even the complexity of the software we're building. With Phase 0 behind us, we have significant momentum, so 2021 will definitely become a year of groundbreaking accomplishments!\n\nOne bit of work I am particularly proud of is the [\"initial synchronization implementation,\"](https://github.com/prysmaticlabs/prysm/tree/develop/beacon-chain/sync/initial-sync) which absolutely every beacon-node runner relies on. So, whenever you cannot sync, or sync takes forever, you know who to blame for it now!\n\nRegarding nasty bugs, during the [\"Medalla incident\"](https://github.com/prysmaticlabs/prysm/pull/7039) in August 2020, we had troubles syncing back. While the fix was easy, discovering the problem wasn't.\n\nShoutout to Diederik Loerakker! (yeah, better known as protolambda)\n\n### Vitalik Buterin\n\n- Ethereum Foundation  \n- Researcher\n- January 2014 \n\nI'm really happy to see how far the Ethereum ecosystem has come in the last few years! In the dark old days back in 2014-2017, it was just myself, Vlad and a couple other people thinking about proof of stake and sharding, and progress was slow; since then, there has been a rapid growth, professionalization and general improvement in the ecosystem and the team. We have much more sophisticated tools, are dealing with advanced cryptography, and a much better process for creating and refining the spec and the implementations. 2020 eth2 is sooo much better than Casper in 2017!\n\nNow, of course, we enter what may perhaps prove to be the most difficult part of the whole process: getting eth2 actually out the door and running. The whole process reminds me of what we had to deal with back in 2015, except this time there's 10x the complexity, 100x more people watching and 1000x the value at stake. Good luck all :)\n\nIf I had to pick one component I'm proud of .. maybe [the entire phase 0 spec](https://github.com/ethereum/eth2.0-specs/blob/dev/specs/phase0/beacon-chain.md)?\n\nShoutout to Danny.\n\n### Will Villanueva\n\n- Quilt  \n- Researcher\n- February 2018 \n\nEth2 research was overwhelmingly fun. We explored pushing the boundaries on how the execution layer could operate. We prototyped, researched, and implemented a simpler version of advanced execution (Execution Environments) on eth1, also known as account abstraction.\n\nA lot of the work Quilt pursued is covered in the post titled [\"Ethereum 2.0 Phase 2 Progress.\"](https://medium.com/@william.j.villanueva/ethereum-2-0-phase-2-progress-7673b57eabff) \n\nAdditionally, some of our account abstraction work can be found on Ethresear.ch as [\"DoS Vectors in Account Abstraction (AA) or Validation Generalization, a Case Study in Geth.\"](https://ethresear.ch/t/dos-vectors-in-account-abstraction-aa-or-validation-generalization-a-case-study-in-geth/7937)\n\nShoutout to Danny Ryan, all the way!\n\n[Onward [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=32)\n\n---\n\n*Kudos for reading to the end! We hope you enjoyed these perspectives - be sure to thank the people featured for their hard work building core infrastructure. If you'd like to donate directly to this project, please send to the Split contract below. *\n\n[Beacon Book](split://0x4Eb0D2b356da831aC613aEf9EC3D705d78DFd197?network=mainnet)\n\n*If you would like a physical copy of this book, remember to [**sign up here**](https://forms.gle/XXNW65Qb4iNpfccp8) to be notified when the auction for the 100 printed Genesis Editions starts and ends.*\n\n*The Stateful Works team can be reached at [@statefulworks](https://twitter.com/StatefulWorks) on twitter. Join our [discord](https://forms.gle/jqrYHw9ykdSkW31YA) if you'd like to discuss the project more fully.*", "timestamp": 1627667294, "digest": "Y1ED9RorG9OvEUXD8NBmXgYhSVhjj8H537-I2SZJkYA", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "SiuRPgDe0PYPxwOdw7iRgHgJi3vgEmUSQhx4Uq-xdGw", "title": "Beacon Book: Read and Mint now!", "body": "*This post contains the complete text of the **Beacon Book**: a collection of perspectives from 46 researchers and implementers that worked on the Ethereum Beacon Chain. We hope you enjoy reading it! Join our [discord](https://forms.gle/jqrYHw9ykdSkW31YA) if you'd like to discuss.*\n\n1. ***The crowdfund for 100 physical prints is live now!!** [Contribute here](https://stateful.mirror.xyz/-NLDSw0mA2vjtvqQYpXBOa3H38HXMmIdaw2KwI1A0y8) to get a physical copy of the book.*\n\n2. *In addition to the text, the book also features 7 full-spread illustrations, which can be minted as editional NFTs of varying exclusivity. They are placed below according to their position in the printed book. Only 10 full Genesis Edition sets (NFTs 1-7) can be minted. Check out this post for an exploration of the book's [Graphics and Narratives](**url**).*\n\n3. *In line with the goals set in our [Dec. 2020 announcement](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), any ETH from NFT minting and the auctions goes directly to the contributors that made the book possible: see the [Split Contract here](https://mirror.xyz/dashboard/splits/0x4Eb0D2b356da831aC613aEf9EC3D705d78DFd197). Please note that minting NFTs does not grant access to the printed books, nor should it be construed as an investment of any kind. This is a community based project.*\n\n---\n# Beacon Book \n\n![](https://images.mirror-media.xyz/publication-images/17a0e877-1b73-440e-a431-8de031e10c42.jpg?height=2625&width=3424)\n\n*Above: the back (left) and front (right) cover of the book*\n\n### Stateful Works\n\nWe are a group of community members interested in cultivating patronage culture around public goods. We can be reached at [@statefulworks](https://twitter.com/StatefulWorks) on Telegram or Twitter.\n\nWe're excited to continue creating Ethereum culture with all of you - to the merge and beyond.\n\n### Acknowledgments\n\nThis project would not have been possible without the time and effort of dozens of contributors, from Eth2 researchers and implementers to the broader Ethereum community.\n\nThanks as well to Y and C for their companionship.\n\n### Graphic Credits\n\nThanks to the following photographers for permission to use their work throughout the book: [Wesley Tingey](https://unsplash.com/@wesleyphotography), [Cytonn Photography](https://unsplash.com/@cytonn_photography), [Serge Kutuzov](https://unsplash.com/@serge_k), [Luis Quintero](https://unsplash.com/@jibarofoto), [Lawrson Pinson](https://unsplash.com/@lawrsonpinson), and [Gabriela Fechet](https://unsplash.com/@pt_graphy).\n\n### Introduction\n\nThe Beacon Book began its life in October 2020 as the first project from Stateful Works. While the content and framing has evolved over the past 6 months, the core vision has remained the same: to craft a crypto-native artifact that captures the humanity of the people building the future of Ethereum.\n\nIt contains the hopes, fears, and anticipations of the Eth2 researchers and client implementers directly responsible for bringing the Beacon Chain to life on December 1, 2020. The future of the Beacon Chain is the future of Ethereum, and we’re proud to tell part of its story this far.\n\nWe prompted contributors with a few questions - you'll find them in order in each response, some but not all answered.\n\n- Name / handle\n- Affiliated orgs\n- Primary role\n- Eth2 rough start date\n- General summary of experiences\n- Code or documentation they are particularly proud of\n- Most memorable or painful-to-discover Eth2 bug\n- Person you've come to admire or want to give a shoutout to\n\nKeep in mind that these responses were gathered both before and after the Beacon Chain launch, so references to launch expectations will vary. Profiles are ordered alphabetically by first name.\n\nFinally, while we made the utmost effort to include as many people as possible, it’s inevitable that we missed or were unable to feature some contributors. Eth2 wouldn’t be what it is without the input of hundreds of community testers and code contributors - thank you.\n\n---\n\n### Ethereum = Eth1 + Eth2\n\n- Ben Edgington\n- Originally [published on eth2.news](https://hackmd.io/@benjaminion/wnie2_210328), 28th March, 2021\n\nLet's start with a quick history of what's become known as Eth2, and where it's headed in the future.\n\nRecently, Danny Ryan has announced his [intent to deprecate](https://blog.ethereum.org/2021/03/11/finalized-no-23/) the use of the terms eth1 and eth2. As the creator and curator of “What’s New in Eth2,” this is a bit of a blow!\n\nBut, on the whole, I agree that these terms are beginning to outlive their usefulness, and are in danger of becoming quite misleading. It’s not really about fiddling with names; it’s about capturing fundamental changes in direction, and communicating them clearly. Changes in the roadmap are confusing for the community. Clarity in naming aids clarity of understanding.\n\nHere's a brief history of naming things in Ethereum’s roadmap.\n\nAs far as I can tell, the first use of the name “Ethereum 2” was by Vitalik in Hacker News, way back in [April 2014](https://news.ycombinator.com/item?id=7554923). He positioned Ethereum 2 as being a future step-change in the capability of Ethereum through the use of “fundamental cryptographic upgrades.”\n\nEthereum 2 then drops out of view, and the main narrative becomes the familiar Frontier → Homestead → Metropolis → Serenity progression, first described in [March 2015](https://blog.ethereum.org/2015/03/03/ethereum-launch-process/). In this scheme, Serenity is the network upgrade to Proof of Stake; Serenity isn’t Ethereum 2 per se. Interestingly, sharding/scaling doesn’t have a clear place in that roadmap, although it was certainly discussed [around that time](https://blog.ethereum.org/2015/04/05/blockchain-scalability-chain-fibers-redux/).\n\nProgress largely followed this plan for some years, with Homestead going live in March 2016, and Metropolis (in name at least) in a pair of upgrades in October 2017 and February 2019.\n\nSerenity was to have been delivered via a process of upgrading the existing Ethereum chain to bootstrap Proof of Stake. That upgrade was specified in [EIP-1011](https://github.com/ethereum/EIPs/blob/master/EIPS/eip-1011.md) and there was even a [testnet](https://hackmd.io/@aTTDQ4GiRVyyce6trnsfpg/Hk6UiFU7z?type=view) that went live on December 31st, 2017.\n\nHowever, the road to Serenity was found to be a dead-end, not least because of the vast amount of Ether that stakers would require - 1500 was the number back then.\n\nSo, in mid 2018, we tore up that roadmap and started afresh with Ethereum 2.0. Rather, we reverted to Vitalik’s original idea from 2014 of an Ethereum 2 that was to be a significant cryptographic step-change to the protocol. Calling this Eth 2.0 made sense: we were planning to change pretty much everything about the platform. Ethereum 1 would eventually be brought in as a kind of legacy system. This Ethereum 2.0 roadmap came with neat consecutive phases: Phase 0 for Proof of Stake; Phase 1 for data shards; Phase 2 for executable shards; and, finally, bring Eth1 over to Eth2 after all that.\n\nWe’ve now delivered Phase 0, but the rest of the plan has evolved. As per the latest Eth2 pages [on the ethereum.org website](https://ethereum.org/en/eth2/), “Eth2 [now] refers to a *set of interconnected upgrades* that will make Ethereum more scalable, more secure, and more sustainable” (emphasis mine). This looks much more like the old Serenity plan! We’re upgrading the Ethereum chain in-place rather than doing the old rip-and-replace.\n\nSo, you see, the roadmap narrative has vacillated over the years between effectively doing a replacement of Ethereum 1, referred to at various times as Eth2, and doing in-place upgrades to Eth1. Today, we’re more or less back in upgrade territory.\n\nIn view of all this, applying the Ethereum 2.0 moniker to the entire project is now seen as confusing: to some it implies a different chain to today’s Ethereum; to others, even [a different coin](https://www.reddit.com/r/ethereum/comments/md75k2/will_be_eth_20_a_new_coin_or_will_be_the_same_eth/). It suggests incompatibilities and problems ahead.\n\nThe [latest naming trend](https://blog.ethereum.org/2021/03/11/finalized-no-23/), then, is to limit Eth2 to refer only to the consensus layer upgrade of Ethereum to Proof of Stake, and to refer to all of today’s Ethereum (fka Eth1) as the execution layer.\n\nIt's good to see everything moving under a consistent terminology and a shared roadmap. I'm looking forward to a productive rest of 2021 and beyond!\n\n[Continuations [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=26)\n\n### Aditya Asgaonkar\n\n- Ethereum Foundation  \n- Researcher\n- 2019 \n\nEth2 promises to deliver a decentralized, scalable, and secure blockchain platform on which stateful applications can live. These three qualities will be the driving force towards the mass adoption of the Ethereum network.\n\nIn the quest to satisfy the design requirements, we've also seen some amazing research and engineering progress. We have pushed the frontier of computer science in areas such as Byzantine consensus, signature aggregation, and VDFs. With the launch of Phase 0, we created the largest BFT consensus network in existence, which is an awesome feat in itself!\n\nMy favorite bit of work was the [\"Weak Subjectivity Guide\"](https://github.com/ethereum/eth2.0-specs/blob/dev/specs/phase0/weak-subjectivity.md) - a document that outlines the weak subjectivity safety features of the Eth2.0 network. The goal is to prevent long range attacks that appear specifically in PoS consensus.\n\nAs for favorite bug, there was a consensus (fork-choice) issue discovered right before the Beacon Chain launch. The first priority was to assess the threat level of the attack -- it was critical and could have lead to a large-scale failure, but was extremely difficult to execute. Fixing this attack vector required a comprehensive review of the fork-choice component, and we had already identified a couple of solutions. At the end, there was agreement among the spec team that the attack didn't pose a critical threat because of its difficult execution, and we decided to publish a fix after further review was completed.\n\n### Adrian Manning\n\n- Sigma Prime  \n- Co-Lead Developer\n- Aug 2018 \n\nThe project has always been ambitious. The early designs were well thought out, but had shortcomings which became apparent when realising them through implementation. The collaboration between researchers and developers constantly iterated on these design specs for years, finally achieving a workable version of the original concept. The process was longer than expected, but it's been amazing to see the coordination and what has been achieved by a globally distributed group of implementers and researchers.\n\nOf all the work put into the Lighthouse client, I've changed and modified various architectures and designs and I'll likely continue to do so. I'm therefore not particularly fond of any individual piece relative to another. But I'm very proud of the end result. The resulting Lighthouse code-base that came together from everyone's hard work is what I'm most proud of.\n\nAs for person to give a shoutout to, I'm sure everyone has a similar answer, but for me it's Danny and Proto. Danny for the amazing organisational role and interfacing with all the client teams (especially on contentious topics) has sped up the development immensely. Proto (Diederick) for his relentless troubleshooting, bug-finding and research endeavours. He has been invaluable in interop testing, optimisation improvements and all round improving the general state of all clients and the eth2 ecosystem in general.\n\nAlso - there's an Australian saying, which I think applies to all eth2 researchers and developers: We're not here to f$!k spiders!\n\n### Adrian Sutton\n\n- Teku  \n- Client Implementer\n- July 2018 \n\nEth2 is this big idea that started as a seed right back when Ethereum began and then went on this crazy, messy, long journey as the details were thrashed out through open research and public collaboration. All that messiness and the length of the journey is a result of this unique, highly collaborative and distributed approach to designing it. Multiple times, concepts that had been thought settled were thrown out because a better idea came along. While that has been frustrating for on-lookers, it has led to and continues to lead to huge improvements in the resulting technology.\n\nThe interop lock-in in Canada was a major turning point in the progress of Phase 0. It forced the Beacon Chain out of that research mode. Suddenly, client development was less about translating the Python spec to another language and more about engineering all the other components that make a client actually usable. Client teams finally had a stable platform to work from and make clients interoperable. There was an explosion of tools to aid developers in debugging and testing across clients. The Beacon Chain had stopped being a research project and started being an engineering one. The road to Mainnet started to become clear.\n\nNow with the deposit contract launched and deposits flowing into it, the pressure to deliver the rest of Eth2 really amps up. Community pressure to unlock those funds again will become overwhelming and despite all the warnings that it won't be quick, people will be disappointed at how long it takes. But those locked funds will also be the equivalent of the interop lock-in, forcing work out of the research phase and into production. All that time spent researching led people to wonder if Eth2 will ever ship, but with the beacon chain launch and all that money locked in, Eth2 has almost unstoppable momentum.\n\nThe future of Ethereum is very bright.\n\nI'm quite proud of my blog post explaining the weak subjectivity period: [\"Exploring Ethereum 2: Weak Subjectivity Period.\"](https://www.symphonious.net/2019/11/27/exploring-ethereum-2-weak-subjectivity-period/) It was just me trying to get my head around a concept everyone seemed to be very hand-wavy about and put off solving to the future, yet it's become one of the standard reference points to explain the concept.\n\nI'm proud to have worked with Meredith Baxter and Cem Ozer. They have both been doing all the heavy lifting for Teku, almost entirely behind the scenes. They aren't flashy Twitter personalities, they just put their heads down and do the work.\n\nA few anecdotes to conclude: \n\n1. Family commitments mean I don't travel much, so when the first 7-client interop happened and a photo was posted of people crowded around the computer watching it, everyone in the photo was quickly identified but no one had any clue who I was. For a little while I was just \"that random guy in all the eth2 photos\".\n2. Before Ethereum, Ben Edgington only ever wore button-up, collared shirts. He's now exclusively dressed in Ethereum related T-shirts and has even picked up a penchant for Ethereum hoodies.\n\n[Caravans [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=27)\n\n### Afri Schoedon\n\n- Byzantine Fault / ESP Grantee  \n- Testnet Engineer\n- June 2018 \n\nI was working at Parity Technologies in 2018 which managed to implement EIP 1011, the \"Hybrid Casper FFG\" in the Parity Ethereum client. It was a hybrid proof-of-stake approach to the consensus engine and literally my first memory of seeing anything Eth2 related actually being implemented and run. There was Casper testnet up and running with Harmony, Pythereum, and Parity. It was exciting to see the idea of \"Serenity\" starting to materialize. \n\nHowever, it was the same year (only a few weeks later) that the Berlin Eth2 workshop decided to completely discard the hybrid Casper ideas in favor of the beacon chain. Admittedly, it was a massive undertaking. After all the ideation and the first implementations and testnets, we basically started from scratch. \n\nPrysmatic Labs first caught my attention when they launched their first public beacon chain testnets at the end of 2019. I was wondering why we had seven Eth2 clients but none of them was able to synchronize to the other clients' testnets. I was hooked and reached out to the Ethereum Foundation and the Goerli Initiative about contributing to multi-client testnets. And that's what I did in 2020, testnet after testnet up to the mainnet launch.\n\nWhen we launched the Goerli testnet in January 2019, it was not only an important milestone for Eth1 but it was also the perfect chance for Eth2 client teams to use this for their Eth1 integration leading up to the beacon chain genesis. Prysmatic Labs seized this moment and deployed all their Eth2 testnets to date to the Goerli testnet. Coindesk wrote a feature story with the headline [\"A New Test Network Just Activated and Ethereum 2.0 Will Be Using It.\"](https://www.coindesk.com/testnet-gorli-ethereum-serenity)\n\nAll my work on Eth2 concluded with the Eth2 mainnet launch in December 2020. The eight multi-client testnets are well documented on Github and received quite some [media attention](https://github.com/goerli/medalla).\n\nAs for bugs or missing features, that would be the lack of [BLS signature verifications](https://github.com/ethereum/eth2.0-specs/issues/2081) in the deposit contract.\n\nShoutout to Hsiao-Wei Wang!\n\n### Alex Stokes\n\n- Ethereum Foundation  \n- Researcher\n- 2018 \n\nWhat a ride it has been! The launch of the Beacon Chain in 2020 represents the culmination of years of research and development across countless contributors from every corner of the globe, reaching as far back as the Ethereum genesis block.\n\nIt has been exhilarating to watch this effort go from a collection of wild ideas (e.g. informal talks on Casper from Devcon 3) to today’s production-scale mainnet. Having been involved before the “casper + sharding” merge and the formation of the eth2 umbrella, I have seen time and again how a dedicated group of individuals adapts and responds to changes both inside and outside the community. It is this resilience that I find most exciting, and that gives me confidence in a very bright future for Ethereum.\n\nWe are ready to weather whatever challenges may come our way and I cannot wait as we deploy a scalable Ethereum in 2021 and beyond.\n\nI'll highlight [some of the early Casper work](https://github.com/ethereum/casper/pull/143) that got me involved directly with eth2 in mid-2018. Part of the original proof-of-stake design involved a validator registry contract hosted on the eth1 chain. As part of the deposit process, validators provided an arbitrary smart contract for signature verification. While an interesting application of account abstraction, this smart contract needed to be deterministic so that signatures could be independently verified on-chain. In order to ensure the smart contract had the desired properties, it was processed by another smart contract, the \"purity checker\" (in the sense of a pure computation), during the initial registration.\n\nAn early version of the purity checker was written in a now deprecated smart contract language called Serpent LLL. I created a Gitcoin bounty to port the Serpent LLL to a language stack used in the ethereum/casper project, Vyper LLL.\n\nMost painful bug would definitely have to be debugging cross-client interactions during the eth2 interop event in 2019. Fun times, good people and challenging bugs!\n\nShoutout to protolambda!\n\n### Alex Vlasov\n\n- TX/RX  \n- Applied Researcher\n- July 2019 \n\nMy predominant impression is that Eth2 poses problems, which are perhaps the most challenging from a software engineering point of view, at the moment. This is exciting from a researcher's perspective, but sometimes frustrating from a software engineer's one. We must adapt, in order to survive in the endeavor.\n\nOne aspect is that we, as software engineers, are used to optimizing for the common case, largely overlooking rare ones. But the latter ones are exactly what an attacker will thoroughly scrutinize! The habit is difficult to break, especially considering that it demands huge amounts of time to analyze and optimize the worst case behavior.\n\nI'm confident that we have to use Formal Methods, as testing is not able to explore the search space exhaustively (except for rare cases, when the space is relatively small).\n\nAnother important aspect is that modern DeFi is demanding on resources. And that is not only data throughput, but EVM/CPU throughput too. ZKP/zkRollups is an obvious example. However, asset pricing can be computation hungry too. And, as we can see now, DeFi asset pricing is an important topic. Unfortunately, EWASM turned to be a much harder idea to implement than initially expected. And it's basically for the same reason - WASM JIT compilers are optimized for a common case, while worst case scenarios can be exploited by an attacker. So, I treat it as another manifestation of the problem discussed above.\n\nWhile the problems are difficult, I am very excited to investigate and implement potential solutions.\n\nOne idea that I'm working on is a (semi-)automated transpilation of Eth2 beacon chain Python specs to Kotlin. The [resulting Kotlin code](https://github.com/ericsson49/research/blob/master/beacon_kotlin_generated/src/phase1/spec.kt) is beautiful, IMHO. Kotlin turned to be a pretty good match for (a statically-typed subset of) Python.\t\n\nAs for a specific bug, it's not yet made public (as it can turn to be a serious vulnerability). But the basic idea is that swapping two lines leaves a function 100% functionally correct, while an attacker can send the code into a practically endless loop.\n\nShoutout to Danny Ryan!\n\n[Discovery [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=28)\n\n### Ben Edgington\n\n- Teku  \n- Chronicler of Eth2 and Teku PM\n- January 2018 \n\nI could write a book on this, and perhaps one day I will. But the tl;dr is that getting to where we are has been the most incredible journey of my career.\n\nThe technology is thrilling, and the distributed development model no less so. But the highlight above all is getting to work every day with such a brilliant, thoughtful, capable, and generous group of people. If it's true that technology reflects the people who build it, then Eth2 is going to be a superb foundation for all the systems of the world.\n\nAs for the future, the beacon chain was designed, developed and delivered astonishingly quickly, having been conceived only in June 2018. Things get harder from now on: the beacon chain already carries so much value, and we need to begin taking into account the existing value on the Eth1 chain as we work on a merge. I think our main challenges ahead may not be technical, but more governance related. But I am confident that, with the ethos we've established and momentum we have as a community, we can bring this thing to a successful conclusion.\t\n\nI've enjoyed writing up regular digests of the latest developments in the spec since October 2018 at [eth2.news](https://hackmd.io/@benjaminion/eth2_news/), really with an audience of just the other Eth2 devs in mind. Over time it's grown and evolved, and now gets between three thousand and ten thousand views per edition. This amazes me.\n\nI am still happy with my one and only ethresear.ch post, co-written with Nicolas Liochon: [\"Exploring the Proposer Collator split.\"](https://ethresear.ch/t/exploring-the-proposer-collator-split/1632) While more of a design bug than a code bug, some credited it with finally finishing off the old sharding design, and precipitating the move to the beacon chain. I think things may have already been heading in that direction at the time.\n\nAs for individual shoutouts, what an incredible group of people - you are all amazing!\n\n### Carl Beekhuizen\n\n- Ethereum Foundation  \n- Researcher\n- April 2018 \n\nAlthough eth2 has taken longer to get off the ground than I think any of us imagined, the result is extremely robust, secure, and decentralised.\n\nIt is incredibly exciting to see how eth2 is evolving and maturing into the backbone of the decentralised future we all dream about.\n\nI'm most proud of the key-derivation EIPs (2333, 2334, 2335). Specifically, the quantum-secure backup keys built into EIP 2333. In the event of a quantum apocalypse, validators should be able to recover using these Lamport signatures.\n\nI'm also really proud of the Launchpad. 🦏 So many validators managed to deposit safely.\n\nSpecial shoutout to Hsiao-Wei Wang for the attention to detail and diligence she brings to everything she works on.\n\n### Cayman Nava\n\n- Chainsafe Systems  \n- Client Implementer\n- December 2018 \n\nThe past two years have been a blast. Looking back on the progress we've collectively made and the state of the ecosystem, I feel like we're on the cusp of something great. And I'm honored to be a part of it. I anticipate that Ethereum will be of critical importance for the future, as a rock-solid foundation that empowers ultimately successful experiments which aim to resolve many of the hardest problems facing society today.\n\nI'm proud of the [typescript implementation](https://github.com/ChainSafe/ssz) of SSZ (a copy of Proto's remerkleable). It fulfills the spec, but in an ergonomic way. You can operate on an ssz merkle tree as if it is a 'normal' javascript object. This required some exotic code, but the result is seamless [ssz <-> javascript interoperability](https://medium.com/chainsafe-systems/lodestar-medalla-update-59865a5cce1a).\n\nHuge thanks to Proto and his work! Many of the tools / algorithms / methods he's published are present in Lodestar: remerkleable, eth2-fastspec, protoarray fork choice, etc. the list goes on.\n\n### Celeste Seberras\n\n- Prysmatic Labs  \n- Technical Content Strategist\n- May 2018 \n\nIt has been a humbling experience to have witnessed the growth of Prysmatic from a small seedling with a dream to the robust and diverse community it harbours today; equally so for the broader Eth2 ecosystem. Hard work over the past two years has proven that, through all the speculative noise and interindustry drama, the things that truly speak are code and passion.\n\nI'm most proud of my work on the Prysm client usage manual.\n\nShout out to all the boys here at Prysmatic Labs. You are all fantastic to work with, here's to the future!\n\nShoot for the stars. Even if you miss, holy fuck you're in space!\n\n### Cem Ozer\n\n- Teku  \n- Client Implementer\n- January 2019 \n\nI’m blown away that the Eth2.0 beacon chain is now alive and well. For me it was such a complex undertaking, and deep down I was scared it would never launch or be successful.\t\n\nWhen I first joined Teku (called Artemis back then) we were almost only working on the state transition. The spec changed pretty rapidly at the time, and as a result we had to update our state transition many times. I found myself leading these changes at Artemis, and it would almost always be a week long intense marathon where we’d change thousands of lines of code as a team, and I’d try to make sure we did not break anything.\n\nLuckily this was in the prototyping phase, this is not how it’s done today in the production phase :). I’m also pretty proud of having worked on the Eth1 Deposit Management of Teku.\n\nMy best bug discovery is luckily documented by my team lead Adrian Sutton on his blog: [\"The Curious Case of the Invisible Fork.\"](https://www.symphonious.net/2020/07/06/exploring-ethereum-2-the-curious-case-of-the-invisible-fork/)\n\nShoutout to Johnny Rhea, Adrian Sutton, and Protolambda. These three people are all geniuses in their own unique ways. It was an honor and an incredible experience working with them.\n\n[Build - Maintain [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=29)\n\n### Chih Cheng Liang\n\n- Ethereum Foundation  \n- Client Implementer\n- November 2017 \n\nI'm glad to be part of Eth2 development. There are too many people; I can't express my gratitude enough. There are lots of beautiful memories that I'll cherish forever.\n\nI'm excited to see what Ethereum will be with fully-fledged PoS as well as sharding.\n\nI'm most proud of introducing the Milagro BLS binding to Trinity. BLS signatures are like the steroids of Eth2. Back then, only one Python library, py_ecc, met the requirements of the Beacon Chain spec. py_ecc is great for research or education purposes, but for things like client implementations, the performance of the library is not on par. The naïve alternative is to find a Python binding of a fast language. Chia's Python binding to C++ code was the low hanging fruit to pursue.\n\nAs the Beacon Chain BLS requirements became more specific, and we had to interop with other clients in a short timeframe, we decided to try using Python to wrap \"milagro_bls\" - Sigma Prime's Rust library. The result is the \"milagro_bls_binding\" library. I'm proud of it because that's my first Rust-ish project, and it was used in a real use case.\n\nAs for most challenging bug, in early 2018 I worked on the [Casper prototype testnet](https://github.com/ethereum/trinity/pull/954) that Karl and Vitalik built on pyethapp. Pyethapp had many issues, but the most difficult one to debug was the peer connection issue. I got a lot of help from Dmitry from the Harmony team, he discovered many peer connection issues with the Java client's logs. One of them was pyethapp's catastrophic peer-to-peer bug.\n\nSpecial thanks to Jannik Luhn - he contributed lots of quality work in peer to peer research/simulation and Trinity.\n\n### Dankrad Feist\n\n- Ethereum Foundation  \n- Researcher\n- June 2018 \n\nBy historical accident, one of my first ever involvements with Ethereum was the research workshop in Berlin 2018 where the Beacon chain design (and merging of Casper and Sharding) was first decided. I had only come to the workshop because I was in Berlin at the time for my startup and my former colleague and friend, Justin Drake, had invited me to check it out. The concepts that were talked about at this workshop immediately appealed to the nerd inside me -- deep maths and computer science problems, nevertheless approachable and worth exploring to find elegant solutions. \n\nOver the next few months, I tried my luck on some of the problems that were discussed, especially the randomness problem. However, it would only be March 2019 that I left my startup and went to work on Ethereum 2.0 full time, so I would say that the concept of the beacon chain was by then fairly mature and what was left to be done was more tinkering around the edges.\n\nI think it is always worth reminding ourselves that the beacon chain itself, while only one part of Eth2.0, is a very ambitious project. As far as I am aware, Proof of Stake has never been tried on this scale: neither economically nor in the networking sense. What I mean by this is the sheer amount of funds that can be staked on the beacon chain, which due to the Ether market cap can easily approach billions of dollars in value. This is one advantage smaller projects certainly do have over Ethereum -- they can increase stake gradually, whereas Eth2.0 will very quickly go all the way.\n\nNot only that, but most other projects have refrained from actually imposing penalties on validators -- which compromises the security of PoS networks, but obviously makes designing it much easier, because literally nothing is at stake except for some very minor rewards.\n\nFinally, and this is the most important distinction, Eth2.0 is designed so that it can literally accommodate a million validators. That's pretty impressive considering that most other projects only support around 100! Not only that, but this feat is achievable using fairly modest node requirements, in fact it seems perfectly plausible to run a validator on a mobile phone or a Raspberry Pi.\n\nWhen we do launch the beacon chain, which is now truly imminent (barring extreme surprises), we should keep in mind just how ambitious this project is even on its own. \n\nThe beacon chain was essentially frozen 3 months after I joined the team full time, so I would not claim that I have made any major contributions to it. My most important contribution to Eth2.0 that is slated for inclusion so far is re-architecting the Proof of Custody construction so that it is fully suitable for SSVs (Secret Shared Validators). While we weren't too sure of the experimental cryptographic Legendre pseudo-random function (PRF) when we first came across it in March 2019, it has successively improved to a truly impressive construction on all fronts that I am now very proud of:\n\n1. Extended cryptoanalysis has improved our confidence in the Legendre PRF a lot in response to several bounties that we have set out.\n2. The combination of the Legendre PRF with the Universal Hash Function primitive, suggested by Dmitry Khovratovich, means that only a single evaluation of the PRF is needed per proof of custody, and the rest of the computation is extremely efficient and even faster than regular (sha256) hashing.\n3. Thanks to the probabilistic 0.01 bit proof of custody idea, only a small amount of information is leaked from the proof of custody, such that it would be impossible to gain access to custody secrets even if the Legendre PRF were broken outright.\n\nFinally, I have huge respect for Danny Ryan. He is phenomenal at keeping everything together and making it work.\n\n### Danny Ryan\n\n- Ethereum Foundation  \n- Researcher\n- 2017 \n\nSurprise! Everything is a bit harder than originally expected (at least from my perspective) - I suppose most of the things worth doing in life are. Today, I am very excited about the project and the progress. Eth2 has an incredibly strong technical background and is ready for the next wave of upgrades. Huge shout-out to the hard work from client teams, as well as to the validator community keeping this thing running.\n\nI'm most proud of my work on the [beacon chain spec](https://github.com/ethereum/eth2.0-specs/blob/dev/specs/phase0/beacon-chain.md).\n\nFinally, I don't want to imagine how this would have gone without protolambda's insight and technical contributions over the past couple of years.\n\n### Dmitriy Ryajov\n\n- Status  \n- libp2p developer\n- August 2019 \n\nSuper grueling, but rewarding in terms of overall impact on the different ecosystems, Eth2 itself, the Nim language and libp2p.\n\nI'm most proud of my work on the Nim libp2p implementation.\n\n### Hsiao-Wei Wang\n\n- Ethereum Foundation  \n- Researcher\n- Summer 2017 \n\nMy journey started with implementing Serenity™. It was an ambitious and abstract concept. We've struggled with the design trade-offs for a long time, but with more and more contributors who devoted their efforts, and years of hard work, we were finally able to divide and conquer Eth2.\n\nIt was a fantastic journey to launch Phase 0 finally. I'm so grateful for the broad community support. And, of course, the Ethereum heroes who dove into Ethereum R&D.\n\nI'm very excited about the next Eth2 milestones and the creative ideas that the community will build on Eth2.\n\nI want to mention my admiration for Virgil Griffith, a pioneer that paved the way for Ethereum research work.\n\n[Seen and Seeing [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=30)\n\n### Ivan Martinez\n\n- Prysmatic Labs  \n- Engineer\n- August 2018 \n\nWorking on Eth2 has been an amazing adventure. It went from contributing in my free time to becoming my longest running full-time job. While there have been a few blocks on the way (unstable spec, implementation problems, testnet drama), it's been an absolute blast and this is just the start! Very excited to release, and move forward with future phases!\n\nI am particularly proud of building our [end-to-end testing suite](https://github.com/prysmaticlabs/prysm/pull/3932), which has proved incredibly useful for detecting issues before changes reach the canary. I've also helped build a lot of the [slasher](https://github.com/prysmaticlabs/prysm/pull/5043) and optimized it for mainnet usage.\n\nOne of the most memorable bugs I encountered would have to be: [\"Change StreamIndexedAttestations to use target root for state regen #5971.\"](https://github.com/prysmaticlabs/prysm/pull/5971)\n\nShoutout to Terence Tsao! His ability to understand the spec has constantly amazed me (he's the largest contributor to the spec outside of the EF!).\n\nAlso.. Danny Ryan is awesome :)\n\n### Jacek Sieka\n\n- Status  \n- Research Lead\n- March 2018 \n\nI was fortunate to join Eth2 at the very start - having worked on many open source projects before, for fun, peer-to-peer networks like DC++, compilers like nlvm, as well as high-frequency trading. It all came together at that point like a perfect fit - a giant stroke of good luck. Here we are, years later, with the baby well on its way to being delivered.\n\nThe work I'm most proud of is managing to restore sanity and switching [Eth2 to Little Endian](https://github.com/ethereum/eth2.0-specs/pull/139). It survived several high-profile attempts to swing it back to Big. I guess a more memorable, and certainly more involved feature, was the deep collaboration on the networking protocol that culminated with [what we have today](https://github.com/ethereum/eth2.0-specs/pull/1328) - this was quite the achievement made possible by some round-the-world collaboration with Adrian (of Sigma Prime), Raúl (of libp2p) and lots of others! Less known is that me and Adrian resorted to flipping an Ethereum block hash coin to see who would get to post the PR :)\n\nI'm most proud of when Paul Hauner and I managed to run a fully independent, self-sufficient [multi-client Eth2 network](https://twitter.com/jcksie/status/1171886857908609024) for the first time, at the Canada retreat!\n\n### Jonny Rhea\n\n- Teku, TX/RX  \n- Client lead & TX/RX co-founder\n- November 2018 \n\n\"It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness, it was the epoch of belief, it was the epoch of incredulity, it was the season of light, it was the season of darkness, it was the spring of hope, it was the winter of despair.\"\n\nParticularly proud of my Ethresearch post, [\"Packetology: Validator \nPrivacy.\"](https://ethresear.ch/t/packetology-validator-privacy/7547) \n\nMost memorable bug: [\"DoS Attack on Prysm Stops Finality.\"](https://github.com/ethereum/public-attacknets/issues/12)\n\nShoutout to the Russians! (former Harmony team) “You know that if we don't pull this off we are fired, right?” Joe Delong to me before the interop lock-in.\n\n### Joseph Delong\n\n- Teku  \n- Client Implementer, Researcher\n- December 2018 \n\nI hope we can move from the Beacon Chain to a practical implementation as fast as possible. Most proud of my implementation of the deposit tree logic in Teku. Toughest bug was getting the \"is_valid_merkle_branch\" method working in Teku.\n\nShoutout to Jonny Rhea & Mikhail!\n\n### JosephC \n\n- ConsenSys  \n- R&D\n- January 2019 \n\nThe Beacon Chain launch is like Project Mercury: getting into space/orbit. The equivalents of Project Gemini and Project Apollo are needed next. Rollups and Layer 2 will help improve scalability, but I believe there is much innovation that can and should continue to be done in Layer 1. There is a place for some execution, and cross-shard transactions in Layer 1. I also think that we should be careful about assumptions that we might make, like assuming that cross-shard transactions must be asynchronous. The challenges in the Ethresearch thread [“Cross-shard DeFi composability”](https://ethresear.ch/t/cross-shard-defi-composability/6268/9) need tackling with minimal assumptions.\n\nI dream of a system that is more scalable, performant, but preserves the default atomicity and synchronicity of Ethereum. I dream of shards that are transparent and automatically load-balancing. It may sound impossible, but can be used to inspire the engineers of the world to build the ambitious system that we can envision.\n\nDevelopments like Apollo and the Internet are an encouraging reminder to what humanity can accomplish: where there's a will, there's a way.\n\nWhy is this important? Why is a platform for decentralized systems important? John Perry Barlow may have answered it with his [“Declaration of the Independence of Cyberspace.”](https://www.eff.org/cyberspace-independence)\n\nPersonally, I'm delighted that [\"The Beacon Chain Ethereum 2.0 explainer you need to read first\"](https://ethos.dev/beacon-chain/) is usually on the first page of Google for \"beacon chain.\" I'm most proud of forming and recruiting a talented R&D group at ConsenSys that has made numerous Ethereum contributions. For Eth2, these include a review of the deposit contract and influencing an important Solidity implementation. More well known is the Quilt team, which started from R&D of Eth2 Phase 2 (execution, threads [quilting], rather than Plasma). Finally, years ago I helped connect Karl Floersch to the Casper \"team\" at EDCON Paris.\n\nShoutout to all of Ethereum Layer 0 -- its people -- without which there would be no Layer 1 or beyond. Layer 0 always welcomes you, and all contributions great and small :)\n\n### Justin Drake\n\n- Ethereum Foundation  \n- Researcher\n- Late 2017 \n\nLooking back, the beacon chain took longer than expected to ship and there is significant work remaining in the coming years. Having said that, I am incredibly optimistic and excited about the future of Ethereum—I could not be more bullish :)\n\nI'm pretty proud of the fact that the beacon chain spec is executable - it's pretty remarkable IMO. How many complex internet protocols have a full executable spec, not to mention four production-grade implementations on day 1?\t\n\nOne of the \"design bugs\" I was involved with early on was having PoS and sharding be separate cryptoeconomic systems as opposed to one unified design. Another big design flaw was using plain (as opposed to aggregatable) signatures. Looking back, in ~2 years we took a visionary but very rough design and made it orders of magnitude better.\n\nFolks dedicated to Eth2 are a rare breed (less than 100 of us) and I have tremendous respect for the team as a whole, as well as many individuals. I will note that, with where things are headed, we may soon have trillions of dollars running on Eth2 and we will need more manpower. So I want to give a shoutout to you—the reader—to consider joining the Ethereum mission :) Hit me up by email, on Twitter, or on Telegram!\n\n[Traditions [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=31)\n\n### Karl Floersch\n\n- prev. Ethereum Foundation  \n- Researcher\n- Winter 2017 \n\nIt has been a wild journey to scale Ethereum & we are ridiculously close to realizing the vision after all this time. It's pretty insane. I'm most proud of the early work I did on [Casper](https://github.com/ethereum/casper) and initial implementation of [Hybrid Casper](https://github.com/ethereum/pyethereum/tree/b704a5c6577863edc539a1ec3d2620a443b950fb/ethereum/hybrid_casper). As for bugs, the pyethereum p2p layer was absolutely terrible and really crippled the testnet :'''(\n\nShoutout to Vitalik, Hsiao-Wei Wang, & Justin Drake!\n\n### Kirk Baird\n\n- Sigma Prime  \n- Client Implementer\n- January 2018 \n\nIt's been a very busy two years; as only my second job working in IT, the learning curve has been massive. First and most importantly, my understanding of the core technologies around blockchains has matured from seeing them as a secure linked list to the complex beast they are. With the focus of my work being on integrating BLS into Lighthouse, a significant knowledge of pairing based cryptography was needed. The BLS signature scheme is far more complicated than the existing ECDSA used in Eth1. Luckily, there are a lot of good resources out there which explain how to progress from classical elliptic curve cryptography to pairing based cryptography.\n\nI was lucky enough to go to DevCon Osaka in 2019 which was an amazing experience! There were so many keen minds all meeting to relish and enjoy the progress Ethereum has made, but also to provide insights and ideas on how it will be improved and developed over the coming years. Japan itself is also an amazing place with so much to see, until we almost got stuck in a typhoon.\n\nI am most proud of the work done on [Milagro BLS](https://github.com/sigp/milagro_bls). This library was rough around the edges when I first inherited it, being a long way from the standardised signature scheme we have now.\n\nFinally, wanted to give a shoutout to Danny Ryan! The man is a weapon.\n\n### Mamy André-Ratsimbazafy\n\n- Status  \n- Client Implementer\n- July 2018 \n\nI remember reading the \"70% ready\" spec in july 2018, that was the wild wild west. Things were on a HackMD document, changes were made every 6 hours and very hard to track - as mentioned in the EthCC 2 talk [\"Tests and Simulations of Eth2.0.\"](https://www.youtube.com/watch?v=6c4mQg5L6Rs&t=597s)\n\nOne of the most significant milestones was when, out of nowhere, all 7 clients at the time were able to create a testnet back in September 2019 in Muskoka. Anticipation, apprehension, will the launch work? If yes, that is definitely a huge milestone!\n\nI'm proud of my work on the [\"Auditors Handbook to Nimbus Beacon Chain.\"](https://nimbus.guide/auditors-book/01_introduction.html) Nimbus uses a dark horse language called Nim. It happens to be easily picked up, and our 3 audit teams were pleasantly surprised by its features, including those related to correctness.\n\nThe most infamous bugs we had were related to fork choice / Proof-of-Stake. The most infamous one would be this one-liner hotfix, where some votes were skipped in period of non-finality: [\"hotfix fork choice score application #2041.\"](https://github.com/status-im/nimbus-eth2/pull/2041/files)\n\nBig respect to Protolambda! He came like the Hagibis storm.\n\n### Matt Garnett \n\n- Quilt  \n- Researcher\n- January 2019 \n\nMy perspective on eth2 is probably very different from many people who were focused on Phase 0. Although I compartmentalized Phase 0 and Phase 1 to a large degree to allow myself to consider the possibilities of Phase 2, I never considered the possibility that eth2 wouldn't ship. To me, it was not a matter of \"if\" but \"when.\"\n\nI'm proud of the work I did writing the first Execution Environment for eth2, called [\"sheth.\"](https://github.com/quilt/sheth) It was completely stateless and allowed Ether transfers within a shard. \n\nShoutout to Proto, he has been instrumental in making eth2 happen, I don't know how he manages to be so prolific.\n\nA quick story to wrap up. On the first day of the Canada interop, the Quilt team drove up from Toronto in a 15-person passenger van. It had rained a bit so the area was sort of wet. The venue was tucked away off on a gravel road, right beside the lake. We pulled the van up next to the parked cars and headed in to visit with the eth2 teams. \n\nAfter catching up with everyone, we returned to the van to drive over to the airbnb we were sharing with the ewasm team. Will Villanueva had driven us there, so he hopped in the driver's seat and began orienting the van forwards to head out. The area we had parked in was sort of a T-intersection and there were small drop-offs (0.5m maybe) into a heavily wooded ditch anywhere there wasn't road. Will backed into one of the legs of the T and started to drive forward to leave. Unfortunately, the exit path was a rather steep gravel hill. The 2WD van didn't have the traction climb out and now we were positioned at an awkward angle in the T. The van was perilously close to tipping over into the ditch. Will backed up to a flatter part to regroup. I offered to give it a shot and he obliged. \n\nAt this point, we had drawn a bit of a crowd. I recall having people at each corner of the van, keeping an eye out to help avoid falling off into the ditch. I gave it a few attempts, but realized how difficult of a situation we were in. At this point, it was unclear if we could even return to our starting place, as the front left and back right of the van were less than a foot away from falling into the ditch - a ditch that would no doubt require a tow truck to collect the van from. There was no other option than making it up the hill. Fortunately, there was a bit of flatter ground between the van and the beginning of the hill. Although it would be a tight fit, likely inches on either side into the wooded ditch, I thought that with speed we should be able to build enough momentum to get past the steep portion of the hill. I shared my plan with the spectators. Unsurprisingly, the uninvested patrons were eager to fill me with confidence so they could enjoy the spectacle. I backed up the van as far as the gravel road would allow and then slammed the gas down. The van lurched forward, albeit lethargically, towards the top of the hill. The eth2 gods were almost certainly looking down on us in that moment and guided that van safely to the hill's peak. \n\nAt the top of the hill, I collected my emotions and then stepped out to enjoy the laughing and cheering. We inspected the ridiculous situation we had been in, and examined the ruts that the tires had made spinning out on the fail attempts. After the excitement died down and the spectators returned to the venue to continue working on their clients, we headed back up the hill to our van and drove home. \n\nFor the rest of the time there, we parked the van at the top of the hill and walked down to the venue.\n\n### Mehdi Zerouali\n\n- Sigma Prime  \n- Security Engineer, Cofounder\n- October 2018 \n\nI find it hard to believe that we're finally launching the beacon chain! So much hard work from so many different entities has gone into this over the past couple of years. I'm extremely proud of what Sigma Prime has accomplished so far and look forward to the Lighthouse crew making Phase 1, Phase 1.5 and Phase 2 a reality.\n\nThe structural differential fuzzer I've helped build as part of Beacon Fuzz is definitely something I'm proud of. Over the last few months, Beacon Fuzz helped uncover more than 40+ bugs on all major client implementations, including critical consensus related vulnerabilities.\n\nIt's hard to pick one person to recognize, but Diederik Loerakker (aka protolambda) has done such an amazing job helping the client teams navigate the optimisations required to implement the eth2 spec in production. Of course, the coordination job done by Danny Ryan is second to none. I doubt we'd be where we are today without these two exceptional individuals.\n\nFun fact: Lighthouse releases are named after Rick & Morty characters!\n\n### Meredith Baxter\n\n- Teku  \n- Client Implementer, Software Engineer\n- November 2019 \n\nI was fortunate to join the Teku team at an exciting time (about a year ahead of the beacon chain launch) in November of 2019. We had a lot of work ahead of us and we weren't sure whether or not we would meet launch deadline with a fully functional, production-ready client. The learning curve to understanding eth2 is also pretty steep, which only increased the pressure. Luckily, the EF and other eth2 client teams have been an incredible resource for us throughout the development process. The engineers involved across the client teams have been very open and supportive. And the EF researchers have been amazingly welcoming, approachable, and responsive. They've always been there for us to answer questions and provide insights. It has been hugely gratifying to be a part of the successful launch of the beacon chain with the help of this incredible group of people. I'm very excited to continue the work as we look forward to upcoming changes including our first hard fork, sharding, and the merge.\t\n\nOne exciting milestone was getting [Teku syncing to a live](https://github.com/ConsenSys/teku/pull/1143) testnet (Prysm's Sapphire testnet).\n\nI'm also really proud of our [checkpoint sync feature](https://www.youtube.com/watch?v=Oz3flfj50Ig) which allows new nodes to sync up and become fully operational within minutes. See the issue as well: \"[Implement sync from a recent state #3063](https://github.com/ConsenSys/teku/issues/3063).\"\n\nThe instability on the Medalla testnet in the fall of 2020 was a trying moment across the client teams, but we came out stronger on the other side. We were all working overtime to improve performance and patch issues revealed by the long period of non-finalization. One big fix I managed to push during this time involved putting a hard limit on amount of work required to regenerate states that dropped out of our in-memory cache: [\"[Issue 2608] Add ability to periodically persist hot states #2611.\"](https://github.com/ConsenSys/teku/pull/2611) More context on the network instability can be found here: [\"Eth2 Implementers’ Call #46 - 2020-08-20.\"](https://hackmd.io/@benjaminion/S1b2sJhzv)\n\n### Michael Sproul\n\n- Sigma Prime  \n- Client Implementer\n- March 2019 \n\nAfter a brief foray into the blockchain world in 2017, I developed a taste for it and knew I had to come back. When I saw a job ad from SigP on Twitter for a proof-of-stake client in Rust, I dropped what I was doing and got involved ASAP. At the beginning I got deep into Lighthouse's consensus code which was then very much in flux due to lots of spec changes, and had been written in a gargantuan solo effort by Paul! From that foothold in consensus I then branched out into the database, op pool and slashing -- all of which captured my interest in a way no other project had. \n\nWhen we ran the first testnets in September 2019 off code I'd contributed to, I was kind of shocked the thing worked at all, and awed by all the hard work done by everyone else involved. This community of researchers, programmers and enthusiasts has been nothing but amazing, and I'm optimistic for a successful Phase 0 launch and the realisation of the Eth2 dream in Phase 1 and beyond. Personally, I can't wait until we can run some transactions, and look forward to getting into the minutiae of WebAssembly execution environments.\t\n\nI'm very proud of Lighthouse's slasher. I was able to draw inspiration from great foundational research laid by Proto, and dedicate myself to building a fast, concise implementation. Testing the implementation on Medalla and watching the carnage inflicted on other validators brought a perverse form of satisfaction ;)\n\nOne of my favorite bugs: [\"DB inconsistent after restart #1488.\"](https://github.com/sigp/lighthouse/issues/1488)\n\nShoutout to Cem Özer!\n\nI know of at least one core dev who force pushed a commit to master in the EthDenver bathrooms...\n\n### Mikhail Kalinin\n\n- PegaSys, TX/RX  \n- Applied Researcher\n- April 2018 \n\nIt's been exciting to see how Hybrid Casper FFG and the Sharding proposal have been merged into what is now called the Beacon Chain. And how this research is evolving, growing, attracting a lot of new people. And finally the result is about to be shipped pretty soon. This was a big part of my life for two and a half years. I anticipate rapid movement towards Shards and the Merge when Phase 0 is shipped. Though there are many things yet to deal with.\n\nI am proud of the [Eth1 Shard Demo](https://github.com/txrx-research/eth1-shard-demo) that we made together with Guillaume from EF with decent support from EF researchers.\n\nI can give recognition to a bunch of people tbh. But, narrowing down, Danny Ryan and Ben Edgington.\n\n### Nathaniel Jensen\n\n- Sigma Prime  \n- Security Engineer\n- September 2019 \n\nI'd heard a bit about Ethereum before but had not developed a solid understanding.\n\nAlthough relatively new, I'm glad to play a small part in such a technically impressive undertaking. I am continually appreciative that I can work in such an interesting space, with such friendly and impressive colleagues and community, and contribute to something that has the potential to be profoundly important. I'm excited to see Phase 0 mainnet kick off, the culmination of so much effort!\n\nI look forward seeing the space continue to develop with the incorporation of the EVM chain and Layer 2 solutions, and all the interesting use-cases that I can't begin to imagine.\n\nMy primary contribution to the Eth2 ecosystem had been taking on maintenance and development of a differential fuzzer that compares state transitions across the Eth2 clients: beacon-fuzz. In September 2019, Sigma Prime was engaged by the Ethereum Foundation to continue development of Guido Vranken's previous differential fuzzing solution - comparing ZRNT and Pyspec, the Go and Python Eth2.0 executable specifications.\n\nI was primarily responsible for building out [the fuzzing framework](https://github.com/sigp/beacon-fuzz) to include comparison of other client implementations: Lighthouse, Prysm, Nimbus, Teku, Trinity, as well as adding fuzzing targets for additional state transition functions.\n\nAs for most painful bug, see the [\"Beacon Fuzz update 001\"](https://blog.sigmaprime.io/beacon-fuzz-01.html) on the Sigma Prime blog, section \"Golang Library Linking Errors.\" How to try to get multiple Go implementations running without having their dependencies clash, and dealing with arcane linking issues using existing tooling to build a Go fuzzing library that exercises cgo/C code (as Prysm depends on a C/assembly BLS library).\n\nI want to give a shoutout to Protolambda (Diederik Loerakker). He reliably gets to the bottom of really obtuse fuzzing results. He's our consistent fallback for deciphering complicated results across multiple Eth2 client implementations. From our interactions, he clearly comes across as a friendly, genuine, and technically outstanding individual.\n\n### Nishant Das\n\n- Prysmatic Labs  \n- Client Implementer\n- June 2018 \n\nIt was a very difficult endeavour to get Eth2 running smoothly. Ultimately, with teams well distributed across the globe, constant communication is always a challenge. However, despite all that, I am really proud of the fact that we have launched Phase 0 with 4 different clients running. I'm very optimistic for the future and am looking forward to the merge. There have been too many bugs to count, and I keep on finding new ones every week.\n\nShoutout to Proto - cross client compatibility would be nowhere near what it is without him constantly monitoring and working on it.\n\n### Paul Hauner\n\n- Sigma Prime  \n- Client Implementer\n- January 2018 \n\nThe Ethereum Foundation has fostered an inclusive, open, and merit-based approach to technical collaboration. Under this environment we've seen many researchers, engineers and communicators flourish. This is a testament to what people can do when they share a common goal and are empowered to work on the things that interest them.\n\nAs Eth2 has progressed, Sigma Prime has grown steadily to include a team of talented engineers and computer scientists. I am grateful to work with these people and I learn from them every day.\n\nI hope to see Ethereum evolve into a tool that provides honest utility to everyday people, without jeopardising the sovereignty of their data or selves.\n\nRegarding work I'm proud of, I quite like the [minimal-allocation Merkle-tree hasher](https://github.com/sigp/lighthouse/blob/stable/consensus/tree_hash/src/merkle_hasher.rs) I built in 2018. It's simpler and more powerful than other algorithms I have seen.\n\nOne notable bug: [\"Manipulating deposit contract to gain an early majority #1446.\"](https://github.com/ethereum/eth2.0-specs/issues/1446)\n\n### Pawan Dhananjay\n\n- Sigma Prime  \n- Client Implementer\n- July 2019 \n\nI remember reading Vitalik's proof of stake blog posts in early 2018 and thinking that it sounds all good in theory, but no way we'll have a proof of stake protocol for more than a small number of participants which would work well in practice. Needless to say, it's been extremely impressive to see how far the effort has come in just a few years. Kudos to everyone involved, I'm glad to have been a part of the effort for the past year.\n\nAlso, a huge shoutout to the SigP crew! It has been an absolute blast working with these guys, learning from them and also indulging in their jolly Aussie humor :) Excited for the Phase 0 launch and geared up to begin work on Phase 1!\n\nMost memorable bug would have to be: [\"Update state before producing attestation #1596.\"](https://github.com/sigp/lighthouse/pull/1596)\n\nBig thanks to protolambda for sure. All his debugging tools have saved me (and many others I'm sure) hours of effort.\n\n### Preston Van Loon\n\n- Prysmatic Labs  \n- Cofounder, Client Implementer\n- January 2018 \n\nThe last few years have been an adventure, to say the least. At first, I had just a mild interest in Ethereum. I didn't own any cryptocurrencies or really understand how they worked. After a few months of reading, I started to realize two things: 1) Ethereum was this incredible technology that has an unlimited potential to change the world for the better, and 2) Ethereum is incredibly slow and desperately needed to scale. \n\nImmediately, I looked for ways to help contribute to the scaling effort and then I met Raul Jordan. We met together in NYC for coffee and talked about starting a project to work on sharding for Ethereum. We formed Prysmatic Labs. Since starting the company in January of 2018, I've met some of the most interesting people in the world - many have become close friends. Working in Ethereum continues to fulfill my desire to make a positive impact, and I'm very much looking forward to seeing the completed roll out of Eth2.\n\nMost memorable bug would have to be that time that all of Prysm nodes thought they were 4 hours in the future and thousands of validators were slashed in a testnet: [\"Roughtime reports clock offset by 4hrs #6825.\"](https://github.com/prysmaticlabs/prysm/issues/6825)\n\n### Protolambda\n\n- Ethereum Foundation  \n- Researcher\n- November 2018 \n\nThe main theme is that we - researchers and client devs - did not make our lives easy. Spec updates have continued to improve the protocol itself, but caused instability in the process of updating implementations. A new network stack was adopted, and many difficult research and implementation problems had to be solved. In the future, I do not think this will change, as Phase 1 and later are complicated too. But the approach can be improved. Exploratory single-client implementation ahead of others could avoid duplicating work for other clients, and enable faster spec updates.\n\nMost memorable bug: [\"247120: encoding/binary: read at most MaxVarintLen64 bytes in ReadUvarint.\"](https://go-review.googlesource.com/c/go/+/247120)\n\nShoutout to @Butta for his work on the beaconchain explorer.\n\n### Radosław Kapka\n\n- Prysmatic Labs  \n- Software Engineer\n- May 2020 \n\nWhat struck me most when I joined the project was the seemingly infinite amount of good will and patience from others when onboarding a new contributor. I really appreciate it. As for the future, I fail to see how Eth2 can not succeed when there are so many great people working on it.\n\nShoutout to the whole Prysmatic team! Everyone is so cool I can't just pick one person.\n\nI planned to visit Japan in the summer of 2020 and start learning Eth2 after coming back. The pandemic ruined my plans so I joined the Prysm project in May as a contributor. Three months later I got invited to be one of the core team members. Pretty cool, huh? I guess 2020 is not that bad after all.\n\n### Raul Jordan\n\n- Prysmatic Labs  \n- Cofounder, Client Implementer\n- January 2018 \n\nWe went from being a bunch of hobbyists and volunteers interested in Ethereum's future, to having a ton of responsibility with a client being used by a large portion of stakers today. Core dev work was indistinguishable from magic to me before starting on this, and it honestly still is. However, I am fortunate to be surrounded by people much smarter than I am, and constantly learning how to write better code. Every day, we feel the weight of the work we do and we foresee it will only keep getting more important, as Phases 1 and 2 develop and eventually Ethereum will be powering world-scale transaction volume, likely using the code we wrote. At some point, the blockchain we are building might have multinational implications, and the hard work from the research team to make it as robust as possible is very encouraging. I could not be any happier with how far it’s come along, and we'll ship it.\n\nI am most proud of our [original eth2 API](https://github.com/prysmaticlabs/ethereumapis). One day I was hanging out with Preston and Terence and we’re like “whoa! Etherscan built a block explorer using our API for eth2??” and then beaconcha.in popped up and it was honestly mind-blowing. We spent a lot of time putting it together and it contributed to the success of the Prysm client early on.\n\nOur most memorable bug would have to be the [Medalla Testnet Incident](https://medium.com/prysmatic-labs/eth2-medalla-testnet-incident-f7fbc3cc934a).\n\nI admire my team at Prysmatic Labs. I look up to them every week in awe of their resourcefulness, prescience, and just overall raw software engineering knowledge.\n\nOur journey with eth2 started with a few of us posting in a go-ethereum gitter channel regarding starting a prototype implementation of Vitalik’s sharding FAQ. Little did we know that just a few months later, we would be neck deep into everything about proof of stake and sharding with Vitalik and the Ethereum Research team in Taipei. Coincidentally, I was visiting New York the same week I met Preston online via gitter, and managed to meet up in his office and start Prysmatic Labs officially within the next few days!\n\n### Robert Drost \n\n- Quilt  \n- Project Manager\n- August 2018 \n\nLooking back, one remarkable thing that stands out to me is the unifying culture of optimism and positivity among the people who found Eth and Eth2 and dove into working on it. Kind of by self-selection over time, it's a community that wants to strive for the positive side of things. While it’s not always possible to maintain this, somehow over time it seems to always get back there again.\n\nMoving forward, two themes I look forward to will be the acceleration of innovation and delivery around Eth2, and the growth of bridging among Eth2 and most other crypto communities and protocols that matter.\n\nShoutout to Casey Detrio — I love how he always seems to find a novel analysis angle to things!\n\n### Sam Wilson \n\n- Quilt  \n- Protocol Research Engineer\n- October 2019 \n\nWell, I'm a relative newcomer to Ethereum. I'd been vaguely aware of Ethereum for years, and I had (and still have) a couple hundredths of a bitcoin lying around, but Devcon V was jumping head first into the space.\n\nThe Ethereum community, once you get past all the... crap on the fringe, is full of really welcoming people who come from really diverse philosophies. I found that particularly surprising, given how many scammers and hangers on there are.\n\nEth2, which is actually where I started learning Ethereum, is a huge undertaking being built by an equally huge amorphous conglomeration. Seeing the discussions from execution environments and WASM to pure data availability and minimal execution, and the journey from where we were a year ago to actually getting the beacon chain launched has been one of the most exciting periods of my career so far.\n\nI'm looking forward to the next phases, layers, and whatever else comes with Eth2, but more importantly, I'm excited for the memes, because really, that's what this is all about.\n\nIt's hard to compare what I've contributed with the amazing other things going on in the space, but I guess I'd have to say that the write-up on dynamic state access that Ansgar Dietrichs and I put together is probably the most influential thing I've worked on: [\"State Provider Models in Ethereum 2.0.\"](https://ethresear.ch/t/state-provider-models-in-ethereum-2-0/6750)\n\n### Shay Zluf\n\n- Prysmatic Labs  \n- Client Implementer\n- March 2019 \n\nLooking back on this past two years makes me feel how this space is being shaped by the people who build it, their values and their convictions. Working in Prysmatic Labs developed my skills and code quality in a way that I cannot describe. Raul Jordan and Preston van Loon make sure to lead by example. All the team members are super motivated and take eth2.0's success as their own responsibility. That kind of dedication comes only from taking part in a project that has higher purpose for each member of the team. Looking forward, I see those bright and enthusiastic figures attracting many more talented people into the eth2.0 effort, while step by step the Ethereum ecosystem becomes the collaboration infrastructure of humanity.\n\nI took part in kickstarting the slasher implementation in Prysm's code base. As context, old POS systems had a major flaw, called the \"nothing at stake problem.\" Policing the set of rules to avoid this on the massive scale of the beacon chain is a challenge. Solving this led to the design and implementation of the Prysmatic Labs slasher. Working with other team members and protolambda from the eth2.0 research team was a great privilege. I got a first hand experience of protolambda’s ingenuity in finding novel solutions to hard problems.\n\nShoutout goes to Preston Van Loon.\n\n### Stefan Talpalaru\n\n- Status  \n- Client Implementer\n- November 2018 \n\nWe're moving at what probably looks like a slow pace, from the outside, but I'm confident we'll be able to replace Proof of Work with Proof of Stake. I can't wait to see the estimates for energy consumption reduction in the years to come!\n\nI'm proud of the many changes that lead to reproducible builds. It all started with replacing a language-specific package manager with Makefiles and Git submodules, in order to have a fine-grained control over all our dependencies. Over time, it grew into a somewhat reusable [\"build system.\"](https://github.com/status-im/nimbus-build-system)\n\nI also liked designing and implementing well-defined components like our [metrics library](https://github.com/status-im/nim-metrics/) or the [NAT traversal library](https://github.com/status-im/nim-nat-traversal). Much messier, but equally rewarding, was changing the Nim compiler and standard library to implement [efficient stack traces](https://github.com/status-im/nim-libbacktrace).\n\nI like hunting down mysterious stack corruptions. A memorable one was due to the wrong calling convention being used in a [C library wrapper](https://github.com/status-im/nimbus-eth2/pull/677#issuecomment-575636421). Another [nice one](https://github.com/status-im/nimbus-eth2/issues/640#issuecomment-57008484) was triggered by a procedure parameter called \"errno\" (which the Nim compiler forgot to name-mangle).\n\n### Terence Tsao\n\n- Prysmatic Labs  \n- Cofounder, Client Implementer\n- January 2018 \n\nIt has been an amazing journey, we have learned and accomplished so much along the way. Lots of great memories and friendships were formed. \n\nWith Phase 0 heading towards finish line, I'm particular excited about Phase 1 and all its cutting edge research. Go Eth2!\n\n### Victor Farazdagi\n\n- Prysmatic Labs  \n- Engineer\n- February 2020 \n\nMy Ethereum journey started in 2016, when I joined Status in building a censorship-resistant messenger. It quickly became apparent that, despite all the goodness the Ethereum platform and its decentralized network brought, in its current implementation they are relatively limited. So, getting attracted to Ethereum 2, with all its ambitious plans to revamp an already hugely innovative product, was just a matter of time for me. Right now, being part of the amazing crowd of highly motivated, even idealistic, people - with a chance to participate in delivering on the original Ethereum promises - is nothing less than a dream come true. I love the community, the leadership, and even the complexity of the software we're building. With Phase 0 behind us, we have significant momentum, so 2021 will definitely become a year of groundbreaking accomplishments!\n\nOne bit of work I am particularly proud of is the [\"initial synchronization implementation,\"](https://github.com/prysmaticlabs/prysm/tree/develop/beacon-chain/sync/initial-sync) which absolutely every beacon-node runner relies on. So, whenever you cannot sync, or sync takes forever, you know who to blame for it now!\n\nRegarding nasty bugs, during the [\"Medalla incident\"](https://github.com/prysmaticlabs/prysm/pull/7039) in August 2020, we had troubles syncing back. While the fix was easy, discovering the problem wasn't.\n\nShoutout to Diederik Loerakker! (yeah, better known as protolambda)\n\n### Vitalik Buterin\n\n- Ethereum Foundation  \n- Researcher\n- January 2014 \n\nI'm really happy to see how far the Ethereum ecosystem has come in the last few years! In the dark old days back in 2014-2017, it was just myself, Vlad and a couple other people thinking about proof of stake and sharding, and progress was slow; since then, there has been a rapid growth, professionalization and general improvement in the ecosystem and the team. We have much more sophisticated tools, are dealing with advanced cryptography, and a much better process for creating and refining the spec and the implementations. 2020 eth2 is sooo much better than Casper in 2017!\n\nNow, of course, we enter what may perhaps prove to be the most difficult part of the whole process: getting eth2 actually out the door and running. The whole process reminds me of what we had to deal with back in 2015, except this time there's 10x the complexity, 100x more people watching and 1000x the value at stake. Good luck all :)\n\nIf I had to pick one component I'm proud of .. maybe [the entire phase 0 spec](https://github.com/ethereum/eth2.0-specs/blob/dev/specs/phase0/beacon-chain.md)?\n\nShoutout to Danny.\n\n### Will Villanueva\n\n- Quilt  \n- Researcher\n- February 2018 \n\nEth2 research was overwhelmingly fun. We explored pushing the boundaries on how the execution layer could operate. We prototyped, researched, and implemented a simpler version of advanced execution (Execution Environments) on eth1, also known as account abstraction.\n\nA lot of the work Quilt pursued is covered in the post titled [\"Ethereum 2.0 Phase 2 Progress.\"](https://medium.com/@william.j.villanueva/ethereum-2-0-phase-2-progress-7673b57eabff) \n\nAdditionally, some of our account abstraction work can be found on Ethresear.ch as [\"DoS Vectors in Account Abstraction (AA) or Validation Generalization, a Case Study in Geth.\"](https://ethresear.ch/t/dos-vectors-in-account-abstraction-aa-or-validation-generalization-a-case-study-in-geth/7937)\n\nShoutout to Danny Ryan, all the way!\n\n[Onward [Beacon Book]](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=32)\n\n---\n\n*Kudos for reading to the end! We hope you enjoyed these perspectives - be sure to thank the people featured for their hard work building core infrastructure. If you'd like to donate directly to this project, please send to the Split contract below. *\n\n[Beacon Book](split://0x4Eb0D2b356da831aC613aEf9EC3D705d78DFd197?network=mainnet)\n\n---\n\n***The crowdfund for 100 physical prints is live now!!** [Contribute here](https://stateful.mirror.xyz/-NLDSw0mA2vjtvqQYpXBOa3H38HXMmIdaw2KwI1A0y8) to get a physical copy of the book.*\n\n*The Stateful Works team can be reached at [@statefulworks](https://twitter.com/StatefulWorks) on twitter. Join our [discord](https://forms.gle/jqrYHw9ykdSkW31YA) if you'd like to discuss the project more fully.*", "timestamp": 1627667382, "digest": "Y1ED9RorG9OvEUXD8NBmXgYhSVhjj8H537-I2SZJkYA", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "O80y8biF3UKWZ6u7GB8_tCMGzLoWe83x8PzKUcDi6Fs", "title": "New Beginnings, Old Rumors", "body": "The Web 3 community has welcomed me without knowing the first thing about me. \n\n![](https://images.mirror-media.xyz/publication-images/3f332687-9947-4d82-8baf-868c0eb4e0fc.JPG?height=4032&width=3024)\n\nOthers have been too scared or superstitious to take the time to get to know me. \n\n![](https://images.mirror-media.xyz/publication-images/48ba2948-e581-46a2-a72e-4f24a47b8b56.jpg?height=3088&width=2316)\n\nI want to thank you. I'm looking forward to getting together in meatspace and creating some real memories, together! \n\n![](https://images.mirror-media.xyz/publication-images/ca118eb9-117d-4ba4-b3b5-033f911a56ca.jpg?height=3088&width=2316)\n\nI’ve been around the block a few times, so to speak. I’m just happy to have a fresh start. I've been witness to a lot. \n\n![](https://images.mirror-media.xyz/publication-images/c509ae9a-7c70-473f-aba6-273e486cd55d.JPG?height=2576&width=1932)\n\nIt's a joy that the Web 3 community has welcomed me into their collective lives. It’s brought out my lighter side. You can see it in my face.\n\n![](https://images.mirror-media.xyz/publication-images/821735a9-74b7-4614-a23c-7ba2cff47c86.JPG?height=3088&width=2316)\n\nI’m looking forward to getting to know you all better.\n\n![](https://images.mirror-media.xyz/publication-images/32b09950-bbe0-4255-9210-7f4a8c7b4287.JPG?height=2576&width=1932)\n\nRIP, Osborne McKenzie, Jane Smythson and Larry O’Connor, who left us so suddenly in 1998. Also RIP to the cohort in Denmark in 2004. Special thoughts also for the members of Hackathon, Berlin 2007 who still have not been found.\n\nEND\n\n### This is the first Mirror essay written by a potential sociopath. Buy the NFT at the top of this post -- all proceeds go to Coin Center in support of its mission to explain shadowy super-coders to policymakers. I'll be watching.\n\n\n\n*When Dan Conway isn’t caring for his three children or tending to his crypto addiction, he writes troubling parody essays.*\n", "timestamp": 1627670323, "digest": "Zhki9JsM79uZeftWfG8yABRTQ_6glsabq5o28S19NMo", "contributor": "0xfbdf598dB4dBA841f40680Cd9C2D3cF618265be0"}
{"id": "sc9dXiMQCCOYVzBtPYfFYTzH52wsNjoZRkmpKlq4S8s", "title": "Hosted auctions", "body": "**Hosted auctions** are live on Catalog, allowing labels, DAOs, artists, and fans to champion musicians they love and share in the upside through on-chain revenue splits. Although we expect most hosted auctions to be pre-coordinated in the early days, any artist or record owner can send a host request to any Catalog account or Ethereum wallet address. We're using Zora's open and permissionless [Auction House ZDK,](https://docs.zora.co/zoraos/dev/zdk/auction-house) which means hosted auctions on Catalog may also exist outside our platform, such as a label website or DAO NFT gallery. We hope this tool helps establish a better pathway between talented artists and curators with the platform and passion to spotlight them.\n\n### How does it work?\n\n1. An artist or record owner creates an auction request by selecting a host and inputting a host share.\n2. Offers are disabled while the request is pending and it can be cancelled at any time.\n3. When the host accepts a request, the record is displayed on both profiles and becomes available for bidding.\n4. After the auction ends, all parties automatically receive their share of the sale.\n\n## Whitelisted curators\n\nAlongside this feature, we're whitelisting select curators to onboard artists to Catalog independent of our regular submission process. These groups will help introduce artists to Catalog through education, onboarding, and promotion, and share in the benefit when they sell records using hosted auctions. We're kicking things off with [FWB](https://www.fwb.help/), [Leaving Records](https://leavingrecords.com/), and [The Park](https://twitter.com/thepark) — three groups with a history of advocating for artists, putting on great music, and experimenting with fairer incentive structures on the internet. These curators will be welcoming talented new voices to Catalog including [Thys](https://iamthys.bandcamp.com/), [Colloboh](https://colloboh.bandcamp.com), [Jesse Boykins III](https://jb3music.bandcamp.com/), and many more. As we learn and iterate from this release, we'll add more whitelisted curators – taking small steps towards decentralizing onboarding beyond our core team. \n\nWe're intent on whitelisting curators committed to equitable deal structures – pressuring artists off-platform for predatory or inequitable revenue splits doesn't have space on Catalog. The splits for hosted auctions are public and on-chain, encouraging fair play across the board. Since all Catalog records originate directly from their creators, artists holding their initial sale through a hosted auction input the revenue split themselves. The artist's creator share remains intact for all hosted auctions in both primary and secondary sales. With these guardrails in place we can start to explore better reward systems for everyone creating value on a [protoform](https://twitter.com/js_horne/status/1418331497749041152), including the DAOs, labels, and hybrids putting in the work to support and provide valuable signal for artists entering web3. If you're a pillar of a given music community and/or want to leverage your audience to support artists you love, [hit our line](https://catalog.community).\n\n### How do we decide on whitelisted curators?\n\nHere’s what we look for in individuals or groups who want to curate music on Catalog:\n- A commitment to equitable revenue splits that favor artists\n- A reputation in / relationship with different artist communities\n- An ear for great music\n- An eye for overlooked or underrepresented music\n\n\n# Thys x FWB\nWe’re thrilled to debut this feature with an exceptional piece of music from Thys — one of the masterminds behind Noisia and a pioneer of experimental electronic music. We're honored to give his new EP a home in the ether. In the host seat: FWB (Friends With Benefits), a seminal crypto x culture collective redefining what it means to create value together, whether you're in Discord or on the streets of Paris.\n\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/4198)\n\nhttps://twitter.com/ThysMusic/status/1420389577110528002?s=20\n\n\n## Closing Thoughts\n\nWe’ve all seen web2 behemoths accumulate 10-digit market caps and fail to allocate that wealth to the people writing the jokes, designing the memes, curating the playlists, sharing the music, etc. In response to this broken model, we're evolving Catalog into a place where anyone creating value can benefit if they’d like to. The on-chain splits in hosted auctions also provide a powerful visibility check – unfair financial relationships between artist and industry might not remain so widespread if you could see deal terms on streaming services while you listened. That said, monetized curation has other implications to consider. These are just some of the questions we'll continue to chew on while we keep building: \n\n- To what extent might monetized curation risk cheapening curation itself, turning it from a trustable labor of love into a paid advertisement?\n- How can we improve monetized curation so it incentivizes supporting undiscovered, overlooked, or underrepresented artists, in addition to those who've already found success?\n- Will competition between artists drive their self-selected share of revenue downward in an effort to appeal to curators?\n\nWe look forward to putting these tools into the hands of as many artists as possible without replicating the same supply-demand problems that reinforce music’s grossly lopsided status quo. If you’re interested in cracking this code, [join us](https://catalog.community), and thanks for reading.", "timestamp": 1627674556, "digest": "-SPF_-1dkZ-reEIdluTrt2XXgy3chG5R2Dh2fy4rH48", "contributor": "0xc236541380fc0C2C05c2F2c6c52a21ED57c37952"}
{"id": "YFV9o5pbtp6yG33A16hb26q4lpETGjKc6JhHyR0INpo", "title": "Volt Capital's Write Race", "body": "Early-stage recruiting is a fundamentally broken process: there’s a stronger bias towards credentialism than ability. Often, the two are confused for each other. Crypto offers us opportunities to work and collaborate in ways that help us [see people more clearly](https://grahamduncan.blog/whats-going-on-here/) and reach people more broadly. The rise of the [pseudonymous economy](https://twitter.com/balajis/status/1249372482412273668?s=20) and daos are just the tip of the iceberg of what’s possible.\n\nWhen we were reflecting on ways to announce that we’re hiring for an analyst at Volt Capital, we thought over the different ways to do it:\n\n\n1. Tap into the whisper network (optimize for existing friendships)\n2. Put out a job description to apply (optimize for existing credentials)\n3. Run an essay competition (optimize for research and reasoning)\n\nThis month we’re running an experiment focused on #3. \n\nIf you’re interested in joining our team, please submit an essay response to one of the prompts below **by August 25th**. We encourage submitting earlier as we’ll be reviewing essays on a rolling basis.\n\nThe top essays will be reviewed and selected by our team at Volt Capital, and fellow judges USV partner Albert Wenger and Scalar Capital co-founder Linda Xie. \n\nWhen writing, keep in mind your essay should demonstrate a deep understanding of current crypto projects, original thinking, and a thesis around where the space could be headed directionally. Essay length is up to you, but preferably meets a minimum of 250 words.\n\n**Prompts**\n\n1. Now that Uniswap V3 is live, provide an overview of the tools being built - or tools that should be built - to support the network and network growth.\n2. Provide an overview of the DAO management tooling landscape. Where’s the biggest opportunity to build? Why?\n3. Free form - write about a sector or narrative you’re currently seeing play out in the crypto space. What’s the opportunity set and how do you anticipate the narrative playing out?\n\nOnce you’ve published your essay, please [submit the link here](https://docs.google.com/forms/d/1_wNf7-ZlseKa5lL43vi1eFGTjVxt-adJOCmHXe-1aOY/edit).\n\n\n\n**How to join Mirror**\n\nYou’ll be prompted to connect your wallet. \n\n![](https://images.mirror-media.xyz/publication-images/8b9e54e0-9dac-452d-b334-c1663ede841e.png?height=640&width=742)\n\n\n\n1. After connecting, click “join the $write race” and answer the prompt with a sentence or two. The prompt typically asks why you want to join Mirror.\n2. Once you’ve applied, send your profile link to soona@volt.capital or imran@volt.capital, and we’ll help rally the community to get you accepted onto Mirror.\n3. Once accepted, you’ll be able to create a Mirror profile.\n\n\n**Prefer to publish elsewhere?**\n\nBonus points for publishing on Mirror, but if you want to publish on other platforms like Medium or Substack, feel free to [send the link to your essay here](https://docs.google.com/forms/d/1_wNf7-ZlseKa5lL43vi1eFGTjVxt-adJOCmHXe-1aOY/edit).\n\n\nHappy writing!\n", "timestamp": 1627675492, "digest": "ipE183WnXXaFtMGw-_-lnKfaPrtiwEUxj7iEFlSKj7w", "contributor": "0x04970d93EcB584dc00bBb82c0c18D2Ec49a0AA9c"}
{"id": "Ygg2rPhHRLiPAHoZci-Dag5pyXryfRvgWdeCEDyh0vs", "title": "Volt Capital's Write Race", "body": "Early-stage recruiting is a fundamentally broken process: there’s a stronger bias towards credentialism than ability. Often, the two are confused for each other. Crypto offers us opportunities to work and collaborate in ways that help us [see people more clearly](https://grahamduncan.blog/whats-going-on-here/) and reach people more broadly. The rise of the [pseudonymous economy](https://twitter.com/balajis/status/1249372482412273668?s=20) and daos are just the tip of the iceberg of what’s possible.\n\nWhen we were reflecting on ways to announce that we’re hiring for an analyst at Volt Capital, we thought over the different ways to do it:\n\n\n1. Tap into the whisper network (optimize for existing friendships)\n2. Put out a job description to apply (optimize for existing credentials)\n3. Run an essay competition (optimize for research and reasoning)\n\nThis month we’re running an experiment focused on #3. \n\nIf you’re interested in joining our team, please submit an essay response to one of the prompts below **by August 25th**. We encourage submitting earlier as we’ll be reviewing essays on a rolling basis.\n\nThe top essays will be reviewed and selected by our team at Volt Capital, and fellow judges USV partner Albert Wenger and Scalar Capital co-founder Linda Xie. \n\nWhen writing, keep in mind your essay should demonstrate a deep understanding of current crypto projects, original thinking, and a thesis around where the space could be headed directionally. Essay length is up to you, but preferably meets a minimum of 250 words.\n\n**Prompts**\n\n1. Now that Uniswap V3 is live, provide an overview of the tools being built - or tools that should be built - to support the network and network growth.\n2. Provide an overview of the DAO management tooling landscape. Where’s the biggest opportunity to build? Why?\n3. Free form - write about a sector or narrative you’re currently seeing play out in the crypto space. What’s the opportunity set and how do you anticipate the narrative playing out?\n\nOnce you’ve published your essay, please [submit the link here](https://docs.google.com/forms/d/1_wNf7-ZlseKa5lL43vi1eFGTjVxt-adJOCmHXe-1aOY/edit).\n\n\n\n**How to join Mirror**\n\nYou’ll be prompted to connect your wallet. \n\n![](https://images.mirror-media.xyz/publication-images/8b9e54e0-9dac-452d-b334-c1663ede841e.png?height=640&width=742)\n\n\n\n1. After connecting, click “join the $write race” and answer the prompt with a sentence or two. The prompt typically asks why you want to join Mirror.\n2. Once you’ve applied, send your profile link to soona@volt.capital or imran@volt.capital, and we’ll help rally the community to get you accepted onto Mirror.\n3. Once accepted, you’ll be able to create a Mirror profile.\n\n\n**Prefer to publish elsewhere?**\n\nBonus points for publishing on Mirror, but if you want to publish on other platforms like Medium or Substack, feel free to [send the link to your essay here](https://docs.google.com/forms/d/1_wNf7-ZlseKa5lL43vi1eFGTjVxt-adJOCmHXe-1aOY/edit).\n\n\nHappy writing!\n", "timestamp": 1627675537, "digest": "nQ4-VWNTVp3nJIAFJRa4vIvLC1lOFcUMdoPCKtQ4r0U", "contributor": "0x04970d93EcB584dc00bBb82c0c18D2Ec49a0AA9c"}
{"id": "j6kCeanDMUaEo7a7deXl2u3bKyMjczNsye1MbF7ysfg", "title": "Who Owns Your Content?", "body": "You've probably never asked this question, because you probably don't know how to value the abundance of information you produce on a daily basis.\n\n--\n\nWhen companies do their accounting, they call these things \"intangible assets\". When they onboard employees, they make sure they retain the rights over their IP. When they produce IP, they make sure they don't sign it away easily. This is sensible - because **companies value their content.**\n\n--\n\nMany terms of service agreements mention the right that you've granted these companies to use your content *in any ways made possible in the future*.\n\nTry this thought experiment: take a moment and **imagine what some of those might be.**\n\n**remembering that data has an infinite shelf life\n\n--\n\nThese companies are powered by algorithms, and those algorithms are powered by your content. Without fuel to throw into the furnaces, these engines would stop turning.\n\n--\n\n\"We need to make sure our users never figure out how much their content is worth, otherwise they'll never keep letting us use it for free\"\n\n-- \n\nNow what if you owned your community?\n\n--\n\nYOU ARE BUILDING THE METAVERSE\n\nSO YOU SHOULD OWN IT.", "timestamp": 1627709023, "digest": "WEayZ3Si69499L7bwBcRNXLD9u-CrdAFfXEdVguwJMQ", "contributor": "0xbfDb50Dc66C8Df9fd9688D8fe5A0C34126427645"}
{"id": "RxYT5N2IRIE7ecyJehbm5-tqgXCPIkkuuJlEmSGMsxk", "title": "Who Owns Your Content?", "body": "You've probably never asked this question, because you probably don't know how to value the abundance of information you produce on a daily basis.\n\n--\n\nWhen companies do their accounting, they call these things \"intangible assets\". When they onboard employees, they make sure they retain the rights over their IP. When they produce IP, they make sure they don't sign it away easily. This is sensible - because **companies value their content.**\n\n--\n\nMany terms of service agreements mention the right that you've granted these companies to use your content *in any ways made possible in the future*.\n\nTry this thought experiment: take a moment and **imagine what some of those might be.**\n\n**remembering that data has an infinite shelf life\n\n--\n\nThese companies are powered by algorithms, and those algorithms are powered by your content. Without fuel to throw into the furnaces, these engines would stop turning.\n\n--\n\n\"We need to make sure our users never figure out how much their content is worth, otherwise they'll never keep letting us use it for free\"\n\n-- \n\nNow what if you owned your community?\n\n--\n\nYOU ARE BUILDING THE METAVERSE\n\nSO YOU SHOULD OWN IT.", "timestamp": 1627709019, "digest": "OlcHFb-umaeoQrmSroGMjRKc2mp2Vm898CBUo0CMHeY", "contributor": "0xbfDb50Dc66C8Df9fd9688D8fe5A0C34126427645"}
