{"id": "2_jjb1CHiZTjFQgIR5RG2NRo-Gik3mXv-79EzVea6oI", "title": "first post v2", "body": "test2", "timestamp": 1612236042, "digest": "-gLPLEvCEGER8d4DY31vAoveaulDcJcbaali6fB5mN4", "contributor": "0x8c5A261d38fE7fE65221AdAD3c2Ba5c3D10F046C"}
{"id": "dqZf7pgNqH1X_5OnF6Du4T2uNuMHap4mbnpt3WqIPws", "title": "first post 21-02-01", "body": "test2", "timestamp": 1612237080, "digest": "-gLPLEvCEGER8d4DY31vAoveaulDcJcbaali6fB5mN4", "contributor": "0x8c5A261d38fE7fE65221AdAD3c2Ba5c3D10F046C"}
{"id": "we1pRJ0trc_lqaHXvUMqpOsI12KR05IEdunWzTZd9GI", "title": "first post v3", "body": "test2", "timestamp": 1612237050, "digest": "-gLPLEvCEGER8d4DY31vAoveaulDcJcbaali6fB5mN4", "contributor": "0x8c5A261d38fE7fE65221AdAD3c2Ba5c3D10F046C"}
{"id": "WaNQtJcdxeTyT7a2TjiEbvWidaIYlCTyiurfNfUoufo", "title": "NFT subculture", "body": "Established art cultures online and in the physical world won't be early adopters of NFTs. A crypto-native subculture will emerge around the medium first.\n\nLet's look at two subcultures that may provide inspiration for how NFTs might evolve:\n\n- Photography as an art form\n- Streetwear as fashion\n\nPhotography was rejected by the art establishment until late in the 20th century, almost a century after it was invented.\n\n> They saw photography merely as a thoughtless mechanism for replication, one that lacked, “that refined feeling and sentiment which animate the productions of a man of genius.” [source](https://daily.jstor.org/when-photography-was-not-art/)\n\nStreetwear, similarly, was seen as a low form of fashion consumed by a low-brow audience.\n\nSome important properties of disruptive subcultures:\n\n**Practiced by outsiders**\n- Photography: Camera equipment tinkerers\n- Streetwear: Skater kids\n\n**Considered culturally inferior**\n- Photography: Not art, but the output of a \"machine\"\n- Streetwear: Logos on sweatshirts, no appreciation for craft or materials of fashion\n\n**New marketplaces and connoisseurship criteria**\n- Photography: Collector community outside of “art world”\n- Streetwear: Bespoke online and retail marketplaces\n\nBoth result in controversy and a rejection of the new form among the old guard. Both are initially adopted by outsiders to the dominant culture.\n\nEventually, the old guard starts to slowly embrace the new medium, because the economic and cultural opportunities are too big to miss out on. Finally, the new culture is merged wholesale into the old.\n\nNFT culture will evolve following a similar trajectory. NFT art won’t be taken seriously by the art world at first. Crypto-natives will blaze their unique path and create a new culture.\n\nThe best example of NFT culture today may be community  \"portraits\" of crypto founders. Every civilization valorizes its heroes through art, and crypto is no different.\n\n[](https://twitter.com/Iiterature/status/1349060357889908737)", "timestamp": 1612237329, "digest": "OQrTGdbiDDKs-7it-URF2NYRG9xLMYEQcNnET8fah3I", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
{"id": "Pf2u6LtxYMe1GrV5RchMNM2lRQ4f1DNULKYPGKDObos", "title": "Crypto and Blockchain Governance Resources", "body": "This is my running list of crypto and blockchain governance resources here. I'll annotate them as well, as I find the time and attention to review them.\n\n[[Proposal] SourceCred Engagement Incentives](https://forum.balancer.finance/t/proposal-sourcecred-engagement-incentives/684) by [Coopahtropa](https://twitter.com/Cooopahtroopa) on the Balancer forum\n\n[Ten Theses on Decentralized Network Governance](https://www.placeholder.vc/blog/2020/9/30/ten-theses-on-decentralized-network-governance) by [Mario Laul](https://twitter.com/mlphresearch) on the Placeholder VC blog.\n\n[We Need to Re-Think Decentralized Governance](https://thedefiant.io/we-need-to-re-think-decentralized-governance/) by Blake West on The Defiant\n\n*P.S. - [Contact me](https://chainflow.io/staking) if you'd like to talk governance strategy for your staking project. I have real world experience building DAO tools and living the governance process as a core team member and validator with projects and on networks that have significant user bases.*\n\n", "timestamp": 1612289007, "digest": "xdUczMv13E4se9kxQfxi5V3_T8gPektt4oIPcAMfeAA", "contributor": "0x53b91350a481C1ad80f12127d10524793c9a7E89"}
{"id": "S6OTQX7wNhqgwcmW_feGGo8sUKq0X6JbVobaBPKhvyQ", "title": "Crypto and Blockchain Governance Resources", "body": "This is my running list of crypto and blockchain governance resources here. I'll annotate them as well, as I find the time and attention to review them.\n\n[[Proposal] SourceCred Engagement Incentives](https://forum.balancer.finance/t/proposal-sourcecred-engagement-incentives/684) by [Coopahtropa](https://twitter.com/Cooopahtroopa) on the Balancer forum\n\n[Ten Theses on Decentralized Network Governance](https://www.placeholder.vc/blog/2020/9/30/ten-theses-on-decentralized-network-governance) by [Mario Laul](https://twitter.com/mlphresearch) on the Placeholder VC blog.\n\n[We Need to Re-Think Decentralized Governance](https://thedefiant.io/we-need-to-re-think-decentralized-governance/) by [Blake West](https://twitter.com/_blakewest) on The Defiant\n\n*P.S. - [Contact me](https://chainflow.io/staking) if you'd like to talk governance strategy for your staking project. I have real world experience building DAO tools and living the governance process as a core team member and validator with projects and on networks that have significant user bases.*\n\n", "timestamp": 1612289213, "digest": "xdUczMv13E4se9kxQfxi5V3_T8gPektt4oIPcAMfeAA", "contributor": "0x53b91350a481C1ad80f12127d10524793c9a7E89"}
{"id": "3KLFLMtt5KWRIGDGyUpFX6iy0tJUhFow_wIPP4_wTsg", "title": "Crowdfund: $ESSAY", "body": "A new experiment begins today: using crypto to crowdfund the next essay I'm writing, titled [Scissor Labels](https://j.mirror.xyz/RUeJfZEZxr-hkuzUCakQyUuf2kOJVMPPiAWBaQFhhqc).\n\nInstead of publishing my work for free, or putting it behind a paywall, I'm doing something in between: raising funds to produce a new essay in exchange for ownership of the work. This will allow me to devote my full time to writing the piece, while allowing it to exist as a public good for anyone to read. **The crowdfund is now live**, and will stay open for one week, or until the cap is hit.\n\n\n[Scissor Essay](crowdfund://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0)\n\n![](https://images.mirror-media.xyz/publication-images/70da6b7c-f699-4cf8-896e-02bdc272a70b.jpeg?height=1340&width=2400)\n\nUnlike other patronage models, this form of crowdfunding is not pure altruism. Instead, patrons receive a stake in the success of the work. Here's how it works:\n1. The essay exists as permanent, public data published via Mirror.\n2. That essay is minted as an NFT on the new [Zora protocol](https://zora.engineering/).\n3. Backers can send ETH to the crowdfund in exchange for $ESSAY tokens.\n4. When the NFT is sold, the ETH in the contract increases\n5. $ESSAY tokens can be bought and sold like any other ERC-20 token, or redeemed for underlying ETH.\n6. Participants in the initial crowdfund will be embedded in the essay forever, as the supporters who made it possible.\n\n### Inspiration\nOver the past couple years, paid writing has made great strides, with Substack popularizing newsletter subscriptions as the dominant business model for writing online. However, the paid newsletter model only works for a certain kind of writing - something regular, consistent, and often a bit shorter.\n\nWhile newsletters are great for many reasons, we also need other business models for writing. Some of the greatest thinkers around are primarily dedicated to something besides publishing their ideas on a regular cadence, and therefore won't be found starting a weekly newsletter. Even those who *are* dedicated to writing often produce their best work after weeks or months of research, not by writing a new piece every few days. Unfortunately, these kinds of writers face a tough choice today: adapt their work to a newsletter format, or write without being paid.\n\nEven for writers running successful newsletters, there's an inherent tradeoff in the subscription format: in order to monetize their content, writers must hide some, if not all of their work, behind a paywall, reserved for those who pay to subscribe. With each new piece is a choice between rewarding those who pay and sharing ideas widely.\n\nThe tools we have at our disposal influence the kind of work we create, and when the only tool around for getting paid to write is a newsletter publisher, it's no wonder we see more and more newsletters, and less of everything else.\n\nOther formats and styles of writing are obviously valuable and worth paying for, and for this reason alone it's worth experimenting with new funding models. I believe that these issues can be solved if we can introduce effective new business models for writing.\n\nThis week, in an attempt to move towards that goal, I'm pursuing my own writing under the new crowdfunding model described above. This model has been on my mind for awhile, and I'm really curious to see if it's possible.\n\nIf my funding goal is hit, the piece will be published publicly, free for everyone to read and share, while those who funded it hold ownership. If the funding goal isn't hit, everyone will receive their money back.\n\n![](https://images.mirror-media.xyz/publication-images/7d42a4b3-363c-4b13-b7f3-592d3b9cb6c1.jpeg?height=1340&width=2400)\n\nThough not proven, I believe this model can can solve both of the problems mentioned above:\n\n1. It offers a path to being paid for a one-off work that's not part of a subscription or newsletter.\n2. It offers a way to monetize work that remains a public good, without a paywall.\n\nIf this experiment is a success, it will mark an early promising sign for a new way to fund not just writing, but all kinds of creative work.\n\nThat all being said, I hope you'll stick around to fund, share, or at least observe as we try something new. A link to the post containing the abstract is below, along with some information about me.\n\n[](https://j.mirror.xyz/RUeJfZEZxr-hkuzUCakQyUuf2kOJVMPPiAWBaQFhhqc)\n\n### About Me\nI’m a product designer and software engineer, mostly involved in helping early stage startups design and grow products in interesting markets. I started my career as a software engineer at Snapchat, then founded a startup, which went through Y Combinator in 2018. Since then, I've worked as a designer and consultant for several startups and investors, including WorkOS, Muze, a16z Crypto, and Y Combinator, where I help out part-time with admissions. You can find me on Twitter [here](https://twitter.com/john_c_palmer).\n\nI typically write 1-2 longer essays each year, most often concerning new insights around startup strategy and product design. Among them, my [Spatial Software](https://darkblueheaven.com/spatialsoftware/) post from last year was probably the most popular, describing a wave of new products being built around game-like interfaces and what makes them unique.\n", "timestamp": 1612297129, "digest": "uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0", "contributor": "0xB0623C91c65621df716aB8aFE5f66656B21A9108"}
