{"id": "8riF1xTg6AbbVCT7MmZ1vUXEWWFJBskXk930WSb09BU", "title": "Blitmap is public domain", "body": "*This post was originally made to Medium to August 12th and is being reposted here in its entirety.*\n\n—\n\nLast night we voted unanimously to make the original Blitmap collection public domain under [CC0](https://creativecommons.org/share-your-work/public-domain/cc0/).\n\nStarting today, you are free to use the original Blitmap collection for any reason and without restriction, personally or commercially. This includes any selection of pieces, components, or characters within it, or the collection as a whole.\n\nRecent developments in the NFT ecosystem indicate an increasing desire for NFTs to incorporate some of the same ideals that crypto itself is based on. Namely, that value comes from a decentralized ledger, the provenance it enables, and the trustless composability that comes out of it. At the same time, these new ideals encourage a more open ecosystem of work where historical gatekeepers (“moats”) are not the primary drivers for proliferation or longevity.\n\nWe choose to incorporate these values into our beliefs around Blitmap.\n\nWe believe that attention and mindshare — in other worlds, culture — are increasingly becoming the greatest drivers for sustainability in our space. It doesn’t matter if derivative works or outright copies can be created. In fact, it’s probably better. Every derivative work shares some of its significance with the original it was based on, and vice versa. Over time, the original has the capability to become a platform and ecosystem in and of itself.\n\nIn making our decision, we considered some pros and cons:\n\n**Pros:**\n\n* **Decentralizes distribution and significance.** Derivatives are created trustlessly. Every derivative increases attention and mindshare of the original.\n* **Aligns interests.** Creators can make self-sustainable derivatives. They are incentivized to create more (and hopefully, higher quality) derivatives.\n* **Simplifies things.** No more worrying about rights, or answering questions about what is and isn’t okay. Everything is spelled out and easy to understand. We can focus on our work and we can be \\*surprised \\*by what the community does.\n* It’s **crypto-native.**\n\n**Cons:**\n\n* **No exclusive rights.** Both the entity and the individual artists have the same rights as everyone else: to create derivatives.\n* **Bad actors**. The IP could be co-opted or otherwise tainted by trolls, extreme political groups, cults, etc.\n* **Will seem less valuable to some**. Some people will believe that IP is the moat and believe Blitmap has less significance if it is given up.\n\nWe also considered a list of fictional works and universes that are already in the public domain:\n\n* King Arthur\n* Shakespeare\n* Dracula\n* The Wizard of Oz\n* Jane Eyre\n* Little Women\n* Moby Dick\n* Peter Pan\n\nAn interesting thing about these examples is that many of the derivative works they are reponsible for are *not* public domain. In other words, just because the foundation and universe of King Arthur is public domain, it does not mean that adaptations like *The Green Knight* or *The Sword in the Stone* are. Still, these adaptations contribute to the significance of the original as a whole. Imagine a world where the King Arthur mythology was started on a blockchain and its components were represented as tokens. Surely, there is value in proving one is *the* creator or *the* owner of *the* Excalibur.\n\n# Does this include Blitnauts or future expansion packs?\n\nCurrently, we are releasing the original Blitmap collection, including any selection of pieces, components, or characters within it, and the collection as a whole.\n\nOur plan is to release all IP created in Season 1, including Blitnauts, the third expansion pack, and the lore reveal shortly *after* their respective drops. After Season 1, we will reevaluate and decide on our plans for future IP, but we are optimistic!\n\nYou are, of course, free to create your own expansions or interpretations (including new Blitnauts) at any time.\n\n# Does this include both originals and siblings?\n\nBecause the siblings themselves are derivative works made by combining originals, they are in a bit of a grey area. In theory, we currently have the right to release siblings, but just doing that feels strange. We value community involvement and acknowledge that the community owns most of the siblings in existence. To that end, we will put out a vote to Blitmap owners today asking for support to also release the sibling collection.\n\nRegardless of outcome, you can always use the original Blitmaps however you like, including (but certainly not limited to) remixing or combining them to create your own siblings.\n\n# What about naming?\n\nCC0 does not affect trademark rights. We are working on opening up the naming separately, but this will require a little more work on our end. For now, we would ask that you refrain from the following phrasing in your derivative works: “Official”, “Canon”, “Blitmap(s)” or “Blitnaut(s)” followed by any sequence number, *just* “Blitmap(s)”, or *just* “Blitnauts(s)”.\n\n✅ My Little Blitnauts \n\n✅ Baby Blitmaps\n\n✅ Blitland\n\n✅ Blitmaps GAN\n\n✅ Coolblits\n\n✅ Blit Blit Maps\n\n❌ Blitmaps\n\n❌ Blitnauts 2\n\n❌ Blitmap Mk III\n\n❌ Blitnauts Part 4\n\n❌ Official Baby Blitnauts\n\n# Does my derivative also need to be public domain?\n\nNo. There may be mutual community benefits in it but it is entirely up to you.\n\n# Do I need to acknowledge Blitmap in my derivative?\n\nNo. There may be mutual community benefits in it but it is entirely up to you.\n\n# I’m making a commercial derivative. Do I need to share profits with Blitmap?\n\nNo. There may be mutual community benefits in it but it is entirely up to you.\n\n# Does this include merch/games/toys/shows/etc?\n\nYes. You can do whatever you like.\n\n# When does this take effect? Is there documentation?\n\nAll the original artists agreed unanimously in a 17 of 17 decision, so we believe this takes effect today. For anyone who wants further assurance and immutability, we are also working on creating a smart contract that contains the release, which every artist will sign with their wallet. We expect to deploy this in the coming weeks.\n\n—\n\nWe love NFTs and the new possibilities they open for world building and storytelling. In some ways, this change is a bet on the NFT premise as a whole. In other ways, it’s just a natural extension of our own “community crafted” values. We are looking forward to seeing what we can make together.\n\nIf you are interested in discussing this or anything else related to Blitmap, join us on our Discord: **<https://discord.gg/blitmap>**\n\nP.S. This post should be on Mirror but we’re still in the process of setting it up. We’ll …mirror… it over there as soon as we do.", "timestamp": 1629900048, "digest": "b-ANHRCj78z9Qy6Dk-kgjOsFtIqoVsQAS5DNNygU10U", "contributor": "0x3233525B5181D995547f2Fb2f16E0C6953714376"}
{"id": "iyWtrCf5xeP0CXzPQNTQVz9Y4sNEQnMFNZWhowbQYzw", "title": "NFT brand strategy: Visa and Arizona Iced Tea ape into web3", "body": "Last Friday, Arizona Iced Tea used it’s Twitter feed to announce to the world they had acquired an NFT from the popular Bored Ape Yacht Club (BAYC) collection.\n\n![](https://images.mirror-media.xyz/publication-images/d82b7f26-137a-419c-96e9-0947114bbb5c.png?height=694&width=1238)\n\nThe Bored Ape Yacht Club Collection is a series of 10,000 randomly generated profile pictures of, you guessed it, bored apes. The NFT series has surged in value since the spring, and is arguably one of the premiere NFT assets available today.\n\nNot to be outdone, three days later, Visa announced via their @Visanews Twitter handle they had acquired Crypto Punk #7610 for nearly $150,000. The Crypto Punk collection of 10,000 randomly generated characters is considered one of the very first NFTs on the Ethereum blockchain, and set the precedent for many generative NFT projects like BAYC.\n\n[https://twitter.com/VisaNews/status/1429745230023208969](https://twitter.com/VisaNews/status/1429745230023208969)\n\nSeeing legacy consumer facing brands like Arizona Iced Tea and Visa publicly support some of the most popular NFT collections on the market is certainly a bellwether for both Web3 and for legacy Web2 brands.  But how will these decisions be received by consumers, and what is the ultimate purpose that these brands are trying to achieve in their very public NFT acquisitions?\n\n## The Market Effect\n\nSo, what happens when legacy brands join a bunch of NFT degens? What reaction will all the .jpg lovers out there have to large, deep pocketed consumer brands sweeping up the floor of popular NFT collections?\n\nWell, it seems like, regardless of what the public sentiment may be, the NFT market reacted with a buying frenzy.\n\nIn the hour after Visa’s announcement, [Crypto Punks saw over $20M of trading activity](https://tokenist.com/20-million-worth-of-cryptopunks-bought-in-first-hour-after-visas-nft-purchase/), and by the end of the day, there had been over $100M in trading activity. Also, while Visa paid a little under $150k for their Crypto Punk, as of writing, the cheapest punk is now over $250k.\n\nCrypto Punks as an asset, it should be noted, could be the new trend for large organizations looking to diversify their holdings. Tesla made waves when[ it announced that they had bought $1.5B in Bitcoin](https://www.cnbc.com/2021/02/08/tesla-buys-1point5-billion-in-bitcoin.html) back in February, but the valuation of Crypto Punks has actually outperformed both Bitcoin and Ethereum this year.\n\n[https://twitter.com/ceterispar1bus/status/1429756740401250314](https://twitter.com/ceterispar1bus/status/1429756740401250314)\n\nMeanwhile, while the “‘Zonies” were being welcomed aboard the Bored Ape Yacht Club, popular Youtuber and boxer, Logan Paul, [announced on Twitter](https://twitter.com/LoganPaul/status/1428909432486854660) his purchase of two rare NFTs from the Bored Ape Yacht Club Collection for over $105,000 *each*, and the floor of the Bored Ape Yacht Club collection saw a similar bounce to what the Crypto Punks experienced after the Visa news. Just a few days later, Logan ponied up another $600K+ for the Bumblebee K4N1, a rare piece of the 0N1 Force. Similarly, this news drove a buying frenzy in that community as well.\n\nLess than one month ago, the floor of the Bored Ape Yacht Club collection was at 10ETH, and today the floor is over 25ETH.\n\n![](https://images.mirror-media.xyz/publication-images/68f6222d-65a6-49a0-a3c5-6b45f0662ca9.png?height=612&width=1254)\n\nThings move fast in NFT-land.\n\nOn Brand?\n\nIt’s fairly straightforward to see that these NFT acquisitions by Arizona Iced Tea and Visa will most likely perform very well as far as investments go, but what is the overall play here for the brands themselves?\n\nWhen Arizona Iced Tea announced their acquisition, they teased they had “some huge things planned”, and referenced a surprise reveal in the first issue of the Bored Apes Comic project. The [Bored Apes Comic](https://boredapecomic.com/) project is not affiliated in any way with the actual Bored Apes collection, and is an example of what can emerge from the generous Bored Apes ‘*terms of use*’ that gives a commercial license to owners to use the images as they see fit.\n\nWe can anticipate that the surprise reveal in the comic will probably be an ape consuming Arizona Iced Tea. Is this the first instance of product placement within an NFT?  We’re not sure. However, Arizona Iced Tea may need to be more careful in how it appropriates the branding of this popular NFT series.\n\nResponding to the announcement, Yuga Labs, the creators of the Bored Ape Yacht Club, tweeted support, but also[ told outlets that Arizona Iced Tea had crossed the line in using the actual Bored Ape Yacht Club branding in their tweet](https://decrypt.co/79231/arizona-iced-tea-bored-ape-nft-brand-use-inappropriate). The commercial license applies to the images of the apes themselves, but not to the branding or brand name of “Bored Ape Yacht Club”.\n\nThe narrative behind Visa’s announcement took a more historical perspective, [saying that they were adding their Crypto Punk to their existing collection](https://twitter.com/VisaNews/status/1429745230023208969) of “historic commerce artifacts” like paper credit cards, the zip zap machine, and more. In addition to their announcement, Visa also published a 17 page report called “[NFTs: Engaging Today’s Fans in Crypto and Commerce](https://usa.visa.com/content/dam/VCOM/regional/na/us/Solutions/documents/visa-nft-whitepaper.pdf)” as well as [an interview with Cuy Sheffield](https://usa.visa.com/visa-everywhere/blog/bdp/2021/08/18/nfts-mark-a-1629328216374.html?utm_source=VisaNewsTwitter&utm_medium=OrganicSocial&utm_campaign=NFT082321&linkId=128409385), their Head of Crypto. While the report is designed as a primer on NFTs and tailored for Web 2 investors, the interview provides a high level view of how this 60 year old company views the growing NFT landscape.\n\nIn addition to providing basic insights for Web2 investors as to what NFTs are and why an investor may want to own one, Sheffield claims that the main reason that Visa acquired their Crypto Punk was because, “First and foremost, we wanted to learn”.\n\nTo purchase their Crypto Punk, Visa partnered with [Anchorage Digital](https://www.anchorage.com/), a digital asset platform that caters to institutional investors. Anchorage positions itself as a platform that gives “institutions easy and efficient access to crypto custody, trading, financing, staking, and governance services, all from within the world's most advanced and proven security architecture.”\n\nNow that Visa has their first NFT acquisition under their belt with the help of Anchorage, Sheffield shared that they feel more confident in helping their partners navigate this growing space.\n\nWhat role Visa can play in the NFT space is still to be determined, but in addition to learning and signaling support for the broader NFT industry, Sheffield did mention that they are thinking deeply about “how we can apply our expertise in enabling seamless and secure digital payments to make NFT-commerce accessible and useable for buyers and sellers.”\n\n## Schelling Points\n\nAs Chris Cantino points out, “Businesses spent the last decade dialing in their online strategy—relying on digital ads, content creation, and influencers. But old models are facing increasing cost pressures and competition. Brands are struggling to own and retain their audiences. To be authentic. “\n\n[https://twitter.com/chriscantino/status/1430241317418799105](https://twitter.com/chriscantino/status/1430241317418799105)\n\nAs consumers awake to the fact that the value they generate on Web2 social platforms is increasingly tough to capture, they’re keen to switch to decentralized incentive based communities.\n\nThis is evidenced by the aforementioned NFT communities in Crypto Punks and BAYC. They certainly won’t be the last ones either. Over the weekend we saw the dramatic rise of the [0N1 Force](https://www.0n1force.com/), with many other communities coming online every week.\n\nSome will be avatar based, some will be interest based. Some will be worth millions, some will be worth hundreds. Some will fail, some will succeed. But the overall trend indicates this is the direction consumers are going.\n\nWhich leaves us with an interesting [Schelling Point](https://nav.al/schelling-point). Communities are active, and brands want in. But where do these communities actually want to meet brands? And how can brands organically provide value to these communities? Arizona Iced Tea led the way, but the community backlash shows that there is much to be desired.\n\nAs with all things tech, it’ll first be unbundled solutions. Partnerships, collections, licensing, purchasing, access, etc. There will be some incredibly creative executions within this time period. And then we’ll move to the bundled phase. Brands, if not already, will become synonymous with their communities. Ownership communities will become some of the most noteworthy brands on earth. And that’s when the real fun begins.\n\n### A Coming Wave?\n\nOne week in Web3 is starting to feel like a full year in what we’ve been used to with Web2, and the announcements from Visa and Arizona Iced Tea are surely a sign of things to come from legacy brands looking to bridge the gap between Web2 and Web3.\n\nAs more and more brands consider the unique ways that they can wade into the NFT waters, it’s worth considering the tactics and narrative around these strategies. It’s all too common to see brands try and hop on trends, only to come across as cringe worthy. So, hopefully brands leverage the unique perspectives and expertise that can be found in places like JUMP, Forefront, Seed Club, and others.\n\n### Author credits\n\nThis essay was written by [Chad Huggins](https://twitter.com/ChadHugghins).\n\nThank you to [Jeremy Olken](https://twitter.com/jeremyolken) and [Domingo Bette Encour](https://twitter.com/glycemag) for reviewing the essay’s draft and contributing additional insights.\n\n### About JUMP\n\nJUMP is the first tokenized community for marketing and advertising professionals.\n\nJoin us at [JoinJump.Community](https://www.joinjump.community/) and follow [@jumperstweeting](https://twitter.com/jumperstweeting).", "timestamp": 1629902621, "digest": "ATrIlwxvkXwdo2R18kZIgYwspbURdyzjf1y-a9F99Jk", "contributor": "0xC143c4E2f95B7B49aF49501323093efFeDa42e41"}
{"id": "HIYUHvmG_3Fhz_MmhaekY_aB7c3jcNlQYnx3DaKhOX0", "title": "📚 the bookshelf as a metaphor: cultural artifacts in the digital era", "body": "Walk into someone’s home, and you’ll find their personal bookshelf. What books? All sorts. Books lent by friends, gifted over the course of a certain chapter of life, ordered off Amazon after being referenced in conversation, picked up spontaneously in the airport duty-free before flights, bought solely for the aesthetic value of their covers…\n\nIn this piece, we’ll be using books as a metaphor for ownable cultural artifacts. Let’s get into it.\n\n### The bookshelf as a record of who I am...and who I was\n\nMy amazing friend **[Inga Chen](https://inga.substack.com/p/magic-of-bookstores-issue-4)** wrote:\n\n> “What books people buy are stronger signals of what topics are important to people, or perhaps what topics are aspirationally important, important enough to buy a book on it that will take hours to read”....or that they’ll display on their shelf to signal something about themselves.\n\nAs I look at the books I’ve accumulated, I’m reminded of how I’ve changed. How my bookshelf changes is quiet, but powerful commentary on what’s happening in my life. A few months ago, I bought a bunch of baking books—like many people, I had a baking phase during covid. Recently, I’ve been really into product design and am amassing a bunch of the canonical books on the topic. In many ways, the bookshelf is an archive of who I am—and who I **want** to be.\n\nBeyond the selection of books, the way I organize my books is opinionated. I chose to showcase Understanding Media by Marshall McLuhan, but hide Principles by Ray Dalio. I also spent a couple of hours organizing my books based on their color, and every time I add one, I slot into the right place. I care a lot about the aesthetic of my bookshelf, because it’s quite visible - it stands center stage in my living room.\n\n### The bookshelf as a source for discovery\n\nWhen we visit bookstores, we go in with an intention. Sometimes it’s to search for a specific book, to seek inspiration for our next read or maybe we just want to be in the bookstore for the vibes - the aesthetic or what being in that space signals to ourselves or others. When I visit someone’s house, I’ll always look at what’s on their bookshelf to see what they’re reading. This is especially the case for someone I admire or want to get to know better. \n\nScanning the bookshelf, I’m on the lookout for a spontaneous discovery. The connection I have with the bookshelf owner provides some level of context and the trust that it’s somewhat a vetted recommendation. I look through the books for a title that catches my eye - maybe I’ll leaf through the pages and sample a few sentences, read the book jacket or the author biography. If something hits, maybe I’ll ask to borrow it or take a note to buy it later. \n\n### The bookshelf as context for connection\n\nThere’s something surprisingly intimate about browsing someone’s bookshelf - a public display of what they’re consuming, or looking to consume. When I’m browsing someone’s bookshelf, I’m also on the lookout for books that I’ve read or books that fit my ‘taste’ - and when I find something, it immediately creates common ground, triggers a sense of belonging and connection. It might be even more reason for me to opt to dig deeper into their bookshelf to see what else they’re reading.\n\nAlong with discovery, the act of borrowing a book in itself creates a new context through which we can connect. Recommending a book to a friend is one thing, but sharing a copy of a book in which you’ve annotated texts that stand out to you, highlighted key parts of paragraphs—that’s an entirely new dimension for connection. \n\nLast summer, after falling in love with Sally Rooney’s *Conversations with Friends*, I mailed my annotated copy to another friend, who then mailed it to another. With each iteration of reads, we kept store of the parts that meant something to us through different colored pens and highlighters, claiming separate parts of the book as our own. It was an intellectual version of the sisterhood of the traveling pants. The copy became a shared collectible that we could use to archive our thoughts, feelings, and emotions, bringing us closer together in our friendship with a new understanding of how we connect with each other, and the messages that resonate with us.\n\n**People connect with people, not just content.** \n\nWhat’s more powerful than the books and the topics they discuss is the author. The effort to source the book, its edition, how early you got it, whether it’s signed by the author, the condition it’s in all serve as some “proof of work” that signal to myself, and the world, the intensity of my fanship. And in all of this, putting out a carrier signal of varying intensity to other fans. \n\nTake this metaphor of a bookshelf, and apply it to any other space that houses cultural artifacts — or what **[Julian Weisser ](https://twitter.com/julianweisser)**has been calling *Social Objects*. Beyond the books we own, the shirts we wear, the posters we put on the walls of our bedrooms, the souvenirs we pick up — these are all social objects. They showcase what we care about and the communities to which we belong. At their core, social objects have always acted as a shorthand to tell people about who we are, functioning as beacons sending out a signal for like-minded people to find us. On the internet, social objects come in the form of URLs of JPGs, articles, songs, videos.\n\nPinterest, Goodreads, Spotify and the countless other platforms center discovery and community around creative works - but what’s missing from our digital experience is this aspect of ownership that’s rooted in physicality. We turn to digital platforms as sources of discovery and inspiration, but until now, we haven’t been able to attach our identities to the content we consume. Without public histories that allow for ‘proof of fanship’, there’s no way to track provenance or to verify that you were first to that song, to that artist, to that feeling, commentary, meme. And without true portability, we leave fragments of our digital identity across siloed spaces. \n\nAs we enter this new era, we’ll see a natural evolution of platforms competing for our time: the battle for digital identity - an abstraction of the time we spend online. As more of our lives play out online, we’re spending increasing amounts of time **and money** developing our digital identities. With that, we’ll see platforms compete less for share of our time online, but more for share of our digital identity.\n\nPlatforms that become the de facto ‘bookshelf’ for our online lives, where our social objects are placed and are on display, have a huge opportunity in front of them.\n\n*koodos has entered the chat.* \n\nBy Jad Esber & **[Aleena Vigoda](https://www.linkedin.com/in/aleenavigoda)**", "timestamp": 1629906513, "digest": "UpucfIHH_bHU7143ZieI8JtW1X_y_Px3pRyxkYG8cQ0", "contributor": "0xC1f099630feB3A4937c869c42411b123279Db344"}
{"id": "TFTBUAVAvJE6hQ7WWhazzMUd0i9V7jUDIuYOB9BUFok", "title": "Dharma is live on Mirror!", "body": "Today, we are happy to announce the migration of the Dharma Blog onto Mirror. \n\nDecentralized applications should use decentralized tools. With Mirror, we are able to move our long-form communications off of a centralized hosting provider and onto a crypto-native solution. \n\nWe are moving important prior blog posts to Mirror, but will deprecate most prior posts.\n\nHere’s to the decentralized future.\n\nOnward :)", "timestamp": 1629909103, "digest": "nh_l6eI1HJ9ne3OoJKseE6-NF3feSwjQFycJ8__LWIc", "contributor": "0x67e1b186e6dA49917922C040FD07bE1827978CE7"}
{"id": "1LvGzMgtUPLphKpSBtGia9axwGcS0D3aZHKdsKnJb3A", "title": "Dharma is live on Mirror!", "body": "Today, we are happy to announce the migration of the Dharma Blog onto Mirror.\n\nDecentralized applications should use decentralized tools. With Mirror, we are able to move our long-form communications off of a centralized hosting provider and onto a crypto-native solution.\n\nHere’s to the decentralized future.\n\nOnward :)", "timestamp": 1629909915, "digest": "nh_l6eI1HJ9ne3OoJKseE6-NF3feSwjQFycJ8__LWIc", "contributor": "0x67e1b186e6dA49917922C040FD07bE1827978CE7"}
{"id": "d6tWT6NWwiqkKZAtMD98qkKN3kMKbl-V69wFhVg2-0s", "title": "Editor 2.0", "body": "### Mirror is excited to release a significant update to the writing experience with a completely new editor.\n\nToday we’re excited to release a significant update to the writing experience on Mirror with a completely new editor.\n\nThe new editor allows you to seamlessly weave together multimedia content and economic participation into a cohesive narrative. Create a story that’s collectible. Raise funds to make your dream project a reality. Build a community around your writing.\n\n![](https://images.mirror-media.xyz/publication-images/9df2e94e-c96b-41fc-96b5-46c7be65441f.png?height=1142&width=2284)\n\nWe’ve evolved the editor to better support your creative process. No more toggling to preview mode or looking up Markdown syntax. As you write, the editor displays your story how readers will see it. You can even insert rich embeds directly into the document — like Mirror economic blocks (crowdfunds, splits, etc.), web3 content (NFTs), or third-party content (YouTube videos, tweets, etc).\n\nIf you like using Markdown, you still can. Markdown syntax gets transformed into rich text and you can even paste Markdown into the editor. For those who prefer formatting with their mouse, there are new selection and block menus to get things just right.\n\nIn the future, this foundation will help support new features, like auto-save, table support, collaborative editing, etc. We are excited to get this into creators’ hands and see what you create.", "timestamp": 1629910155, "digest": "pC6nnyipUUMoTmHzYQzrwNic-4ZO4YXtL8GcEIahTe4", "contributor": "0xA0Cf798816D4b9b9866b5330EEa46a18382f251e"}
{"id": "nKL-_ykLlN7cIoEASnOBivL_S1Nz7bUEn-d1s6iSoFk", "title": "Editor 2.0", "body": "### Mirror is excited to release a significant update to the writing experience with a completely new editor.\n\nToday we’re excited to release a significant update to the writing experience on Mirror with a completely new editor.\n\nThe new editor allows you to seamlessly weave together multimedia content and economic participation into a cohesive narrative. Create a story that’s collectible. Raise funds to make your dream project a reality. Build a community around your writing.\n\n![](https://images.mirror-media.xyz/publication-images/9df2e94e-c96b-41fc-96b5-46c7be65441f.png?height=1142&width=2284&size=medium)\n\nWe’ve evolved the editor to better support your creative process. No more toggling to preview mode or looking up Markdown syntax. As you write, the editor displays your story how readers will see it. You can even insert rich embeds directly into the document — like Mirror economic blocks (crowdfunds, splits, etc.), web3 content (NFTs), or third-party content (YouTube videos, tweets, etc).\n\nIf you like using Markdown, you still can. Markdown syntax gets transformed into rich text and you can even paste Markdown into the editor. For those who prefer formatting with their mouse, there are new selection and block menus to get things just right.\n\nIn the future, this foundation will help support new features, like auto-save, table support, collaborative editing, etc. We are excited to get this into creators’ hands and see what you create.", "timestamp": 1629910179, "digest": "pC6nnyipUUMoTmHzYQzrwNic-4ZO4YXtL8GcEIahTe4", "contributor": "0xA0Cf798816D4b9b9866b5330EEa46a18382f251e"}
{"id": "90_QSTkEisJUwMI9mgPGkFKIOG6n59KEMBrvUlPb9Zk", "title": "Editor 2.0", "body": "### Mirror is excited to release a significant update to the writing experience with a completely new editor.\n\nThe new editor allows you to seamlessly weave together multimedia content and economic participation into a cohesive narrative. Create a story that’s collectible. Raise funds to make your dream project a reality. Build a community around your writing.\n\n![](https://images.mirror-media.xyz/publication-images/9df2e94e-c96b-41fc-96b5-46c7be65441f.png?height=1142&width=2284&&size=medium)\n\nWe’ve evolved the editor to better support your creative process. No more toggling to preview mode or looking up Markdown syntax. As you write, the editor displays your story how readers will see it. You can even insert rich embeds directly into the document — like Mirror economic blocks (crowdfunds, splits, etc.), web3 content (NFTs), or third-party content (YouTube videos, tweets, etc).\n\nIf you like using Markdown, you still can. Markdown syntax gets transformed into rich text and you can even paste Markdown into the editor. For those who prefer formatting with their mouse, there are new selection and block menus to get things just right.\n\nIn the future, this foundation will help support new features, like auto-save, table support, collaborative editing, etc. We are excited to get this into creators’ hands and see what you create.", "timestamp": 1629910276, "digest": "pC6nnyipUUMoTmHzYQzrwNic-4ZO4YXtL8GcEIahTe4", "contributor": "0xA0Cf798816D4b9b9866b5330EEa46a18382f251e"}
{"id": "EFRG5oNDypHbAu8TGZqf9S6Ro7e29mq_gYI3BmVzohY", "title": "NounsDAO", "body": "[NounsDAO](https://nouns.wtf/) is an NFT project that combines pseudorandom image generation with auctioning, community governance, and a novel rendering technique. Each NFT is called a *Noun*, and one Noun is minted every day, indefinitely.\n\nAll Nouns are auctioned, and sales revenue goes into a treasury. NounsDAO has adapted governance protocols from DeFi to allow owners of Nouns to create and vote on proposals over treasury funds and protocol upgrades.\n\nAt time of writing, there is 2,074.0122 ETH (\\~$6.88m) in the treasury, and the project has been running for 15 days. The first treasury proposal is to donate 30 ETH (\\~$100k) to various charities.\n\nThere are four mechanisms worth highlighting in the NounsDAO protocol, each of which contains some innovation: **auctioning**, **trait generation**, **rendering**, and **governance**.\n\n![Examples of three nouns, rendered in SVG - each Noun has a unique background, body, head, and accessory.](https://images.mirror-media.xyz/publication-images/12e8e7a4-18f0-4503-902b-e6fa1cf0efbc.png?height=506&width=1012)\n\n## **Auctioning a Noun**\n\nThe lifecycle of a Noun begins with the creation of an auction; the auction house mints the Noun. This auction house is a simplified version of Zora/Mirror's that only accepts bids in ETH.\n\nOnly one auction is run at a time, and each runs for a minimum of one day. When an auction is closed, a new one is immediately created. This means that there is always exactly one Noun on auction at any time.\n\nEach auction has a reserve price, but it is currently set to a negligible 1 wei. New bids must increment the current bid by at least 2%, otherwise they revert. Nouns are typically being sold for between 100 and 150 ETH (\\~between $300k and $500k).\n\nIf a bid is made within the last 5 minutes, the auction is extended by 5 minutes. When the auction is over, the noun is transferred from the auction contract to the highest bidder.\n\n![](https://images.mirror-media.xyz/publication-images/d8d4696e-9d73-47a8-9b71-634468cffbbd.png?height=1102&width=2120)\n\n## Noun Generation\n\nA Noun is composed of 5 traits: *background*, *body*, *accessory*, *head*, *glasses.*\n\nWhen a Noun is created, the protocol generates a random integer to represent each of these traits, distinguishing it from other Nouns. The theoretical maximum value of each trait is 2^48 - 1, but in practice it is limited by the number of images that have been uploaded to the protocol for that trait.\n\nEvery Noun has a unique ID that can be used to view its traits. Traits are stored on the core contract called `NounsToken`, which also holds user balances. The actual image rendering of these traits is decoupled, and lives on a contract called the `descriptor`. This contract can be swapped out through a governance proposal (unless governance has chosen to make this locked).\n\n![The traits for each Noun is publicly viewable on the core NounsToken contract.](https://images.mirror-media.xyz/publication-images/c9e74e17-f1ad-4b9e-9954-3318edf64bf0.png?height=710&width=1120)\n\n## Rendering a Noun\n\nThis is where NounsDAO is technically very interesting.\n\nThe integer generated for each trait is a reference to an image stored in another contract called `NounsDescriptor`. Images are stored as string of bytes in a lossless data compression format called RLE, which are ultimately renderable by the contract as SVG!\n\nWhen the UI calls the tokenURI method, the contract returns the SVG derived from these compressed RLE data. This is innovative and worth considering for any new blockchain art project.\n\n![The tokenURI method returns all data required to render a high-fidelity image, without needing to reference anything off-chain.](https://images.mirror-media.xyz/publication-images/758876c3-612d-4a4b-b8fc-79d65b3fc189.png?height=702&width=1104)\n\nBecause Noun rendering is decoupled from the core Noun contract itself, this functionality can be improved and swapped if a new compression or rendering technique is proposed.\n\n## **Governance**\n\nNounsDAO is community-governed through a modification of Compound's Governor Bravo contract. It is primarily modified to use ERC721 balances instead of ERC20 balances for voting.\n\nThe first governance proposal has been to \"Donate 5 ETH each to 6 Charities\", which looks like it will pass with unanimous consent.\n\n![](https://images.mirror-media.xyz/publication-images/3f5cb7c1-91fc-42d4-bb3c-55ca0fd7dc52.png?height=876&width=1440)\n\nThere are two other subtle technical differences NounsDAO made to Governor Bravo:\n\n* During token transfer, delegation is moved via a hook, rather than in the transfer method itself.\n* The function that returns an account’s delegates will return the account itself if that account hasn't delegated. This is probably an improvement.\n\n## Technical Evaluation\n\nThe NounDAO code is cleanly written, using well-known open-source libraries and modern Solidity. Methods are expressed simply, but also contain a few well-executed innovations.\n\nUpgradability is achieved through decoupling functionality into separate contracts and making the pointers to those contracts governable, rather than through proxy-delegation methods. This keeps things simple while still allowing peripheral parts of the architecture - like Noun rendering - to be updated.\n\nThe rendering method itself is very innovative and worth understanding. NounsDAO has figured out a way to render somewhat sophisticated images entirely on-chain via SVGs, which improves on most other NFT projects including CryptoPunks.\n\nI've read every line of code in this project, and did not find any bugs. This doesn't mean there aren't any, and it might still be worthwhile to have a formal audit. Overall, I was impressed by the smart contracts created by this DAO, and by the innovation of the product as a whole.", "timestamp": 1629911718, "digest": "BqF6OA0uX2msUo4tp_iy9ZH1Dwz-_BWPOEJEoX46Yhg", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "xdDDpLwAoPnu9Tan3ZY1qCpbwOchtK3Zxj99krBMkjc", "title": "CityDAO August Community Roundup", "body": "Table of Contents\n\n1. News & Updates\n2. Shoutouts & Showcases\n3. Tweets we love \n4. Overheard in CityDAO\n5. Resources shared\n6. Memes to go\n\n### What is CityDAO?\n\nThe vision of CityDAO is to build the city of the future on the Ethereum blockchain by tokenizing land, rights, and governance.\n\nSee the landing page below for more information.\n\n## 🔈News & Updates\n\nFirst, let’s do a quick recap of the CityDAO so far: \n\n* July ___ CityDAO starts\n* July _____ First community call\n* July ______ CityDAO discord hits 1000k people\n* July 23, CityDAO officially registered as an LLC in Wyoming\n* ______ CityDAO gets voted in on Mirror’s $WRITE RACE\n* The First Citizen NFT sells for 6.52 eth\n\nNow \n\n## 🖼 Shout-outs & showcases\n\n* nonce crypto hacker house in Seoul\n* Phalius labs (check spelling)\n\n### Checkout this article by @JustinKalland on why he chose to become the first citizen of CityDAO: \n\n[https://city.mirror.xyz/7rtqWC6DBNHbIt87xCPUqkmFcw_3u_ZAK6vahn2IhOI](https://city.mirror.xyz/7rtqWC6DBNHbIt87xCPUqkmFcw_3u_ZAK6vahn2IhOI)\n\n### Creator Cabins just announced applications are open for cohort 3!!\n\n[https://twitter.com/creatorcabins/status/1430224927630692355?s=20](https://twitter.com/creatorcabins/status/1430224927630692355?s=20)\n\n### Build___ is hosting AMAs with people related to DAOS (humbled that CityDAO was included 🙏 ). Here’s the dates & lineup below if you’re interested in joining any: \n\n[https://twitter.com/joinbuild_/status/1430264271418630152](https://twitter.com/joinbuild_/status/1430264271418630152)\n\nSome recent tweets we love:\n\n[https://twitter.com/ljin18/status/1429146390589026306?s=20](https://twitter.com/ljin18/status/1429146390589026306?s=20)\n\n[https://twitter.com/naval/status/1428206525487611907?s=20](https://twitter.com/naval/status/1428206525487611907?s=20)\n\n[https://twitter.com/cdixon/status/1429585831899983876?s=20](https://twitter.com/cdixon/status/1429585831899983876?s=20)\n\n[https://twitter.com/punk6529/status/1429399888786333697?s=20](https://twitter.com/punk6529/status/1429399888786333697?s=20)\n\n[https://twitter.com/nnnnicholas/status/1428102510628294664?s=20](https://twitter.com/nnnnicholas/status/1428102510628294664?s=20)\n\n## 🎤 Overheard in CityDAO\n\n[https://twitter.com/chancecollabs/status/1430088497940025349?s=20](https://twitter.com/chancecollabs/status/1430088497940025349?s=20)\n\n# ☕️ Resources shared in CityDAO\n\n☕️ Shout-out to @jasminew and @scottfits for sharing this super inspiring project:\n\n[https://rewilder.xyz/](https://rewilder.xyz/)\n\n☕️ I know I know I know I’m biased, but someone shared this article in CityDAO and it’s a great read! If you haven’t already, definitely check out 1729.com (a project Balaji & others are working on). \n\n[https://1729.com/how-to-start-a-new-country](https://1729.com/how-to-start-a-new-country)\n\n## 🎨 Meme to go\n\nThat's all for this roundup!\n\nSee y'all next time,\n\n\\-- Chance Taken\n\nPast ", "timestamp": 1629922199, "digest": "_YOhv7aYTGs6jJG01CFF5Cnwv2oph9C9yem9ppz8Jic", "contributor": "0x77aA943A365161e499eaFF59E936a799e6051e15"}
{"id": "md3Ul7Voa7mp9qpNJdghYB9-bO6cHmcSZ0NERy3SGxg", "title": "Decentralized Comments for Mirror", "body": "![](https://images.mirror-media.xyz/publication-images/d8c51ded-9ace-4788-a4c4-3dce0166a29e.jpg?height=640&width=1280)\n\nYou can now comment on my Mirror entries! Here’s how I implemented it in a decentralized way.\n\n\n---\n\nFor a while now I’ve been maintaining a [custom Mirror client](https://github.com/m1guelpf/mirror-next). This allows me to use a custom domain (`m1guelpf.blog` instead of `miguel.mirror.xyz`), provide an [RSS feed](https://m1guelpf.blog/feed.xml) and retain some control over the design.\n\nSo, when I came across [The Convo Space](https://theconvo.space/), a “conversation protocol” built on top of [IPFS](https://ipfs.io/) & [Libp2p](https://libp2p.io/), I decided to try my hand at building a decentralized commenting system for the client.\n\n## Follow the Conversation\n\nTo get started, we need a way of getting the comments for the current entry. TheConvo works with threads and, fortunately, we can make up our own thread IDs. Since Mirror digests are supposed to be unique, we can use those as our thread ID, linking the comments to the entry regardless of the URL it’s displayed at.\n\nWith our thread ID figured out, we can use Vercel’s SWR library to fetch comments on page load.\n\n```js\nconst { data: comments, mutate } = useSWR(\n    `https://theconvo.space/api/comments?apikey=CONVO&threadId=${entry.digest}`,\n    { revalidateOnFocus: false }\n)\n```\n\nThis gets us an array of comments we can loop over, including the comment’s contents, timestamp & address/ENS of the author. Since my design also included an avatar field, I tweaked the fetcher function to look at the avatar field of the commenters’ ENS domains, defaulting to a gradient avatar if they hadn’t set one or didn’t have an ENS domain.\n\n```js\nconst DEFAULT_AVATAR = 'https://cdn.tryshowtime.com/profile_placeholder.jpg'\n\nconst getAvatarFromENS = ensName => {\n    if (! ensName) return DEFAULT_AVATAR\n\n    return serverWeb3\n        .getResolver(ensName)\n        .then(resolver => resolver?.getText('avatar') || DEFAULT_AVATAR)\n}\n\nconst commentFetcher = url =>\n\tfetch(url)\n\t\t.then(res => res.json())\n\t\t.then(comments => Promise.all(comments.map(async comment => ({\n            ...comment,\n            authorAvatar: getAvatarFromENS(comment.authorENS),\n        }))))\n\nconst { data: comments, mutate } = useSWR(\n    `https://theconvo.space/api/comments?apikey=CONVO&threadId=${digest}`,\n    commentFetcher,\n    { revalidateOnFocus: false }\n)\n```\n\n## Inviting the Conversation\n\nWith a system to read comments in place, we now need a way to post them. TheConvo’s process for this is pretty straightforward: [authenticate the user using a personal signature](/post/server-authentication-for-web3) and send an API request to post the comment.\n\n### Please Sign Here\n\nTo authenticate the users, we need to craft a special signature composed of the user’s wallet address and the current timestamp.\n\n```js\nconst timestamp = Date.now()\nconst signerAddress = await web3.getSigner().getAddress()\nconst signature = await web3.getSigner().signMessage(\n    `I allow this site to access my data on The Convo Space using the account ${signerAddress}. Timestamp:${timestamp}`\n)\n\nconst token = await axios.post(\n    'https://theconvo.space/api/auth?apikey=CONVO',\n    { signerAddress, signature, timestamp }\n).then(res => res.data?.message)\n```\n\nThis token will be valid for 1 day, so I wanted to avoid prompting the user for a signature more than once a day. I thought about storing the token on `localStorage` along with an expiry date but ended up going with a cookie, as you can set those to expire automatically. Instead of calling the Convo API directly, I created an API route to handle login.\n\n```js\nimport axios from 'axios'\nimport { serialize } from 'cookie'\n\nconst ONE_DAY = 60 * 60 * 24 * 1000\n\nfunction createCookie(name, data, options = {}) {\n\treturn serialize(name, data, {\n\t\tmaxAge: ONE_DAY,\n\t\texpires: new Date(Date.now() + ONE_DAY * 1000),\n\t\tsecure: process.env.NODE_ENV === 'production',\n\t\tpath: '/',\n\t\thttpOnly: true,\n\t\tsameSite: 'lax',\n\t\t...options,\n\t})\n}\n\nexport default async ({ method, body: { signerAddress, signature, timestamp } }, res) => {\n\tif (method != 'POST') return res.status(405).send('Not Found')\n\n\tconst token = await axios.post(\n        'https://theconvo.space/api/auth?apikey=CONVO',\n        { signerAddress, signature, timestamp }\n    ).then(res => res.data?.message)\n\n\tres.setHeader('Set-Cookie', [\n        createCookie('convo_token', token),\n        createCookie('convo_authed', true, { httpOnly: false })\n    ])\n\n\tres.status(200).end()\n}\n```\n\nNotice how I’m setting two cookies. The first one, `convo_token`, contains the actual token but is not accessible from JS. A second one, `convo_authed`, allows us to check if the token exists from the frontend, without exposing it. Here’s our updated code for the front end.\n\n```js\nconst authenticateConvo = async web3 => {\n\tconst timestamp = Date.now()\n\tconst signerAddress = await web3.getSigner().getAddress()\n\tconst signature = await web3.getSigner().signMessage(\n\t\t`I allow this site to access my data on The Convo Space using the account ${signerAddress}. Timestamp:${timestamp}`\n\t)\n\n\tawait axios.post('/api/comments/login', {\n\t\tsignerAddress, signature, timestamp\n\t})\n}\n\nif (!document.cookie.includes('convo_authed')) authenticateConvo(web3)\n```\n\n### POSTing the Comment\n\nFinally, posting the comment is as simple as making a POST request to the `/api/comments` endpoint. Since the frontend doesn’t have access to the Convo token, I created another API route for this.\n\n```js\nimport axios from 'axios'\n\nexport default async ({ method, headers: { referer }, body: { signerAddress, comment, digest }, cookies: { convo_token } }, res) => {\n\tif (method != 'POST') return res.status(405).send('Not Found')\n\tif (!comment || !digest || !signerAddress) return res.status(400).send('Invalid Params')\n\tif (!convo_token) return res.status(401).send('Unauthorized')\n\n\ttry {\n\t\tawait axios.post(\n            'https://theconvo.space/api/validateAuth?apikey=CONVO',\n            { token: convo_token, signerAddress }\n        )\n\t} catch {\n\t\treturn res.status(401).send('Unauthorized')\n\t}\n\n\tawait axios.post(\n        'https://theconvo.space/api/comments?apikey=CONVO',\n        { token: convo_token, signerAddress, comment, threadId: digest, url: referer }\n    ).then(resp => res.json(resp.data))\n}\n```\n\nBack on the front end, we can use SWR’s mutate function to instantly display the comment at the end of our list (while we retry the request to fetch the new data).\n\n```js\nconst result = await axios.post('/api/comments/post', {\n\tsignerAddress: await web3.getSigner().getAddress(), comment, digest\n}).then(res => res.data)\n\nsetComment('')\nmutate(comments => {\n\tcomments.push({\n\t\t...result,\n\t    authorAvatar: 'https://cdn.tryshowtime.com/profile_placeholder.jpg'\n\t})\n}, true)\n```\n\n## That’s all, folks!\n\nHope you enjoyed the post! The Mirror client I mentioned at the start [is open-source](https://github.com/m1guelpf/mirror-next), and you can look at the commit that added the comment system [here](https://github.com/m1guelpf/mirror-next/commit/3c8f700eb89b6faba0713c14901a686673de18fc).\n\nYou can [follow me on Twitter](https://twitter.com/m1guelpf) to keep up with what I’m building, or leave a comment below to try the whole thing out!", "timestamp": 1629931835, "digest": "o0yDNCC9Y1QXd0l6DeUsVTrAN6bnopAeY7A4Y1bMrwg", "contributor": "0xE340b00B6B622C136fFA5CFf130eC8edCdDCb39D"}
{"id": "y9bOM1pXce9fXVrJEeRavvt0XKRsfxW0yJaCKP56H0M", "title": "Decentralized Comments for Mirror", "body": "![](https://images.mirror-media.xyz/publication-images/d8c51ded-9ace-4788-a4c4-3dce0166a29e.jpg?height=640&width=1280)\n\nYou can now comment on my Mirror entries! Here’s how I implemented it in a decentralized way.\n\n\n---\n\nFor a while now I’ve been maintaining a [custom Mirror client](https://github.com/m1guelpf/mirror-next). This allows me to use a custom domain (`m1guelpf.blog` instead of `miguel.mirror.xyz`), provide an [RSS feed](https://m1guelpf.blog/feed.xml) and retain some control over the design.\n\nSo, when I came across [The Convo Space](https://theconvo.space/), a “conversation protocol” built on top of [IPFS](https://ipfs.io/) & [Libp2p](https://libp2p.io/), I decided to try my hand at building a decentralized commenting system for the client.\n\n## Follow the Conversation\n\nTo get started, we need a way of getting the comments for the current entry. TheConvo works with threads and, fortunately, we can make up our own thread IDs. Since Mirror digests are supposed to be unique, we can use those as our thread ID, linking the comments to the entry regardless of the URL it’s displayed at.\n\nWith our thread ID figured out, we can use Vercel’s SWR library to fetch comments on page load.\n\n```js\nconst { data: comments, mutate } = useSWR(\n    `https://theconvo.space/api/comments?apikey=CONVO&threadId=${entry.digest}`,\n    { revalidateOnFocus: false }\n)\n```\n\nThis gets us an array of comments we can loop over, including the comment’s contents, timestamp & address/ENS of the author. Since my design also included an avatar field, I tweaked the fetcher function to look at the avatar field of the commenters’ ENS domains, defaulting to a gradient avatar if they hadn’t set one or didn’t have an ENS domain.\n\n```js\nconst DEFAULT_AVATAR = 'https://cdn.tryshowtime.com/profile_placeholder.jpg'\n\nconst getAvatarFromENS = ensName => {\n    if (! ensName) return DEFAULT_AVATAR\n\n    return serverWeb3\n        .getResolver(ensName)\n        .then(resolver => resolver?.getText('avatar') || DEFAULT_AVATAR)\n}\n\nconst commentFetcher = url =>\n\tfetch(url)\n\t\t.then(res => res.json())\n\t\t.then(comments => Promise.all(comments.map(async comment => ({\n            ...comment,\n            authorAvatar: getAvatarFromENS(comment.authorENS),\n        }))))\n\nconst { data: comments, mutate } = useSWR(\n    `https://theconvo.space/api/comments?apikey=CONVO&threadId=${digest}`,\n    commentFetcher,\n    { revalidateOnFocus: false }\n)\n```\n\n## Inviting the Conversation\n\nWith a system to read comments in place, we now need a way to post them. TheConvo’s process for this is pretty straightforward: [authenticate the user using a personal signature](/post/server-authentication-for-web3) and send an API request to post the comment.\n\n### Please Sign Here\n\nTo authenticate the users, we need to craft a special signature composed of the user’s wallet address and the current timestamp.\n\n```js\nconst timestamp = Date.now()\nconst signerAddress = await web3.getSigner().getAddress()\nconst signature = await web3.getSigner().signMessage(\n    `I allow this site to access my data on The Convo Space using the account ${signerAddress}. Timestamp:${timestamp}`\n)\n\nconst token = await axios.post(\n    'https://theconvo.space/api/auth?apikey=CONVO',\n    { signerAddress, signature, timestamp }\n).then(res => res.data?.message)\n```\n\nThis token will be valid for 1 day, so I wanted to avoid prompting the user for a signature more than once a day. I thought about storing the token on `localStorage` along with an expiry date but ended up going with a cookie, as you can set those to expire automatically. Instead of calling the Convo API directly, I created an API route to handle login.\n\n```js\nimport axios from 'axios'\nimport { serialize } from 'cookie'\n\nconst ONE_DAY = 60 * 60 * 24 * 1000\n\nfunction createCookie(name, data, options = {}) {\n\treturn serialize(name, data, {\n\t\tmaxAge: ONE_DAY,\n\t\texpires: new Date(Date.now() + ONE_DAY * 1000),\n\t\tsecure: process.env.NODE_ENV === 'production',\n\t\tpath: '/',\n\t\thttpOnly: true,\n\t\tsameSite: 'lax',\n\t\t...options,\n\t})\n}\n\nexport default async ({ method, body: { signerAddress, signature, timestamp } }, res) => {\n\tif (method != 'POST') return res.status(405).send('Not Found')\n\n\tconst token = await axios.post(\n        'https://theconvo.space/api/auth?apikey=CONVO',\n        { signerAddress, signature, timestamp }\n    ).then(res => res.data?.message)\n\n\tres.setHeader('Set-Cookie', [\n        createCookie('convo_token', token),\n        createCookie('convo_authed', true, { httpOnly: false })\n    ])\n\n\tres.status(200).end()\n}\n```\n\nNotice how I’m setting two cookies. The first one, `convo_token`, contains the actual token but is not accessible from JS. A second one, `convo_authed`, allows us to check if the token exists from the frontend, without exposing it. Here’s our updated code for the front end.\n\n```js\nconst authenticateConvo = async web3 => {\n\tconst timestamp = Date.now()\n\tconst signerAddress = await web3.getSigner().getAddress()\n\tconst signature = await web3.getSigner().signMessage(\n\t\t`I allow this site to access my data on The Convo Space using the account ${signerAddress}. Timestamp:${timestamp}`\n\t)\n\n\tawait axios.post('/api/comments/login', {\n\t\tsignerAddress, signature, timestamp\n\t})\n}\n\nif (!document.cookie.includes('convo_authed')) await authenticateConvo(web3)\n```\n\n### POSTing the Comment\n\nFinally, posting the comment is as simple as making a POST request to the `/api/comments` endpoint. Since the frontend doesn’t have access to the Convo token, I created another API route for this.\n\n```js\nimport axios from 'axios'\n\nexport default async ({ method, headers: { referer }, body: { signerAddress, comment, digest }, cookies: { convo_token } }, res) => {\n\tif (method != 'POST') return res.status(405).send('Not Found')\n\tif (!comment || !digest || !signerAddress) return res.status(400).send('Invalid Params')\n\tif (!convo_token) return res.status(401).send('Unauthorized')\n\n\ttry {\n\t\tawait axios.post(\n            'https://theconvo.space/api/validateAuth?apikey=CONVO',\n            { token: convo_token, signerAddress }\n        )\n\t} catch {\n\t\treturn res.status(401).send('Unauthorized')\n\t}\n\n\tawait axios.post(\n        'https://theconvo.space/api/comments?apikey=CONVO',\n        { token: convo_token, signerAddress, comment, threadId: digest, url: referer }\n    ).then(resp => res.json(resp.data))\n}\n```\n\nBack on the front end, we can use SWR’s mutate function to instantly display the comment at the end of our list (while we retry the request to fetch the new data).\n\n```js\nconst result = await axios.post('/api/comments/post', {\n\tsignerAddress: await web3.getSigner().getAddress(), comment, digest\n}).then(res => res.data)\n\nsetComment('')\nmutate(comments => {\n\tcomments.push({\n\t\t...result,\n\t    authorAvatar: 'https://cdn.tryshowtime.com/profile_placeholder.jpg'\n\t})\n}, true)\n```\n\n## That’s all, folks!\n\nHope you enjoyed the post! The Mirror client I mentioned at the start [is open-source](https://github.com/m1guelpf/mirror-next), and you can look at the commit that added the comment system [here](https://github.com/m1guelpf/mirror-next/commit/3c8f700eb89b6faba0713c14901a686673de18fc).\n\nYou can [follow me on Twitter](https://twitter.com/m1guelpf) to keep up with what I’m building, or leave a comment below to try the whole thing out!", "timestamp": 1629933089, "digest": "o0yDNCC9Y1QXd0l6DeUsVTrAN6bnopAeY7A4Y1bMrwg", "contributor": "0xE340b00B6B622C136fFA5CFf130eC8edCdDCb39D"}
{"id": "8V9E5PCt4pxqmPtUcn7zBFFOACs7DBnC-DLG4bxEyn4", "title": "Welcome to The Krause House", "body": "It’s June 12, 1991. A who’s who of Hollywood stars, musicians, and movie executives watch live as the man they call “Magic” is knocked off the proverbial pedestal. Millions more stare at their TVs in awe.\n\nMichael Jordan’s Chicago Bulls just defeated Magic Johnson’s L.A. Lakers to win the NBA championship. The first of six titles for the man better known as “Air Jordan”. Basketball is on the precipice of becoming a global phenomenon, and the NBA is on its way to eventually [earning $8.76 billion in annual revenue.](https://www.investopedia.com/articles/personal-finance/071415/how-nba-makes-money.asp)\n\nYet, 100 years earlier, basketball was just an idea.\n\nIn 1891, [Dr. James Naismith](https://www.biography.com/scholar/james-a-naismith) was a P.E. instructor at the local YMCA in Springfield, Massachusetts. One day, he was asked to create an indoor sport to keep athletes in shape during the frigid winter months. With a set of 13 rules, two peach baskets as goals, and a ball with twine lace stretched across the inseams, the game we know today as basketball was born.\n\n![](https://images.mirror-media.xyz/publication-images/10f0a2ca-5e57-4522-89c3-0519f3fb1458.png?height=1620&width=2880)\n\n> I am sure that no man can derive more pleasure from money or power than I do from seeing a pair of basketball goals in some out of the way place.\n>\n> \\- Dr. James Naismith\n\nThe game of basketball has always been predicated on groups of self-organizing squads coming together to participate. As the years went on, the popularity of the game grew and participation quickly found its lifelong partner, fandom. Now watched by billions of people all over the globe, basketball has quickly become one of the most beloved games in the world.\n\nFandom, whether manifested from players or teams, gives a sense of belonging that’s seldom seen in day-to-day life. To be a fan is to be part of something larger. To feel belonging to a community that shares a common identity. To ride the [rollercoaster of ups and downs](https://www.youtube.com/embed/jNAeoNDsG30), all while staying dedicated to the cause. To be a fan is to love.\n\nAlthough, there's a part of the game that's been missing amongst fans since it’s inception. A level of integration we could share as fans that even Dr. Naismith couldn't have predicted. Ownership.\n\nBefore we dive into who we are and the mission we set to achieve, it's important to define what ownership means. Is ownership merely symbolism for more influence? A state of possession? Means of authority?\n\nAs we usher in a new era of new institutions and collective commons, ownership will take on a new meaning. We’ve seen the internet transition over the decades from read, to read-write, and now read-write-execute. This makes the internet a place not only for transactions, but for connection, thought, and programmable democracy. Agreements can now be automated on the application and organizational level, where the players can define business logic and behavioral rulesets for all participants. For all intents and purposes, products and organizations can be owned by the players that built them.\n\nIf Web 2.0 was defined as the frontend revolution, Web 3.0 is the execution revolution. Squads, up until now, have been dependent on centralized monoliths for communication, participation, and transactions.  The atomic unit of the internet is the individual, yet corporations hold majority of the power.\n\n![](https://images.mirror-media.xyz/publication-images/4b257805-3378-4878-8cc8-af46de03c9ef.jpeg?height=433&width=628)\n\nWeb 3.0 fundamentally changes that…\n\n* What does a group chat bank account or cap table look like?\n* What kind of superpowers does a native squad currency unlock?\n* How can collectives come together to glean upside, reciprocity, and socialized risk?\n* How can online teams band together to do the unimaginable?\n\n## \\* Krause House has entered the chat \\*\n\n[The Krause House](https://krausehouse.club/) is a community of hoop fanatics that are *just* crazy enough to buy an NBA team. To our members, being a fan isn’t enough. This is a squad made of wet jumpers and saucy crossovers that refuse to sit on the sidelines.\n\nTeam ownership shouldn’t be limited to a handful of billionaires, but rather a movement of individuals that want to be a part of the greatest professional league in the world. Fans breed life to the organizations in which they attach, so isn't it reasonable to accept a shared portion of the ownership and upside? We don't think it's merely acceptable, but mandatory.\n\nThe Krause House is a Decentralized Autonomous Organization (DAO) governed by the community, the fans, the basketball lovers and purists. Together we will write the consensus rules that will bring the first fan-governed team to the game as first participants, then fans, and now owners. The collective of ambitious contributors whose goal is to own an NBA team describes the underlying mission of DAOs in its purest form: *Difficult by one, achievable by many*.\n\nWe will allow our members to participate in decisions affecting the operating procedures of a National Basketball Association (NBA) team including but not limited to ticketing, merchandising, partnerships, and general management of players and coaches.\n\nAs a DAO, we embrace the label of an online cooperative with open arms. We champion evolving organizational mechanics and practices from that of traditional hierarchies.  We prioritize ownership and autonomy. We value culture over structure. As the membership grows, so does the interdependence. Building confidence brought forth by the consistency of socialization and self-actualization. Put simply, we’re a tribe with a vibe.\n\n## Who’s got next?\n\n![](https://images.mirror-media.xyz/publication-images/8248a5f8-54a7-42eb-a4a7-4ea921784db8.jpeg?height=500&width=956)\n\nIn the weeks to come, Krause House will launch its inaugural Season 1. We’re scouting contributors who want to actively participate in our mission to own and operate an NBA team as a DAO. All skill sets and skill levels are welcome.\n\nWe believe championship teams are defined by the role players. The first ones in the gym, but the last to leave. Ones who celebrate making free throws as much as breaking ankles. Ones who think in terms of we, not me.\n\nWe’re looking for [The Mamba Mentality.](https://www.youtube.com/watch?v=4gi9y3sTrXE)\n\nTo be the world’s first fan-owned and operated NBA team is no small feat. Do you have the burning desire to own an NBA team? The passion to contribute to a community of fanatics just as die-hard as you? Join us and embrace the movement.\n\nThe revolution will not be centralized…\n\nDiscord: <https://discord.com/invite/3bJwMCUEbe>\n\nTwitter: <https://twitter.com/KrauseHouseDAO>", "timestamp": 1629938880, "digest": "-ygteS-daiuSrk-szUsbt_cavFbGCAHNKiwgLnkEEEM", "contributor": "0x5715E8a86c4b785dE5114ed9b2233C566f73756C"}
{"id": "xA837V9pueEaoUwx6ij0TABoYuUeb8nAlLtiuJAbQss", "title": "Tutorial: How to Purchase an NFT on OpenSea", "body": "Today, we’re showing you **how to purchase a non-fungible token (NFT) on [Opensea](https://opensea.io/)** - by writing a post on Mirror and listing it as an NFT itself. \n\n## What you will need for this Quest:\n\n* ETH to purchase the NFT and cover gas fees \n* MetaMask wallet (or another web3 wallet)\n\n## What is OpenSea?\n\n![OpenSea's homepage](https://images.mirror-media.xyz/publication-images/b2a1ee39-d38f-4ec1-84a4-30a5d15d0f0c.png?height=616&width=1432)\n\nOpenSea is a peer-to-peer marketplace for NFTs – showcasing everything from digital collectibles and art to virtual land and utility tokens. \n\nThink of OpenSea as the eBay of NFTs, where you can bid on an NFT auction, mint and sell your own NFT, or explore the wild west of non-fungibles. OpenSea is where most NFT collectors go to discover almost any project.\n\n## How to Purchase an NFT on Opensea \n\n### Step 1: Choose your NFT on OpenSea.\n\nGo to [OpenSea](https://opensea.io/) and choose which NFT you want to buy.\n\nFor the purposes of this tutorial, simply **choose an NFT on OpenSea that you love** and would be happy holding on to for the long term. \n\n***Note****: you may need to pay additional gas fees if it’s your first time purchasing on OpenSea.*\n\n### Step 2: Click “Buy Now” or “Place Bid”\n\nSome NFTs are on auction while others can be bought right away. \n\nFor this tutorial, we will buy an NFT that is ready for immediate purchase. \n\nClick “Buy Now” and agree to OpenSea’s Terms of Service.\n\n![](https://images.mirror-media.xyz/publication-images/ead79986-eada-4887-8430-66a6d6f41ae9.png?height=145&width=586)\n\n### Step 3: Agree to OpenSea’s Terms of Service and Checkout.\n\nOnce you check the box, and click “Checkout\", you will be prompted to pay ETH gas fees for your NFT. Set the amount of gas fees and confirm your NFT purchase.\n\n![](https://images.mirror-media.xyz/publication-images/d1c7722e-9cf6-4475-b3d5-cddfef80d34e.png?height=146&width=502)\n\n### Step 4: Wait for confirmation.\n\nNow you wait! Depending how much gas you used, it could take up to 30 minutes or longer for the payment to confirm.\n\nOnce confirmed, your NFT will be in your wallet and displayed on your OpenSea profile. \n\n### That’s all you need! \n\nCongratulations on buying an NFT on OpenSea. You can now show your NFT off to all of your friends.\n\nPlease let me know if this tutorial was helpful (I could have gone into more detail but wanted to keep this short and sweet) or if you have any questions whatsoever in the RabbitHole Discord. \n\nSee you on the other side of the RabbitHole!", "timestamp": 1629942288, "digest": "6UF5AgtcoSBgHvJR_-ZvAyBEJiiCEINP1SEXsRpe2NM", "contributor": "0xF69EFCc2dECE59Fbc75B23aE75f51DD7Be3bb1E1"}
{"id": "dJ8hvL-lZxmDLYIj-cTeSDTXpfdiIzbqqhj7Mw2ynSw", "title": "DAO Landscape", "body": "DAOs have taken center stage.\n\nEver since 14% of the entire ETH supply was locked in [The DAO](https://en.wikipedia.org/wiki/The_DAO_(organization)) in early 2016, we’ve spent the last five years distilling what it means to coordinate digital working groups.\n\n**DAOs are internet communities with a shared cap table and bank account.**\n\nMembers work together to create, distribute and capture value relative to a shared mission. Ownership shares economic, social and political components, creating best practices for digital coordination.\n\nIn this post, we’ll break down the DAO landscape and examine the relationship between financial and social capital.\n\n![DAO Landscape Cover](https://images.mirror-media.xyz/publication-images/ed6f1c94-5204-4eca-95d4-804f189f3ed3.jpeg?height=1440&width=2560)\n\n*The DAOs mentioned in this post are non-comprehensive. I definitely missed some. If your DAO wasn’t mentioned, you probably missed [this tweet.](https://twitter.com/Cooopahtroopa/status/1407458878246121475?s=20\\*)*\n\n## What is a DAO?\n\nA DAO is a commitment to share value with a community.\n\nDAOs seek to:\n\n* Provide members with a voice through governance.\n* Flatten hierarchy and create fluid workstreams.\n* Allocate resources to achieve a core mission.\n\nA Telegram group with 10 members and 1 ETH is a DAO.\n\nA DeFi protocol with $1B+ of assets governed on-chain by 10,000+ token holders is a DAO.\n\n**Regardless of size, DAOs look to solve core missions - evolving a group chat into a success-driven community.**\n\n## DAO Landscape\n\nToday, there are more than 100 DAOs managing over $10B in assets.\n\n![DAO Landscape 2021](https://images.mirror-media.xyz/publication-images/5d496d8a-8119-4a79-ad40-fe6a754903b5.jpeg?height=2880&width=5120)\n\n### DAO Operating Systems\n\nThe first chapter of DAOs are the operating systems used to create them.\n\nThese projects offer different templates, frameworks and tools for communities to pool resources and start their first DAO.\n\nThey commonly offer smart contracts and interfaces to facilitate on-chain actions for decentralized communities.\n\n**DAO Operating Systems make it easy for anyone to start a DAO with limited technical skills.**\n\n### Grants DAOs\n\nThe first real use case for DAOs were grants.\n\nCommunities donate funds and use a DAO to vote on how that capital is allocated to various contributors in the form of governance proposals.\n\nGovernance of Grants DAOs was originally conducted through non-transferable shares, meaning participation was largely motivated by social capital over financial returns.\n\n**Grants DAOs show that niche communities are [more nimble](https://molochdao.medium.com/moloch-2019-year-in-review-eb6f53dc035) in capital allocation than formal bodies.**\n\n### Protocol DAOs\n\nProtocol DAOs transition power from a core team into the hands of the community, spawning a new way for projects to issue fungible tokens into the market.\n\nWhereas the first chapter of DAOs featured non-transferable shares, Protocol DAOs were the first to issue transferable ERC20 tokens with a secondary market value.\n\nThese tokens are commonly used to govern protocols, meaning tokenholders have the sole authority to propose, vote on and implement changes to the underlying mechanics of the network.\n\nProjects commonly vote on how to distribute tokens, thus opening the doors to liquidity mining, yield farming, fair launches and everything in between.\n\n**Protocol DAOs provided a framework for any network to issue a token that was (hopefully) owned and operated by its community.**\n\n### Investment DAOs\n\nWith Protocol DAOs bringing new tokens into the world, it only seemed logical that groups band together to invest in them.\n\nAfter a long period of non-profit DAOs, investment clubs flipped the switch for members to focus on generating a return.\n\nWhile these DAOs come with a lot more legal restrictions than a Grants DAO, they showed that any group of individuals could come together to invest larger amounts of capital with low barriers to entry.\n\n**Investment DAOs allow members to pool capital and invest in projects at their earliest stages.**\n\n### Service DAOs\n\nWith so many tokens coming into the world, projects need talent. Service DAOs are talent allocators, using on-chain credentials to funnel and allocate resources from one DAO to another.\n\nService DAOs create decentralized working groups for individuals to work for the open internet - essentially acting as crypto-native talent agencies.\n\nFrom legal to creative, governance to marketing, development to treasury management, Service DAOs create funnels to contract web3 mercenaries. Work is often rewarded with ERC20 tokens - providing ownership over the value created for a network.\n\n**Service DAOs explore the future of work, and what employment looks like in crypto-native world.**\n\n### Social DAOs\n\nWhat does it mean to be a member of a DAO?\n\nIn an industry dominated by speculation, Social DAOs focus on social capital over financial capital. Social DAOs are the natural evolution of group chats, where friends become co-workers.\n\nWhere social media turned everybody into a media company, Social DAOs turn every group chat into a digital business.\n\nThey challenge what it means to be a part of a community and offer ways to lean into becoming a part of a digitally-native tribe.\n\n**Social DAOs show that there is more to crypto than making a quick buck, and that the internet is the best place to meet people with similar interests.**\n\n### Collector DAOs\n\nNFTs. You’ve heard of them - and for a while, you couldn’t ignore them.\n\nOn the back of mainstream adoption, Collector DAOs popped up to collect them.\n\nCurator groups act as the underlying glue behind a specific artist, platform or series to help establish longevity.\n\n**Collector DAOs seek to curate which NFTs have long-term value.**\n\n### Media DAOs\n\nIn an age when information is globally accessible, ownership of the narratives through which they are distributed should be, too.\n\nMedia DAOs give that power back to those who consume the content.\n\nThey break down the way in which writers, streamers, and readers engage with the content they release. Whether it be media mining programs to incentivize contributions or governance over which topics make the front page, Media DAOs turn consumption into a two-way street.\n\n**Media DAOs share an outlet’s open agenda to spread awareness and news.**\n\n## DAO Tools\n\nAcross the board, a suite of tools are acting as the defacto standard for most DAOs today.\n\n*[Gnosis Safe](https://gnosis-safe.io/)* - Multisig wallets commonly used to manage community treasuries.\n\n*[Snapshot](https://snapshot.org/#/)* - Off-chain voting platform for easy token-based governance.\n\n*[Discourse](https://www.discourse.org/)* - Forum commonly used to discuss governance proposals.\n\n*[CollabLand](https://collab.land/)* - Bots providing token-gated access and tipping to community chat groups.\n\n*[Coordinape](https://coordinape.com/)* - Coordination game to determine which contributors(s) deserve token rewards.\n\n*[Parcel](https://parcel.money/)* - Treasury management to easily track and send payments.\n\n*[SourceCred](https://sourcecred.io/)* - Instance to track community participation and reward active members.\n\n*[Mirror](https://mirror.xyz/race)* - Finance creative projects through tokenized crowdfunds.\n\n*[Tally](https://www.withtally.com/)* - Governance dashboard to track on-chain voting history across different protocols.\n\n*[Boardroom](https://boardroom.info/)* - Governance hub for tokenholder management to empower key decision making.\n\n*[Sybil](https://sybil.org/#/)* - Create and track on-chain governance delegation.\n\n*[RabbitHole](https://rabbithole.gg/)* - Reward tokens for completing specific on-chain tasks.\n\nTogether, this stack allows anyone to spin up a treasury, introduce governance, reward key contributions and engage communities in ongoing discussions.\n\nNot bad!\n\n## How DAOs Evolve\n\nDAOs live on a spectrum.\n\n![](https://images.mirror-media.xyz/publication-images/73d3af5f-c315-420f-b2e5-d6dddbe47ecc.jpeg?height=2880&width=5120)\n\nThe lightest DAOs are social-first with off-chain governance. The goal is to create active discussion and communal belonging - more than to generate a profit.\n\nThe heaviest DAOs have tremendous amounts of capital at stake, requiring on-chain governance to execute and ratify proposals.\n\nWhat we’re currently witnessing is a shift from very heavy protocols to extremely light micro-economies.\n\nhttps://twitter.com/Cooopahtroopa/status/1392975646108778498\n\nCommunities are creating social DAOs in real-time, rather than being restricted to on-chain structures to get started.\n\nFor the heavier DAOs, on-chain proposals are creating and empowering lighter, off-chain working groups. This is best highlighted by the recent growth around Grants DAOs, allowing trusted community members to move faster with funds, rather than having to meet quorum to execute simple payments.\n\nAs DAOs gain momentum, it’s common to see [Treasury Diversification proposals](https://research.lido.fi/t/proposal-ldo-treasury-diversification-part-2/506). These events allow the wider community to contribute directly to a DAO treasury in exchange for its native token(s).\n\nThis shift signals that fundraising can apply to a community-wide treasury, rather than being managed solely by a core team.\n\nOnce runway is secured, DAOs need to figure out how to put it to work. The evolution of working groups and subcommittees is one I’m deeply fascinated by, and something we’re watching play out in real-time.\n\n## DAO Mercenaries\n\nDAOs mature on the back of community-driven services and governance.\n\nAs treasuries grow in size and communities grow in quality, core contributions become more and more important to keep the ball rolling.\n\nThrough [Fire Eyes DAO](https://www.fireeyes.xyz/), I’ve been lucky enough to pass on-chain proposals on protocols like Aave, Balancer, Rocket Pool and Gitcoin.\n\nGovernance will become increasingly more important, and feature a much wider design diamond of possibilities. With this, so will the number of teams working to put capital to work through on-chain proposals.\n\nFrom grants to payroll, token swaps to M&A - expect the next wave of mercenaries to show why web3 governance is a complete paradigm shift. (more on this topic to come in my next post).\n\nVery soon, we could see a world where **DAOs are the new LLCs.**\n\nIt feels inevitable that tokens will eventually replace equity, and with it - so will the legacy legal structures that underpin them.\n\n## Just DAO It\n\nThis post was published in June, 2021.\n\nBelow is a growing list of resources to keep up with DAOs, their growth and the key people to watch. This list will be updated periodically, so please DM me with anything worth adding to the list!\n\n\\[Julia Lipton\\] - [Open Source DAO Market Research](https://docs.google.com/spreadsheets/d/16IDgIyPcfwJGG-zmXeMAenYbePQVHkc2P6WCwKEZgpk/edit#gid=0)\n\\[pet3rpan\\] - [How to Grow Decentralized Communities](https://medium.com/1kxnetwork/how-to-grow-decentralized-communities-1bf1044924f8)\n\\[Linda Xie\\] - [A Beginner’s Guide to DAOs](https://linda.mirror.xyz/Vh8K4leCGEO06_qSGx-vS5lvgUqhqkCz9ut81WwCP2o)\n\\[Kinjal Shah\\] - [DAOs & Creators - Resources to Get Started Today](https://kinjal.mirror.xyz/eD3-Sgv2h50j-kwjHQCOnwqMKqSLTfnrqrtNypU-P5k)\n\\[Cooper Turley\\] - [How to Launch a Token](https://forefront.news/blog/how-to-launch-a-token)\n\\[Bankless\\] - [Life of a Protocol Politician](https://newsletter.banklesshq.com/p/the-life-of-a-protocol-politician)\n\\[Kevin Owocki\\] - [Know Thy Enemy - Coordination Failures](https://newsletter.banklesshq.com/p/know-thy-enemy-coordination-failures)\n\\[Packy McCormack\\] - [The DAO of DAOs](https://www.notboring.co/p/the-dao-of-daos-5b9)\n\\[Packy McCormack\\] - [Cooperation Economy](https://www.notboring.co/p/the-cooperation-economy-)\n\\[Patrick Rivera\\] - [A Guide to Crypto Tokens](https://future.a16z.com/a-taxonomy-of-tokens-distinctions-with-a-difference/)\n\\[pet3rpan\\] - [An Introduction to DAOs](https://medium.com/metawork/an-introduction-to-daos-782e3817e2cd)\n\\[Vitalik Buterin\\] - [DAOs, DACs, DAs and More: An Incomplete Terminology Guide](https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/)\n\nTo the DAO contributors of the world - keep up the great work.\n\nWe’ve got a long way to go before DAOs have proven real traction at scale, but this snapshot should show that some of the world’s brightest minds are committed to making that happen.\n\nIn the meantime, keep shipping and remember… when in doubt - **Just DAO It.**\n\n*Special thanks to Carlos Gomes for the graphics and to Li Jin, Jesse Walden, Pet3rpan, Lucas Campbell, Kinjal Shah, Jess Sloss, Brian Flynn, Jake Chervinsky, Packy McCormick, and Alex Zhang for their feedback!*\n\nWant to continue the conversation? Here's your chance!\n\n[auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3773&auctionId=0xc001ca3aff4414dd7a9d0e8be9cc41367838ad624d2886484ded285a20d3d94e](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3773&auctionId=0xc001ca3aff4414dd7a9d0e8be9cc41367838ad624d2886484ded285a20d3d94e)\n\nLooking to offer more passive support? Leave a tip!\n\n[split://0xa01Ed7E91835c82C21FF0cB823b859757Bc8be57?network=mainnet](split://0xa01Ed7E91835c82C21FF0cB823b859757Bc8be57?network=mainnet)\n\n", "timestamp": 1629957391, "digest": "_EDyn4cs9tDoOxNGZLfKL7JjLo5rGkkEfRa_a-6VEWw", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "i_r76hPML6xn95Tt0YVSQ9H289l5SbHr9ne4EozC0wk", "title": "DAO Landscape", "body": "DAOs have taken center stage.\n\nEver since 14% of the entire ETH supply was locked in [The DAO](https://en.wikipedia.org/wiki/The_DAO_(organization)) in early 2016, we’ve spent the last five years distilling what it means to coordinate digital working groups.\n\n**DAOs are internet communities with a shared cap table and bank account.**\n\nMembers work together to create, distribute and capture value relative to a shared mission. Ownership shares economic, social and political components, creating best practices for digital coordination.\n\nIn this post, we’ll break down the DAO landscape and examine the relationship between financial and social capital.\n\n![DAO Landscape Cover](https://images.mirror-media.xyz/publication-images/ed6f1c94-5204-4eca-95d4-804f189f3ed3.jpeg?height=1440&width=2560)\n\n*The DAOs mentioned in this post are non-comprehensive. I definitely missed some. If your DAO wasn’t mentioned, you probably missed [this tweet.](https://twitter.com/Cooopahtroopa/status/1407458878246121475?s=20\\*)*\n\n## What is a DAO?\n\nA DAO is a commitment to share value with a community.\n\nDAOs seek to:\n\n* Provide members with a voice through governance.\n* Flatten hierarchy and create fluid workstreams.\n* Allocate resources to achieve a core mission.\n\nA Telegram group with 10 members and 1 ETH is a DAO.\n\nA DeFi protocol with $1B+ of assets governed on-chain by 10,000+ token holders is a DAO.\n\n**Regardless of size, DAOs look to solve core missions - evolving a group chat into a success-driven community.**\n\n## DAO Landscape\n\nToday, there are more than 100 DAOs managing over $10B in assets.\n\n![DAO Landscape 2021](https://images.mirror-media.xyz/publication-images/5d496d8a-8119-4a79-ad40-fe6a754903b5.jpeg?height=2880&width=5120)\n\n### DAO Operating Systems\n\nThe first chapter of DAOs are the operating systems used to create them.\n\nThese projects offer different templates, frameworks and tools for communities to pool resources and start their first DAO.\n\nThey commonly offer smart contracts and interfaces to facilitate on-chain actions for decentralized communities.\n\n**DAO Operating Systems make it easy for anyone to start a DAO with limited technical skills.**\n\n### Grants DAOs\n\nThe first real use case for DAOs were grants.\n\nCommunities donate funds and use a DAO to vote on how that capital is allocated to various contributors in the form of governance proposals.\n\nGovernance of Grants DAOs was originally conducted through non-transferable shares, meaning participation was largely motivated by social capital over financial returns.\n\n**Grants DAOs show that niche communities are [more nimble](https://molochdao.medium.com/moloch-2019-year-in-review-eb6f53dc035) in capital allocation than formal bodies.**\n\n### Protocol DAOs\n\nProtocol DAOs transition power from a core team into the hands of the community, spawning a new way for projects to issue fungible tokens into the market.\n\nWhereas the first chapter of DAOs featured non-transferable shares, Protocol DAOs were the first to issue transferable ERC20 tokens with a secondary market value.\n\nThese tokens are commonly used to govern protocols, meaning tokenholders have the sole authority to propose, vote on and implement changes to the underlying mechanics of the network.\n\nProjects commonly vote on how to distribute tokens, thus opening the doors to liquidity mining, yield farming, fair launches and everything in between.\n\n**Protocol DAOs provided a framework for any network to issue a token that was (hopefully) owned and operated by its community.**\n\n### Investment DAOs\n\nWith Protocol DAOs bringing new tokens into the world, it only seemed logical that groups band together to invest in them.\n\nAfter a long period of non-profit DAOs, investment clubs flipped the switch for members to focus on generating a return.\n\nWhile these DAOs come with a lot more legal restrictions than a Grants DAO, they showed that any group of individuals could come together to invest larger amounts of capital with low barriers to entry.\n\n**Investment DAOs allow members to pool capital and invest in projects at their earliest stages.**\n\n### Service DAOs\n\nWith so many tokens coming into the world, projects need talent. Service DAOs are talent allocators, using on-chain credentials to funnel and allocate resources from one DAO to another.\n\nService DAOs create decentralized working groups for individuals to work for the open internet - essentially acting as crypto-native talent agencies.\n\nFrom legal to creative, governance to marketing, development to treasury management, Service DAOs create funnels to contract web3 mercenaries. Work is often rewarded with ERC20 tokens - providing ownership over the value created for a network.\n\n**Service DAOs explore the future of work, and what employment looks like in crypto-native world.**\n\n### Social DAOs\n\nWhat does it mean to be a member of a DAO?\n\nIn an industry dominated by speculation, Social DAOs focus on social capital over financial capital. Social DAOs are the natural evolution of group chats, where friends become co-workers.\n\nWhere social media turned everybody into a media company, Social DAOs turn every group chat into a digital business.\n\nThey challenge what it means to be a part of a community and offer ways to lean into becoming a part of a digitally-native tribe.\n\n**Social DAOs show that there is more to crypto than making a quick buck, and that the internet is the best place to meet people with similar interests.**\n\n### Collector DAOs\n\nNFTs. You’ve heard of them - and for a while, you couldn’t ignore them.\n\nOn the back of mainstream adoption, Collector DAOs popped up to collect them.\n\nCurator groups act as the underlying glue behind a specific artist, platform or series to help establish longevity.\n\n**Collector DAOs seek to curate which NFTs have long-term value.**\n\n### Media DAOs\n\nIn an age when information is globally accessible, ownership of the narratives through which they are distributed should be, too.\n\nMedia DAOs give that power back to those who consume the content.\n\nThey break down the way in which writers, streamers, and readers engage with the content they release. Whether it be media mining programs to incentivize contributions or governance over which topics make the front page, Media DAOs turn consumption into a two-way street.\n\n**Media DAOs share an outlet’s open agenda to spread awareness and news.**\n\n## DAO Tools\n\nAcross the board, a suite of tools are acting as the defacto standard for most DAOs today.\n\n*[Gnosis Safe](https://gnosis-safe.io/)* - Multisig wallets commonly used to manage community treasuries.\n\n*[Snapshot](https://snapshot.org/#/)* - Off-chain voting platform for easy token-based governance.\n\n*[Discourse](https://www.discourse.org/)* - Forum commonly used to discuss governance proposals.\n\n*[CollabLand](https://collab.land/)* - Bots providing token-gated access and tipping to community chat groups.\n\n*[Coordinape](https://coordinape.com/)* - Coordination game to determine which contributors(s) deserve token rewards.\n\n*[Parcel](https://parcel.money/)* - Treasury management to easily track and send payments.\n\n*[SourceCred](https://sourcecred.io/)* - Instance to track community participation and reward active members.\n\n*[Mirror](https://mirror.xyz/race)* - Finance creative projects through tokenized crowdfunds.\n\n*[Tally](https://www.withtally.com/)* - Governance dashboard to track on-chain voting history across different protocols.\n\n*[Boardroom](https://boardroom.info/)* - Governance hub for tokenholder management to empower key decision making.\n\n*[Sybil](https://sybil.org/#/)* - Create and track on-chain governance delegation.\n\n*[RabbitHole](https://rabbithole.gg/)* - Reward tokens for completing specific on-chain tasks.\n\nTogether, this stack allows anyone to spin up a treasury, introduce governance, reward key contributions and engage communities in ongoing discussions.\n\nNot bad!\n\n## How DAOs Evolve\n\nDAOs live on a spectrum.\n\n![](https://images.mirror-media.xyz/publication-images/73d3af5f-c315-420f-b2e5-d6dddbe47ecc.jpeg?height=2880&width=5120)\n\nThe lightest DAOs are social-first with off-chain governance. The goal is to create active discussion and communal belonging - more than to generate a profit.\n\nThe heaviest DAOs have tremendous amounts of capital at stake, requiring on-chain governance to execute and ratify proposals.\n\nWhat we’re currently witnessing is a shift from very heavy protocols to extremely light micro-economies.\n\nhttps://twitter.com/Cooopahtroopa/status/1392975646108778498\n\nCommunities are creating social DAOs in real-time, rather than being restricted to on-chain structures to get started.\n\nFor the heavier DAOs, on-chain proposals are creating and empowering lighter, off-chain working groups. This is best highlighted by the recent growth around Grants DAOs, allowing trusted community members to move faster with funds, rather than having to meet quorum to execute simple payments.\n\nAs DAOs gain momentum, it’s common to see [Treasury Diversification proposals](https://research.lido.fi/t/proposal-ldo-treasury-diversification-part-2/506). These events allow the wider community to contribute directly to a DAO treasury in exchange for its native token(s).\n\nThis shift signals that fundraising can apply to a community-wide treasury, rather than being managed solely by a core team.\n\nOnce runway is secured, DAOs need to figure out how to put it to work. The evolution of working groups and subcommittees is one I’m deeply fascinated by, and something we’re watching play out in real-time.\n\n## DAO Mercenaries\n\nDAOs mature on the back of community-driven services and governance.\n\nAs treasuries grow in size and communities grow in quality, core contributions become more and more important to keep the ball rolling.\n\nThrough [Fire Eyes DAO](https://www.fireeyes.xyz/), I’ve been lucky enough to pass on-chain proposals on protocols like Aave, Balancer, Rocket Pool and Gitcoin.\n\nGovernance will become increasingly more important, and feature a much wider design diamond of possibilities. With this, so will the number of teams working to put capital to work through on-chain proposals.\n\nFrom grants to payroll, token swaps to M&A - expect the next wave of mercenaries to show why web3 governance is a complete paradigm shift. (more on this topic to come in my next post).\n\nVery soon, we could see a world where **DAOs are the new LLCs.**\n\nIt feels inevitable that tokens will eventually replace equity, and with it - so will the legacy legal structures that underpin them.\n\n## Just DAO It\n\nThis post was published in June, 2021. Last updated August 2021.\n\nBelow is a growing list of resources to keep up with DAOs, their growth and the key people to watch. This list will be updated periodically, please share anything worth adding!\n\n\\[Clay Robbins\\] - [DAO Nation](https://clay.mirror.xyz/DwJ60O0R1IyRiPAZFBw4L05L3fd8PPxWnzDNedKtOas)\n\n\\[Gaby Goldberg\\] - [Curators All the Way Down](https://gaby.mirror.xyz/qvnNJhylZz-w6t4ubZzHfxd5gP17zDAXa6ruwOyO7sc)\n\n\\[Alex Zhang\\] - [Evolution of the FWB DAO](https://zhang.mirror.xyz/9sRa2kNDUpkWoQkWw67bJ8PczFyTSX8fotf7JOddxew)\n\n\\[Julia Lipton\\] - [Open Source DAO Market Research](https://docs.google.com/spreadsheets/d/16IDgIyPcfwJGG-zmXeMAenYbePQVHkc2P6WCwKEZgpk/edit#gid=0)\n\\[pet3rpan\\] - [How to Grow Decentralized Communities](https://medium.com/1kxnetwork/how-to-grow-decentralized-communities-1bf1044924f8)\n\\[Linda Xie\\] - [A Beginner’s Guide to DAOs](https://linda.mirror.xyz/Vh8K4leCGEO06_qSGx-vS5lvgUqhqkCz9ut81WwCP2o)\n\\[Kinjal Shah\\] - [DAOs & Creators - Resources to Get Started Today](https://kinjal.mirror.xyz/eD3-Sgv2h50j-kwjHQCOnwqMKqSLTfnrqrtNypU-P5k)\n\\[Cooper Turley\\] - [How to Launch a Token](https://forefront.news/blog/how-to-launch-a-token)\n\\[Bankless\\] - [Life of a Protocol Politician](https://newsletter.banklesshq.com/p/the-life-of-a-protocol-politician)\n\\[Kevin Owocki\\] - [Know Thy Enemy - Coordination Failures](https://newsletter.banklesshq.com/p/know-thy-enemy-coordination-failures)\n\\[Packy McCormack\\] - [The DAO of DAOs](https://www.notboring.co/p/the-dao-of-daos-5b9)\n\\[Packy McCormack\\] - [Cooperation Economy](https://www.notboring.co/p/the-cooperation-economy-)\n\\[Patrick Rivera\\] - [A Guide to Crypto Tokens](https://future.a16z.com/a-taxonomy-of-tokens-distinctions-with-a-difference/)\n\\[pet3rpan\\] - [An Introduction to DAOs](https://medium.com/metawork/an-introduction-to-daos-782e3817e2cd)\n\\[Vitalik Buterin\\] - [DAOs, DACs, DAs and More: An Incomplete Terminology Guide](https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/) \\n \\[YOUR ARTICLE HERE\\]  - [DM me](https://twitter.com/Cooopahtroopa) :)\n\nTo the DAO contributors of the world - keep up the great work.\n\nWe’ve got a long way to go before DAOs have proven real traction at scale, but this snapshot should show that some of the world’s brightest minds are committed to making that happen.\n\nIn the meantime, keep shipping and remember… when in doubt - **Just DAO It.**\n\n*Special thanks to Carlos Gomes for the graphics and to Li Jin, Jesse Walden, Pet3rpan, Lucas Campbell, Kinjal Shah, Jess Sloss, Brian Flynn, Jake Chervinsky, Packy McCormick, and Alex Zhang for their feedback!*\n\nWant to continue the conversation? Here's your chance!\n\n[auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3773&auctionId=0xc001ca3aff4414dd7a9d0e8be9cc41367838ad624d2886484ded285a20d3d94e](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3773&auctionId=0xc001ca3aff4414dd7a9d0e8be9cc41367838ad624d2886484ded285a20d3d94e)\n\nLooking to offer more passive support? Leave a tip!\n\n[split://0xa01Ed7E91835c82C21FF0cB823b859757Bc8be57?network=mainnet](split://0xa01Ed7E91835c82C21FF0cB823b859757Bc8be57?network=mainnet)\n\n", "timestamp": 1629958182, "digest": "_EDyn4cs9tDoOxNGZLfKL7JjLo5rGkkEfRa_a-6VEWw", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "w9484wI1jmZScR3dsg3VZCrMysDjNBPoo37UEan6YwU", "title": "DAO Landscape", "body": "DAOs have taken center stage.\n\nEver since 14% of the entire ETH supply was locked in [The DAO](https://en.wikipedia.org/wiki/The_DAO_(organization)) in early 2016, we’ve spent the last five years distilling what it means to coordinate digital working groups.\n\n**DAOs are internet communities with a shared cap table and bank account.**\n\nMembers work together to create, distribute and capture value relative to a shared mission. Ownership shares economic, social and political components, creating best practices for digital coordination.\n\nIn this post, we’ll break down the DAO landscape and examine the relationship between financial and social capital.\n\n![DAO Landscape Cover](https://images.mirror-media.xyz/publication-images/ed6f1c94-5204-4eca-95d4-804f189f3ed3.jpeg?height=1440&width=2560)\n\n*The DAOs mentioned in this post are non-comprehensive. I definitely missed some. If your DAO wasn’t mentioned, you probably missed [this tweet.](https://twitter.com/Cooopahtroopa/status/1407458878246121475?s=20\\*)*\n\n## What is a DAO?\n\nA DAO is a commitment to share value with a community.\n\nDAOs seek to:\n\n* Provide members with a voice through governance.\n* Flatten hierarchy and create fluid workstreams.\n* Allocate resources to achieve a core mission.\n\nA Telegram group with 10 members and 1 ETH is a DAO.\n\nA DeFi protocol with $1B+ of assets governed on-chain by 10,000+ token holders is a DAO.\n\n**Regardless of size, DAOs look to solve core missions - evolving a group chat into a success-driven community.**\n\n## DAO Landscape\n\nToday, there are more than 100 DAOs managing over $10B in assets.\n\n![DAO Landscape 2021](https://images.mirror-media.xyz/publication-images/5d496d8a-8119-4a79-ad40-fe6a754903b5.jpeg?height=2880&width=5120)\n\n### DAO Operating Systems\n\nThe first chapter of DAOs are the operating systems used to create them.\n\nThese projects offer different templates, frameworks and tools for communities to pool resources and start their first DAO.\n\nThey commonly offer smart contracts and interfaces to facilitate on-chain actions for decentralized communities.\n\n**DAO Operating Systems make it easy for anyone to start a DAO with limited technical skills.**\n\n### Grants DAOs\n\nThe first real use case for DAOs were grants.\n\nCommunities donate funds and use a DAO to vote on how that capital is allocated to various contributors in the form of governance proposals.\n\nGovernance of Grants DAOs was originally conducted through non-transferable shares, meaning participation was largely motivated by social capital over financial returns.\n\n**Grants DAOs show that niche communities are [more nimble](https://molochdao.medium.com/moloch-2019-year-in-review-eb6f53dc035) in capital allocation than formal bodies.**\n\n### Protocol DAOs\n\nProtocol DAOs transition power from a core team into the hands of the community, spawning a new way for projects to issue fungible tokens into the market.\n\nWhereas the first chapter of DAOs featured non-transferable shares, Protocol DAOs were the first to issue transferable ERC20 tokens with a secondary market value.\n\nThese tokens are commonly used to govern protocols, meaning tokenholders have the sole authority to propose, vote on and implement changes to the underlying mechanics of the network.\n\nProjects commonly vote on how to distribute tokens, thus opening the doors to liquidity mining, yield farming, fair launches and everything in between.\n\n**Protocol DAOs provided a framework for any network to issue a token that was (hopefully) owned and operated by its community.**\n\n### Investment DAOs\n\nWith Protocol DAOs bringing new tokens into the world, it only seemed logical that groups band together to invest in them.\n\nAfter a long period of non-profit DAOs, investment clubs flipped the switch for members to focus on generating a return.\n\nWhile these DAOs come with a lot more legal restrictions than a Grants DAO, they showed that any group of individuals could come together to invest larger amounts of capital with low barriers to entry.\n\n**Investment DAOs allow members to pool capital and invest in projects at their earliest stages.**\n\n### Service DAOs\n\nWith so many tokens coming into the world, projects need talent. Service DAOs are talent allocators, using on-chain credentials to funnel and allocate resources from one DAO to another.\n\nService DAOs create decentralized working groups for individuals to work for the open internet - essentially acting as crypto-native talent agencies.\n\nFrom legal to creative, governance to marketing, development to treasury management, Service DAOs create funnels to contract web3 mercenaries. Work is often rewarded with ERC20 tokens - providing ownership over the value created for a network.\n\n**Service DAOs explore the future of work, and what employment looks like in crypto-native world.**\n\n### Social DAOs\n\nWhat does it mean to be a member of a DAO?\n\nIn an industry dominated by speculation, Social DAOs focus on social capital over financial capital. Social DAOs are the natural evolution of group chats, where friends become co-workers.\n\nWhere social media turned everybody into a media company, Social DAOs turn every group chat into a digital business.\n\nThey challenge what it means to be a part of a community and offer ways to lean into becoming a part of a digitally-native tribe.\n\n**Social DAOs show that there is more to crypto than making a quick buck, and that the internet is the best place to meet people with similar interests.**\n\n### Collector DAOs\n\nNFTs. You’ve heard of them - and for a while, you couldn’t ignore them.\n\nOn the back of mainstream adoption, Collector DAOs popped up to collect them.\n\nCurator groups act as the underlying glue behind a specific artist, platform or series to help establish longevity.\n\n**Collector DAOs seek to curate which NFTs have long-term value.**\n\n### Media DAOs\n\nIn an age when information is globally accessible, ownership of the narratives through which they are distributed should be, too.\n\nMedia DAOs give that power back to those who consume the content.\n\nThey break down the way in which writers, streamers, and readers engage with the content they release. Whether it be media mining programs to incentivize contributions or governance over which topics make the front page, Media DAOs turn consumption into a two-way street.\n\n**Media DAOs share an outlet’s open agenda to spread awareness and news.**\n\n## DAO Tools\n\nAcross the board, a suite of tools are acting as the defacto standard for most DAOs today.\n\n*[Gnosis Safe](https://gnosis-safe.io/)* - Multisig wallets commonly used to manage community treasuries.\n\n*[Snapshot](https://snapshot.org/#/)* - Off-chain voting platform for easy token-based governance.\n\n*[Discourse](https://www.discourse.org/)* - Forum commonly used to discuss governance proposals.\n\n*[CollabLand](https://collab.land/)* - Bots providing token-gated access and tipping to community chat groups.\n\n*[Coordinape](https://coordinape.com/)* - Coordination game to determine which contributors(s) deserve token rewards.\n\n*[Parcel](https://parcel.money/)* - Treasury management to easily track and send payments.\n\n*[SourceCred](https://sourcecred.io/)* - Instance to track community participation and reward active members.\n\n*[Mirror](https://mirror.xyz/race)* - Finance creative projects through tokenized crowdfunds.\n\n*[Tally](https://www.withtally.com/)* - Governance dashboard to track on-chain voting history across different protocols.\n\n*[Boardroom](https://boardroom.info/)* - Governance hub for tokenholder management to empower key decision making.\n\n*[Sybil](https://sybil.org/#/)* - Create and track on-chain governance delegation.\n\n*[RabbitHole](https://rabbithole.gg/)* - Reward tokens for completing specific on-chain tasks.\n\nTogether, this stack allows anyone to spin up a treasury, introduce governance, reward key contributions and engage communities in ongoing discussions.\n\nNot bad!\n\n## How DAOs Evolve\n\nDAOs live on a spectrum.\n\n![](https://images.mirror-media.xyz/publication-images/73d3af5f-c315-420f-b2e5-d6dddbe47ecc.jpeg?height=2880&width=5120)\n\nThe lightest DAOs are social-first with off-chain governance. The goal is to create active discussion and communal belonging - more than to generate a profit.\n\nThe heaviest DAOs have tremendous amounts of capital at stake, requiring on-chain governance to execute and ratify proposals.\n\nWhat we’re currently witnessing is a shift from very heavy protocols to extremely light micro-economies.\n\nhttps://twitter.com/Cooopahtroopa/status/1392975646108778498\n\nCommunities are creating social DAOs in real-time, rather than being restricted to on-chain structures to get started.\n\nFor the heavier DAOs, on-chain proposals are creating and empowering lighter, off-chain working groups. This is best highlighted by the recent growth around Grants DAOs, allowing trusted community members to move faster with funds, rather than having to meet quorum to execute simple payments.\n\nAs DAOs gain momentum, it’s common to see [Treasury Diversification proposals](https://research.lido.fi/t/proposal-ldo-treasury-diversification-part-2/506). These events allow the wider community to contribute directly to a DAO treasury in exchange for its native token(s).\n\nThis shift signals that fundraising can apply to a community-wide treasury, rather than being managed solely by a core team.\n\nOnce runway is secured, DAOs need to figure out how to put it to work. The evolution of working groups and subcommittees is one I’m deeply fascinated by, and something we’re watching play out in real-time.\n\n## DAO Mercenaries\n\nDAOs mature on the back of community-driven services and governance.\n\nAs treasuries grow in size and communities grow in quality, core contributions become more and more important to keep the ball rolling.\n\nThrough [Fire Eyes DAO](https://www.fireeyes.xyz/), I’ve been lucky enough to pass on-chain proposals on protocols like Aave, Balancer, Rocket Pool and Gitcoin.\n\nGovernance will become increasingly more important, and feature a much wider design diamond of possibilities. With this, so will the number of teams working to put capital to work through on-chain proposals.\n\nFrom grants to payroll, token swaps to M&A - expect the next wave of mercenaries to show why web3 governance is a complete paradigm shift. (more on this topic to come in my next post).\n\nVery soon, we could see a world where **DAOs are the new LLCs.**\n\nIt feels inevitable that tokens will eventually replace equity, and with it - so will the legacy legal structures that underpin them.\n\n## Just DAO It\n\nThis post was published in June, 2021. Last updated August 2021.\n\nBelow is a growing list of resources to keep up with DAOs, their growth and the key people to watch. This list will be updated periodically, please share anything worth adding!\n\n\\[Clay Robbins\\] - [DAO Nation](https://clay.mirror.xyz/DwJ60O0R1IyRiPAZFBw4L05L3fd8PPxWnzDNedKtOas)\n\n\\[Gaby Goldberg\\] - [Curators All the Way Down](https://gaby.mirror.xyz/qvnNJhylZz-w6t4ubZzHfxd5gP17zDAXa6ruwOyO7sc)\n\n\\[Alex Zhang\\] - [Evolution of the FWB DAO](https://zhang.mirror.xyz/9sRa2kNDUpkWoQkWw67bJ8PczFyTSX8fotf7JOddxew)\n\n\\[Julia Lipton\\] - [Open Source DAO Market Research](https://docs.google.com/spreadsheets/d/16IDgIyPcfwJGG-zmXeMAenYbePQVHkc2P6WCwKEZgpk/edit#gid=0)\n\\[pet3rpan\\] - [How to Grow Decentralized Communities](https://medium.com/1kxnetwork/how-to-grow-decentralized-communities-1bf1044924f8)\n\\[Linda Xie\\] - [A Beginner’s Guide to DAOs](https://linda.mirror.xyz/Vh8K4leCGEO06_qSGx-vS5lvgUqhqkCz9ut81WwCP2o)\n\\[Kinjal Shah\\] - [DAOs & Creators - Resources to Get Started Today](https://kinjal.mirror.xyz/eD3-Sgv2h50j-kwjHQCOnwqMKqSLTfnrqrtNypU-P5k)\n\\[Cooper Turley\\] - [How to Launch a Token](https://forefront.news/blog/how-to-launch-a-token)\n\\[Bankless\\] - [Life of a Protocol Politician](https://newsletter.banklesshq.com/p/the-life-of-a-protocol-politician)\n\\[Kevin Owocki\\] - [Know Thy Enemy - Coordination Failures](https://newsletter.banklesshq.com/p/know-thy-enemy-coordination-failures)\n\\[Packy McCormack\\] - [The DAO of DAOs](https://www.notboring.co/p/the-dao-of-daos-5b9)\n\\[Packy McCormack\\] - [Cooperation Economy](https://www.notboring.co/p/the-cooperation-economy-)\n\\[Patrick Rivera\\] - [A Guide to Crypto Tokens](https://future.a16z.com/a-taxonomy-of-tokens-distinctions-with-a-difference/)\n\\[pet3rpan\\] - [An Introduction to DAOs](https://medium.com/metawork/an-introduction-to-daos-782e3817e2cd)\n\\[Vitalik Buterin\\] - [DAOs, DACs, DAs and More: An Incomplete Terminology Guide](https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/) \\n  \\n \\[YOUR ARTICLE HERE\\]  - [DM me](https://twitter.com/Cooopahtroopa) :)\n\nTo the DAO contributors of the world - keep up the great work.\n\nWe’ve got a long way to go before DAOs have proven real traction at scale, but this snapshot should show that some of the world’s brightest minds are committed to making that happen.\n\nIn the meantime, keep shipping and remember… when in doubt - **Just DAO It.**\n\n*Special thanks to Carlos Gomes for the graphics and to Li Jin, Jesse Walden, Pet3rpan, Lucas Campbell, Kinjal Shah, Jess Sloss, Brian Flynn, Jake Chervinsky, Packy McCormick, and Alex Zhang for their feedback!*\n\nWant to continue the conversation? Here's your chance!\n\n[auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3773&auctionId=0xc001ca3aff4414dd7a9d0e8be9cc41367838ad624d2886484ded285a20d3d94e](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3773&auctionId=0xc001ca3aff4414dd7a9d0e8be9cc41367838ad624d2886484ded285a20d3d94e)\n\nLooking to offer more passive support? Leave a tip!\n\n[split://0xa01Ed7E91835c82C21FF0cB823b859757Bc8be57?network=mainnet](split://0xa01Ed7E91835c82C21FF0cB823b859757Bc8be57?network=mainnet)\n\n", "timestamp": 1629958128, "digest": "_EDyn4cs9tDoOxNGZLfKL7JjLo5rGkkEfRa_a-6VEWw", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "xh0NBZw-RlVwfj-MmXpkosMkwVUy5kCuzHchRVSxYOY", "title": "Autonomy on a human scale: cooperatives to DAOs", "body": "DAOs are hot right now. In the world of blockchains if you bring together a couple of people who share profits, voting rights, or create some form of community it’s almost impossible not to be called a DAO. But the idea of a decentralized autonomous organization has a long history. Around 160 years ago the concept of the cooperative took shape in Britain. In a country industrializing at a fast pace, workers came together to form groups that shared responsibility and found ways to match industrialists who turned their businesses (mostly factory-work related businesses) into corporations. Of course, this long history of the DAO isn’t a new framework, but I will have a look at the what the purposes, struggles and general history of the cooperative movement can teach DAOs and those thinking of setting up a DAO.\n\n### From 1844 to 2021\n\nBlockchain and Web3 tools, solutions, and services are akin to the changes seen in the 19th Century driven by the Industrial Revolution. If you look at Manchester, in the UK, in 1801 you found 85,000 people. By 1851, this number had grown to over 400,000. The areas surrounding Manchester had industrialised at an equal pace. Towards the end of this 50 year period a couple of major changes had taken place that still shape our economic society today. All three actually have their root in the year 1844.\n\n1. **Friedrich Engels** published ‘*Conditions of the Working Class in England*’, which **Karl Marx** subsequently read and lead to the two of them spending time together in Manchester, in Chetham’s Library to be specific, to read - quite boring - economic history. This lead to the publication in 1848 of ‘*The Communist Manifesto*.’ As **Will Page** recently pointed out in his ‘*Tarzan Economics*,’ this link between cooperation and Communism is one that often means people shy away from the former, but we would do well not to be deterred.\n2. The British government laid the foundations of modern capitalism in 1844 by passing the *Joint Stock Act* and the *Bank Charter Act* through parliament. The former is the basis for the stock-based businesses and corporations we still know today. The latter functioned as the macro-basis for currency protected by a central bank as we still know it today.\n3. Finally, and if you’re [at all familiar with DAOs](https://gnosisguild.mirror.xyz/t4F5rItMw4-mlpLZf5JQhElbDfQ2JRVKAzEpanyxW1Q) there’s a strong chance you will have heard of them before, a group of workers founded the **Rochdale Equitable Pioneers** **Society**. They did not come out of nowhere. [Their principles](https://cloyne.org/rochdale-principles/) and codifications can be seen as the fruits of decades, if not centuries, of co-operative work. A main protagonist in this earlier work was **Robert Owen**, who also had a history in Manchester where he worked as a draper in the late 18th Century. From there he went on to buy the New Lanark Mills in Scotland where he put his, and those of others, ideas on social reform into practice. As a reference, one of the radical ideas he instituted at New Lanark was to introduce a minimum age for apprentices: 10 years old\n\n![](https://images.mirror-media.xyz/publication-images/e742707c-cb39-42c3-8c47-38c03a450088.jpg?height=695&width=453)\n\nLet’s briefly compare this history to more recent developments:\n\n1. Writers and thinkers such as **Yuval Noah Harari**, and specifically his book ‘*Sapiens*,’ who argue that human development is predicated on the ability to work together in ever larger groups and across ever larger geographies.\n2. Global hypes that drive adoption of Web3 tools, solutions, and protocols. The latest example being the NFT hype, but also the crypto-boom of 2017. As blockchain-based technologies become more mainstream, [global financial institutions](https://www.cnbc.com/2021/08/23/visa-buys-cryptopunk-nft-for-150000.html) and [governments](https://www.jdsupra.com/legalnews/crypto-daos-and-the-wyoming-frontier-9251606/) are forced to join the new space and [create policy](https://www.weforum.org/agenda/2021/07/new-rules-tools-cryptocurrencies/).\n3. Early iterations of DAOs mostly involved investments. Examples are **The DAO** and **Bitshares**. More recently, DAOs have started veering more towards cooperation and away from drivers such as pure profits. Overall, the last year has seen the number of DAOs explode. According to **DeepDAO** – which tracks DAO activity – one year ago, there were 4,600 DAOs while today there are 716,000.\n\nSo humans get their best work done when they operate together as teams, or [squads](https://www.atlassian.com/agile/agile-at-scale/spotify) if you prefer agile terminology. We’ve been doing this for a very long time and major social-economic changes often impact how we organize ourselves. In the Middle Ages we had guilds, in the 19th Century we turned to cooperatives and now, in the 21st Century, we operate in DAOs. If indeed the idea of a DAO is closely related to that of the cooperative, then what can we learn from the latter’s growth from 28 skilled workers from Rochdale to around 720 million cooperative members worldwide in 2021? Let’s have a look at the key moments of growth for cooperatives in the past 180 years and how that compares to DAO-led developments.\n\n## Diverging cooperatives: from Rochdale to Weyerbusch\n\nOf course, our 28 Rochdale pioneers were not the first to organize themselves into a cooperative. However, they stuck in history as a defining group because they set out rules, principles and codifications that allowed others to build on what they did. For them it was mainly about helping out fellow workers and establishing a community that was capable of creating pecuniary benefit and led to improve the social and domestic conditions of its workers. Of course, others who took up this initiative had other incentives and goals.\nFrom 1844, our next step leads to Germany, where the first cooperatives – some say Engels kickstarted these – centred around helping indebted poor in rural Weyerbusch. The need for excessive loans and the conditions to those loans found their roots in early capitalist ideas arising from industrialisation. **Friedrich Wilhelm Raiffeisen** started a project in 1847 that allowed farmers to receive small loans on favorable conditions for repayment. The other main figure at the beginning of the cooperative movement in Germany was **Franz Hermann Schulze-Delitzsch**. Where he differed from Raiffeisen was that he wanted the cooperatives to remain free of state help. Raiffeisen, conversely, increasingly engaged with Prussian government structures for aid. By 1895 this had resulted in a state-owned cooperative bank. Schulze-Delitzsch, who had died in 1883, and his followers did not approve of any state help and instead focused on self-help. In other words, by the end of the 19th Century, and after unification, Germany was home to two main divergent strands of cooperativism.\n\n1. A kind of middle-ground cooperative which still held up ideals of togetherness, but which increasingly had involved state help. Besides, it had increasingly come to be built upon structures that did not favor the cooperative, but which focused on centralized ownership.\n2. A more pure-bred cooperative which focused on units of self-help and which saw cooperation as a moral virtue. Moreover, cooperation meant first and foremost that single workers lacked the resources to compete in expanding markets. By banding together they could both retain ownership and compete with industrialization.\n\n### DAOs can learn\n\nAs I jokingly said in the opening paragraph, almost anything that happens collectively on the blockchain is called a DAO recently. But it’s worthwhile thinking about various forms of DAOs and how they compete together. For example, back in 2014 **Vitalik Buterin** wrote a short [terminology guide](https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/) on the differentiations between DAOs, DACs, DAs, and DCs. He focuses heavily on the ‘automation’ implied through ‘autonomous’, or in what way humans move from the center to the edge of decision-making. Related to the above German example of cooperatives going in two different directions it’s useful to look at the differentiation between a DAC (Decentralized Autonomous Corporation) and DAO.\n\n> “\\[A\\] DAC pays dividends. That is, there is a concept of shares in a DAC which are purchaseable and tradeable in some fashion, and those shares potentially entitle their holders to continual receipts based on the DAC’s success. A DAO is non-profit; though you can make money in a DAO, the way to do that is by participating in its ecosystem and not by providing investment into the DAO itself.”\n\nButerin himself already acknowledges that this distinction is murky because even the internal capital of the DAO, expressed in its own coin, will go up when the DAO becomes more popular and thus increase in value almost like a dividend. Leaving that murkiness aside, it’s clear that any attempt to decentralize organisations today faces the same dichotomy faced by cooperatives in the late-19th Century.\n\nState-help in blockchain terms should be seen as any help that isn’t transparent. The pure-bred DAO is totally transparent and reveals itself through their blockchain of choice. And while we need web2.5 solutions to increase adoption rates for Web3 solutions, just like Raiffeisen felt it was fine to use state funds if it helped him achieve his own goals towards cooperation, this will ultimately lead to competing elements. \n\n## Expanding principles\n\nPost-World War II, the cooperative movement, which had already for decades been institutionalized into the **International Cooperative Alliance** (ICA), found itself struggling with the original principles set out by the Rochdale Pioneers. Even though these principles had already been amended in 1937, they needed another set of changes to reflect an ever-growing number of non-consumer cooperatives. For the current purpose of this article let me highlight one renewed principle:\n\nThe economic results arising out of the operations of a society belong to the members of that society and should be distributed in such a manner as would avoid one member gaining at the expense of others. This may be done by decision of the members as follows: a) by provision for development of the business of the corporation; b) by provision of the common services; or c) by the distribution among the members in proportion to their transactions with the society.\n\n### DAOs can learn\n\nThe reason I highlight that part is because currently most DAOs would require expanding this principle again. On the one hand, voting in a cooperative was, and is, based on one member equals one vote. Most DAOs work on a vote distribution based on token ownership. More significantly, however, is the mention of the common services. Of course, there are DAOs which keep this in mind, but a key element to any DAO is that they automate certain governing processes.\n\n[https://twitter.com/evabeylin/status/1396184123761303554?s=20](https://twitter.com/evabeylin/status/1396184123761303554?s=20)\n\nThere’s an element of cooperation in this image of a DAO as a truly autonomous organization. However, the idea and especially the ideal behind many DAOs go much further and potentially bring the human closer to the decision-making process again. One example of an expression of this is **Project DisCO**, where DisCO stands for distributed cooperative organization.\n\n[https://www.youtube.com/watch?v=I7Gv8aQpptI](https://www.youtube.com/watch?v=I7Gv8aQpptI)\n\nThe project started in response to DAOs as they formed a couple of years ago: focused on investment. Project DisCO’s main focus is on the commons and in doing so they link heavily back to the ideal of cooperation. This comes back in their [manifesto](http://disco.coop/manifesto/), where they dedicate a full chapter to historical precedents for decentralized models.\n\nOne important way Project DisCO updates the principles set out by the Rochdale Pioneers, and modernized throughout the years by the ICA, is by priming DisCOs for federation.\n\n> “This dynamic resembles how TCP/IP allows a network of networks, the Internet, to function. Each node can be based on small group trust, intimacy and mutual support while still achieving a larger impact through federation.”\n\nThis harks back to an issue that Raiffeisen tried to solve in the mid-19th Century by talking about villages as a synonym for the cooperatives. He did that, because he felt that any cooperative would need to resemble a village. Any group bigger than that would start to cause problems. Over the next couple of decades he was proved right as his own organization expanded and failed at keeping that commons connection alive.\n\n## Where does this leave music DAOs?\n\nBringing musicians, fans, or your organization together as a DAO [isn’t that difficult](https://www.musicxtechxfuture.com/2021/06/22/blockchain-basics-how-to-start-a-dao/), but what the above asks is to think about why you do that. Furthermore, it asks that when you have an answer to the why, you realize what the history is you’re building on. The why then becomes a how do I interpret a DAO and what it stands for? Am I looking to bring people together to [create](https://elektra.camp/#/) something new that will benefit them as a whole group? Or am I bringing people together [to share ownership](https://www.partybid.app/) of something we would not be able to achieve as individuals?\n\nWhatever your reasons, if it builds on the long history of the DAO then it might lead you to reassess the principles that have been codified for almost 180 years now. While DAOs’ first iterations took humans towards the edges of decision-making, cooperatives took economics and brought it to a human scale. DAOs can do the same for any community coming together in a decentralized, or better yet distributed, manner. Music is often already a collaborative effort, but to take all those elements of collaboration and decentralize and distribute them will work better if the historical struggles of cooperatives are learned from. ", "timestamp": 1629959461, "digest": "aJODmYiWXhveFO64nTgO4qNn-E_1rphF6GiZJJk1VVM", "contributor": "0x04a395a382B43d083ac5F43eb4c32B93d5a43E00"}
{"id": "9_MGVBFCWONNTL3Wii7PHHZk2aG5F25CDwgZo8LfLvU", "title": "Hi", "body": "* Hello world\n* My name is Tom\n* Testing\n\n  ![Image inside list](https://images.mirror-media.xyz/publication-images/549afbe0-d17c-47e5-860f-b183b79857ee.png?height=388&width=1782)\n\n* Test\n* Testing", "timestamp": 1629984419, "digest": "uCPaHzqTYKVZMFlrohR-zPbhMBNSLX3FH50TTAEQyF0", "contributor": "0x5FE6C3F8d12D5Ad1480F6DC01D8c7864Aa58C523"}
{"id": "lXQI7jfnehf3FDhuy-IfOzoYC6ThtSn-R_kRl8qXQOc", "title": "Hi", "body": "* Hello world\n* My name is Tom\n* Testing\n\n![Image inside list](https://images.mirror-media.xyz/publication-images/549afbe0-d17c-47e5-860f-b183b79857ee.png?height=388&width=1782)\n\n* Test\n* Testing\n\n> Testing image in blockquote\n\n![](https://images.mirror-media.xyz/publication-images/c3813d38-d4a9-4a8e-aa6a-b986b8e395fe.png?height=1142&width=2284)\n\n", "timestamp": 1629984640, "digest": "uCPaHzqTYKVZMFlrohR-zPbhMBNSLX3FH50TTAEQyF0", "contributor": "0x5FE6C3F8d12D5Ad1480F6DC01D8c7864Aa58C523"}
{"id": "Ho72ySLZ9XHrXpwd6kWDAbCEFWr8LPxCPvY_ia4L50s", "title": "Hi", "body": "* Hello world\n* My name is Tom\n* Testing\n\n![Image inside list](https://images.mirror-media.xyz/publication-images/549afbe0-d17c-47e5-860f-b183b79857ee.png?height=388&width=1782)\n\n* Test\n* Testing\n\n> Testing image in blockquote\n>\n> ![](https://images.mirror-media.xyz/publication-images/c3813d38-d4a9-4a8e-aa6a-b986b8e395fe.png?height=1142&width=2284)\n\n", "timestamp": 1629984581, "digest": "uCPaHzqTYKVZMFlrohR-zPbhMBNSLX3FH50TTAEQyF0", "contributor": "0x5FE6C3F8d12D5Ad1480F6DC01D8c7864Aa58C523"}
{"id": "UvnHpmAM6KQ7bA0UTOtN3BJ1UQYxnemGkdcronPXlc8", "title": "Hi", "body": "* Hello world\n* My name is Tom\n* Testing\n\n![Image inside list](https://images.mirror-media.xyz/publication-images/549afbe0-d17c-47e5-860f-b183b79857ee.png?height=388&width=1782)\n\n* Test\n* Testing", "timestamp": 1629984541, "digest": "uCPaHzqTYKVZMFlrohR-zPbhMBNSLX3FH50TTAEQyF0", "contributor": "0x5FE6C3F8d12D5Ad1480F6DC01D8c7864Aa58C523"}
{"id": "IM1bZ_Z5rUUhOsjtmy0m_LwuO_BWF5aFXhJDoCRBAsE", "title": "Care Package", "body": "*\"The need in Afghanistan is overwhelming and growing fast as conflict escalates and drives more than 393,000 newly displaced people from their homes. They need food, water, shelter, and protection. Please give now to rush emergency aid to displaced Afghan families and your gift will matched to go twice as far to help.\"*\n\nEach edition of this NFT covers one family’s emergency needs for a month. (scroll down to buy 10 at a time)\n\nFunds are routed directly to \\[care.org\\]\n\nFunds Sent:\n\n8/18/21 — 33.824 ETH / $103,992\\~ [(view tx)](https://etherscan.io/tx/0x633a96794e090e2977e9c95063d16051bcdbbbadea02e703fbb62f263971b322)\n\n8/19/21 — 5.04 ETH / $16,238\\~ [(view tx)](https://etherscan.io/tx/0x292796e375a25bf44a8ed40a7876e61d4d4a1d5e1d2689377685fcaec783378d)\n\n8/21/21 — 5.684 ETH / $18,079\\~ [(view tx)](https://etherscan.io/tx/0x43822f7d15b7e78ac7ae5fbff7442541fcf03551fc3324460517777a6045e008)\n\n8/23/21 — 2.212 ETH / $6,891\\~ [(view tx)](https://etherscan.io/tx/0x01e87f5e7c1b1d2de53254024caa83a240c4c94b7827609bcfc36f4db8e9c8dc)\n\nFunds sent directly to [care.org](https://my.care.org/site/Donation2?df_id=30197&mfc_pref=T&30197.donation=form1&_ga=2.18597753.1765542984.1629153044-549514178.1629153044).\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=184](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=184)\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=186](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=186)\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=186](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=186)\n\nDonate fiat [here](https://my.care.org/site/Donation2?df_id=30197&mfc_pref=T&30197.donation=form1&_ga=2.18597753.1765542984.1629153044-549514178.1629153044).", "timestamp": 1629985165, "digest": "sb9NU7Wzpg-53wqNFPM-MCwWQ7y48RJlri3cr3Nt0Do", "contributor": "0xc8f8e2F59Dd95fF67c3d39109ecA2e2A017D4c8a"}
{"id": "G1UaCCIma1FFClNgwX7gyqCfL4d7ziZxbfPLDEEmwu4", "title": "Care Package", "body": "*\"The need in Afghanistan is overwhelming and growing fast as conflict escalates and drives more than 393,000 newly displaced people from their homes. They need food, water, shelter, and protection. Please give now to rush emergency aid to displaced Afghan families and your gift will matched to go twice as far to help.\"*\n\nEach edition of this NFT covers one family’s emergency needs for a month. (scroll down to buy 10 at a time)\n\nFunds are routed directly to \\[care.org\\]\n\nFunds Sent:\n\n8/18/21 — 33.824 ETH / $103,992\\~ [(view tx)](https://etherscan.io/tx/0x633a96794e090e2977e9c95063d16051bcdbbbadea02e703fbb62f263971b322)\n\n8/19/21 — 5.04 ETH / $16,238\\~ [(view tx)](https://etherscan.io/tx/0x292796e375a25bf44a8ed40a7876e61d4d4a1d5e1d2689377685fcaec783378d)\n\n8/21/21 — 5.684 ETH / $18,079\\~ [(view tx)](https://etherscan.io/tx/0x43822f7d15b7e78ac7ae5fbff7442541fcf03551fc3324460517777a6045e008)\n\n8/23/21 — 2.212 ETH / $6,891\\~ [(view tx)](https://etherscan.io/tx/0x01e87f5e7c1b1d2de53254024caa83a240c4c94b7827609bcfc36f4db8e9c8dc)\n\nFunds sent directly to [care.org](https://my.care.org/site/Donation2?df_id=30197&mfc_pref=T&30197.donation=form1&_ga=2.18597753.1765542984.1629153044-549514178.1629153044).\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=184](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=184)\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=186](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=186)\n\nDonate fiat [here](https://my.care.org/site/Donation2?df_id=30197&mfc_pref=T&30197.donation=form1&_ga=2.18597753.1765542984.1629153044-549514178.1629153044).", "timestamp": 1629985351, "digest": "sb9NU7Wzpg-53wqNFPM-MCwWQ7y48RJlri3cr3Nt0Do", "contributor": "0xc8f8e2F59Dd95fF67c3d39109ecA2e2A017D4c8a"}
{"id": "btkQupTftl3GL7SH57Jusi4Jvt4xmp0BOT9VPefJV0o", "title": "Mirror and tipping point to interoperable content, social, and economic graphs", "body": "*Big thanks to [Patrick Rivera](https://twitter.com/patrickxrivera), [Jarrod Dicker](https://twitter.com/jarroddicker), [Raphael Menezes](https://twitter.com/raphacaixeta), and [Dan Shipper](https://twitter.com/danshipper) for their help writing this post. Follow me on [Twitter](https://twitter.com/Joey_DeBruin) or subscribe to [Penguins and Rabbit Holes](https://creativekitchen.so/penguins) to hear more thoughts on building public knowledge in the future.*\n\nInteroperability is the connecting thread of the future of the social web. It’s the reason Facebook and Twitter are not so secretly working to fundamentally transform their current products. It’s the argument I’ll give for the crypto publishing platform Mirror — where this post is published — being undervalued, despite raising a round at $100M a year after launch. Interoperability is the idea that to succeed in the future, builders will design individual lego pieces rather than entire sculptures.\n\nThe world of consumer tech can feel impossible to keep up with at the moment: NFTs, social tokens, crypto wallets, AR/VR, the metaverse. Those terms describe new products and experiences and will continue to change, but interoperability is the core mechanism that brings them together. It will drive the next wave of products, including and especially science where I spend most of my time. \n\nSo I’m going to try and make interoperability as cool as a pixelated punk. I want to lay out the steps to a tipping point — where you wake up one day and the internet is almost unrecognizable from how it is now. And to make those steps as concrete as possible in this abstract world, I’ll do it through the lens of Mirror, a company with a vision that makes the opportunity of interoperability obvious.\n\n![](https://images.mirror-media.xyz/publication-images/3323898e-e39a-4437-8d4c-ed3cc2c6b33a.png?height=1440&width=2560)\n\n## The dream of interoperability\n\nIn essence, “interoperable” means multiple products or services can make use of the same information.\n\nTake healthcare as an example. If I choose to switch doctors because my current one is a hack, I want my new doctor to have access to all of my medical history. It matters because it fosters competition and allows a more diverse ecosystem to evolve.  My doctors should compete based on who can make me healthiest, not who has exclusive access to my data. Healthcare also illustrates the challenge interoperability has faced with privacy, but more on that later.\n\nAs Ben Thompson notes in [The Web’s Missing Interoperability](https://stratechery.com/2021/the-webs-missing-interoperability/), interoperability was actually one of the core benefits mentioned at the start of the last wave of consumer tech, what many refer to as Web2.0. But we didn’t get interoperability from the big Web2 giants of Facebook, Twitter, and the like.  We got almost the exact opposite — business models built on capturing data, storing it in private databases, and charging advertisers for access to it. We are quick to point the finger at Facebook or Twitter, but blaming them is hardly different than blaming McDonalds for the rise of fast food. The system and especially consumer pressure clearly didn’t create the incentives for interoperable technology to thrive.\n\nMore than a decade later at the dawn of Web3, consumer demand for a healthier internet is growing and there are a few important data points that suggest interoperability at scale is finally possible. First, we see that the giants are exploring this space with quite a bit more energy and openness than you might expect. Twitter — [via their “BlueSky” project](https://twitter.com/bluesky) — is very openly researching how to build an open and interoperable standard for social media. Zuckerberg has recently been talking about Facebook becoming [\"becoming a metaverse company.\"](https://www.theverge.com/22588022/mark-zuckerberg-facebook-ceo-metaverse-interview) \n\nThe simple reason the social giants even consider such bold new directions is because interoperable graphs are better for creators, and creators are the scarce resource in the quickly arriving next iteration of the internet. The most valuable asset in a world of interoperable data will be the complex business relationships creators establish between their content, other creators, and their audience. Subscribers will be replaced by supporters, angel investors by angel audiences, and collaborators by co-owners. Big tech is many things but dumb isn’t one of them, and the giants realize that tapping into those flows of money is where the trillions will be made in the future.\n\nTo be clear, it’s hard to imagine how the transition to interoperability actually happens at these existing giants. While they have been building lots of new features in line with the creator-centric strategy above — tipping, subscriptions, funding for creators, better business tools — only time will tell whether they’ll be able to execute the dramatic shifts they are pretty openly exploring.\n\nThe next question after “is it possible?” is “why should we care?” What would happen if Twitter, Facebook, YouTube, and the rest all opened up their vast databases? What new types of products could we imagine getting as creators and consumers from a more interoperable world? Just a few examples to paint a picture:\n- For creators:\n  - **Publish anywhere.** No matter where you publish or who you collaborate with, it is connected to your unique ID and distributed to your followers.\n  - **Auto-updated profiles.** Rather than manually building a LinkTree of your various projects, simply put in your universal creator ID and one is populated and updated automatically.\n- For consumers:\n  - **Focus Twitter.** Discover a version of Twitter which pulls in everyone you follow and their content, but in a single daily digest rather than a time-sucking feed. Ready to dive back into the “normal” app? That’s fine too - these apps live in parallel and have all of the same content.\n  - **Follow everywhere.** Love Taylor Swift? Follow her across all of her accounts with one click.\n\nInteroperability at scale is possible, and it can enable a healthier and more diverse product ecosystem. As [As Jarrod Dicker notes](https://darkstar.mirror.xyz/aXm3OTVTK26hN2QKu82s8NjLQYPKCOMiVD2zIioCOVU), it remains to be seen whether Web2 will still exist in the future as a parallel to Web3. But it’s clear Web3 is coming, and ultimately whether it is a full replacement will come down to what we as creators and consumers value from our media. So the next step is to take a look at the changing preferences and pressures that are starting to allow interoperability to become mainstream.\n\n## Substack and Web2.5 \n\n![](https://images.mirror-media.xyz/publication-images/5933528b-c4bb-4daa-9bc9-fedc11f3fafb.png?height=959&width=1600)\n\nMoney talks, and building your own business as a creator has traditionally been difficult. It requires stacking a number of different building blocks on top of each other — content creation, distribution, revenue generation, admin, and so on. [The cost of integrating or coordinating those different blocks](https://www.theproductkitchen.com/p/coases-penguin-is-learning-to-fly) has been prohibitively difficult for individuals or small groups of creators, which is why they have written for the New York Times, sung for Sony records, and acted for Disney.\n\nBut things are changing — consumers increasingly prefer to build trust with individuals or small groups. Packy put it best in “[Power to the Person:](https://notboring.mirror.xyz/SPV_-bchriVn_ncDj8OgnLccSb5qAsU0sXNpg9y_UTk)”\n\n> *“**People follow people, not companies,** but companies have long had the advantage because of all of the coordination it takes to build scaled products...Ben Thompson has said that media companies are the first to adapt to a new paradigm shift because of the relative simplicity of their products. They require very little coordination among parties, just the ability to capture and distribute one person’s thoughts, images, or dance moves.”*\n\nThe media boats that first floated across Web2 moats were the Substacks and Patreons. They are the first major media networks to build huge businesses by optimizing for creator success rather than consumer engagement. They are still fully vertical — they own the content and distribution — but creators can theoretically download the emails of their audience to take it with them.\n\nThe reason I call this Web2.5 is because the Substacks and Patreons are *open* but not *interoperable.* There’s nothing stopping me from downloading my Substack subscribers and posts and manually moving to a new platform. The data is *accessible* but not *interoperable*, and that makes all the difference when it comes to building the internet of tomorrow.\n\n## Social graphs in Web2 vs Web3 - a side by side comparison\n\nSo if interoperability is possible, exciting, and we see early signs of it happening, then what would true interoperability in media actually entail? Let’s break it down.\n\n![](https://images.mirror-media.xyz/publication-images/15b880ab-551b-4edd-b946-179f56b4e23a.png?height=1440&width=2560)\n\nI admit, I’m not sure I can even imagine a future where *all* of the internet works in this way. We may always have fast food. But the point is that some of it will, because some of it already is. Now we’re finally ready to hold up the Mirror. \n\n## Mirror - the reflection of an interoperable future?\n\nMirror — the red hot “crypto Substack” which just [raised >$10M at $100M from A16Z](https://www.theinformation.com/articles/union-square-ventures-values-crypto-publishing-tool-mirror-at-100-million) and others — is starting to look more like “crypto Kickstarter and crypto Patreon meets crypto Substack.”\n\nHiding behind a distracting blur of new features, Mirror’s core structure is consistent and visionary. It's a bet worth understanding on the future of interoperable content graphs, internet-native money in the form of tokens, and the dynamic new businesses that will be possible because of them.\n\nMirror does look a whole lot like Substack from afar - it has a publishing tool and a way to generate revenue. The most obvious difference is that it has lots of fancy crypto tools to run crowdfunds, generate NFTs for your content, and get tips and other ways to generate revenue. \n\nOn closer examination, however, we can pass it through the same criteria as above and see that it’s not far off:\n- **A unique creator ID:** I use my public Ethereum address, which I own through my private key, to publish on Mirror. \n- **An open database of content, connected to my ID:** Mirror stores content on a decentralized storage system called [Arweave](https://www.arweave.org/). If Mirror were to shut down tomorrow, I could access all of my articles by querying Arweave for the posts signed by my Ethereum address.\n- **Open social and economic graphs:** All of the important relationships built on Mirror are stored openly. Adding new members to the platform is done via their [$WRITE race](https://dev.mirror.xyz/vZxxUIeGMQK9NNLcrT0eDYZ6wXhXVr6vTQzztj1DaEA), a decentralized and publicly viewable vote where existing members carry more weight. When I split the proceeds of my article with another writer, or when an audience member buys an NFT in a crowdfund via my article — all of those things are signed via Ethereum addresses and stored publicly. Anyone could build apps on top of this data, for example a “Crunchbase for Creators” which shows how much funding each creator has gotten over time and from whom. \n- **Standards:** Mirror is both using and helping build open standards for the core technologies they use. They use Ethereum standards like ERC20 for fungible tokens, ERC721 for NFTs, signature standards for verifying data and so on. Some other areas like NFT sales and royalties don’t have standards yet, and Mirror is working to establish standards that can be used by others. Better standards means more adoption of those new technologies, which then benefits Mirror as the place with the best creator experience to leverage those technologies to build a business.\n\nThe key point to take away from this is that **owning the content is not important to Mirror’s strategic moat.** What differentiates Mirror and makes it a sticky product for creators is that it offers a number of ways to build a business that you can’t get anywhere else. Mirror dramatically lowers the coordination cost of creating a complex online business as a writer - hidden behind what looks like a content platform is actually a crowdfunding, e-commerce, and media platform all rolled up into powerful cryptographically backed tools. It’s Kickstarter, Patreon, and Substack all in one.\n\nAs a more concrete example, a film team [just raised $2M](https://ethereumfilm.mirror.xyz/3SV8gLXHIW8Ot45h3RL7aOgDINxN2hjLfFVOvyatB2A) to produce a documentary on Ethereum. Crowdfunding platforms like Kickstarter have contribution limits of $10,000, require a bank account and only support certain jurisdictions. On the other hand, Mirror’s crypto-native crowdfunding tool had programmable contribution limits (the highest contribution was over $200k), required just a crypto wallet, and was open to anyone with an internet connection.  \n\nPatrick Rivera — an engineer at Mirror and one of the best people to follow to understand this space — [calls this the “protocol economy.”](https://p.mirror.xyz/1EpvJwUpx_KlRcHOKLNqADEkwHL_Z1ZYKobF2uLwgBg) Companies like Mirror own publishing and distribution for now because they have to build vertical solutions given the UX problems that are so prevalent in crypto. Being vertically integrated allows Mirror to build easy and effective onramps into the powerful protocols that will serve as their strategic moats in the future. \n\nCrypto products that aren’t vertically integrated end up sending their users through a complex maze of different crypto apps that may have varying degrees of usability. Integrating the user journey into a single app allows crypto products to significantly improve the user experience to drive better acquisition, engagement, and retention over time. The key is to use open code and data standards to build a high-quality integrated experience.\n\nLaying out the open structure that currently hides under Mirror’s vertically integrated solution, you can see that the shift from being a publishing company to stewarding a vibrant protocol economy has very little to do with the content itself. It’s about building developer tools for teams to use their contracts and content tools. It’s about SDKs, APIs, sub-graphs, and documentation. Their competitors will be the Stripes and Stirs of the world, not Substack. At that point, there could be multiple different apps handling publishing and distribution, all routing through Mirror’s business layer to handle things like funding, governance, revenue splits, and so on. \n\n![](https://images.mirror-media.xyz/publication-images/7da76ad6-0cff-40d5-aa65-a3361f3cec9f.png?height=1440&width=2560)\n\n## Could interoperability ever dry the Web2 moat?\nThere are a number of reasons interoperability will not happen overnight, and may never happen at scale. A few key barriers include high transaction fees, difficulty managing a crypto wallet, and scarcity of talent in the space (although all of these are rapidly improving). Not to mention privacy, security, and moderation — those topics would take an entire piece on their own but there is good reason to believe those are technical limitations which can be tackled.\n\nThe momentum to tackle these challenges can only come from an exponential UX improvement as each new interoperable product is added to the ecosystem. In other words, the network effects of the interoperable ecosystem competing with the walled-garden network effects of Web2. Using your Ethereum wallet as your Mirror account is cool, but if you can use the same wallet to log into another important product you use, the benefit scales exponentially. At a certain point, you might actively prefer to use products that allow you to use your wallet in the same way you prefer to shop with businesses that accept your credit card. That’s the tipping point.\n\nI hope that companies like Mirror will work to push interoperability even as they focus on building onramps to crypto via vertically integrated solutions that can control the end user experience. If they can actively build seamless integrations with other open content platforms such as [Audius](https://audius.co/), it could dramatically accelerate the speed of adoption of a more open internet. \n\nThe more that open platforms rely on and develop the same technology, the more they are effectively investing in each other. They become a superorganism, a swarm. As Packy put it in [“Who disrupts the disruptors”](https://www.notboring.co/p/who-disrupts-the-disrupters), people wonder which new platform will challenge the giants, but  it is the swarm of open platforms that pose the biggest threat to a real tipping point.\n\nPlatforms like Mirror have such an enormous and important challenge ahead when it comes to interoperability. But it’s not all excitement - there are a number of major challenges to a more open model. Say what you will about the job they’re doing, but centralized platforms have unique advantages to privacy and moderation that will be very difficult to build into a more decentralized web. \n\nAmusingly, the best place I’ve found to read all about the challenges that would need to be overcome to build decentralized media platforms at massive scale is Twitter’s BlueSky project. [They have curated a huge amount of content into a GitLab project on open identities](https://gitlab.com/bluesky-community1/decentralized-ecosystem/-/blob/master/topics/data.md), moderation privacy, monetization, and more. So perhaps we shouldn’t sleep on the incumbents after all - and if nothing else we should gain some confidence from the fact that those with all of the money are giving this topic quite a lot of attention.\n\nPatrick and I will be hosting a hangout to discuss interoperability, Mirror, and some exciting new developments - follow me on [Twitter](https://twitter.com/Joey_DeBruin) or join the [Forefront discord](https://forefront.community) to grab a spot when we set the date. \n\n***\nIf you enjoyed this post, be sure to leave a tip. It will automatically be distributed to all contributors! Thank you!\n\n[Mirror and the tipping point to interoperable content, social, and economic graphs](split://0xd49B7EBC829bb75a9b836a348796Db06c0222fca?network=mainnet)\n\n\n\n\n\n", "timestamp": 1629996347, "digest": "3FKwvkwAPltEdhe4pWnL8RX7TNruwNNZcFAqNn92tUs", "contributor": "0xaBaF40768e575bEb3244df2853A0505Cb2D2e4bB"}
{"id": "S7veZzk211MK0NMq52e6uMUhHdX6kNW0twYHsXi3KoY", "title": "What's next for PartyDAO", "body": "A few days after PartyDAO's formation, we stated our two primary mandates:\n\n1. Ship PartyBid, a product for collective bidding on NFTs\n2. Build PartyDAO itself into a long-lasting organization that can fund its own continued existence\n\nOver the past few months, our members built and shipped PartyBid V1 to resounding success. In its first 48 hours live, PartyBid processed over 1200 ETH in volume and earned over 60 ETH, with Parties pulling in victories on several high-profile auctions. Since launch, over 2600 ETH have been contributed to Parties.\n\nAs we continue to build and improve PartyBid, we're expanding our focus to ensure that we deliver on our second mandate: growing PartyDAO into a successful long-term organization. Doing so requires a clear long-term vision for what we aim to achieve, and as a DAO that builds software, we think it's most important to articulate our vision for the software we intend to build.\n\nIn the weeks since PartyBid launched, we've faced many questions about whether or not all the excitement for PartyBid is just a flash in the pan. Crypto moves in strong boom and bust cycles, and when seen as a toy for throwing money at JPEGs surrounded by emoji-flavored cursors, it might seem like PartyBid is just part of the hype.\n\nWe don't think that's the case. The crypto industry has long heralded the age of the sovereign individual, free from mandatory participation in social institutions. But even in the absence of mandatory social ties, everything from early hunter-gatherer tribes to more recent examples like the GME stock rally show that people naturally want to coordinate together around shared goals.\n\nAs crypto transitions into a time when all kinds of new and useful applications exist across the ecosystem, it is a natural next step for people to join forces and participate in this ecosystem together. PartyBid is an early torchbearer for technology that enables this coordination: multiplayer crypto products.\n\nAs we look toward the future, enabling this kind of group coordination is what PartyDAO is all about. PartyDAO builds multiplayer products for crypto.\n\nIn the near-term, it's clear that there is tons of work to do in order to build PartyBid into the best possible protocol for establishing collective ownership. In the immediate days following our launch, communities rallied to form PartyBids for a variety of different causes. The [Party of the Living Dead](https://www.partybid.app/party/0x2912F57F93dD69FBbF477B616D6f8C34C49bb282) bought a rare Zombie punk and established a virtual group identity. [Sirsu](https://twitter.com/sirsuhayb)'s [CRYPTO COOKOUT](https://twitter.com/ourZORA/status/1424492663726804992?s=20) brought people together to win auctions for black and brown CryptoPunks. [PartyPAC](https://twitter.com/prtyDAO/status/1423847784415956992?s=20) collected funds to donate to CoinCenter in the fight against legislation threatening the crypto industry. More recently, [Nouns](https://nouns.wtf/) announced recurring Parties to bring people together on a regular cadence.\n\nAll of these examples represent strong use-cases for PartyBid and the wide range of goals around which the product can help people direct their combined energy. Our own members are now well underway developing improvements that will help take PartyBid to the next level.\n\nLooking even further ahead, we believe more and more crypto applications are waiting to become multiplayer versions of themselves. As we continue to grow, PartyDAO aims to play a key role in this transition.\n\nWith this vision intact, we are planning the long-term future of PartyDAO. Equally as important as the software we build is our organization, and in coming weeks, we hope to set PartyDAO up for its next major phase of growth and building.\n\n[Stay tuned](https://twitter.com/prtyDAO) for more updates, and let's keep the party going.\n\n— The PartyDAO Team", "timestamp": 1630001650, "digest": "NHMOTjy3j3EB21GTpWYH3CrMFD2k4WKTB3EpM1dkACc", "contributor": "0xB0623C91c65621df716aB8aFE5f66656B21A9108"}
{"id": "VR1gRj2x6gWtsqvI6k2Npv_JUWr3alW_mthW54Zzn5U", "title": "Love and Money in DAOs", "body": "**It’s an absolute lovefest in DAOs. Everyone in a DAO at this moment is in early to something that’s going to be big, big, big. That includes me, since I’m a member of some of them.** \n\nAlso, valuations are going nuts. $FWB (Friends with Benefits DAO) tokens are up 700% over the past thirty days. $FF (ForeFront DAO) is up nearly 500%. $Whale (Whale DAO)  is up a mere 200%. And so on. \n\nThe world, starting with the greater crypto community, is starting to catch on to the superpowers of smart, driven people sharing a checking account and a mission. And that amazing reality is an aphrodisiac for those already in. This tweet, from one of my favorite people in the space (though he doesn’t know me), gives you a sense of where we are. \n\n[https://twitter.com/jongold/status/1430935842361466887?s=20](https://twitter.com/jongold/status/1430935842361466887?s=20)\n\nAs a grizzled veteran of the class of 2017, I’ve seen this before. In r/EthTrader, we LOVED EACH OTHER. We fought off Bitcoin maxis and no-coiners, worshiped together at the alter of decentralization and the Unicorn culture of Ethereum. And then, when we started to make some real money, our love blossomed. There is simply nothing like getting rich with those on a shared mission. It’s just a human incentive thing, it’s just the way it goes. And I loved it -- and I loved my brothers and sisters on r/EthTrader. \n\nThis is why I got my family and friends into crypto. I wanted them to see the potential of this stuff, and I also wanted them to make some money and enjoy the freedom that would provide them during their short time on earth. I wanted to share it with them. There is nothing better.\n\nBlockchains are about moving value around. Yes, it’s also based on the shared idea of building a better world. But the nuclear fuel is that we can get rich doing good, as we define it. I have no problem with that. It’s how crypto has grown from zero to more than a trillion dollars in a little over a decade. I dare say, if this were all an open source project with no tokens, I wouldn’t be having this conversation with you. I’d be too busy putting together my TPS reports for tomorrow’s meeting. \n\nMy thesis isn’t that the love these DAO prophets are feeling is bad or fake. It’s good and it’s real. But here are a few observations:\n\n**Love becomes more complicated in a bear market.** Shit gets real. People drop off, trolls appear from nowhere to gloat. It’s like when your literal honeymoon is over and a few months later, as you are slogging away at your job, you notice that your spouse never does the dishes. So you say something, and then you are in a fight, and that leads to several long conversations. In the end, you figure it out and you are good, maybe even better than before, but the euphoric feeling is gone. \n\n**People leave and you’ll miss them.** In the Ethereum community circa 2016-2017 many people jumped into other coins and disappeared. I’m still sad that Emin Gun Sirer left to start his own coin, since he was one of my Ethereum heroes (though he was never officially part of the dev team). The same thing will happen with DAOs. Soldiers in one DAO will develop the skills and the incentives to start their own DAOs. One day they will be  gone, and it feels like you lost a family member. Some of these people will turn out to be very big deals in their new communities. You will miss them, and feel nostalgic for when you were all pulling together (and sharing the same wallet, dammit). \n\n**There is nothing like your first love.** You don’t need an OG to tell you this. But it won’t always be like this. Right now everyone is chugging along in the same direction, making soon-to-be life changing money and figuring it out together. Then after a while, everyone gets used to the big idea being accepted as conventional wisdom in the mainstream. At this point, it would almost feel like bragging to express how damn happy you are and how much you love everyone traveling with you, considering how right you all were. That’s OK. Trust me, if the DAO CT lovefest continued indefinitely, it’d  become a love cult and we’d scare off the next round of adopters. \n\n### Savor this time, DAO brothers and sisters. You won’t necessarily get jaded, or even fall out of love with one another. But recognize this is the honeymoon, so make it count and make it last. \n\n### \n\n \\n ", "timestamp": 1630002158, "digest": "waeBXOCINpDjis51zShm2mN-cbdKv_x2wsQ6HEvbLuw", "contributor": "0xfbdf598dB4dBA841f40680Cd9C2D3cF618265be0"}
{"id": "yttSRe0NEwQuFLkhNPCUy6RhQnqlZdGrHKnq2IrL-Cs", "title": "What's next for PartyDAO", "body": "A few days after PartyDAO's formation, we stated our two primary mandates:\n\n1. Ship PartyBid, a product for collective bidding on NFTs\n2. Build PartyDAO itself into a long-lasting organization that can fund its own continued existence\n\nOver the past few months, our members built and shipped PartyBid V1 to resounding success. In its first 48 hours live, PartyBid processed over 1200 ETH in volume and earned over 60 ETH, with Parties pulling in victories on several high-profile auctions. Since launch, over 2600 ETH have been contributed to Parties.\n\nAs we continue to build and improve PartyBid, we're expanding our focus to ensure that we deliver on our second mandate: growing PartyDAO into a successful long-term organization. Doing so requires a clear long-term vision for what we aim to achieve, and as a DAO that builds software, we think it's most important to articulate our vision for the software we intend to build.\n\nIn the weeks since PartyBid launched, we've faced many questions about whether or not all the excitement for PartyBid is just a flash in the pan. Crypto moves in strong boom and bust cycles, and when seen as a toy for throwing money at JPEGs surrounded by emoji-flavored cursors, it might seem like PartyBid is just part of the hype.\n\nWe don't think that's the case. The crypto industry has long heralded the age of the sovereign individual, free from mandatory participation in social institutions. But even in the absence of mandatory social ties, everything from early hunter-gatherer tribes to more recent examples like the GME stock rally show that people naturally want to coordinate together around shared goals.\n\nAs crypto transitions into a time when all kinds of new and useful applications exist across the ecosystem, it is a natural next step for people to join forces and participate in this ecosystem together. PartyBid is an early torchbearer for technology that enables this coordination: multiplayer crypto products.\n\nAs we look toward the future, enabling this kind of group coordination is what PartyDAO is all about. PartyDAO builds multiplayer products for crypto.\n\nIn the near-term, it's clear that there is tons of work to do in order to build PartyBid into the best possible protocol for establishing collective ownership. In the immediate days following our launch, communities rallied to form PartyBids for a variety of different causes. The [Party of the Living Dead](https://www.partybid.app/party/0x2912F57F93dD69FBbF477B616D6f8C34C49bb282) bought a rare Zombie punk and established a virtual group identity. [Sirsu](https://twitter.com/sirsuhayb)'s [CRYPTO COOKOUT](https://twitter.com/ourZORA/status/1424492663726804992?s=20) brought people together to win auctions for black and brown CryptoPunks. [PartyPAC](https://twitter.com/prtyDAO/status/1423847784415956992?s=20) collected funds to donate to CoinCenter in the fight against legislation threatening the crypto industry. More recently, Nouns announced [recurring Parties](https://twitter.com/punk4156/status/1430926348810395649?s=20) to bring people together on a regular cadence.\n\nAll of these examples represent strong use-cases for PartyBid and the wide range of goals around which the product can help people direct their combined energy. Our own members are now well underway developing improvements that will help take PartyBid to the next level.\n\nLooking even further ahead, we believe more and more crypto applications are waiting to become multiplayer versions of themselves. As we continue to grow, PartyDAO aims to play a key role in this transition.\n\nWith this vision intact, we are planning the long-term future of PartyDAO. Equally as important as the software we build is our organization, and in coming weeks, we hope to set PartyDAO up for its next major phase of growth and building.\n\n[Stay tuned](https://twitter.com/prtyDAO) for more updates, and let's keep the party going.\n\n— The PartyDAO Team", "timestamp": 1630002195, "digest": "NHMOTjy3j3EB21GTpWYH3CrMFD2k4WKTB3EpM1dkACc", "contributor": "0xB0623C91c65621df716aB8aFE5f66656B21A9108"}
{"id": "1t79n-BmE42MLHLU5YWahIz7KJRww4eQWLEmE41436w", "title": "Tutorial: How to Swap Tokens on 1inch", "body": "[1inch](https://app.1inch.io/) is a [DEX aggregator](https://coinmarketcap.com/alexandria/glossary/dex-aggregator) with over $70B in total volume across 540k+ users. To give users the best token exchange rates, 1inch searches across various liquidity sources & swaps your tokens on the exchange with the cheapest rate.\n\n[https://app.1inch.io/](https://app.1inch.io/)\n\nThey support 50+ liquidity sources on the Ethereum network, 20+ on Binance Smart Chain, and 7+ on Polygon, and their Pathfinder algorithm optimizes for the most cost efficient token swap path if necessary to minimize fees.\n\nWhy does this matter?\n\nAs people become more crypto native, they'll initiate more on-chain transactions, which will, in turn, result in more fees paid to the network. In the long run, these fees add up, so any effort to minimize them is a good practice. In addition, since cryptocurrencies are volatile assets, using DEX aggregators like 1inch can help minimize [slippage](https://coinmarketcap.com/alexandria/glossary/slippage) too.\n\nThere are 4 main parts to 1inch:\n\n* **The Aggregation Protocol** — aggregates on-chain price data from DEXs and helps you pick the best DEX on which you should swap your tokens.\n* **The Liquidity Protocol** — an [AMM](https://coinmarketcap.com/alexandria/glossary/automated-market-maker-amm) that prevents front-running attacks and provides yield to liquidity providers.\n* **The Limit Order Protocol** — allows you to initiate limit orders in DeFi.\n* **The DAO & its governance token** — a decentralized autonomous organization that governs the broader 1inch network. Using the 1inch token, holders can vote on 1inch governance proposals.\n\nFor the sake of this guide, we'll focus on the aggregation protocol & walk through how to swap tokens on 1inch.\n\n## How to Swap Tokens using 1inch\n\n### Step 1: Navigate to the 1inch dApp and connect your crypto wallet.\n\n![Click \"Connect Wallet\" & Sign in with your Metamask](https://images.mirror-media.xyz/publication-images/a88d33cc-b55d-45fc-b0ce-eea9cfdb989a.png?height=156&width=2798)\n\n### Step 2: Select the token you want to swap in the \"From\" drop-down menu & input the amount of that token you want to exchange.\n\n![](https://images.mirror-media.xyz/publication-images/035c00cf-89a4-4cb5-8793-c340456ed690.png?height=1236&width=984)\n\n### Step 3: Select the token you want to receive in the \"To\" drop-down menu.\n\nYou should immediately see the amount of tokens to be received (minus slippage) show up in the \"To\" area. You should also see multiple options for the exchanges you can use to swap your tokens. Since 1inch is a DEX aggregator, you can choose whichever exchange gives you the best rate directly from their interface, similar to how you may use Kayak for booking travel.\n\n### Step 4: Swap your tokens.\n\nIf this is your first time using [1inch](https://app.1inch.io/), you'll have to \"Give permission to swap,\" which will trigger an \"approval transaction.\" The approval transaction is not the swap transaction. You'll have to initiate a second transaction to actually swap your tokens, incurring gas fees both times.\n\nClick the swap button to swap your tokens & confirm the transaction in your wallet.\n\n### Congratulations! You've officially swapped tokens using 1inch.\n\n\n---\n\nIf you have any questions about this guide, feel free to reach out directly on Twitter [@NotZachDavidson](https://twitter.com/NotZachDavidson).", "timestamp": 1630003885, "digest": "OzbK05w_pHTX9GWm_Q_4KCooZPJUnZ-RnrBdwMGXF0Y", "contributor": "0xE8B0016130A38f26c116576A7b13267c9FB11B59"}
{"id": "fY9fjcUeUEwub5qnNBWndpd533CWfjnCZ_q_DBa85Ng", "title": "Tutorial: How to Swap Tokens on 1inch", "body": "[1inch](https://app.1inch.io/) is a [DEX aggregator](https://coinmarketcap.com/alexandria/glossary/dex-aggregator) with over $70B in total volume across 540k+ users. To give users the best token exchange rates, 1inch searches across various liquidity sources & swaps your tokens on the exchange with the cheapest rate.\n\n[https://app.1inch.io/](https://app.1inch.io/)\n\nThey support 50+ liquidity sources on the Ethereum network, 20+ on Binance Smart Chain, and 7+ on Polygon, and their Pathfinder algorithm optimizes for the most cost efficient token swap path if necessary to minimize fees.\n\nWhy does this matter?\n\nAs people become more crypto native, they'll initiate more on-chain transactions, which will, in turn, result in more fees paid to the network. In the long run, these fees add up, so any effort to minimize them is a good practice. In addition, since cryptocurrencies are volatile assets, using DEX aggregators like 1inch can help minimize [slippage](https://coinmarketcap.com/alexandria/glossary/slippage) too.\n\nThere are 4 main parts to 1inch:\n\n* **The Aggregation Protocol** — aggregates on-chain price data from DEXs and helps you pick the best DEX on which you should swap your tokens.\n* **The Liquidity Protocol** — an [AMM](https://coinmarketcap.com/alexandria/glossary/automated-market-maker-amm) that prevents front-running attacks and provides yield to liquidity providers.\n* **The Limit Order Protocol** — allows you to initiate limit orders in DeFi.\n* **The DAO & its governance token** — a decentralized autonomous organization that governs the broader 1inch network. Using the 1inch token, holders can vote on 1inch governance proposals.\n\nFor the sake of this guide, we'll focus on the aggregation protocol & walk through how to swap tokens on 1inch.\n\n## How to Swap Tokens using 1inch\n\n### Step 1: Navigate to the 1inch dApp and connect your crypto wallet.\n\n![Click \"Connect Wallet\" & Sign in with your Metamask](https://images.mirror-media.xyz/publication-images/a88d33cc-b55d-45fc-b0ce-eea9cfdb989a.png?height=156&width=2798)\n\n### Step 2: Select the token you want to swap in the \"From\" drop-down menu & input the amount of that token you want to exchange.\n\n![](https://images.mirror-media.xyz/publication-images/035c00cf-89a4-4cb5-8793-c340456ed690.png?height=1236&width=984)\n\n### Step 3: Select the token you want to receive in the \"To\" drop-down menu.\n\nYou should immediately see the amount of tokens to be received (minus slippage) show up in the \"To\" area. You should also see multiple options for the exchanges you can use to swap your tokens. Since 1inch is a DEX aggregator, you can choose whichever exchange gives you the best rate directly from their interface, similar to how you may use Kayak for booking travel.\n\n### Step 4: Swap your tokens.\n\nIf this is your first time using [1inch](https://app.1inch.io/), you'll have to \"Give permission to swap,\" which will trigger an \"approval transaction.\" The approval transaction is not the swap transaction. You'll have to initiate a second transaction to actually swap your tokens, incurring gas fees both times.\n\nClick the swap button to swap your tokens & confirm the transaction in your wallet.\n\n### Congratulations! You've officially swapped tokens using 1inch.\n\n\n---\n\nIf you have any questions about this guide, feel free to reach out directly on Twitter [@NotZachDavidson](https://twitter.com/NotZachDavidson).", "timestamp": 1630003872, "digest": "OzbK05w_pHTX9GWm_Q_4KCooZPJUnZ-RnrBdwMGXF0Y", "contributor": "0xE8B0016130A38f26c116576A7b13267c9FB11B59"}
{"id": "A_uE2DK_oq_7Mot_gyzLuz5dg38bnCCle0UI1FQqgYw", "title": "Tutorial: How to Swap Tokens on 1inch", "body": "[1inch](https://app.1inch.io/) is a [DEX aggregator](https://coinmarketcap.com/alexandria/glossary/dex-aggregator) with over $70B in total volume across 540k+ users. To give users the best token exchange rates, 1inch searches across various liquidity sources & swaps your tokens on the exchange with the cheapest rate.\n\n[https://app.1inch.io/](https://app.1inch.io/)\n\nThey support 50+ liquidity sources on the Ethereum network, 20+ on Binance Smart Chain, and 7+ on Polygon, and their Pathfinder algorithm optimizes for the most cost efficient token swap path if necessary to minimize fees.\n\nWhy does this matter?\n\nAs people become more crypto native, they'll initiate more on-chain transactions, which will, in turn, result in more fees paid to the network. In the long run, these fees add up, so any effort to minimize them is a good practice. In addition, since cryptocurrencies are volatile assets, using DEX aggregators like 1inch can help minimize [slippage](https://coinmarketcap.com/alexandria/glossary/slippage) too.\n\nThere are 4 main parts to 1inch:\n\n* **The Aggregation Protocol** — aggregates on-chain price data from DEXs and helps you pick the best DEX on which you should swap your tokens.\n* **The Liquidity Protocol** — an [AMM](https://coinmarketcap.com/alexandria/glossary/automated-market-maker-amm) that prevents front-running attacks and provides yield to liquidity providers.\n* **The Limit Order Protocol** — allows you to initiate limit orders in DeFi.\n* **The DAO & its governance token** — a decentralized autonomous organization that governs the broader 1inch network. Using the 1inch token, holders can vote on 1inch governance proposals.\n\nFor the sake of this guide, we'll focus on the aggregation protocol & walk through how to swap tokens on 1inch.\n\n## How to Swap Tokens using 1inch\n\n### Step 1: Navigate to the 1inch dApp and connect your crypto wallet.\n\n![Click \"Connect Wallet\" & Sign in with your Metamask](https://images.mirror-media.xyz/publication-images/a88d33cc-b55d-45fc-b0ce-eea9cfdb989a.png?height=156&width=2798)\n\n### Step 2: Select the token you want to swap in the \"From\" drop-down menu & input the amount of that token you want to exchange.\n\n![](https://images.mirror-media.xyz/publication-images/035c00cf-89a4-4cb5-8793-c340456ed690.png?height=1236&width=984)\n\n### Step 3: Select the token you want to receive in the \"To\" drop-down menu.\n\nYou should immediately see the amount of tokens to be received (minus slippage) show up in the \"To\" area. You should also see multiple options for the exchanges you can use to swap your tokens. Since 1inch is a DEX aggregator, you can choose whichever exchange gives you the best rate directly from their interface, similar to how you may use Kayak for booking travel.\n\n### Step 4: Swap your tokens.\n\nIf this is your first time using [1inch](https://app.1inch.io/), you'll have to \"Give permission to swap,\" which will trigger an \"approval transaction.\" The approval transaction is not the swap transaction. You'll have to initiate a second transaction to actually swap your tokens, incurring gas fees both times.\n\nClick the swap button to swap your tokens & confirm the transaction in your wallet.\n\n### Congratulations! You've officially swapped tokens using 1inch.\n\n\n---\n\nIf you have any questions about this guide, feel free to reach out directly on Twitter [@NotZachDavidson](https://twitter.com/NotZachDavidson).", "timestamp": 1630003812, "digest": "OzbK05w_pHTX9GWm_Q_4KCooZPJUnZ-RnrBdwMGXF0Y", "contributor": "0xE8B0016130A38f26c116576A7b13267c9FB11B59"}
{"id": "tA9M7lSUSWXQGpy-OgVBLSYXq3c2--G9bZNljZzdquE", "title": "Tutorial: How to Swap Tokens on 1inch", "body": "[1inch](https://app.1inch.io/) is a [DEX aggregator](https://coinmarketcap.com/alexandria/glossary/dex-aggregator) with over $70B in total volume across 540k+ users. To give users the best token exchange rates, 1inch searches across various liquidity sources & swaps your tokens on the exchange with the cheapest rate.\n\n[https://app.1inch.io/](https://app.1inch.io/)\n\nThey support 50+ liquidity sources on the Ethereum network, 20+ on Binance Smart Chain, and 7+ on Polygon, and their Pathfinder algorithm optimizes for the most cost efficient token swap path if necessary to minimize fees.\n\nWhy does this matter?\n\nAs people become more crypto native, they'll initiate more on-chain transactions, which will, in turn, result in more fees paid to the network. In the long run, these fees add up, so any effort to minimize them is a good practice. In addition, since cryptocurrencies are volatile assets, using DEX aggregators like 1inch can help minimize [slippage](https://coinmarketcap.com/alexandria/glossary/slippage) too.\n\nThere are 4 main parts to 1inch:\n\n* **The Aggregation Protocol** — aggregates on-chain price data from DEXs and helps you pick the best DEX on which you should swap your tokens.\n* **The Liquidity Protocol** — an [AMM](https://coinmarketcap.com/alexandria/glossary/automated-market-maker-amm) that prevents front-running attacks and provides yield to liquidity providers.\n* **The Limit Order Protocol** — allows you to initiate limit orders in DeFi.\n* **The DAO & its governance token** — a decentralized autonomous organization that governs the broader 1inch network. Using the 1inch token, holders can vote on 1inch governance proposals.\n\nFor the sake of this guide, we'll focus on the aggregation protocol & walk through how to swap tokens on 1inch.\n\n## How to Swap Tokens using 1inch\n\n### Step 1: Navigate to the 1inch dApp and connect your crypto wallet.\n\n![Click \"Connect Wallet\" & Sign in with your Metamask](https://images.mirror-media.xyz/publication-images/a88d33cc-b55d-45fc-b0ce-eea9cfdb989a.png?height=156&width=2798)\n\n### Step 2: Select the token you want to swap in the \"From\" drop-down menu & input the amount of that token you want to exchange.\n\n![](https://images.mirror-media.xyz/publication-images/035c00cf-89a4-4cb5-8793-c340456ed690.png?height=1236&width=984)\n\n### Step 3: Select the token you want to receive in the \"To\" drop-down menu.\n\nYou should immediately see the amount of tokens to be received (minus slippage) show up in the \"To\" area. You should also see multiple options for the exchanges you can use to swap your tokens. Since 1inch is a DEX aggregator, you can choose whichever exchange gives you the best rate directly from their interface, similar to how you may use Kayak for booking travel.\n\n### Step 4: Swap your tokens.\n\nIf this is your first time using [1inch](https://app.1inch.io/), you'll have to \"Give permission to swap,\" which will trigger an \"approval transaction.\" The approval transaction is not the swap transaction. You'll have to initiate a second transaction to actually swap your tokens, incurring gas fees both times.\n\nClick the swap button to swap your tokens & confirm the transaction in your wallet.\n\n### Congratulations! You've officially swapped tokens using 1inch.\n\n\n---\n\nIf you have any questions about this guide, feel free to reach out directly on Twitter [@NotZachDavidson](https://twitter.com/NotZachDavidson).", "timestamp": 1630004113, "digest": "Az4z69YCC3EnbPdrzdX7qTedClA1bDMXjpDUvfQVt2Y", "contributor": "0xE8B0016130A38f26c116576A7b13267c9FB11B59"}
{"id": "U__zaqw42ywIACzbSXEx30ehhCpKlK7q5P1sFEU3u5c", "title": "Tutorial: How to provide liquidity on Balancer (Polygon)", "body": "## What is Balancer?\n\nBalancer is an automated market maker (AMM) protocol that allows users to swap assets using liquidity pools, similar to Uniswap. However, Balancer differs from Uniswap in a major way in that the liquidity pools are able to have up to 8 assets deposited in them, and the desired ratio between those assets can be set by the person that creates it. This essentially allows users to create custom investment vehicles that can act like index funds in which they can collect transaction fees from people using the pool. This comes with the added benefit of being able to maintain the ratios of the assets in their portfolio by having arbitragers effectively manage the fund for them.\n\n## Balancer on Polygon?\n\nIn this tutorial, we will be covering how to provide liquidity on Balancer on the Polygon network. Polygon is an EVM smart contract-enabled side chain that is very similar to Ethereum. This means that you can use familiar tools like MetaMask to approve transactions. An added benefit is that the transaction fees on Polygon are much lower than on Mainnet Ethereum.\n\nIn order to get assets onto Polygon, you will need to use a bridge. Which you can find here: [ETH<>Polygon bridge](https://wallet.matic.network/bridge/)\n\nHere is a tutorial on how to [Use Polygon for the first time](https://rabbithole.mirror.xyz/Hm0zb1vkvx0yoj9EfvqCt119vsMdcD0Cp9Sk25hyNic), but in this tutorial, I will assume you have already gone through it.\n\n## How to provide liquidity on Balancer\n\n### What you will need:\n\n1. A supported web3 wallet.\n2. Some Matic in your wallet to pay gas fees.\n3. 1 to 8 assets in your wallet on Polygon Network that you wish to invest.\n\nI will also assume that you are familiar with approving transactions with your wallet software.\n\nOnce you have everything you need from the list above, we are ready to dive in.\n\n### Step 1. Go to the Balancer v2 investments page and connect your wallet\n\nYou can get to the investment page by clicking this link https://polygon.balancer.fi/#/. Then you will need to click the “Connect wallet” button in the top right corner of the page and select the wallet software you prefer from the list. Make sure you set the network to Polygon Mainnet.\n\n*If you are managing several wallets with the same software, you will also need to specify which address you wish to connect to the site.*\n\n![](https://images.mirror-media.xyz/publication-images/0ea06ba5-a000-4cf3-8767-569ae7a3fcc2.jpeg?height=951&width=1919)\n\nStep 2. Choose a pool you wish to invest in.\n\nYou can scroll through the list or use the “Filter by token” field to search for the pool you wish to invest in. You can also use three of the column headings to sort the list by metrics that may help you decide which pool you wish to choose.\n\nNote that there are several different types of pools, and it is important to understand how each one works if you wish to invest in it. To read about them you can visit the Balancer documentation here: https://docs.balancer.fi/core-concepts/protocol/pools#pool-types\n\nWhen you’ve made your decision, click on the row in the table that represents the pool you wish to invest in.\n\n*The green dots over assets in the “Composition” column identify assets that you already have in your wallet*\n\n![](https://images.mirror-media.xyz/publication-images/94405f2e-18bf-427e-9def-2d4011a91a42.jpeg?height=867&width=1564)\n\nStep 3. Enter the amount you wish to invest.\n\nFor this example, we’ll be using the USDC/SNX/GRT/WETH pool, which is a Weighted Pool (see top left in photo). This means that the ratios between each asset were set when the pool was created and it is optimized to maintain those ratios as it is used.\n\nOn the right side of the screen, you will need to enter the assets in the correct ratio in order to enter the pool. However, if you don’t have all of the required assets in your wallet, Balancer will perform the necessary conversions for you as long as you deposit at least one of the required assets. In this case, there is only 100 USDC in the wallet and the weights of each asset is set to 25/25/25/25, so when depositing it, Balancer will use the pool to trade 75 USDC for the equivalent of 25 USDC of each of the other assets before entering the pool.\n\nOf course, before depositing any assets in the pool, you will need to approve the contract to use your funds. Click “Approve…” and submit a transaction for each asset you have, and then click the “Invest…\" button and submit the last transaction.\n\n![](https://images.mirror-media.xyz/publication-images/07710629-76b6-48cd-80a2-df8c9dde7b7d.jpeg?height=626&width=1570)\n\nStep 4. Monitor your investment\n\nOnce the transaction goes through you will be able to see the pool in the “My V2 investments” section on the page from Step 1.\n\n![](https://images.mirror-media.xyz/publication-images/cd020a1a-3903-4c11-96dc-4204ece8b040.jpeg?height=416&width=1581)\n\nIf you view the pool again you can now click on the “Withdraw” tab to view the assets and their current values. If you wish to reclaim your funds, you can choose to receive them as your share of each token in the proportions shown by selecting “Best price”...\n\n![](https://images.mirror-media.xyz/publication-images/1c25d41c-faa6-4e6e-87a4-a4f3d8f4d347.jpeg?height=628&width=504)\n\n...or you can withdraw them as a single token, by selecting “Single token” and then clicking the “Withdraw…” button and approving the transaction.\n\n![](https://images.mirror-media.xyz/publication-images/23e1afdc-d776-407f-a5ca-14553d6ec607.jpeg?height=577&width=499)\n\n## Congrats you now know how to become an LP on Balancer!!\n\n*Always remember to return to the RabbitHole site in order to redeem each task and then mark the Quest as complete within the timeframe so that you will be eligible for the reward.*", "timestamp": 1630005801, "digest": "_MqYw-kl3-KlGnxOtgXNPr9Be8MD1Bsn4zGotMvxQQQ", "contributor": "0x8926B75642C2650aE3c5b227bAD2F7158ceaCCD1"}
{"id": "X9khcPSFS8LyJtrCy3KxuTxK7z2hmSNb4m_P__yF7T4", "title": "Programmable Collateral: Bringing Music Royalties On-Chain", "body": "The exciting ways to use Ethereum stretch far beyond financial applications - as NFTs are currently showing, but a less-than-sexy area of music, royalties, are already being paid faster and more efficiently today using DeFi and NFTs. \n\nPaperchain is a company that was formed in 2017 and founded by Dan Dewar. After riding through the rise and fall of the 2017-2018 period in crypto they had landed on a strong value proposition: *collateralize streaming data for an artist on Spotify and use that to create synthetic assets on-chain that can be immediately paid to the artist.* \n\n**This solved a big problem: slow royalty payments**\n\nSpotify is well known for not producing much income in the way of royalties for artists. What it is not as well known for is how slow those royalty payments can be - sometimes taking as much as 75 days. That is slow, but other sources are even slower. Paperchain recognized this as an issue DeFi was uniquely positioned to solve. \n\nWhat if NFTs weren’t just collectibles or art or token gates? What if NFTs could be programmable collateral?\n\n![High-level diagram of how Paperchain uses NFTs, Tinlake, and DAI for providing immediate royalties on Ethereum.](https://images.mirror-media.xyz/publication-images/e3b21906-182b-4a4a-b0fd-2107c345abc8.png?height=666&width=1358)\n\nPaperchain has now been at this for awhile - first announcing their plans to leverage NFTs and DeFi [publicly in 2019 in a partnership with Centrifuge](https://medium.com/centrifuge/centrifuge-tinlake-and-paperchain-join-forces-to-accelerate-music-streaming-revenues-c83324d116e7).\n\nHow it works: Paperchain provides the data from a music distributor, gives a market rate for the per stream of the individual artist, and use Centrifuge’s Tinlake to mint DAI that could be paid to the artist the same day the streams happened.\n\n> Paperchain is leveraging a unique combination of NFTs x DeFi to unlock the creator economy with a web3 layer that makes content interoperable with digital assets and community monetization models.\n\n**This solves a bigger problem: On-chain music royalties**\n\nLast week Paperchain [announced that they are now available to select United Masters customers](https://www.rollingstone.com/pro/news/unitedmasters-advances-real-time-royalty-payments-beatbread-paperchain-1213546/), now making a crypto wallet available with an incumbent music distributor.\n\nPaperchain is now an App + Debit Card that creators can use to access daily partners, and is partnering with music distributors to help them pay their artists daily. More significantly, they are moving towards giving artists a wallet to interact with crypto. You can use the debit card to spend your DAI at the store, sure, but maybe in the future you could also use the app to buy NFTs or Social Tokens of another artist.\n\n![Paperchain app](https://images.mirror-media.xyz/publication-images/48b241e0-e289-4bac-ad47-46b80e34f3dd.png?height=1400&width=1210)\n\nThis is all part of a grander vision for Dan Dewar, CEO of Paperchain. He notes that royalty payments may not add up to much today but aggregating them in one place will lead to wealth accumulation. Dan also noted that Paperchain surveyed users for new features and that they found that artists were more interested in buying crypto with their streaming payments as opposed to things like cash back rewards with the card.\n\nGiving artists the tools to bring their work into parity with the payments they receive for that work has been a large value proposition of web3. The problem has been that payments have not been on-chain and artists didn’t have identity on-chain. Paperchain has now augmented legacy payment systems to realize on-chain royalty payments for music - in a way that bridges legacy media to web3 layers. \\n  \\n When music can be distributed to Spotify + all other DSPs and those royalties can be brought on-chain - artists can then explore ways to give value back to their fans in more novel ways. Royalties from streaming can flow to NFTs, social token holders, early followers, and anyone who has a record of interacting with that artist on-chain.\n\n**Paperchain can expedite streaming payments for artists now but I think that will be one of the smaller achievements in comparison to what else they have unlocked in the process.**\n\n*Special thanks to Dan Dewar for helping make this piece happen.  \\n  \\n Checkout [paperchain](https://paperchain.io).io or give them a follow @[paperchainio](https://twitter.com/paperchainio)*", "timestamp": 1630010356, "digest": "tWIcB9-GiPA7MbtS3Q7cpitQsM9Z_SK6nc2pIuOsDs0", "contributor": "0xaD8717E33C719a9B407Ad6B40d0Be237845c2FbF"}
{"id": "4oPPGDaWt73miF18AOq0qhkCaUxpvacA-W_Sfx6xjvc", "title": "L1 & L2", "body": "[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F02b677cc-9cec-43b5-aa8f-841f086e6115\\_2001x998.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F02b677cc-9cec-43b5-aa8f-841f086e6115\\_2001x998.png)\n\nSocial tokens on Coinvise can be minted (created) either on **Ethereum Mainnet (L1)** or **Polygon (Matic) Network (L2)**.\n\nIt is essential to understand that this isn't necessarily binary, as your tokens can exist on different blockchains. The two solutions have pros and cons, and the goal of this article is to help you navigate this to choose the best Blockchain depending on your needs.\n\nWe'll go through what a Blockchain is, what exactly is Layer 1 and Layer 2, and in which case you should use one or the other.\n\n### **1/ What is a Blockchain?**\n\nToday, if you want to buy a new item on the internet, chances are you're going to pay with your Credit Card. If you've just bought a $20 item, you'll ask your bank to send those $20 to the seller by processing the payment. If verified, the bank will confirm you have the right amount in your bank account and send the money to the seller's bank. This system works because everyone trusts the banks to store your money safely and trusts them to send your money to the seller when asking. The thing is that you don't own your money, and the banks are investing your money until you ask for it. Those are some of the reasons why blockchains have been invented.\n\n**A blockchain is a digital ledger that stores all the transactions in a decentralized and secure way thanks to cryptographic mechanisms.** Instead of relying on third parties such as banks to serve as the middleman in a transaction, you can securely send money without having to trust the recipient by doing it on a Blockchain. Every action taken on the Blockchain must be verified by others to be approved, making sure there is no fraud.\n\n### **2/ What is Layer 1 & Layer 2 (L1\\&L2)?**\n\n**L1 stands for Layer 1 (also called Ethereum Mainnet), which is the Ethereum Blockchain.** It's the main network where every Transaction takes place. As mentioned above, transactions happening on the Ethereum Mainnet (L1) need to be verified by others to be approved. Users that verify the transactions are called \"*Miners*\" and to thank those contributors (*Miners*) for verifying a transaction and incentivizing them to make the network more secure, we give them a tip, a slice of the trade, also called \"*Gas fees.*\"\n\nDue to its infrastructure, **the Ethereum Blockchain can currently process around 15 transactions per second**. This infrastructure means that you'll sometimes have to wait hours before seeing your Transaction approved, while some users need their transactions to be approved quicker. Those users can offer more money to reward the *Miners* and see their transactions being approved in priority. As more and more people want to do transactions on the Blockchain and are keen to pay a higher price (*Gas fees*) to reward contributors (*Miners*), the price increases.\n\nTo solve this problem of paying high fees for every Transaction, projects have emerged to create another Blockchain on top of the Ethereum Blockchain. It's those blockchains that we're calling Layer 2. **These other Blockchains (Layer 2) help increase Layer 1 by handling transactions off-chain and increasing the number of transactions that can happen simultaneously.** These Layer 2 Blockchains use the exact Ethereum Blockchain mechanisms that make it easy for certain transactions to run through their network (Blockchain) while maintaining the same level of security. **By creating copies of the original Ethereum blockchains, they offload transactions from the main chain and help reduce the gas fees (slice of the trade).** Layer 2 is built on top of Layer 1 and doesn't replace nor be a competitor of the Ethereum Mainnet. Several Layer 2 blockchains exist, such as **Polygon (Matic) Network, Optimism, or BSC,** and these blockchains allow between 2k and 4k transactions per second (compared to 15/s on the Ethereum Blockchain).\n\n### **3/ What are the implications for a Creator?**\n\nNow that you have a better understanding of the differences between **Ethereum Mainnet (L1)** or** Polygon (Matic) Network (L2)**, you can make wiser decisions on which Blockchain to choose for certain transactions.\n\nWhat is essential to understand is that **this isn't necessarily binary, as your tokens can exist on different blockchains. **Layer 1 might be preferable for **High-Value **Transactions (if you want to send a $5k worth NFT to the winner of an auction, for example). In contrast, Layer 2 might be more beneficial for **High Volume **Transactions (if you need to send a small number of your tokens to many people). We could compare Layer 1 with a Fedwire transfer and Layer 2 with an application like Venmo. You need both in your life, but the use cases are different. For small transactions such as sending $10 to some of your friends, it makes more sense to use Venmo (easier to make many small transfers, better mobile integration etc..). On the other hand, maybe it's more appropriate for high-value transactions to send a Fedwire transfer (If you need to pay your student loan, for example).\n\nThe rationale behind using Layer 2 instead of Layer 1 is the *Gas Fees*, as explained previously. The more transactions you're making, the more expensive the *Gas Fees* will be. If you're planning to airdrop (send) 1 token to 20 of your friends or community members, you'll have to run 20 transactions on the Blockchain, which can result in a lot of *Gas Fees* to pay. By running these \"**High Volume** transactions'' on the **Polygon (Matic) Network (L2)**, you'll save money. On the other hand, if you have to send a **High-Value** NFT, you'll have to run only one Transaction for a decent amount of money, which wouldn't make sense to make this Transaction on Layer 1.\n\nNow, let's take a closer look at which Layer you should use for different use cases to make sure you've understood the difference between L1 & L2.\n\n**You should make the transactions on the Ethereum Mainnet (L1) for :**\n\n*   *NFT drops* - If you need to send NFTs to a **few people** in your community (**High-value** transactions)\n*   *Pooling Liquidity* - If you need to create a Pool on Uniswap (**one Transaction** of a possibly large number of tokens - **High-Value** Transaction)\n*   *Bounties* - You can set up bounties on Coinvise. If you need to outsource specific missions (Writing an article, do a design, make a video) and create bounties. It makes sense to use Layer 1 in this case, as you need **only one person** to complete the mission.\n\n**You should make the transactions on the Polygon (Matic) Network (L2) for :**\n\n*   *Airdrop / Bulk transactions* - If you need to send tokens to **many people** (**high-Volume** transactions).\n*   *Rewards* - Comparable to airdrop. If you want to reward **all (or a part) of your community** (**high-Volume** Transaction), you should send the rewards through the Polygon (Matic) Network to save Gas fees.\n\nAt this point, you should understand better the dynamics behind making transactions on Layer 1 and Layer 2. Again, there is no right or wrong solution, and you should continuously adapt the number of tokens you have on each blockchain depending on your needs.\n\nIf you want to learn more on how to \"map\" or bridge (transfer) your token to Polygon (L2) network, here is a [complete tutorial](https://www.notion.so/Bridge-Social-Tokens-Multichain-6c2aff4f1c8641829807e6c9124740dd) to do it.\n\n###### **Want more?**\n\nFollow us on **[Twitter](https://twitter.com/CoinviseCo)**,  **[Instagram](https://www.instagram.com/coinvise/?hl=en) **and join us on** [Discord](https://discord.gg/8jaQB5CZ) 🔥**\n\nThanks for being here!\n", "timestamp": 1630015534, "digest": "iVn5U6lVdhY1BWl3pPC2Kpu8noV5rRJpfhhEdXSxDYE", "contributor": "0xC0241e384dB48C35E7b3FEded3BfEcd29A3E73e3"}
{"id": "kjL_8lmMni-KYs8vKGXc-cKnJ_2VsWumV55XFAmYXSc", "title": "Most commonly asked questions from Creators around Social Tokens.", "body": "![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0d3f0023-daca-46e6-983f-5d2bb3839782_4167x2084.jpeg)\n\nWe're entering the 3rd phase of the Creator Economy where **Creators will become their own businesses**. Creators discovered they can now BE the brand, BE the product, and they could do for them what they were doing for others. Creators can now build a direct relationship with their 'fans' and create their own economy thanks to Social Tokens.\n\nIf you're a creator not familiar with Crypto, but you would like to learn more about how it can help you, here's a good starting point.\n\nCoinvise is the most trusted & simple to use platform for creating social tokens and building incentives around them.\n\n### **First things first, what are Social Tokens, and why would I want to create mine?**\n\nSocial Tokens are virtual currencies that live on a blockchain. Put simply, your Social Token will allow you to create an open economy around your project. Anyone will be able to participate in your projects with your $NAME Token. Just as you need to convert your USD in EUR when going to Europe, fans will need to convert their USD in the Creator's social tokens to get involved in its economy/project.\n\n*But why, as a creator, would you want to create a virtual currency (aka Social Token)?*\n\nBy creating a Social Token, you'll gain ownership over your content and have an easier way to collaborate with your community. What Social Tokens allow you, in the end, is unlocking different experiences with your fans. You have control over the means and the production of your content throughout the process. You don't rely on platforms anymore. While, in Web2, creators needed to funnel people into their game (convincing people to follow them on YouTube, for example,) web3 allows new ways of collaboration to create a game and grow together. Instead of limiting the access (paywall in front of an article or a video), Web3 encourages collaboration and opens access to anyone wanting to build and share the upside. It's a complete paradigm shift. It's no more the Creator and its fan, but more a whole community driven by a leader around a common project.\n\nIn the end, it's all about community participation. For example, Forefront, the premier social token community creating and curating resources and spaces to help tokenized communities thrive, rewards its community by giving them bounties. As curating resources is not a small task, creating a Social Token to incentivize everyone to help makes sense. The Forefront's leaders have gathered a strong community and motivated their members to send daily great resources toward becoming\\*\\* \\*\\*the leading platform for insight across the social token community.\n\nEvery audience will turn into a community, and every fan will turn into a partner. With Social tokens, you'll have the power to incentivize anyone to help you achieve broader goals, meet new people and collaborate with others. You'll finally have a direct relationship with your fans and create new kinds of experiences instead of relying on centralized platforms that can potentially ban your content at any time.\n\n### **Concretely, what could I do with my Token if I decide to create one?**\n\nSocial tokens are best used when they scale or incentivize coordination and engagement between communities. Incentives are ideal when it's mutually beneficial to you and your community. You also have to understand that Crypto and social tokens are still early, and we're only scratching the surface of what's possible. There are new experimentations with Social Tokens every week, and everyone's trying to push this space forward as we go.\n\nHere are some use cases you could use your Social Token for :\n\n* **Allow your fans to invest in you early.** Having equity in an individual is much more than speculation. It's more about participation and how anyone can participate in helping grow and share the upside. It incentivizes people around a common goal. By believing in you early and helping you, community members will get a slice of your revenue once you've become more famous. In exchange for a portion of your future payments, you'll get their help and some money to start.\n* **Create bounties to incentivize the community to help you grow** (rating a podcast on Apple Podcast, writing a review on Amazon in exchange for X $NAME token, etc...).\n* **Crowdfund through an NFT** (NFT stands for Non-Fungible Token, which means you'll be the only owner of this specific piece). You can sell an NFT such as a unique autographed book, a YouTube video, or a piece of art and fund your future projects. Again, your community will get ownership over the project and will be incentivized to hype it up.\n* **Create premium experiences.** By holding enough $NAME tokens, certain community members could have access to special perks (the first chapters of a writer's next book in advance, access to a private Discord server, or redeem for one hour of your time, for example).\n* **Collaborate easily with other creators.** By creating a Creator DAO with its Social Token, you'll be able to collaborate with other creators and build more significant projects together. If you're interested in learning more about a Creator DAO, we recommend you [read this article](https://forefront.market/blog/how-creator-daos-redefine-the-way-we-work). (TLDR; It's highly complex today for creators to collaborate as they don't have the right tools to do it nor the experience, but Web3 and Social Tokens will re-invent the way people collaborate).\n\nThese are examples of things you could do today if you mint (create) your Token, but we're always looking for new ways to push the boundaries, and we would be happy to help you with every creative idea you may have to use your Social Token.\n\n### **Ok, that seems interesting. Now, what steps should I follow if I want to create my Social Token?**\n\nFirst, you have to understand that creating a Social Token is not complicated even for non-tech people. The difficulty is to get it accepted. How do you foster a strong community around your project? How do you share your vision? You don't need Technical skills but social ones.\n\nIf you already have a strong community and a clear idea of a project that would need strong collaboration between community members, an excellent first step would be to create a Crypto Wallet ([here's an easy tutorial](https://www.notion.so/coinvise/Create-a-Crypto-Wallet-and-Signup-on-Coinvise-co-e89358998648467c96922002fad2e2fc)) and read more about the specifies of creating a Social Token here. Once you understand better the implication of creating a Social Token, you can make yours in less than 5 mins, thanks to [this tutorial](https://www.notion.so/coinvise/How-to-Mint-a-Personal-Community-Token-7823a7c65c4c454bbdb924f80d9577dd). Again, it's crucial to understand that core use cases that drive successful interaction around them and incentives are ideal when mutually beneficial to you and your community.\n\nThe usual path communities are following are :\n\n* Create a small group and gather strong engagement around a common goal.\n* Create a Social token on Coinvise ([tutorial here](https://www.notion.so/coinvise/How-to-Mint-a-Personal-Community-Token-7823a7c65c4c454bbdb924f80d9577dd)).\n* Crowdfund the project and pool liquidity for their Token (If you're not familiar with Liquidity Pooling you can further read here).\n* Design great bounties to incentivize members to participate (As examples - here are [Forefront's bounties](https://docs.google.com/spreadsheets/d/1Dt5KxK5QmOyPAHBfj81nmY-btyTd0mbPlqJByOmkSR4/edit#gid=196077105)).\n* Collaborate with other projects to grow bigger.\n\n### **I'm interested now. You just said a good first step would be to create a Crypto Wallet. What's that?**\n\nA Crypto Wallet allows you to send/request cryptocurrencies, visualize how much Crypto you have, and serves as your unique decentralized identity.\n\nThe same way you have banking information that you share with anyone that wants to send you money, a Crypto wallet creates and stores your Private & Public Keys (a series of numbers similar to your banking information) that allows you to send and receive money on the Blockchain.\n\nYou'll use your Public Key as Banking information, while your Private Key will serve to verify and validate the transactions on the Blockchain.\n\nYour Crypto wallet also serves as your unique decentralized identity. With it, you can sign up to websites and prove your identity in one click.\n\nFor example, on Coinvise, by signing up with your Crypto Wallet (sharing with us your Public Key), we'll be able to verify \"on-chain\" that you're indeed the person trying to sign up on Coinvise and, therefore, let you airdrop (send) your Social Tokens, create an NFT or bounties. We'll also use your Crypto Wallet to send you your Social Tokens and NFTs if you're making any.\n\n### Conclusion\n\nAt that point, you should be more familiar with what a Social Token is, how it can be beneficial for you as a creator and how to create one. We know how overwhelming learning about crypto can be, so if you have any specific questions, please join our [Discord](https://discord.gg/6q8xv3mW) and reach out to EliotC#2942. If you want to learn more, check out our [FAQ](https://www.notion.so/coinvise/FAQs-44522e9aa88a4c4b89ebf417045699a3) and dig more into our [Wiki](https://coinvise.notion.site/Coinvise-Wiki-64b15ff7c1d04ce3b748ca49f7b3c31f) 😉.\n\n###### **Want more?**\n\nFollow us on **[Twitter](https://twitter.com/CoinviseCo)**,  **[Instagram](https://www.instagram.com/coinvise/?hl=en) and join us on** [Discord](https://discord.gg/8jaQB5CZ) 🔥\n\nIf you liked the article, you can also [tip the author](https://coinvise.co/CDTEliot). Thanks for being here!", "timestamp": 1630015659, "digest": "j9lTJcscv0djgF8-MH3yF440XFYfZcfwoBd4P_zCfV0", "contributor": "0xC0241e384dB48C35E7b3FEded3BfEcd29A3E73e3"}
{"id": "ALlV7okwLTqLooUnRld69SiRJ05YYJvzudQx4Omula4", "title": "Social Token as Financial Assets (Blue Version)", "body": "This essay has been written in Collaboration with [Eliot Couvat](https://twitter.com/CDTEliot) and is part of broader experimentation. You're currently reading the \"Blue version\" of this essay, a short and easy-to-understand version of a wider essay about Financial aspects of Social Tokens. If you're interested in a deep-dive with more insights, you can directly access the Red version on [Eliot Couvat's Newsletter](https://eliotc.substack.com/). If you found this essay useful you can collect [both versions as NFTs](https://coinvise.co/CDTEliot) (2/2).\n\n![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F74b8a7a8-ee02-4c2e-8fa3-9ba85e975b12_2003x999.png)\n\n\\*\\*Social Tokens allow you to unlock different experiences with your community. \\*\\*Every audience will turn into a community, and every fan will turn into a partner. With Social tokens, you'll have the power to incentivize anyone to help you achieve broader goals, meet new people and collaborate with others. You'll finally have a direct relationship with your community and create new kinds of experiences instead of relying on centralized platforms that can potentially ban or censor your work at any time.\n\nWith Social Token used purely for its utility, your tokens can thrive in a niche community even though it has no monetary value. It's more of a social, collectible value that people are proud to own. But to create real incentives around a joint project, the financial value of a Token has its importance.\n\n**Indeed to create a whole new economy where every individual can thrive, we need creators to collaborate, and social tokens have shown their efficiency to incentivize individuals to share their skills with others.** Financial aspects of Social Tokens are more than crucial as well-designed incentives can make your project tremendously grow. Remember that the more value your Token will have, the easiest it will be to incentivize contributors to participate.\n\nThere are two main ways to create a Token. The first one is to make your Token on a \\*\\*Fixed Supply Model \\*\\*; you're creating a fixed supply of Token, the standard is 10M, and you can then distribute it to whoever you want in the way you want. The second one is to create it on a \\*\\*Bonding Curve Model \\*\\*; you're creating your Token on a Bonding Curve, which means the supply starts at 0, and every new Token created will cost more than the previous one.\n\nThere is no right or wrong answer, but there are fundamental differences between creating on a Bonding curve and a fixed supply, and it's essential to understand those differences well to make sure it fits your needs.\n\nToday, we'll explain the main differences between a bonding curve model and a Fixed Supply model and which one you should choose for your project. 🔥\n\n## 1 / The Fixed Supply Model\n\n**1.1 / What does that mean to create my Token on a Fixed Supply?**\n\nThe fixed supply model is a model where **you define the number of tokens you want to create beforehand.** Having a fixed supply allows you to get directly in your Crypto Wallet a known number of tokens that you can share or give to incentivize your community to participate in your project. The industry standard is to create 10 million of your tokens, but you can define the number of tokens you want to create. Successful communities such as [Friends With Benefits](https://www.fwb.help/) or [MetaFactory](https://shop.metafactory.ai/) have minted (created) respectively only 1 million and 420k of their Token. Creating your Token on a Fixed Supply means you have full power over the distribution of the native Token.\n\n![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F973317a0-2466-44c9-bfb2-76992df09c59_1280x720.jpeg)\n\n$FF distribution by Forefront - the token has been minted on a 10M Fixed Supply.\n\nThe fixed supply model works more around personal tokens. If you're a Creator that wants an easy solution to experiment with Social Token and create new experiences with your fan, you should hands-down mint your Token on a fixed supply.\n\nHowever, in creating your Token on a Fixed Supply, you'll be limited at one point if your project grows exponentially as you won't be able to increase the supply. It's also good to remember that when building on a Fixed supply, your Token has no inherent value as you're the owner of most of the supply, and no one has put money into your project. With a token based on a fixed supply, you'll create experiences that don't require inherent value. Experiences that only live in your economy. We could think of a \"control my life\" type of experience, gated articles or content (your fans will need enough of your Token to read the article), tips for spontaneous help, etc.\n\nBut creating your Token on a fixed supply doesn't mean it will never have monetary value, and you can create a Liquidity Pool, set an initial price, and allow anyone to buy your Token.\n\n**Adding value to your Token is not the first thing you should do when creating one. Indeed, you should first focus on making actual use cases for your Token and gather a strong community around your project.** Without a strong community, you won't increase your Token's value as no one will be keen to buy it. Creating a liquidity pool is more a later stage action when you'll want to accomplish new (and maybe more significant) projects than part of the initial tasks you should make when creating a token.\n\nLet's get into the fun part of Social Tokens: The liquidity Pools (LP).\n\n*(If you want to understand more in-depth the advantages of creating a Social Token on a Fixed Supply, you can read the [more extended version of this essay](https://eliotc.substack.com/p/social-token-as-financial-assets)).*\n\n## 2/ Liquidity Pool\n\n**2.1 / What is a liquidity Pool?**\n\nPut simply, creating a Liquidity pool means providing Liquidity for potential buyers. When you're creating a social Token, this Token has no inherent value. **Creating a liquidity pool (LP) allows anyone to buy your Token in exchange for other cryptocurrencies with value in USD**. When the LP is created, users can add the exact value of two Token (your Token + collateral, aka any other token) in a Pool and earn trading fees proportional to their share of the total Liquidity.\n\nUsers putting Liquidity in a pool are named Liquidity Providers, and they make a % of fees on every trade in the pools they participate in and are therefore incentivized to add Liquidity. **Put simply, these Liquidity providers facilitate trading by willing to buy or sell a particular asset at any given time, thereby providing Liquidity and enabling traders to trade without waiting for another buyer or seller to show up**.\n\n**2.2 / So why would you need to pool Liquidity for your Token?**\n\nYou will need to pool Liquidity if you want to create a project that requires collaboration. **By pooling liquidity, you'll drive the value of your Token, define its price and allow anyone to purchase it. Believers of your project will have the power to participate by simply swapping (exchanging) any crypto for your Token. They'll be able to buy your Token by simply going on a decentralized exchange and type the name of your Token.**\n\n![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F15328316-49e4-4beb-97e3-fcb4a9e1f759_2864x1454.png)\n\nUniswap (decentralized exchange) interface.\n\nWhile centralized exchanges match buyers and sellers to determine prices and execute trades, taking a fee on the transaction, Uniswap uses a simple math equation and pools of tokens and ETH to do the same job. By knowing the balance between the ETH and your $NAME token in a pool (Supply & demand), **the equation can determine the price of a particular token whenever someone buys your $NAME Token with ETH**. If your $NAME Token supply decreases while the Supply of ETH increases, your $NAME token price goes up. **Your Token now has a monetary value**.\n\nAlso, by creating a Liquidity Pool, you'll create a place where anyone can buy your token and therefore participate in the project you're building. **It will give ownership to your fans and**, as the value of your token increases (considering more people are buying it and assuming you still own a decent amount of your Token), **you'll get more money to realize your project**.\n\nHowever, suppose you're creating a community around a vision (e.g., BanklessDAO) or building a protocol (e.g., Rarible protocol or Zora). In that case, it might be preferable to create your Token on a Bonding curve.\n\n*(If you want to understand better the mechanisms of liquidity pools and explore more use cases, you can read the [longer version of this essay](https://eliotc.substack.com/p/social-token-as-financial-assets).)*\n\n## 3/ The Bonding Curve Model\n\n**3.1 / What does that mean to create a token on a bonding curve?**\n\nThe core idea of minting a token on a bonding curve is that **its price increases as the Supply or distribution of the Token do.** The more tokens have been distributed, the higher the price. This means that early adopters can buy the Token at a much cheaper rate than when the Supply increases over time.\n\nLet's take an example to illustrate what a bonding curve is. You've just launched your Token on a Bonding curve, and your best friend John wants to buy some. To make it easier, let's say that your Token is on a classic (linear) bonding curve and that the price of the first Token is $1. John will pay $1 for the first Token, $2 for the second, for the third, $3, and so on. This means for John to get the first ten tokens, he will have to pay $1+$2+$3+$4+$5. Totaling at $55.\n\nNow, let's say your Mom wants to buy ten tokens. Your Mom's tokens price won't start at $1 but at $11 (as John already purchased the first ten tokens). Every new buyer **pushed the price up by increasing the Supply.**\n\nOn the other hand, when someone sells a Token, it will be burnt (destroyed), decrease the Supply, and lower the Token price. People that have bought your Token early (at a low price) and have believed early in your project will be rewarded by being able to resell their Token at a Higher price as the price is increasing with the Supply (the more people believing in your project, the more the price of your Token will increase).\n\n\\*\\*Creating your Token on a bonding curve greatly facilitates giving value to the token and allowing you to determine how the discovery price will work in the future. \\*\\*Indeed, a bonding curve has its own AMM (Automated Market Maker - a mathematical function that defines the price of your Token depending on different parameters) that allows you to choose the best model of bonding curve depending on your needs. **You have way more freedom over the price discovery of your Token with a token minted on a bonding curve than on a fixed supply, and you can choose the type of bonding curve you want, depending on your needs.**\n\n*(There are different types of bonding curves, and it might be helpful to dig into those if you're interested in creating a Token on a Bonding Curve. You can read the [more extended version of this essay](https://eliotc.substack.com/p/social-token-as-financial-assets) where we go cover those questions).*\n\n## Conclusion\n\nNow that we've covered what a Fixed supply model, a liquidity pool, and a Bonding curve are, you should clearly understand the differences between them.\n\nAs mentioned before, the fixed supply model and the bonding curve model are entirely different and are not made for the same use cases.\n\nTo make it easier to understand, we'll make a quick recap here covering the main differences between the fixed Supply and the bonding curve models and the pros and cons of each model.\n\n#### Main advantages of creating your Social Token on a Fixed Supply model :\n\n* **Usability and lower barrier to entry**. Anyone can create its Token on a Fixed Supply. You'll receive the tokens in your Crypto Wallet and can then distribute them the way you want. You don't technically need a pre-existing community willing to buy your first tokens. They are already created and exist on the blockchain. You own the whole Supply from day 1.\n* **Full power over the distribution of the native Token.** Centralized control over your token Supply prevents anyone from buying a significant amount of your token and using them in a harmful way. A safe and sustainable distribution strategy is critical for some projects - you must get your Token into the right people's hands if you want the project to succeed.\n* **Easier if you're a solo creator creating a personal token**. The Fixed Supply model will allow you to take your time and think thoroughly about the way you want to build your project. By owning the whole Supply, you can allocate your tokens **the way you want.**\n* **You don't need a strong community that is ready to pay from day one.** As you own the total Supply, you can take your time to gather a strong community around a joint project. This is a great advantage compared to the Bonding curve model as, in the bonding curve model, the early adopters might buy the Token. Still, if the community is not big and strong enough, as the price rises, no one will buy tokens anymore and can kill the project.\n\n#### Main advantages of creating your Social Token on a Bonding Curve model :\n\n* **Guaranteed Liquidity:** you can create a contract and have anyone be able to buy and sell your token right away. It can help bootstrap awareness and interest as backers know they have Liquidity from day one. Tokens can be purchased or sold instantaneously as the bonding curve act as an automated market maker (Market makers are agents that alleviate this problem by facilitating trade that would otherwise not occur. \"Automated market makers\" (AMMs) are algorithmic agents that perform those functions and, as a result, provide Liquidity in electronic markets. AMM buys some of your tokens and agrees to sell them at any given time to anyone wanting to buy your Token.)\n* **Reduced volatility:** in times of changing demand for the Token, the bonding curve allows *both the price and Supply* to adjust in response. Deterministic price calculation decreases the size and probability of boom and bust cycles that frequently plague fixed-supply tokens. Also, it ensures a continuous price. The price of your Token will always be n-1<n<n+1.\n* **Limitless Supply.** There is no limit to the number of tokens that can be minted. You have no limits on how big your project can become.\n* **You have complete power over the future discovery price of your Token.** As seen in this essay, you can adapt it depending on your needs.\n* **Reduces the risks of hacks.** If your platform or project is hacked, as you don't own all the Supply, it limits the risks. Tokens belong to the users that bought them and are on their wallets.\n* **Easier for a protocol or a community with more options.** You usually don't know the Supply you need as you don't know if your project will grow exponentially. With a bonding curve, as long as there is demand, it will be possible to create new tokens.\n\n**If you want an easy solution for your personal Token, you should go with a fixed supply model for your Token**. On the other hand, if you're a **big community founder or the Creator of a protocol that wants to launch a token, maybe you should consider creating a bonding curve** and exploring the pros and cons of the different types of bonding curves.\n\n*If you need help or further information, please join our [Discord](https://discord.gg/6q8xv3mW) and reach out to EliotC#2942.*\n\n*If you liked this article, you can [tip the author](https://www.coinvise.co/CDTEliot) and [purchase the Red version](https://www.coinvise.co/CDTEliot) & [Blue version](https://www.coinvise.co/CDTEliot) as NFTs (2/2). You can follow us on [Twitter](https://twitter.com/CoinviseCo).*\n\nFurther resources :\n\n* [An introduction to bonding curves, shapes and use cases](https://medium.com/linum-labs/intro-to-bonding-curves-and-shapes-bf326bc4e11a)\n* [Distribution Curves — A thought piece on Cryptoeconomics and DeFi](https://blog.cosmos.network/distribution-curves-a-thought-piece-on-cryptoeconomics-246b43a3a5ee)\n* [Bonding Curves Explained](https://yos.io/2018/11/10/bonding-curves/)", "timestamp": 1630015816, "digest": "Xnd_y7riTG16Y7hiDQ44kLaqPHQUr5KpAP085FDJGGI", "contributor": "0xC0241e384dB48C35E7b3FEded3BfEcd29A3E73e3"}
{"id": "gB2uHscxeKjANDqgRxUKTfqZ6hXzcUzZllaqSKbcD74", "title": "Creator Stories Episode 1 : Joyce Yang", "body": "![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F1cc0e9cd-929d-4701-82df-40c2ed7287ba_1932x964.png)\n\n*This article is a transcript of a live interview conducted by [Jenil](https://twitter.com/0xjenil) on [Coinvise’s Discord](https://discord.gg/b9xsw6w5). If you want to attend our next Creator Stories episode, join our [Discord](https://discord.gg/b9xsw6w5) and follow us on [Twitter](https://twitter.com/CoinviseCo). We hope you’ll enjoy the conversation as much as we did! 😉*\n\n### Joyce, it's good to have you here. To kick off this interview, could you tell us more about your background, what you do, and what's Global Coin Research?\n\nIn my past life, before Crypto, I was working in Finance and then became a TechCrunch journalist and a reporter for the Information, reporting on tech and software companies. Since I've jumped into Crypto 5-6 years ago, I've focused on Global Coin Research. Global Coin Research (GCR) is a media platform and a Crypto community. You can look at it in two separate entities with a very close and tied approach, anywhere in the media and publishing platforms.\n\nToday, Global Coin Research has three main aspects:\n\n* Firstly, anyone can contribute to creating quality content around Crypto topics. In return, we showcase them to our quality readers that we've been accumulating and working with in the last five years, including founders, such as Brian Armstrong from Coinbase, and investors and also various media partners, such as the Wall street journal or The New York Times. Writers are, on top of that, earning $GCR tokens.\n* Secondly, we have a robust community and a Discord server. We host weekly workshops, AMAs for founders, and showcase projects that are about to launch or that just launched in the Crypto space. We're also helping teams get a little bit more information and contact in the space.\n* Thirdly, we make Crypto investments as syndicates inside the groups. In the past, we have made investments in projects such as space X or several other Crypto projects, and we try to be more involved with those projects, being more hands-on as a community.\n\n### Love this. I also find it interesting that the GCR community was already a very close-knit, engaged community even before launching the $GCR Token. Could you tell us what made you decide that you wanted to do the token and what were some goals that you had in mind?\n\nYeah, for sure. Coming from a background of being a journalist myself and seeing how the traditional reporting space runs and the infrastructure there, it often feels like the writers do not get enough credit and never received the value they deserve in writing and contributing quality content. With platforms such as Substack and Medium, it's effortless to start and write something, but it's tough to monetize and build a brand and traction. You have to keep writing and get new content at least once a week. It doesn't work for the Crypto community because people are busy doing everything else, such as contributing to the communities they're involved in or trading Crypto tokens.\n\nThat's why we've decided to build Global Coin Research, to create a novel platform where it makes sense for the writers to come to earn value and earn a living from day one. We initiated this campaign when we first launched the $GCR token to allow anyone to earn tokens when contributing to the media. Those tokens are immediately liquid, and folks can actually make a living from them because they can withdraw them from our dashboard and then be able to sell them on exchange.\n\nTo be honest, I was resistant to a token until a few months ago because I didn't want to become just a token project for its sake. But virtual community tokens are pretty helpful when you think about incentivizing community and being more innovative around token economics. It's becoming the norm, and we're seeing more and more media platforms introducing a token such as Mirror, The Defiant, Bankless, etc...\n\n### I agree. We spend a lot of time on the internet, and writing becomes crucial as it's how we communicate with most people. Diving deeper into what role the Token plays, could you tell us more about what sort of decision-making you made when launching the $GCR Token and how you've rolled out phases? Also, what advice would you give to someone that wants to introduce a token for its community?\n\nAs a piece of advice for folks who are building tokens, I think it's important to introduce a very simple story that everyone could understand, especially if you're introducing innovative ideas.\n\nWe first told all our writers and audience that they could now write on our platform and get $GCR Tokens in return regarding how we rolled out phases.\n\nRecently, we introduced the second phase of our Token. Now we allow more robust tooling for the writers and more immediate rewards for them. That means that writers are able to contribute and write on our platform, but over time, they will also be able to use the Token for other things, such as joining our discord community. We've been trying to introduce our discord community slowly cause we know it can be overwhelming for newcomers joining large projects. We try to do it slowly, introduce each of these products separately, and build them up over time.\n\nThe last thing we introduced is letting token holders access quality content. We push out high-quality content, and we're able to Token-gate them and offer the best essays to our token holders.\n\n### I like the way you're approaching this. Regarding Social Tokens and community members, there are usually two dynamics. Community members that are in it for the Token price (speculative aspect), and community members trying to participate in attending events and joining the discord server. How do you use the $GCR Token to grow the community, incentivize more participation and less speculation?\n\nI think there's one tip I received from the founding team of Index Coop that helped us. When rewarding your community through Tokens, it's better if the core team managed the token supply and transactions and kept the voting power centralized. By doing so, you'll have a firmer grasp of the token prices. Instead of giving a lot of tokens to a community from the first day in, you could provide them ETH or give them stable coins. It lets the initial team know where the Token is going, so there's no unexpected selling coming from your community. When it comes to community rewards for us, sometimes we give away gifts (e.g . apple headphones), instead of the Token itself because we think controlling our Token's distribution is essential.\n\nWhat's also important to prevent bad token behaviors is to share what you're building with your community; otherwise, a part of the community will get lost in the building. If no one knows what you're working on, they don't have this incentive to participate in becoming a member and helping you grow. So make sure to communicate well and don't be a lock at a loss in the building.\n\nFinally, don't overthink too much about bad token behaviors. Speculative members don't last long in a community, and it's important to just be able to continue to build, continue to ship, and grow the community.\n\n### I agree, it's crucial to focus on your token economics, understand how to allocate your total supply. A follow-up question to this is how do you promote your community to more people and promote the Token's utility? A great way to do it is to crowdfund your project, so how was the crowdfunding process like, or when you did do the Liquidity pool, was it complex or straightforward?\n\nSetting up Uniswap and setting the liquidity pool was one of our biggest pain points. We thought about it starting small and relying on some community members that we trust because many of our community members are angel investors or part of larger funds. They have the capital, and we can offer them the reputational value of being an early community contributor and member.\n\nWe started with a very small pool , I think it was like $50-100K, and I think that's what most folks should do when they're starting, as I honestly don't even think that big size of a pool is needed. It's an all-new kind of problems that we face in crypto like liquidity pool or Tokenomics, and you almost need another team member to figure it out. So in our case, we just wanted to start a small and gather folks that we trust.\n\n### It's a question that we get a lot, and it's nice to hear an opinion from the creator. To close this interview, I would love to know the next steps for what you see the community evolving are? What are some next steps for GCR, and how do you see the future of this idea of decentralized journalism evolving?\n\nInteresting question. Because we're in the Social Tokens space and building a decentralized writing platform, we really have to think about what's going to be next because no one else will be setting the example for that at all. I think there are a lot of great and exciting things coming up in decentralized journalism, and, as I mentioned before, lots of platforms are exploring it. I think there will be some cool products being used and tools being built on that front.\n\nOur primary mission for the future is to continue generating and maintaining the quality content that we have and maintain that high-quality audience. It is one of the most important things that I care about because that's where you build your brand and reputation. We don't put too much weight on not having the largest discord community because I think ultimately, the quality folks will still stay in the space for a long time, and our goal is to create good quality content for them.\n\n###### **Want more?**\n\nFollow us on **[Twitter](https://twitter.com/CoinviseCo)**,  [Instagram](https://www.instagram.com/coinvise/?hl=en) and join us on **[Discord](https://discord.gg/8jaQB5CZ) 🔥**", "timestamp": 1630016064, "digest": "NFqxM3RCsInkg3zN2RYyux1n3JrihqYxQm87SRdffLg", "contributor": "0xC0241e384dB48C35E7b3FEded3BfEcd29A3E73e3"}
{"id": "SyJTN76dtkr0hG6PlT6K2pj1QxVNFlcbXOlskT3tGlU", "title": "Crowdfunding projects through Social Tokens", "body": "![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4b33c22a-ef6e-4d6f-a363-6e180eae892c_2004x999.png)\n\nFor the past years, the market of social tokens has been correlated to the broader Crypto market. But recently, we've seen this correlation diminish. Indeed, as creators understand more the use cases and the utilities of Social Tokens, they bring in more fans from outside of Crypto. The use cases of Social Tokens are numerous. From allowing fans to invest early in creators, creating premium experiences, or collaborating efficiently with other creators, Social tokens have shown their efficiency to incentivize fans to engage and become Creator's distribution.\n\nIt's a complete paradigm shift in the way communities collaborate. It's no more the Creator and its fan, but more a whole community driven by a leader around a joint project. One of the use cases that stood out in the latest months is Crowdfunding through the community. Indeed, \\*\\*we've seen many exciting projects leverage the power of Social Tokens to achieve their goals. \\*\\*Many new possibilities have been made possible thanks to Social tokens and Web3, and Creators are at the forefront of this revolution, leveraging those new technologies to crowdfund their projects and achieve their goals.\n\nThis essay will try to understand the advantages of crowdfunding a project thanks to social tokens, understand the differences between crowdfunding a project on Web2 vs. Web3 for Creator and fans, and highlight use cases with concrete examples.\n\n## 1/ What does that exactly mean to crowdfund a project through social tokens?\n\nIn Web2 (centralized Web), creators asked their community to give USD to crowdfund a project. In Web3 (decentralized Web) the mechanisms are a bit different. Creators can mint (create) a Social Token (their personal digital currency) and use it the way they want. \\*\\*Creating a Social Token makes it easier for creators to raise funds as contributors will receive Social Tokens in exchange for their USD. Contributors are part of the project. They own a piece of it. \\*\\*\n\nLet's say a videographer needs to get better video equipment and hire an editor. There weren't many possibilities for the Creator before Social Tokens to crowdfund its project through its community. It was complicated to manage the legal part, deal with the logistic, and rely on a centralized platform. With this new money, the videographer's fans can redeem a slice of it in exchange for USD. They will have access to unique experiences while helping the Creator achieve its goals. \\*\\*While the videographer would have asked in Web2 to its community to \"support\" his project, he can now in Web3 ask them to be part of it, giving them personalized exchange experiences, a slice of its future income, etc.. \\*\\*The community now has the power to invest in creators to crowdfunding and shape the project's future rather than simply supporting the project from an external position.\n\nIn the end, Creators are leveraging new technologies to involve their community in their projects while raising funds to achieve broader goals. That's how powerful Web3 can be.\n\n## 2/ Why is it great to crowdfund through Social Tokens?\n\nWhat if you've invested in Taylor Swift early, helping her buy her first studio sessions in exchange for a slice of her future revenues? Chances are, this small investment would have turned in a multi-thousand dollar profit today. Social tokens allow to not simply support an artist but be part of its journey and serve as a way to align incentives. Indeed, by having a share of Taylor Swift's future revenues, its community is incentivized to help her grow and promote her art.\n\nThe possibilities are endless for creators. Singers are now able to crowdfund their first album, writers their first book, and filmmakers their first film. **By giving communities and fans ownership over the content and, therefore, by aligning incentives, we'll see more and more projects succeed, all thanks to the power of the community and Social Tokens.**\n\nAs mentioned previously, crowdfunding a project through Social Tokens (Web3) is very different from doing it through traditional Web2 platforms. There are fundamental advantages to using Social tokens to crowdfund your projects, mainly related to three aspects: Financial, Social aspect & Governance aspect.\n\nLet's dig more into the advantages of using Social Tokens to raise funds.\n\n### **✨ Financial aspect**\n\n***For Creators:***\n\n* It allows Creators to raise money for their projects while aligning their upside with key stakeholders.\n* Creators don't need to use the \"all-or-nothing model\", in which the money is only passed to project creators when the project reaches its established funding goal.\n* Overcome the challenges of fundraising through traditional financing methods, which is often complicated for non-well-known projects.\n\n***For Community members :***\n\n* They can buy and trade their tokens without any intermediary taking a cut on each transaction.\n* It gives supporters of the project ownership over it. They won't simply support the project. They'll possess a piece of it, which means having economic incentives to help the project succeed.\n\n### **✨ Social aspect**\n\n***For Creators:***\n\n* Incentivize fans to engage and promote the Creator's content. Community members have economic & Social incentives to help the project succeed.\n* Creators have access to the skills of a whole community keen to help grow the project.\n\n***For community members:***\n\n* Be a proud holder of $NAME tokens. Community members will have tokens in their Crypto wallet to prove they were there since the beginning and prove that they helped grow. They'll also have access to special perks and experiences.\n\n### **✨ Governance & Decisions**\n\n***For Creators:***\n\n* Creators have control over the means and the production of their content throughout the process. It enables them to **maintain their creative vision.**\n* Everything is decentralized, which means they don't need to ask permission from anyone to crowdfund, and platforms can't ban them. Web3 encourages collaboration and opens access to anyone wanting to build and share the upside without relying on centralized platforms anymore.\n\n***For Community members:***\n\n* Give stakeholders (Community members) the chance to have a voice and influence the project's future. It reinvents the process of creating entirely. Fans can now actively participate in the project, and the biggest fans can pay more to have premium experiences and decision power. It allows creators to granular their pricing while giving the biggest fans the possibility to be part of the creative journey.\n\nYou should now clearly see the advantages of creating a Social Token to raise funds for a project instead of crowdfunding it through Web2 platforms. Many exciting projects have already leveraged this new technology to achieve their goals. We're going to explore those examples to better understand why Social Tokens were the best solutions for their use-cases.\n\n## 3/ Examples of successful Social Token crowdfunding.\n\nLet's dig more into examples of projects that successfully leveraged Social Tokens to crowdfund their project through their community.\n\n* **[Ethereum: The Infinite Garden](https://twitter.com/EthereumFilm) - $INFINITE** - ETHEREUM: THE INFINITE GARDEN is a character-driven documentary film on the challenges and rewards of building a new world. The team exceeded their funding goal of 750ETH and raised [1035ETH](https://ethereumfilm.mirror.xyz/3SV8gLXHIW8Ot45h3RL7aOgDINxN2hjLfFVOvyatB2A)(\\~$2.7M when I'm writing this article). As the team behind the movie explain on their crowdfunding page: \"**as experienced, independent filmmakers, we understand the challenges of fundraising through traditional film financing methods.**\" Social tokens have allowed the team to ask their community directly, without asking permission from anyone. They will enable them to \\*\\*maintain their creative vision of the film while ramping up production quickly to capture this evolving story in real-time. \\*\\*Furthermore, it allows them to **involve the community in making the film** by giving them access to the film's private Discord chat and credit them in the film.\n\n  Project funded announcement\n* **[Burn Alpha Novel](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg) - $NOVEL** - As [Emily Sega](https://twitter.com/khole_emily)l, the author of the Burn Alpha Novel says: \"Usually, novelists go to great lengths to fund their own novel-writing process by working other gigs, selling commercial writing, or – in significantly fewer cases – getting an advance from a publishing company. All of these methods have drawbacks in the form of limited time or limited creative freedom for the author. On top of that, the process of creating these works of art goes on behind a veil of secrecy, away from the community that will ultimately enjoy the final product.\" She has decided to change that and crowdfunded her project through Social Tokens. By helping her achieve her goal to write a novel, contributors will have a mention in the book's acknowledgments, access to periodic supporter-only readings of the manuscript in process, and one-on-one calls with her to chat about writing or whatever is on their mind. Social Tokens helped Emily unlock new experiences with fans while giving her more freedom over her content.\n* **[Alex Masmej](https://twitter.com/AlexMasmej) - $ALEX** - Alex Masmej has created the $ALEX token and has decided to sell 10% of the $ALEX token supply against $20,000, claiming to give some of his future income for the next three years. As a 23 years old from France, Alex wouldn't have been able to do it without Social Tokens as it would have been a legal and logistical mess. He achieved his goal to raise $20K and has been able to move to San Francisco with this money. Alex is now the Co-Founder of [Showtime](https://tryshowtime.com/), a platform that allows Creators and Collectors to showcase and Collect digital art, and an early investor in Coinvise.\n* **[Elektra by Songcamp](https://elektra.camp/#/) - $ELEKTRA** - Songcamp Elektra is made up of 42 musicians, visual artists, developers and strategists. Together, they are building \"Elektra\" — an interactive choose-your-own-adventure web3 game with music at its core. As this project evolves, the lines between Creator and audience will blur. Game builders will play the game they are building, and game players will build the game they are playing. The funds raised through this crowdfunding campaign go entirely towards bringing this project to life. The project [raised 80k](https://twitter.com/songcamp_/status/1415040169938460695) thanks to newly wealthy crypto-natives reinvesting in the next generation of creatives on the internet. This kind of project would have had a hard time being funded through the classic path and would have lost total control over the project.\n* **[Creator Cabin](https://www.creatorcabins.com/) - $CABIN** - The Creator Cabin DAO has built a new cabin designed as a collaborative co-living and working space for independent online creators. Their goal is to find ways to sustainably fund independent online creators and develop DAO-based governance models for physical spaces. Thanks to Social Tokens, they've crowdfunded their projects, and they collected $42k to experiment with their idea. It's an experiment in universal creator income, tech stacks for decentralized cities, and the physical manifestation of DAOs that has been made possible thanks to their community.\\\\\n\n### Conclusion \n\nCrypto and Social Tokens allowed revolutionizing the fundraising processes. **It will enable more projects to come to life, rewarding community leaders and community members to collaborate.** More and more projects will use Social Tokens to align incentives with their community and achieve bigger goals together. In the end, every project will be tokenized as tokenization changes the equation and greatly facilitate the crowdfunding process.\n\n###### **Want more?**\n\nFollow us on **[Twitter](https://twitter.com/CoinviseCo)**,  [Instagram](https://www.instagram.com/coinvise/?hl=en) and join us on **[Discord](https://discord.gg/8jaQB5CZ) 🔥**\n\nIf you liked the article, make sure to [tip the author](https://coinvise.co/CDTEliot) \n\nThanks for being here!", "timestamp": 1630016159, "digest": "aSqfg6vP1g7F_8_EM_vLT3dLiakhPUitPHC4sqHLPQ8", "contributor": "0xC0241e384dB48C35E7b3FEded3BfEcd29A3E73e3"}
{"id": "zGM3lwIKPt2wu-W8pXIsGA92oS4gGpJWCCYCQlaCh3c", "title": "Textures Of A Long Forgotten Assumption", "body": "### *tl:dr* ↓\n\nMy album *Textures Of A Long Forgotten Assumption* drops today, but not on streaming platforms. The full album is made up of 9 songs. 6 of them are done. 3 of them aren’t. I need your help to finish the project.\n\nYou can participate in the drop through 3 form factors:\n\n1. The Canon → 4 one-of-one Catalog NFTs + 1 music video NFT (*auctions below*)\n2. The Collectibles → 9 vinyl NFTs [available on Rarible](https://rarible.com/chaim), each with their own mechanics\n3. The Copies → 1000 album bundle copies [available on my online shop](https://ko-fi.com/s/794a026bac)\n\nAll of these give you access to:\n\n1. a private download of the album’s songs and artwork\n2. one (1) invitation into the *Homemade Universe* discord server — my private online community\n3. one (1) entry into the *Flavors Feature Contest*. (more info in *Collectibles* section below)\n\n—————————\n\nWelcome to the official release of ***Textures Of A Long Forgotten Assumption*** — my third album.\n\nThis 9-song body of work explores the fundamental beliefs we all have and don't dare question. What happens when we do?\n\nThe release of this project aims to rip open some of those deeply held beliefs we have around music — what music is, how we value it, and how it’s “supposed to be” distributed.\n\nThis release is broken down into 3 sections: **The Canon, The Collectibles, and The Copies**. *To learn more about my thoughts behind this release mix, [read my previous essay](https://chaim.mirror.xyz/0SRGluR6sYweDWV0qmgF6V1wsN0BvEKsvCVOZCFX7yU).*\n\n### Here’s what’s happening:\n\n* There are 5 one-of-one *canon*ical NFTs on auction **below**\n* There are 9 NFT *collectibles* now **[available on Rarible](https://rarible.com/chaim)**, which are walked through in detail below\n* There are 1000 album bundle *copies* **[now available on my online shop](https://ko-fi.com/s/794a026bac)**, also walked through below\n\n### All collectors of any of the above will receive:\n\n* a private download of the *Textures Of A Long Forgotten Assumptions* album's songs and artwork\n* one (1) invitation into the *Homemade Universe* discord server — my private online community.\n* one (1) entry into the *Flavors Feature Contest*. More on this below.\n\n## The full *Textures Of A Long Forgotten Assumption* tracklist is:\n\n1. Form\n2. Tear\n3. Sand\n4. Red Balloons\n5. Crazy\n6. Island\n7. Flavors (unfinished)\n8. Paint (unfinished)\n9. Untitled (unfinished)\n\nAs you can see, **three of the nine songs are unfinished**. I need your help to finish them, and you can see how in the *Collectibles* section below.\n\nLet’s begin...\n\n![](https://images.mirror-media.xyz/publication-images/ea6822c5-8411-43a4-a093-c485fa6ca32e.jpg?height=1486&width=1486)\n\n# THE CANON\n\nOn auction are 4 one-of-one [Catalog NFTs](https://beta.catalog.works/chaim) for tracks 3 thru 6 — *Sand*, *Red Balloons*, *Crazy* and *Island*. There is also a one-of-one Zora NFT for the official *Form* music video, auctioning off on Zora.\n\nYou can see who the recipients are for each of the 4 Catalog NFTs being auctioned below. These are the collaborators (writers, producers, engineers) I created this music with.\n\n## Track No. 3 — Sand\n\n*Sand* is written by Danny Majic + myself, and produced by Danny Majic.\n\nThis was the first song Danny and I ever wrote together, the very day we met each other. This was also the very first song I wrote after a 10-day cross-country solo drive from Montreal, Canada to Los Angeles, California.\n\n[auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3166](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3166)\n\n## Track No. 4 — Red Balloons\n\n*Red Balloons* is written by Hayley Gene Penner, Jason Yik Nam Wu + myself, and produced by Rabitt.\n\nThis is the first song I've ever released with a co-written top-line. I've always found it difficult to write lyrics and melody with others, but Hayley is a great friend and we truly found a shared energy on this one. And Rabitt always brings the goods.\n\n[auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3167](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3167)\n\n## Track No. 5 — Crazy\n\n*Crazy* is written by Danny Majic + myself, and produced by Danny Majic.\n\nWe wrote this song together at a songwriting camp in Nashville, Tennessee. It was the first ever *Really Fun Camp* organized by Rabitt.\n\n[auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3168](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3168)\n\n## Track No. 6 — Island\n\n*Island* is written by Jason Yik Nam Wu + myself, and produced by Rabitt.\n\nWe wrote this song together in Jason's studio in Silverlake, Los Angeles. Attached to said studio was the very house we were both living in at the time. This was the last song we wrote together, before I left for Montreal when the pandemic began. A version of the song was first released on streaming platforms in May 2020, on a charity album raising money for MusiCares' Covid Relief Fund.\n\n[auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3169](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3169)\n\nAs you can see in the auctions above above, **5% of funds received are going towards my private community *Homemade Universe*’s shared treasury**. These funds will be used in future co-creative projects together. Since all collectors + purchasers gain access to *Homemade Universe*, 5% of this project’s proceeds are funnelling into a community that you are co-creator and co-owner of.\n\n## Form — The Official Music Video\n\nThe official music video for \"Form\" is **[now up for auction on Zora](https://zora.co/chaim/3172)**, filmed + edited by myself while stuck in a quarantine hotel in Montreal in May 2020. 🥽\n\n*Form* is written by Jason Yik Nam Wu + myself, and produced by Rabitt.\n\nThe reserve bid is 0.5 ETH. You can **[bid here](https://zora.co/chaim/3172)**.\n\n[ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/3172](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/3172)\n\n# THE COLLECTIBLES\n\nThere are 9 collectible NFTs — one for each song on the album.\n\n### **Tracks no. 1 thru 6 — *Form, Tear, Sand, Red Balloons, Crazy, Island***\n\nThe collectibles for the 6 finished songs can be [viewed and collected here](https://rarible.com/chaim). Each NFT is an edition of 5, priced at 0.1 ETH.\n\nhttps://rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:572882:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details\n\nhttps://rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:572863:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details\n\nhttps://rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:572834:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details\n\nhttps://rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:572824:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details\n\nhttps://rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:572812:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details\n\nhttps://rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:572803:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details\n\nThe 3 unfinished songs each have their own mechanics in place to experiment with 3 different forms of collective creation…\n\n### **Track no. 7 — *Flavors*** + the *Flavors Feature Contest*\n\n[ethereum://0x60f80121c31a0d46b5279700f9df786054aa5ee5/1012987](ethereum://0x60f80121c31a0d46b5279700f9df786054aa5ee5/1012987)\n\n*Flavors* is written by Matt Parad + myself, and produced by Matt Parad. We started writing this song on my birthday. It was the first time Matt and I had ever worked together.\n\nThe song is nearly finished, but has an empty second verse that needs a feature. Hence, the ***Flavors Feature Contest***. Anyone who collects an NFT or purchases an album bundle copy receives one (1) entry into the contest.\n\nAfter your purchase and/or collection, you’ll receive a private download of the album. Included will be an mp3 of Flavors with an open second verse. You can use that file to start writing your verse. You will also gain access to the Homemade Universe discord server, where you will be able to submit your version of Flavors. Submissions will close on June 20 2021.\n\nA winner will then be chosen to be the official feature of Flavors. The final version of the song with your verse on it will then be released as a 1/1 Catalog NFT and, eventually, on the Textures OF A Long Forgotten Assumption album release on streaming platforms.\n\n**The winner will also receive this 1/1 collectible NFT of Flavors, as well as 10% of the master’s future earnings (through NFT sales, streaming royalties etc).**\n\nhttps://rarible.com/token/0x60f80121c31a0d46b5279700f9df786054aa5ee5:1012987:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details\n\n### **Track no. 8 — *Paint*** + the *Silent Auction*\n\n[ethereum://0x60f80121c31a0d46b5279700f9df786054aa5ee5/1012935](ethereum://0x60f80121c31a0d46b5279700f9df786054aa5ee5/1012935)\n\nThe song *Paint* is still in a very early demo stage. In fact, I don’t yet have a chorus for it. I wrote the beginnings of this song with Danny Majic, and have always loved the first verse and pre-chorus. But there is still a ways to go on this song, and I am looking for 1 partner to join along for the ride.\n\nThis partner will be the ***creative director*** for the song *Paint* — and this role can look many different ways. Perhaps you’re a musician and can help with the songwriting or production of the song, perhaps you’re visual artists and can help on the visual side. Perhaps you don’t consider yourself an artist whatsoever, but can help on the outreach and marketing side. Perhaps you just want to get a closer look into the makings of a song, and just want to take pictures of the process on your disposable camera. Whatever it may be! This creative director position is yours to fill however you choose, should you win it of course.\n\nNow, how do you win it?\n\nThe *Paint* collectible is a 1/1 NFT on Rarible, and is up for **Silent Auction**.\n\nYes, that’s correct. Silent Auction.\n\nTo win this auction, you must email me your bid.\n\nThat’s correct. Email me your bid at paintauctionbid@gmail.com.\n\nYour bid can be in ETH, it can be in USD, it can be in CAD, or DOGE or WRITE or any other currency on the planet. It can also be a non-currency bid! It can be a barter of some kind — maybe a good or maybe a service. Anything! Get creative!\n\nThis is for the role of creative director on the song. So show me your creativity. And show me how much you want it. :)\n\nOnce the first bid is in, a 24-hour countdown will commence. I will announce updates on the Silent Auction in real-time on [twitter](https://twitter.com/matthewchaim).\n\n**The winner will be the official creative director for *Paint*, win this 1/1 collectible NFT, and receive 10% of the master’s future earnings (through NFT sales, streaming royalties etc).**\n\nhttps://rarible.com/token/0x60f80121c31a0d46b5279700f9df786054aa5ee5:1012935:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details\n\n### **Track no. 9 — *Untitled*** + the *Untitled Creative Director DAO*\n\n[ethereum://0xd07dc4262bcdbf85190c01c996b4c06a461d2430/572927](ethereum://0xd07dc4262bcdbf85190c01c996b4c06a461d2430/572927)\n\nGrab your **[entry NFT into the](https://rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:572927:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details) *[Untitled Creative Director DAO](https://rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:572927:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details)* [here](https://rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:572927:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details)**.\n\n1 creative director is great. But what about 100?\n\nYes, that’s correct. 100 creative directors.\n\nThat is what I am in search of for this last song on the album, which does not yet even have a name. As you can see, we have our work cut out for ourselves.\n\nIn fact, I’m not even sure which demo on mine should be the 9th and final song on the project. There are a few options that I really love, but I need your help to decide on which one to pursue. That is where we will start our collective decision making. Here’s how it works:\n\nThe Untitled collectible is a **100 edition** NFT on [Rarible](https://rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:572927:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details), with each edition priced at **0.03 ETH**. I ask that you purchase a maximum of **1 edition per wallet**.\n\nThe Untitled collectible NFT will act as the access token into a gated set of channels on the Homemade Universe discord, where this community of 100 people will convene and begin the creative direction of the song.\n\n**Each edition represents 1 vote in the *Untitled Creative Director DAO* that will be formed to govern the completion of this final song of the album, as well as 0.1% of the master’s future earnings (through NFT sales, streaming royalties, etc). This means that 100 people will together own 10% of the song’s final master.**\n\nhttps://rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:572927:0x5090c4fead5be112b643bc75d61bf42339675448?tab=details\n\n# THE COPIES\n\nThe final form this album is being released today is with **1000 album bundle copies**, [available for purchase on my online shop here](https://ko-fi.com/s/794a026bac).\n\nThis bundle comes with:\n\n1. the first 7 tracks off the album, including *Flavors* with the empty second verse\n2. 8 pieces of album artwork\n3. one (1) invitation to *Homemade Universe*\n4. one (1) entry into the *Flavors Feature Contest* (more info in the Collectibles section above\n\nAfter your purchase, you will receive an access card into the Homemade Universe discord — which will give you access to the private set of channels available to members.\n\nThe album bundle will be available for up to two weeks or up to 1000 copies, whichever comes first.\n\n**You can [purchase an album bundle copy here](https://ko-fi.com/s/794a026bac).**\n\n![](https://images.mirror-media.xyz/publication-images/f29b829a-3e2e-4aba-aee9-2ab41f399355.jpg?height=3000&width=3000)\n\n# A Final Thought\n\nIn building this release out, I realized I missed one more word in my cute little alliteration.\n\nThe full phrase should go → Canon, Collectibles, Copies, and *Community*.\n\nThis project in some ways only *begins* today, in that it is the first page in our story of exploring collective creation together. For the final 3 songs, we will begin a new journey of seeing what it is like for a community to create together in 3 very different ways — one as a contest, one as a 1-to-1 relationship, and 1 as a DAO making decisions together. It is also the beginning of exploring the possibilities around sharing in the equity of our co-creations in this way.\n\nThe other thing you may notice in the splits delineated in the *Canon* NFTs above, is my private community Homemade Universe is receiving 5% of all auction revenues. Those funds will go into a shared treasury controlled by the community, which we will use for future co-creative projects together.\n\nI’m incredibly excited to go on this new journey with you. And learn what it means to bring together like-minded individuals around my art, and create real value together.\n\nThis is just the beginning.\n\nThanks for being here. 🌻", "timestamp": 1630021489, "digest": "9EAsxtkQD6hIQJLDID5w8Jn6o_m9Bw4XnDdTwOVHttA", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
