{"id": "Dcd11SLKLQrXb55wl_h3b7HZXvrWZg87eDpDAXd2BWQ", "title": "Ali's big project", "body": "Back my crowdfund\n\n[Ali's Crowdfund](crowdfund://0x3a87A02d916a8906a61D275d5410EF5ddeC1F827?network=rinkeby)", "timestamp": 1615741806, "digest": "qD_7E2q2fmsDUtujVwBAGSpqR5zQnWSbeMFDrpHQQwM", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
{"id": "KJqMmaGslsiWD9Gr1noSQxD3ln-Q725A_ojzDuA3CEE", "title": "Test Post", "body": "This is a test post.\n\n[Test Wallet](crowdfund://0xFa9ab48B8E516AD7901f4700a718ECad88b90D39?network=rinkeby)", "timestamp": 1615747032, "digest": "sEuI7rlFw--mD4MKAJP5cS0nJmNohBKc_bNZ8VJKhTk", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "QoXA9qKnG2ORP5NXQ110I8_6zYQRXEMaSSFssMr__mE", "title": "Lucifer", "body": "![](https://images.mirror-media.xyz/publication-images/dc7ead97-cb26-4fe8-8ace-caec04d4e072.jpeg?height=600&width=800)", "timestamp": 1615754492, "digest": "lxrwMibvXc75rEQm2FHLBsPx4cnI251cO0mIwrBxtOA", "contributor": "0xD9C4475E2dd89a9a0aD0C1E9a1e1bb28Df7BA298"}
{"id": "V24SiC1XOEuiXHr081O7QdFB3FV2zS80O7if6Mvio-4", "title": "Patrick's Project", "body": "I want to raise $10,000 for a new app I'm building.\n\nParticipate in the crowdfund below.\n\n[Patrick's Awesome Token](crowdfund://0x484eb68c6D203564Fe09762C9E1fA34F15C4847a?network=rinkeby)", "timestamp": 1615758525, "digest": "8uQa84uIssZFB6nhixrtpFXdwUx9i6zGfrixCO-r5JI", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "oLM1-CBgEy4n4ME2FxCqGttOiaY5k63_Hhj7bTeJX3k", "title": "Crowdfund test", "body": "[MARCH14 4](crowdfund://0xaD504B227C149d774693AB4f02ED82Fd2C4D3ED9?network=rinkeby)", "timestamp": 1615767317, "digest": "LyNfQOD5riIN6tMWC4Sjy0lypSAV5AN3XbAo9tetfYk", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
{"id": "t3gVNQTr3cGjP3XzYkB42uXIn8EdcjqquPjApBYDFjY", "title": "$GENERALIST: Modern Value", "body": "![](https://images.mirror-media.xyz/publication-images/bc005ad6-f851-4d47-8d78-ad34d8a1ea1d.jpeg?height=1080&width=1920)\n\n## TL;DR\n[The Generalist](https://www.readthegeneralist.com/) is trying something new. In collaboration with Jack Butcher of [Visualize Value](https://shop.visualizevalue.com/), we're turning our coverage of Coinbase into a non-fungible token (NFT). To make that happen, we’re using [Mirror](https://mirror.xyz). If you’d like to contribute, just click the crowdfunding modal below. \n\nThis means anyone with an Ethereum address can own a piece of our analysis and Jack's corresponding artwork. I think it's an exciting experiment both in this particular case and because of what it portends. I’ll unpack that below.\n\n[The Generalist](crowdfund://0x00055b597e0050405B27C90D21343b1eB5b74165?network=homestead)\n\n### What are the details of this project?\nWe are raising 20 ETH, with contributions capped at 0.25 ETH. That ensures a reasonable number of people are able to participate. Allocations are made on a first come, first serve basis. If you don’t have an Ethereum wallet, I recommend downloading [Rainbow’s](https://rainbow.me/) mobile app (iOS only). [Metamask](https://metamask.io/) is a good alternative.\n\nContributors will receive a stake in $GENERALIST, our token.\n\n### What do $GENERALIST holders get?\nBy backing the crowdfund, supporters receive three primary benefits.\n\n1. Proportional stakes in our Coinbase S-1 Club briefing and Jack’s cover art. This will be minted as an NFT.\n2. Proportional stakes in two additional pieces of art by Jack, inspired by Coinbase. These will also be minted as NFTs.\n3. A place in the underlying data of the NFT — embedded in code as original supporters.\nAbove all, you’ll be entering into the process of creating with us.\n\n### What happens after I back this crowdfund?\nFirst, we create our Coinbase S-1 briefing and artwork. Then, we mint them as NFTs, listing them on Zora using a reserve auction. If the reserve price is hit, an auction kicks off, automatically selling the NFT to the highest bidder before the clock runs out. As a holder of $GENERALIST, you can choose to redeem your share of the sale price, or hold. By holding, you’ll receive a portion of future sales.\n### To understand why I'm doing this, keep reading. You'll learn...\n\n- Why I think NFTs are the future\n- The thought process behind $GENERALIST\n- What might come next\n***\n\n### Why NFTs are the future\nWhat gives an asset its value?\nThe founder points to the product, the venture capitalist gestures at a sloping graph, the banker underlines figures on a balance sheet.\n\nWhat about the artist or the writer?\n\nHistorically, creative works have been priced according to scarcity. We give value to objects based, to a large extent, on their rarity.\n\nAesthetically, what is the difference between looking at a replica of Da Vinci's gorgeously slinky *Salvator Mundi* and the real thing? Most viewers could not choose between them. What makes the original worth $450.3 million, a replica a few thousand, and a high-quality online version free?\n\nThe original *Salvator Mundi* is worth nearly half a billion dollars because of its provable authorship, and scarcity. It is the product of one of the greatest minds of all time, and there is — can only ever be — one.\n\nThe same dynamics exist with the written word. You can buy a copy of a *Harry Potter* book for $9.99 via Amazon (or $0.00 for Prime Members) or pay $6,500 for a first edition copy. The words are the same, the story is the same; in short, the art has not changed. The difference is the degree of scarcity.\n\n### The problem of abundance\n\nWhile the variable of scarcity has been useful for traditional artists, it has been of little use to those that create and share pieces online.\n\nAs Kevin Kelley explained, the internet is fundamentally a \"copy machine.\" It is effectively free and easy to create multiple versions of the same product. Death to scarcity; the internet made abundance the norm. In [Scarcity as an API](https://www.readthegeneralist.com/briefing/scarcity-api), I argued that the best consumer startups would find ways to introduce scarcity programmatically, creating value and status for users.\n\n> *As tech and culture further co-mingle, we should expect more startups to follow MSCHF's lead, using drops to win attention. In the process, programmatic methods may rise to contrive scarcity reliably, at scale, online.*\n\n>*We may live in an age of abundance, but with our sense of self tied to the proprietorship of rivalrous assets, scarcity will need to exist. Even if we must code it ourselves.*\n\nIn what feels like a remarkable oversight, I didn't talk about NFTs once. My rationale at the time was that the crypto world required its own, more nuanced treatise. But the omission is glaring because this is precisely what NFTs solve: the problem of abundance.\n\nIn introducing scarcity, NFTs alter the relationship between audience and art in two fundamental ways. The first is by shifting from access to ownership.\n\n### Access vs. Ownership\n\nIn a matter of clicks, anyone with an internet connection can view the world's greatest pieces of art. We can browse the Louvre or British Museum collections and, with a reasonable degree of fidelity, appreciate humanity's most significant cultural accomplishments.\n\nOur relationship to these objects is one of access. Even if paywalled, we do not own anything; we merely have a ticket to look around for a bit.\n\n(Yes, you can buy digital art without blockchain infrastructure. But how can you be sure you're purchasing what you think you are? How do you know it was made by who you think it was, that it isn't a copy, or a copy of a copy? How do you value something given that uncertainty? Ownership has been possible, but it is far from the norm and beset with cumbersome certification and doubt.)\n\nNFTs open up the path for actual ownership. Questions of provenance, authenticity, and scarcity are solved by using the blockchain which is transparent and verifiable. By making the construction of scarcity simple and safe, NFTs have unleashed a new generation of appreciators and investors in art.\n\nThat is not the only relationship NFTs change. Just as significantly, they blur the boundaries between artist and audience.\n\n### Blurring boundaries\n\nLast year, I explored creator monetization in a [two](https://www.readthegeneralist.com/briefing/audience-and-wealth-part-i)-[part](https://www.readthegeneralist.com/briefing/audience-and-wealth-part-ii) series called *Audience and Wealth*. I argued that creators would succeed by muddying the boundaries between themselves, their work, and those that consume it.\n\n> *In this period of dynamism, this dance of frameworks, creators must decide what they want to achieve. Those that learn to share — to distribute effort, attention, money, and ownership — have the chance to build deeper relationships with their audience and eventually subvert the concept of an audience in and of itself. In the end, the goal is not to be one thing or another, to be some half of a circle, light or dark. It is to be in the arena, to bring others in, and together, to build something greater than ourselves.*\n\nNFTs are one solution, allowing audience members to partake in the creation of the work. This might involve supporting a project upfront in exchange for ownership and voting power over the direction of an artistic endeavor.\n\n![](https://images.mirror-media.xyz/publication-images/e813676f-3553-4cdd-84c6-b5163901c7e9.jpeg?height=1255&width=2313)\n\nRather than an artist making art to show and sell to an audience, NFTs allow for an iterative, imbricated process. The audience might fund an artist to create a piece, then offer feedback on improving it, all powered and enabled through the blockchain. While numerous configurations are possible, the tangible result is a disruption of the traditional cycle. Co-creation and co-play become the new norm.\n\n### Fad and reality\n\nOn Thursday, the artist Beeple sold his piece \"Everydays — The First 5000 Days\" for $69 million. There was no canvas for the purchaser to take away, no marble sculpture, no formaldehyde shark. \"Everydays\" is wholly, completely digital.\n\nThis is the knock on NFTs. What do you get? A JPEG? A PNG? Who would pay that kind of money for something so thin, so intangible? The implicit argument here is that artistic value, scarcity, doesn't translate to the digital world.\n\nI think this position misunderstands internet culture and dynamics. Increasingly, the internet is where we generate and exercise status. Our most significant accomplishments, wittiest thoughts, and lustrous photos are all shared online to reflect and create prestige. This might be aimed at a small or large audience, but the core desire to demonstrate value and enhance social rank is the same.\n\nNFTs are built for this new world. Not only are they scarce by design, ensuring status, but they are made to show off in front of an infinite audience. Owners of rare assets can flex in front of a crowd of billions with little more than a photo or a tweet. Flaunting modern wealth will only become easier and more vivid over time.\n\nWhat status would someone earn for purchasing a Banksy NFT? Or Jack Dorsey's first tweet? What myriad ways could Beeple's latest buyer showcase their newest curiosity?\n\nArt reflects the society in which it is created. In their intangibility and innate *onlineness*, NFTs represent internet-native art.\n\n### $GENERALIST\n\nYou can see where this is going. I'm excited to take the wraps off of $GENERALIST, an NFT collaboration between me and Jack Butcher, built on Mirror.\n\nIt all started with a tweet. On February 25, I asked:\n\n[](https://twitter.com/mariodgabriele/status/1365070038328311811)\n\nI'd watched several interesting projects emerge over the previous few weeks, and in Coinbase, I felt there was a potentially ideal fit. How delightfully meta would it be to write a briefing on a crypto company funded by a crypto instrument?\n\nIn Mirror and Jack Butcher, I found the ideal partners.\n\n### Mirror\n\nThanks to responses to that tweet, I discovered there are a *lot* of ways to create an NFT. But there is only one I know of that is custom-built for writers: Mirror.\n\nFounded by Denis Nazarov, the former founder of Mediachain and partner at a16z Crypto, [Mirror](https://mirror.xyz) is a blockchain-based publishing platform. Right now, that involves giving writers the tools to crowdfund a future piece with a crypto twist. In that respect, it's not dissimilar to traditional platforms like Kickstarter, aimed at the essayist. Rather than chipping $50 to aid the creation of a new mobile phone case, contributors receive a token in return for supporting a project with Ether (ETH): the native currency of the Ethereum network.\n\nAlready, it's proven compelling. As you might have seen, Mirror's first crowdfund with John Palmer netted the writer 10 ETH, ~$17K at the time of writing. Contributors received  $ESSAY tokens, getting an economic stake in John's eventual written work in the process.\n\nLike shareholders, these contributors receive funds when a sale occurs. After he'd written \"[Scissor Labels](https://j.mirror.xyz/RUeJfZEZxr-hkuzUCakQyUuf2kOJVMPPiAWBaQFhhqc)\" John sold an NFT representing the piece, giving backers the chance to redeem part of their contribution. Those that hold onto $ESSAY receive a portion of the sale amount.\n\nThis can be confusing stuff (don't worry, I'll outline exactly what we're doing in a moment), but it was clear in speaking with the Mirror team that they're creating a powerful third mechanism for writers to monetize.\n\nI'd found the right platform to run this experiment on. But to take a Generalist NFT to the next level, I wanted to work with an artist. Someone that could bring our research, bring Coinbase, to life. Maybe, I dreamt, I could work with Jack Butcher.\n\n### Jack Butcher\n\nI don't think there's a better visual interpreter of modern value than [Jack](https://twitter.com/jackbutcher). You have probably seen his images and videos online, characterized by an arresting black and white palette and clean lines. But what I love most about Jack's work is that they tell a story. Each of his works functions as a kind of aphorism, a pictorial encapsulation of wisdom.\n\nLook, for example, at this recent piece, captioned \"Truth.\"\n\n![](https://images.mirror-media.xyz/publication-images/2b037215-7e4f-4b93-9eb0-7d53682b9f81.jpeg?height=538&width=946)\n\nIt distills a complex idea — notions of objectivity, truth, and bias — directly and elegantly. Something about those characteristics feels particularly apt when thinking about the blockchain and its embodiment in Coinbase. The world the company operates in is endlessly intricate, often hard to grasp. But there is beauty and sophistication in the architecture of cryptocurrency.\n\nBetter yet, Jack clearly understood this new medium. Last Sunday, he sold \"[Chisel](https://foundation.app/visualizevalue/chisel-4213),\" an NFT for almost 34 ETH, roughly ~$60K. I decided to give it a shot.\n\nOn Monday night, I asked my friend Tom Osman if he could gauge Jack's interest.\n\n![](https://images.mirror-media.xyz/publication-images/ea76581b-29ad-4332-9b03-9f4e900238de.jpeg?height=1320&width=2237)\n\nOf course, Tom delivered. And in a series of rapid-fire DMs over the past few days, Jack and I came up with a plan.\n\n### Mechanics\n\nThe Generalist is raising 20 ETH to power our coverage of Coinbase's IPO. You can see from the screenshot above, we considered different amounts, ranging from 10 to 100 ETH. We think 20 ETH represents a figure that allows a good number of supporters to get involved.\n\n**Those funds, roughly $34K at the time of writing, will be split among three parties. As follows:**\n\n- 50% goes to Jack. He will create three pieces of art: a cover for our essay and two additional Coinbase-themed NFTs.\n- 25% goes to analysts. The S-1 Club is fundamentally a collaborative project — this rewards those that bring their effort and expertise to the table.\n- 25% goes to The Generalist. This helps me continue to grow and improve The Generalist.\n- An additional 10% is minted after the crowdfund and distributed to [Generalist members](https://www.readthegeneralist.com/membership).\n\n![](https://images.mirror-media.xyz/publication-images/513cf83c-f67c-4412-8c6f-6531a3b741f6.jpeg?height=668&width=2187)\n\nBringing in a sponsor for this S-1 Club would likely have contributed more to The Generalist's bottom-line. But my primary goals here are not financial. Instead, they're to bring you, the reader, into this equation.\n\n**On that subject, here's what supporters receive:**\n\n- $GENERALIST tokens.\n- Proportional stakes in our briefing and cover art. (All work is part of the same project).\n- Proportional stakes in Jack's two additional pieces of art.\n- A place in the underlying data of the NFT — embedded in code as original supporters.\n\nAs alluded to earlier, buying $GENERALIST is part-patronage, part-economic involvement. As Jesse Walden [described](https://twitter.com/jessewldn/status/1355165547441303554) it, selling a token like this is effectively \"Patronage+.\" Buyers support the creation of the artwork while also opening up the possibility for upside.\n\n**A few critical points to consider:**\n\n- The crowdfund will take place at 9 pm ET on this page.\n- Allocation is first-come, first serve. I recommend setting an alarm, if you’re interested in contributing.\n- The total raise is 20 ETH, as mentioned.\n\nThe maximum contribution is 0.25 ETH. This is to ensure at least 80 supporters have the chance to participate.\n\n- You will need an Ethereum wallet to participate. If you don’t have one, I recommend [Rainbow’s](https://rainbow.me/) mobile app for those on iOS. [Metamask](https://metamask.io/) is another good option and is available on iOS, Android, and web.\n\n- The conversion rate is 1 ETH = 1,000 $GENERALIST. That means if someone contributes at the 0.25 cap, they will receive 250 $GENERALIST tokens.\n\n- Once we've published the piece, it will be minted as an NFT and posted on Zora, along with Jack's additional artwork. In total, three NFTs will be created.\n\n- Once on Zora, all pieces will be open for bidding in ETH.\n\n- If a reasonable bid is placed, I have the power to accept it on behalf of token holders. However, token holders can choose *not* to redeem their $GENERALIST for ETH, holding on instead.\n\n- If any of our NFTs sell in the future, holders of $GENERALIST will receive a portion of the proceeds.\n\nEspecially for those new to NFTs or cryptocurrency, this can be rather head-spinning. To simplify the matter, I've done my best to outline a customer journey, step-by-step.\n\n![](https://images.mirror-media.xyz/publication-images/94dd3869-142c-4748-8d88-c0aa6684ab83.jpeg?height=1640&width=2360)\n\nI should say at this point: *NFTs are highly speculative*. If your primary goal is to grow your wealth, I encourage getting involved with more time-tested assets. Think of this as a Kickstarter, first: you are supporting the creation of an S-1 analysis by world-class experts in their field that can be freely read by anyone in the world. If you are motivated by the opportunity to take part in something novel, experimental, at the fringes, this could be a good fit.\n\nBeyond this particular project, I'm incredibly excited by what NFT projects like this might foretell. I hope the future of The Generalist will involve further collaboration and co-creation.\n\n### Where Next\n\nI don't know. But I do have a few ideas. During my discussions with Denis and Patrick on the Mirror team, we outlined some far-out concepts.\n\nTo date, the crowdfunds on Mirror have ranged between 1 - 10 ETH. What could you do if you raised 100 ETH instead?\n\n![](https://images.mirror-media.xyz/publication-images/eddcff61-c805-4a7e-a6f1-0a58a5e5fffb.jpeg?height=2039&width=2087)\n\nVersion 1 and 2 are, I think, exciting because of how they extend the economic relationship between creator and audience and blur the boundaries in the way discussed earlier.\n\nWhat would an angel fund look like powered by a $GENERALIST token? In addition to opening up investor access, it could also seamlessly reward contributions from holders. Those that source an investment could receive $GENERALIST for their work, in addition to weighing in on strategic decisions. Founders, for their part, would be accepting capital from a legion of tech-savvy participants invested in the company's growth.\n\nWhile this opens up lots of regulatory questions around community-based capital formation combined with funding traditional startups, there are exciting possibilities for experimentation in the crypto-native sphere.\n\nA grant program could provide similar benefits. Though holders wouldn't have the potential to return an investment in $GENERALIST, they would guide disbursements and ensure the best community projects received support. There's something rather magical about this: the community elevates and supports itself.\n\n***\n\nThe writer Robert Musil once said, \"To love something as an artist...means to be shaken not by its ultimate value or lack of value, but by a side of it that suddenly opens up.\"\n\nPerhaps more than any other medium, NFTs fit this description. In their unique cluster of characteristics — the cocktail of scarcity, authenticity, and scalability — the internet's artform opens up new dimensions.\n\nFor $GENERALIST, I hope this is just the start.\n", "timestamp": 1615769943, "digest": "1T0h7VGDcECJuifK4TPDfRoUQ3zaO_tPwdZV-dtnNqw", "contributor": "0xADbd9aedA5633448e8b4953b4376c9514075abf4"}
{"id": "I2OL26qnvGxh6QX-7BZfCpnY380dnjWRvxLRM7q10-s", "title": "The enemy of your enemy is NOT your friend", "body": "![](https://images.mirror-media.xyz/publication-images/cd284a3d-d04f-4921-b47e-bd4f43d9cfd8.jpeg?height=218&width=350)\n\nUnbeknownst to the average DeFi user, battlelines are currently being drawn as we speak in the ever evolving realm of MEV (Miner-Extractable Value, or… Maximal-Extractable Value as the cool kids are calling it nowadays).\n\nAs the dust slowly settles from when FrankResearcher [first shared on-chain evidence](https://twitter.com/FrankResearcher/status/1311350156219101185) of explicit arbitrage MEV amongst miners last year, several new groups of participants have been scrambling to establish dominance.\n\nIn this article I explore (just the surface) of the various groups competing to extend their reach across MEV domains and their respective attributes.\n\n\n### The Battlelines\n\nThe new MEV participants have varying degrees of hashpower support from their own circle of MEV-friendly miners but they are broadly categorized into the following:\n\n**Group 1: Frontrunning / Backrunning Cartels** \n\nThese groups were operating long before MEV became the mainstream threat it is today, even dating back to the pre-Defi frontrunning Bancor days in early 2018. Therefore they already have the established infrastructure to easily evolve into monopolistic and horizontally integrated **MEV Searcher Cartels**. \n\nIn plain English, this means:\n\n- They require very little effort to migrate their existing bots onto MEV infrastructure. Since they already have optimized transaction re-ordering algorithms, they only need to build the on-chain miner-bribe logic (i.e. check frontrun/backrun outcome and only release bribe to miners via block.coinbase if prior TXs were successful, otherwise revert).\n- They have the resources to branch out (horizontally integrate) across other bespoke revenue seeking MEV strategies like sandwiching and liquidations. Remember, Sandwiching is essentially a frontrun and a backrun 'sandwiched' on either side of an innocent AMM user's trade, for which these groups are already highly optimized for. MEV-powered liquidations are essentially a rigged backrun (more detail below).\n- They have had more time to build working relationships with the larger mining pools. The larger the hashpower at their disposal, the quicker they win the PoW race against other MEV participants on competing ops. EIP1559 will be of annoyance to them since it would 'technically' diminish their competitive hash power advantage, but as [Stephane alluded to here](https://twitter.com/thegostep/status/1369988957770031104), their supporting mining pools do have the option to simply run a modified Geth if the miners are financially incentivized to do so via MEV profits.\n- Their sheer size will mean they may be slower to adapt to the emergence of new MEV strategies compared to others.\n\n**Group 2: DAO/Protocol-Based MEV Groups** \n\nAs seen with KeeperDAO's [Rook](https://medium.com/keeperdao/caro-kann-introducing-rook-liquidity-mining-arbitrage-mining-adbe319905fd), 1inch's [dark pools](https://twitter.com/1inchExchange/status/1334992381242961930), the miner-centric [ArcherDAO](https://www.archerdao.io/) and more recently the [YCabal proposal](https://forum.sushiswapclassic.org/t/proposal-ycabal-mev-strategy/3159) for SushiSwap, these groups leverage MEV strategies 'for the good of the DAO/Protocol'.\n\nIn plain English, this means:\n\n- They offer their users to opt in and route their transactions through a private relay network (a.k.a. dark pool) straight to mining pools and skip the dreaded mempool (think Samczsun and co's use of Sparkpool's Tai Chi network for that [famous whitehat rescue](https://samczsun.com/escaping-the-dark-forest/) last year).\n- However in addition to the private shielding mechanisms, the transactions themselves are analyzed for downstream MEV opportunities such as flow-on arbitrage, liquidation…etc generated as a result of these transactions and the revenue from these MEVs are atomically extracted within the same block and returned back to a pool controlled by the DAO/protocol.\n- This group's competitive advantage comes from the fact that they control their user's transactional flow, so by routing through private proxies they ensure only the DAO/protocol would have visibility and be in a position to atomically take advantage within the same block before anyone else.\n- Their ability to pivot for bespoke MEV strategies will be limited to how quickly they can get proposals endorsed through their governance process.\n- Then there's Chainlink's [Fair Sequencing Services](https://blog.chain.link/chainlink-fair-sequencing-services-enabling-a-provably-fair-defi-ecosystem/), which somewhat fits into this category, however they don't seem to be extracting anything from the MEV ops but may be incentivizing the payment of Link to sequencers to ensure transaction ordering fairness for anyone using their oracle network. The article on FSS is still light on technical details and they technically may not be able to ensure the entire block's ordering, but I'm keeping a close eye on what comes out of this.\n\n**Group 3: Decentralized MEVs Groups** \n\nThe likes of [Flashbots](https://github.com/flashbots/pm) which is democratizing access to MEV revenue by providing publicly accessible MEV infrastructure along with mining pool support for independent developers across the ecosystem.\n\n- Their role in this ecosystem can not be understated - if it were not for their recent emergence the large cartels would have established near-hegemony over any MEV opportunities that are not privately chaperoned via protocol-specific MEV relays.\n- The decentralized nature of their infrastructure has also  incubated a subcategory within this group - that of independent developers partnering up and forming vertically integrated groups that leverage the Flashbots infrastructure to focus on a particular MEV domain (i.e. 2–3 devs getting together to focus on arb, liquidation or frontrunning only). \n- When a new bespoke opportunity arises this category of MEV participants are likely to be the first to react and pivot given their size and nimbleness.\n- However, the same decentralized nature of Flashbots also allows certain elements of the first group to take advantage of their publicly accessible infrastructure.\n\n\n\n### So what have they been up to?\n\n![What's at stake as per https://explore.flashbots.net](https://images.mirror-media.xyz/publication-images/54836f88-4822-481d-9d98-aef637af4ab1.jpeg?height=114&width=800)\n\n**Mining Pool Participation**\n\nIn terms of mining pool participation, 2Miners, Minerall Pool, EzilPool, BeePool, UUPool, SpiderPool, CrazyPool and FlexPool are all competing for a piece of the MEV revenue pie. Privately mined transactions technically aren't considered MEV but they do complement MEV strategies so it's worth mentioning SparkPool and Ethermine as the main dark pool proponents (77% of all privately mined TXs are mined by Ethermine as quoted from this [research paper](https://arxiv.org/pdf/2101.05511.pdf).\n\n**Value Extraction**\n\nBased on the Flashbots' [MEV explorer](https://explore.flashbots.net/) we are currently trending over $1.2M worth of MEV revenue extracted across the entire network per day and almost one Beeple NFT per month. Among this, you would have seen plenty of MEV alphas like zero gas flashloan-powered arbitrages, [sandwiches](https://twitter.com/FrankResearcher/status/1366795352330948610) and [NFT rescues](https://twitter.com/andrekorol1/status/1358252320207876104) on Twitter and Etherscan these days. Those are already considered mainstream by MEV standards.\n\n✌️***Value Extraction***✌️\n\nI vaguely touched on a few MEV dark alphas recently and there was interest in clarifying MEV liquidation strategies in detail.\n\nLiquidations, as you well know, is when a particular loan position falls below a protocol-specified threshold (Health Factor). At which point anyone can call the relevant liquidation function for that loan and claim the collateral at a heavy discount at the borrower's expense.\n\nWhich brings us to **Capital loss-generating** ✌️**Liquidation**✌️(a.k.a. Stale Toasting) via MEV. [Tokentax's general advice](https://tokentax.co/guides/defi-crypto-tax/#taxes-for-loans-interest-paid-collateral-liquidations) on liquidation states that any liquidation event will be:\n\n> \"…treated as if you had sold that crypto for fiat, meaning that you realize any capital gain or loss on those assets\"\n\nA shady tactic in this context revolves around purposely lowering the health factor of your position to trigger a liquidation, BUT you end up as the guaranteed liquidator of your own position to trigger a paper loss.\n\nThis is only possible via MEV as you're able to submit both the liquidation triggering Tx and a backrunning Tx within the same MEV bundle, which results in you being the first to liquidate yourself in the same block before any other liquidation bot even sees it. In layman's terms, MEV infrastructure allows you to specify logic that ensures the first Tx is mined ONLY IF the 2nd backrun Tx is successful, otherwise it's as if nothing happened, like a flash loan revert. Unlike a flashloan, you incur zero gas fees when it reverts. It's a cap loss on paper, but in reality you got your collateral back elsewhere. Would be interesting to see whether your local tax office is savvy enough to understand all this.\n\n**This is bananas...**\n\nThis is just the tip of the iceberg and there's a whole dark forest within the dark forest, where unscrupulous predators stalk other successful predators by decoding their transactions so they can keep stalking them even after they change contracts to evade detection, and that's before we even start talking about how MEV will look on L2, but that's an article for another time.\n\n![\"who will sandwich the sandwichers?\" …  J. Delong](https://images.mirror-media.xyz/publication-images/c76ddac8-556b-4a86-acb2-e46f17b6ae32.jpeg?height=198&width=365)\n\n\n\n### What about other chains?\n\n\n**BSC**\n\nThis question has come up a few times because since Binance Smart Chain is a modified fork of Ethereum, shouldn't they face the same threats?\n\n![](https://images.mirror-media.xyz/publication-images/95e312f6-8de5-4c8e-9e98-143b8170dc42.jpeg?height=450&width=800)\n\nThe simple answer is no, it is unlikely any one of the established BSC validators would try to develop self serving MEV arrangements and risk the wrath of CZ. It'd only be a short term gain with long term pain (blacklisting). If they do, I guess you could call it CEV (CZ-approved Exploitable Value), which is unlikely to happen.\n\n**AVAX**\n\nI believe AVAX's consensus model is leaderless, thus MEV would not apply as there isn't a single entity that handles block production or to determine transaction ordering.\n\n\n### So what does this mean for you?\n\n- If you're a **DeFi end user**, particularly a Uniswap trader, you might want to review your slippage tolerance settings. You just need to have a look through the various MEV discords to see that there's enough sandwich makers pointed at Uni to make a giant picnic. And their numbers are growing everyday. This would be mitigated if Uni V3 is released with protocol-specific MEV arrangements (not insider alpha, I don't know what's in Uni V3), then all you'll need to do is opt in.\n- \n- If you're a **solo miner** in a MEV-active mining pool, keep in mind they're technically not obligated to share their MEV revenue with you, so it's worth asking the question to get some transparency, as it's not easy for you to calculate this yourself.\n- \n- If you're a **mining pool** that's yet to get involved in MEV then check out the Flashbot's [miner onboarding page](https://github.com/flashbots/pm/blob/main/guides/miner-onboarding.md). Otherwise you're missing out on an emerging revenue stream.\n- \n- If you're an **independent developer** whose arb/liquidation bots have stopped yielding profit, then considering joining the [flashbots discord](https://discord.com/invite/3TjWjBerRb) and partnering up with other like-minded devs to build your own vertically integrated MEV strategies and challenge the cartel's hegemony.\n\n![Can someone build this at the next hackathon and open source it?](https://images.mirror-media.xyz/publication-images/2bc118ae-69a3-4fe0-ba23-f0d80b164a23.jpeg?height=175&width=800)\n\nIt's a scary forest out there, but align yourself with one of the three aforementioned MEV groups instead of going at it alone and you'll have a slightly less horrifying time.\n\n\n\nStay safe,\n\nfifikobayashi", "timestamp": 1615796779, "digest": "QXdCOAggA5g_j5R_JpO-V5LqK89EbimnYIV6c2rOsT0", "contributor": "0xef03254aBC88C81Cb822b5E4DCDf22D55645bCe6"}
{"id": "m-kx6Snwx32oThsUFa91bsmL_pXI9FlO85H_g29wXm0", "title": "The enemy of your enemy is NOT your friend", "body": "![](https://images.mirror-media.xyz/publication-images/cd284a3d-d04f-4921-b47e-bd4f43d9cfd8.jpeg?height=218&width=350)\n\nUnbeknownst to the average DeFi user, battlelines are currently being drawn as we speak in the ever evolving realm of MEV (Miner-Extractable Value, or… Maximal-Extractable Value as the cool kids are calling it nowadays).\n\nAs the dust slowly settles from when FrankResearcher [first shared on-chain evidence](https://twitter.com/FrankResearcher/status/1311350156219101185) of explicit arbitrage MEV amongst miners last year, several new groups of participants have been scrambling to establish dominance.\n\nIn this article I explore (just the surface) of the various groups competing to extend their reach across MEV domains and their respective attributes.\n\n\n### The Battlelines\n\nThe new MEV participants have varying degrees of hashpower support from their own circle of MEV-friendly miners but they are broadly categorized into the following:\n\n**Group 1: Frontrunning / Backrunning Cartels** \n\nThese groups were operating long before MEV became the mainstream threat it is today, even dating back to the pre-Defi frontrunning Bancor days in early 2018. Therefore they already have the established infrastructure to easily evolve into monopolistic and horizontally integrated **MEV Searcher Cartels**. \n\nIn plain English, this means:\n\n- They require very little effort to migrate their existing bots onto MEV infrastructure. Since they already have optimized transaction re-ordering algorithms, they only need to build the on-chain miner-bribe logic (i.e. check frontrun/backrun outcome and only release bribe to miners via block.coinbase if prior TXs were successful, otherwise revert).\n- They have the resources to branch out (horizontally integrate) across other bespoke revenue seeking MEV strategies like sandwiching and liquidations. Remember, Sandwiching is essentially a frontrun and a backrun 'sandwiched' on either side of an innocent AMM user's trade, for which these groups are already highly optimized for. MEV-powered liquidations are essentially a rigged backrun (more detail below).\n- They have had more time to build working relationships with the larger mining pools. The larger the hashpower at their disposal, the quicker they win the PoW race against other MEV participants on competing ops. EIP1559 will be of annoyance to them since it would 'technically' diminish their competitive hash power advantage, but as [Stephane alluded to here](https://twitter.com/thegostep/status/1369988957770031104), their supporting mining pools do have the option to simply run a modified Geth if the miners are financially incentivized to do so via MEV profits.\n- Their sheer size will mean they may be slower to adapt to the emergence of new MEV strategies compared to others.\n\n**Group 2: DAO/Protocol-Based MEV Groups** \n\nAs seen with KeeperDAO's [Rook](https://medium.com/keeperdao/caro-kann-introducing-rook-liquidity-mining-arbitrage-mining-adbe319905fd), 1inch's [dark pools](https://twitter.com/1inchExchange/status/1334992381242961930), the miner-centric [ArcherDAO](https://www.archerdao.io/) and more recently the [YCabal proposal](https://forum.sushiswapclassic.org/t/proposal-ycabal-mev-strategy/3159) for SushiSwap, these groups leverage MEV strategies 'for the good of the DAO/Protocol'.\n\nIn plain English, this means:\n\n- They offer their users to opt in and route their transactions through a private relay network (a.k.a. dark pool) straight to mining pools and skip the dreaded mempool (think Samczsun and co's use of Sparkpool's Tai Chi network for that [famous whitehat rescue](https://samczsun.com/escaping-the-dark-forest/) last year).\n- However in addition to the private shielding mechanisms, the transactions themselves are analyzed for downstream MEV opportunities such as flow-on arbitrage, liquidation…etc generated as a result of these transactions and the revenue from these MEVs are atomically extracted within the same block and returned back to a pool controlled by the DAO/protocol.\n- This group's competitive advantage comes from the fact that they control their user's transactional flow, so by routing through private proxies they ensure only the DAO/protocol would have visibility and be in a position to atomically take advantage within the same block before anyone else.\n- Their ability to pivot for bespoke MEV strategies will be limited to how quickly they can get proposals endorsed through their governance process.\n- Then there's Chainlink's [Fair Sequencing Services](https://blog.chain.link/chainlink-fair-sequencing-services-enabling-a-provably-fair-defi-ecosystem/), which somewhat fits into this category, however they don't seem to be extracting anything from the MEV ops but may be incentivizing the payment of Link to sequencers to ensure transaction ordering fairness for anyone using their oracle network. The article on FSS is still light on technical details and they technically may not be able to ensure the entire block's ordering, but I'm keeping a close eye on what comes out of this.\n\n**Group 3: Decentralized MEVs Groups** \n\nThe likes of [Flashbots](https://github.com/flashbots/pm) which is democratizing access to MEV revenue by providing publicly accessible MEV infrastructure along with mining pool support for independent developers across the ecosystem.\n\n- Their role in this ecosystem can not be understated - if it were not for their recent emergence the large cartels would have established near-hegemony over any MEV opportunities that are not privately chaperoned via protocol-specific MEV relays.\n- The decentralized nature of their infrastructure has also  incubated a subcategory within this group - that of independent developers partnering up and forming vertically integrated groups that leverage the Flashbots infrastructure to focus on a particular MEV domain (i.e. 2–3 devs getting together to focus on arb, liquidation or frontrunning only). \n- When a new bespoke opportunity arises this category of MEV participants are likely to be the first to react and pivot given their size and nimbleness.\n- However, the same decentralized nature of Flashbots also allows certain elements of the first group to take advantage of their publicly accessible infrastructure.\n\n\n\n### So what have they been up to?\n\n![What's at stake as per https://explore.flashbots.net](https://images.mirror-media.xyz/publication-images/54836f88-4822-481d-9d98-aef637af4ab1.jpeg?height=114&width=800)\n\n**Mining Pool Participation**\n\nIn terms of mining pool participation, 2Miners, Minerall Pool, EzilPool, BeePool, UUPool, SpiderPool, CrazyPool and FlexPool are all competing for a piece of the MEV revenue pie. Privately mined transactions technically aren't considered MEV but they do complement MEV strategies so it's worth mentioning SparkPool and Ethermine as the main dark pool proponents (77% of all privately mined TXs are mined by Ethermine as quoted from this [research paper](https://arxiv.org/pdf/2101.05511.pdf).\n\n**Value Extraction**\n\nBased on the Flashbots' [MEV explorer](https://explore.flashbots.net/) we are currently trending over $1.2M worth of MEV revenue extracted across the entire network per day and almost one Beeple NFT per month. Among this, you would have seen plenty of MEV alphas like zero gas flashloan-powered arbitrages, [sandwiches](https://twitter.com/FrankResearcher/status/1366795352330948610) and [NFT rescues](https://twitter.com/andrekorol1/status/1358252320207876104) on Twitter and Etherscan these days. Those are already considered mainstream by MEV standards.\n\n✌️***Value Extraction***✌️\n\nI vaguely touched on a few MEV dark alphas recently and there was interest in clarifying MEV liquidation strategies in detail.\n\nLiquidations, as you well know, is when a particular loan position falls below a protocol-specified threshold (Health Factor). At which point anyone can call the relevant liquidation function for that loan and claim the collateral at a heavy discount at the borrower's expense.\n\nWhich brings us to **Capital loss-generating** ✌️**Liquidation**✌️(a.k.a. Stale Toasting) via MEV. [Tokentax's general advice](https://tokentax.co/guides/defi-crypto-tax/#taxes-for-loans-interest-paid-collateral-liquidations) on liquidation states that any liquidation event will be:\n\n> \"…treated as if you had sold that crypto for fiat, meaning that you realize any capital gain or loss on those assets\"\n\nA shady tactic in this context revolves around purposely lowering the health factor of your position to trigger a liquidation, BUT you end up as the guaranteed liquidator of your own position to trigger a paper loss.\n\nThis is only possible via MEV as you're able to submit both the liquidation triggering Tx and a backrunning Tx within the same MEV bundle, which results in you being the first to liquidate yourself in the same block before any other liquidation bot even sees it. In layman's terms, MEV infrastructure allows you to specify logic that ensures the first Tx is mined ONLY IF the 2nd backrun Tx is successful, otherwise it's as if nothing happened, like a flash loan revert. Unlike a flashloan, you incur zero gas fees when it reverts. It's a cap loss on paper, but in reality you got your collateral back elsewhere. Would be interesting to see whether your local tax office is savvy enough to understand all this.\n\n**This is bananas...**\n\nThis is just the tip of the iceberg and there's a whole dark forest within the dark forest, where unscrupulous predators stalk other successful predators by decoding their transactions so they can keep stalking them even after they change contracts to evade detection, and that's before we even start talking about how MEV will look on L2, but that's an article for another time.\n\n![\"who will sandwich the sandwichers?\" …  J. Delong](https://images.mirror-media.xyz/publication-images/c76ddac8-556b-4a86-acb2-e46f17b6ae32.jpeg?height=198&width=365)\n\n\n\n### What about other chains?\n\n\n**BSC**\n\nThis question has come up a few times because since Binance Smart Chain is a modified fork of Ethereum, shouldn't they face the same threats?\n\n![](https://images.mirror-media.xyz/publication-images/95e312f6-8de5-4c8e-9e98-143b8170dc42.jpeg?height=450&width=800)\n\nThe simple answer is no, it is unlikely any one of the established BSC validators would try to develop self serving MEV arrangements and risk the wrath of CZ. It'd only be a short term gain with long term pain (blacklisting). If they do, I guess you could call it CEV (CZ-approved Exploitable Value), which is unlikely to happen.\n\n**AVAX**\n\nI believe AVAX's consensus model is leaderless, thus MEV would not apply as there isn't a single entity that handles block production or to determine transaction ordering.\n\n\n### So what does this mean for you?\n\n- If you're a **DeFi end user**, particularly a Uniswap trader, you might want to review your slippage tolerance settings. You just need to have a look through the various MEV discords to see that there's enough sandwich makers pointed at Uni to make a giant picnic. And their numbers are growing everyday. This would be mitigated if Uni V3 is released with protocol-specific MEV arrangements (not insider alpha, I don't know what's in Uni V3), then all you'll need to do is opt in.\n- \n- If you're a **solo miner** in a MEV-active mining pool, keep in mind they're technically not obligated to share their MEV revenue with you, so it's worth asking the question to get some transparency, as it's not easy for you to calculate this yourself.\n- \n- If you're a **mining pool** that's yet to get involved in MEV then check out the Flashbot's [miner onboarding page](https://github.com/flashbots/pm/blob/main/guides/miner-onboarding.md). Otherwise you're missing out on an emerging revenue stream.\n- \n- If you're an **independent developer** whose arb/liquidation bots have stopped yielding profit, then considering joining the [flashbots discord](https://discord.com/invite/3TjWjBerRb) and partnering up with other like-minded devs to build your own vertically integrated MEV strategies and challenge the cartel's hegemony.\n\n![Can someone build this at the next hackathon and open source it?](https://images.mirror-media.xyz/publication-images/2bc118ae-69a3-4fe0-ba23-f0d80b164a23.jpeg?height=175&width=800)\n\nIt's a scary forest out there, but align yourself with one of the three aforementioned MEV groups instead of going at it alone and you'll have a slightly less horrifying time.\n\n\n\nStay safe,\n\nfifikobayashi\n\n\n**ACK**: Thanks to @[epheph](https://twitter.com/epheph), @[onewayfunction](https://twitter.com/onewayfunction), @[tzhen ](https://twitter.com/tzhen)and the rest of the Flashbots crew for being my technical sounding board on all things MEV.", "timestamp": 1615797407, "digest": "QXdCOAggA5g_j5R_JpO-V5LqK89EbimnYIV6c2rOsT0", "contributor": "0xef03254aBC88C81Cb822b5E4DCDf22D55645bCe6"}
{"id": "bcm6rWf5NIK0z6lLbJhPIYvNDTK7DoqP1iSCZQiviqI", "title": "The enemy of your enemy is NOT your friend", "body": "![](https://images.mirror-media.xyz/publication-images/cd284a3d-d04f-4921-b47e-bd4f43d9cfd8.jpeg?height=218&width=350)\n\nUnbeknownst to the average DeFi user, battlelines are currently being drawn as we speak in the ever evolving realm of MEV (Miner-Extractable Value, or… Maximal-Extractable Value as the cool kids are calling it nowadays).\n\nAs the dust slowly settles from when FrankResearcher [first shared on-chain evidence](https://twitter.com/FrankResearcher/status/1311350156219101185) of explicit arbitrage MEV amongst miners last year, several new groups of participants have been scrambling to establish dominance.\n\nIn this article I explore (just the surface) of the various groups competing to extend their reach across MEV domains and their respective attributes.\n\n\n### The Battlelines\n\nThe new MEV participants have varying degrees of hashpower support from their own circle of MEV-friendly miners but they are broadly categorized into the following:\n\n**Group 1: Frontrunning / Backrunning Cartels** \n\nThese groups were operating long before MEV became the mainstream threat it is today, even dating back to the pre-Defi frontrunning Bancor days in early 2018. Therefore they already have the established infrastructure to easily evolve into monopolistic and horizontally integrated **MEV Searcher Cartels**. \n\nIn plain English, this means:\n\n- They require very little effort to migrate their existing bots onto MEV infrastructure. Since they already have optimized transaction re-ordering algorithms, they only need to build the on-chain miner-bribe logic (i.e. check frontrun/backrun outcome and only release bribe to miners via block.coinbase if prior TXs were successful, otherwise revert).\n- They have the resources to branch out (horizontally integrate) across other bespoke revenue seeking MEV strategies like sandwiching and liquidations. Remember, Sandwiching is essentially a frontrun and a backrun 'sandwiched' on either side of an innocent AMM user's trade, for which these groups are already highly optimized for. MEV-powered liquidations are essentially a rigged backrun (more detail below).\n- They have had more time to build working relationships with the larger mining pools. The larger the hashpower at their disposal, the quicker they win the PoW race against other MEV participants on competing ops. EIP1559 will be of annoyance to them since it would 'technically' diminish their competitive hash power advantage, but as [Stephane alluded to here](https://twitter.com/thegostep/status/1369988957770031104), their supporting mining pools do have the option to simply run a modified Geth if the miners are financially incentivized to do so via MEV profits.\n- Their sheer size will mean they may be slower to adapt to the emergence of new MEV strategies compared to others.\n\n**Group 2: DAO/Protocol-Based MEV Groups** \n\nAs seen with KeeperDAO's [Rook](https://medium.com/keeperdao/caro-kann-introducing-rook-liquidity-mining-arbitrage-mining-adbe319905fd), 1inch's [dark pools](https://twitter.com/1inchExchange/status/1334992381242961930), the miner-centric [ArcherDAO](https://www.archerdao.io/) and more recently the [YCabal proposal](https://forum.sushiswapclassic.org/t/proposal-ycabal-mev-strategy/3159) for SushiSwap, these groups leverage MEV strategies 'for the good of the DAO/Protocol'.\n\nIn plain English, this means:\n\n- They offer their users to opt in and route their transactions through a private relay network (a.k.a. dark pool) straight to mining pools and skip the dreaded mempool (think Samczsun and co's use of Sparkpool's Tai Chi network for that [famous whitehat rescue](https://samczsun.com/escaping-the-dark-forest/) last year).\n- However in addition to the private shielding mechanisms, the transactions themselves are analyzed for downstream MEV opportunities such as flow-on arbitrage, liquidation…etc generated as a result of these transactions and the revenue from these MEVs are atomically extracted within the same block and returned back to a pool controlled by the DAO/protocol.\n- This group's competitive advantage comes from the fact that they control their user's transactional flow, so by routing through private proxies they ensure only the DAO/protocol would have visibility and be in a position to atomically take advantage within the same block before anyone else.\n- Their ability to pivot for bespoke MEV strategies will be limited to how quickly they can get proposals endorsed through their governance process.\n- Then there's Chainlink's [Fair Sequencing Services](https://blog.chain.link/chainlink-fair-sequencing-services-enabling-a-provably-fair-defi-ecosystem/), which somewhat fits into this category, however they don't seem to be extracting anything from the MEV ops but may be incentivizing the payment of Link to sequencers to ensure transaction ordering fairness for anyone using their oracle network. The article on FSS is still light on technical details and they technically may not be able to ensure the entire block's ordering, but I'm keeping a close eye on what comes out of this.\n\n**Group 3: Decentralized MEVs Groups** \n\nThe likes of [Flashbots](https://github.com/flashbots/pm) which is democratizing access to MEV revenue by providing publicly accessible MEV infrastructure along with mining pool support for independent developers across the ecosystem.\n\n- Their role in this ecosystem can not be understated - if it were not for their recent emergence the large cartels would have established near-hegemony over any MEV opportunities that are not privately chaperoned via protocol-specific MEV relays.\n- The decentralized nature of their infrastructure has also  incubated a subcategory within this group - that of independent developers partnering up and forming vertically integrated groups that leverage the Flashbots infrastructure to focus on a particular MEV domain (i.e. 2–3 devs getting together to focus on arb, liquidation or frontrunning only). \n- When a new bespoke opportunity arises this category of MEV participants are likely to be the first to react and pivot given their size and nimbleness.\n- However, the same decentralized nature of Flashbots also allows certain elements of the first group to take advantage of their publicly accessible infrastructure.\n\n\n\n### So what have they been up to?\n\n![What's at stake as per https://explore.flashbots.net](https://images.mirror-media.xyz/publication-images/54836f88-4822-481d-9d98-aef637af4ab1.jpeg?height=114&width=800)\n\n**Mining Pool Participation**\n\nThe following mining pools are all currently competing for a piece of the MEV revenue pie:\n\n- 2Miners\n- Minerall Pool \n- EzilPool\n- BeePool\n- UUPool\n- SpiderPool\n- CrazyPool\n- FlexPool \n\nPrivately mined transactions technically aren't considered MEV but they do complement MEV strategies so it's worth mentioning SparkPool and Ethermine as the main dark pool proponents (77% of all privately mined TXs are mined by Ethermine as quoted from this [research paper](https://arxiv.org/pdf/2101.05511.pdf).\n\n**Value Extraction**\n\nBased on the Flashbots' [MEV explorer](https://explore.flashbots.net/) we are currently trending over $1.2M worth of MEV revenue extracted across the entire network per day and almost one Beeple NFT per month. Among this, you would have seen plenty of MEV alphas like zero gas flashloan-powered arbitrages, [sandwiches](https://twitter.com/FrankResearcher/status/1366795352330948610) and [NFT rescues](https://twitter.com/andrekorol1/status/1358252320207876104) on Twitter and Etherscan these days. Those are already considered mainstream by MEV standards.\n\n✌️***Value Extraction***✌️\n\nI vaguely touched on a few MEV dark alphas recently and there was interest in clarifying MEV liquidation strategies in detail.\n\nLiquidations, as you well know, is when a particular loan position falls below a protocol-specified threshold (Health Factor). At which point anyone can call the relevant liquidation function for that loan and claim the collateral at a heavy discount at the borrower's expense.\n\nWhich brings us to **Capital loss-generating** ✌️**Liquidation**✌️(a.k.a. Stale Toasting) via MEV. [Tokentax's general advice](https://tokentax.co/guides/defi-crypto-tax/#taxes-for-loans-interest-paid-collateral-liquidations) on liquidation states that any liquidation event will be:\n\n> \"…treated as if you had sold that crypto for fiat, meaning that you realize any capital gain or loss on those assets\"\n\nA shady tactic in this context revolves around purposely lowering the health factor of your position to trigger a liquidation, BUT you end up as the guaranteed liquidator of your own position to trigger a paper loss.\n\nThis is only possible via MEV as you're able to submit both the liquidation triggering Tx and a backrunning Tx within the same MEV bundle, which results in you being the first to liquidate yourself in the same block before any other liquidation bot even sees it. In layman's terms, MEV infrastructure allows you to specify logic that ensures the first Tx is mined ONLY IF the 2nd backrun Tx is successful, otherwise it's as if nothing happened, like a flash loan revert. Unlike a flashloan, you incur zero gas fees when it reverts. It's a cap loss on paper, but in reality you got your collateral back elsewhere. Would be interesting to see whether your local tax office is savvy enough to understand all this.\n\n**This is bananas...**\n\nThis is just the tip of the iceberg and there's a whole dark forest within the dark forest, where unscrupulous predators stalk other successful predators by decoding their transactions so they can keep stalking them even after they change contracts to evade detection, and that's before we even start talking about how MEV will look on L2, but that's an article for another time.\n\n![\"who will sandwich the sandwichers?\" …  J. Delong](https://images.mirror-media.xyz/publication-images/c76ddac8-556b-4a86-acb2-e46f17b6ae32.jpeg?height=198&width=365)\n\n\n\n### What about other chains?\n\n\n**BSC**\n\nThis question has come up a few times because since Binance Smart Chain is a modified fork of Ethereum, shouldn't they face the same threats?\n\n![](https://images.mirror-media.xyz/publication-images/95e312f6-8de5-4c8e-9e98-143b8170dc42.jpeg?height=450&width=800)\n\nThe simple answer is no, it is unlikely any one of the established BSC validators would try to develop self serving MEV arrangements and risk the wrath of CZ. It'd only be a short term gain with long term pain (blacklisting). If they do, I guess you could call it CEV (CZ-approved Exploitable Value), which is unlikely to happen.\n\n**AVAX**\n\nI believe AVAX's consensus model is leaderless, thus MEV would not apply as there isn't a single entity that handles block production or to determine transaction ordering.\n\n\n### So what does this mean for you?\n\n- If you're a **DeFi end user**, particularly a Uniswap trader, you might want to review your slippage tolerance settings. You just need to have a look through the various MEV discords to see that there's enough sandwich makers pointed at Uni to make a giant picnic. And their numbers are growing everyday. This would be mitigated if Uni V3 is released with protocol-specific MEV arrangements (not insider alpha, I don't know what's in Uni V3), then all you'll need to do is opt in.\n- \n- If you're a **solo miner** in a MEV-active mining pool, keep in mind they're technically not obligated to share their MEV revenue with you, so it's worth asking the question to get some transparency, as it's not easy for you to calculate this yourself.\n- \n- If you're a **mining pool** that's yet to get involved in MEV then check out the Flashbot's [miner onboarding page](https://github.com/flashbots/pm/blob/main/guides/miner-onboarding.md). Otherwise you're missing out on an emerging revenue stream.\n- \n- If you're an **independent developer** whose arb/liquidation bots have stopped yielding profit, then considering joining the [flashbots discord](https://discord.com/invite/3TjWjBerRb) and partnering up with other like-minded devs to build your own vertically integrated MEV strategies and challenge the cartel's hegemony.\n\n![Can someone build this at the next hackathon and open source it?](https://images.mirror-media.xyz/publication-images/2bc118ae-69a3-4fe0-ba23-f0d80b164a23.jpeg?height=175&width=800)\n\nIt's a scary forest out there, but align yourself with one of the three aforementioned MEV groups instead of going at it alone and you'll have a slightly less horrifying time.\n\n\n\nStay safe,\n\nfifikobayashi\n\n\n**ACK**: Thanks to @[epheph](https://twitter.com/epheph), @[onewayfunction](https://twitter.com/onewayfunction), @[tzhen ](https://twitter.com/tzhen)and the rest of the Flashbots crew for being my technical sounding board on all things MEV.", "timestamp": 1615807440, "digest": "QXdCOAggA5g_j5R_JpO-V5LqK89EbimnYIV6c2rOsT0", "contributor": "0xef03254aBC88C81Cb822b5E4DCDf22D55645bCe6"}
{"id": "XPM4nHyNjkVUFUGL3vkZUnlyKpfhxMNRgk58uU_8rPA", "title": "The enemy of your enemy is NOT your friend", "body": "![](https://images.mirror-media.xyz/publication-images/cd284a3d-d04f-4921-b47e-bd4f43d9cfd8.jpeg?height=218&width=350)\n\nUnbeknownst to the average DeFi user, battlelines are currently being drawn as we speak in the ever evolving realm of MEV (Miner-Extractable Value, or… Maximal-Extractable Value as the cool kids are calling it nowadays).\n\nAs the dust slowly settles from when FrankResearcher [first shared on-chain evidence](https://twitter.com/FrankResearcher/status/1311350156219101185) of explicit arbitrage MEV amongst miners last year, several new groups of participants have been scrambling to establish dominance.\n\nIn this article I explore (just the surface) of the various groups competing to extend their reach across MEV domains and their respective attributes.\n\n\n### The Battlelines\n\nThe new MEV participants have varying degrees of hashpower support from their own circle of MEV-friendly miners but they are broadly categorized into the following:\n\n**Group 1: Frontrunning / Backrunning Cartels** \n\nThese groups were operating long before MEV became the mainstream threat it is today, even dating back to the pre-Defi frontrunning Bancor days in early 2018. Therefore they already have the established infrastructure to easily evolve into monopolistic and horizontally integrated **MEV Searcher Cartels**. \n\nIn plain English, this means:\n\n- They require very little effort to migrate their existing bots onto MEV infrastructure. Since they already have optimized transaction re-ordering algorithms, they only need to build the on-chain miner-bribe logic (i.e. check frontrun/backrun outcome and only release bribe to miners via block.coinbase if prior TXs were successful, otherwise revert).\n- They have the resources to branch out (horizontally integrate) across other bespoke revenue seeking MEV strategies like sandwiching and liquidations. Remember, Sandwiching is essentially a frontrun and a backrun 'sandwiched' on either side of an innocent AMM user's trade, for which these groups are already highly optimized for. MEV-powered liquidations are essentially a rigged backrun (more detail below).\n- They have had more time to build working relationships with the larger mining pools. The larger the hashpower at their disposal, the quicker they win the PoW race against other MEV participants on competing ops. EIP1559 will be of annoyance to them since it would 'technically' diminish their competitive hash power advantage, but as [Stephane alluded to here](https://twitter.com/thegostep/status/1369988957770031104), their supporting mining pools do have the option to simply run a modified Geth if the miners are financially incentivized to do so via MEV profits.\n- Their sheer size will mean they may be slower to adapt to the emergence of new MEV strategies compared to others.\n\n**Group 2: DAO/Protocol-Based MEV Groups** \n\nAs seen with KeeperDAO's [Rook](https://medium.com/keeperdao/caro-kann-introducing-rook-liquidity-mining-arbitrage-mining-adbe319905fd), 1inch's [dark pools](https://twitter.com/1inchExchange/status/1334992381242961930), the miner-centric [ArcherDAO](https://www.archerdao.io/) and more recently the [YCabal proposal](https://forum.sushiswapclassic.org/t/proposal-ycabal-mev-strategy/3159) for SushiSwap, these groups leverage MEV strategies 'for the good of the DAO/Protocol'.\n\nIn plain English, this means:\n\n- They offer their users to opt in and route their transactions through a private relay network (a.k.a. dark pool) straight to mining pools and skip the dreaded mempool (think Samczsun and co's use of Sparkpool's Tai Chi network for that [famous whitehat rescue](https://samczsun.com/escaping-the-dark-forest/) last year).\n- However in addition to the private shielding mechanisms, the transactions themselves are analyzed for downstream MEV opportunities such as flow-on arbitrage, liquidation…etc generated as a result of these transactions and the revenue from these MEVs are atomically extracted within the same block and returned back to a pool controlled by the DAO/protocol.\n- This group's competitive advantage comes from the fact that they control their user's transactional flow, so by routing through private proxies they ensure only the DAO/protocol would have visibility and be in a position to atomically take advantage within the same block before anyone else.\n- Their ability to pivot for bespoke MEV strategies will be limited to how quickly they can get proposals endorsed through their governance process.\n- Then there's Chainlink's [Fair Sequencing Services](https://blog.chain.link/chainlink-fair-sequencing-services-enabling-a-provably-fair-defi-ecosystem/), which somewhat fits into this category, however they don't seem to be extracting anything from the MEV ops but may be incentivizing the payment of Link to sequencers to ensure transaction ordering fairness for anyone using their oracle network. The article on FSS is still light on technical details and they technically may not be able to ensure the entire block's ordering, but I'm keeping a close eye on what comes out of this.\n\n**Group 3: Decentralized MEVs Groups** \n\nThe likes of [Flashbots](https://github.com/flashbots/pm) which is democratizing access to MEV revenue by providing publicly accessible MEV infrastructure along with mining pool support for independent developers across the ecosystem.\n\n- Their role in this ecosystem can not be understated - if it were not for their recent emergence the large cartels would have established near-hegemony over any MEV opportunities that are not privately chaperoned via protocol-specific MEV relays.\n- The decentralized nature of their infrastructure has also  incubated a subcategory within this group - that of independent developers partnering up and forming vertically integrated groups that leverage the Flashbots infrastructure to focus on a particular MEV domain (i.e. 2–3 devs getting together to focus on arb, liquidation or frontrunning only). \n- When a new bespoke opportunity arises this category of MEV participants are likely to be the first to react and pivot given their size and nimbleness.\n- However, the same decentralized nature of Flashbots also allows certain elements of the first group to take advantage of their publicly accessible infrastructure.\n\n\n\n### So what have they been up to?\n\n![What's at stake as per https://explore.flashbots.net](https://images.mirror-media.xyz/publication-images/54836f88-4822-481d-9d98-aef637af4ab1.jpeg?height=114&width=800)\n\n**Mining Pool Participation**\n\nThe following mining pools are all currently competing for a piece of the MEV pie:\n\n- 2Miners\n- Minerall Pool \n- EzilPool\n- BeePool\n- UUPool\n- SpiderPool\n- CrazyPool\n- FlexPool \n\nPrivately mined transactions technically aren't considered MEV but they do complement MEV strategies so it's worth mentioning SparkPool and Ethermine as the main dark pool proponents (77% of all privately mined TXs are mined by Ethermine as quoted from this [research paper](https://arxiv.org/pdf/2101.05511.pdf)).\n\n**Value Extraction**\n\nBased on the Flashbots' [MEV explorer](https://explore.flashbots.net/) we are currently trending over $1.2M worth of MEV revenue extracted across the entire network per day and almost one Beeple NFT per month. Among this, you would have seen plenty of MEV alphas like zero gas flashloan-powered arbitrages, [sandwiches](https://twitter.com/FrankResearcher/status/1366795352330948610) and [NFT rescues](https://twitter.com/andrekorol1/status/1358252320207876104) on Twitter and Etherscan these days. Those are already considered mainstream by MEV standards.\n\n✌️***Value Extraction***✌️\n\nI vaguely touched on a few MEV dark alphas recently and there was interest in clarifying MEV liquidation strategies in detail.\n\nLiquidations, as you well know, is when a particular loan position falls below a protocol-specified threshold (Health Factor). At which point anyone can call the relevant liquidation function for that loan and claim the collateral at a heavy discount at the borrower's expense.\n\nWhich brings us to **Capital loss-generating** ✌️**Liquidation**✌️(a.k.a. Stale Toasting) via MEV. [Tokentax's general advice](https://tokentax.co/guides/defi-crypto-tax/#taxes-for-loans-interest-paid-collateral-liquidations) on liquidation states that any liquidation event will be:\n\n> \"…treated as if you had sold that crypto for fiat, meaning that you realize any capital gain or loss on those assets\"\n\nA shady tactic in this context revolves around purposely lowering the health factor of your position to trigger a liquidation, BUT you end up as the guaranteed liquidator of your own position to trigger a paper loss.\n\nThis is only possible via MEV as you're able to submit both the liquidation triggering Tx and a backrunning Tx within the same MEV bundle, which results in you being the first to liquidate yourself in the same block before any other liquidation bot even sees it. In layman's terms, MEV infrastructure allows you to specify logic that ensures the first Tx is mined ONLY IF the 2nd backrun Tx is successful, otherwise it's as if nothing happened, like a flash loan revert. Unlike a flashloan, you incur zero gas fees when it reverts. It's a cap loss on paper, but in reality you got your collateral back elsewhere. Would be interesting to see whether your local tax office is savvy enough to understand all this.\n\n**This is bananas...**\n\nThis is just the tip of the iceberg and there's a whole dark forest within the dark forest, where unscrupulous predators stalk other successful predators by decoding their transactions so they can keep stalking them even after they change contracts to evade detection, and that's before we even start talking about how MEV will look on L2, but that's an article for another time.\n\n![\"who will sandwich the sandwichers?\" …  J. Delong](https://images.mirror-media.xyz/publication-images/c76ddac8-556b-4a86-acb2-e46f17b6ae32.jpeg?height=198&width=365)\n\n\n\n### What about other chains?\n\n\n**BSC**\n\nThis question has come up a few times because since Binance Smart Chain is a modified fork of Ethereum, shouldn't they face the same threats?\n\n![](https://images.mirror-media.xyz/publication-images/95e312f6-8de5-4c8e-9e98-143b8170dc42.jpeg?height=450&width=800)\n\nThe simple answer is no, it is unlikely any one of the established BSC validators would try to develop self serving MEV arrangements and risk the wrath of CZ. It'd only be a short term gain with long term pain (blacklisting). If they do, I guess you could call it CEV (CZ-approved Exploitable Value), which is unlikely to happen.\n\n**AVAX**\n\nI believe AVAX's consensus model is leaderless, thus MEV would not apply as there isn't a single entity that handles block production or to determine transaction ordering.\n\n\n### So what does this mean for you?\n\n- If you're a **DeFi end user**, particularly a Uniswap trader, you might want to review your slippage tolerance settings. You just need to have a look through the various MEV discords to see that there's enough sandwich makers pointed at Uni to make a giant picnic. And their numbers are growing everyday. This would be mitigated if Uni V3 is released with protocol-specific MEV arrangements (not insider alpha, I don't know what's in Uni V3), then all you'll need to do is opt in.\n- \n- If you're a **solo miner** in a MEV-active mining pool, keep in mind they're technically not obligated to share their MEV revenue with you, so it's worth asking the question to get some transparency, as it's not easy for you to calculate this yourself.\n- \n- If you're a **mining pool** that's yet to get involved in MEV then check out the Flashbot's [miner onboarding page](https://github.com/flashbots/pm/blob/main/guides/miner-onboarding.md). Otherwise you're missing out on an emerging revenue stream.\n- \n- If you're an **independent developer** whose arb/liquidation bots have stopped yielding profit, then considering joining the [flashbots discord](https://discord.com/invite/3TjWjBerRb) and partnering up with other like-minded devs to build your own vertically integrated MEV strategies and challenge the cartel's hegemony.\n\n![Can someone build this at the next hackathon and open source it?](https://images.mirror-media.xyz/publication-images/2bc118ae-69a3-4fe0-ba23-f0d80b164a23.jpeg?height=175&width=800)\n\nIt's a scary forest out there, but align yourself with one of the three aforementioned MEV groups instead of going at it alone and you'll have a slightly less horrifying time.\n\n\n\nStay safe,\n\nfifikobayashi\n\n\n**ACK**: Thanks to @[epheph](https://twitter.com/epheph), @[onewayfunction](https://twitter.com/onewayfunction), @[tzhen ](https://twitter.com/tzhen)and the rest of the Flashbots crew for being my technical sounding board on all things MEV.", "timestamp": 1615808453, "digest": "QXdCOAggA5g_j5R_JpO-V5LqK89EbimnYIV6c2rOsT0", "contributor": "0xef03254aBC88C81Cb822b5E4DCDf22D55645bCe6"}
{"id": "tHoQHL7Kh_JHYZSmGx_pIqXh6vfHVgp0BCzjlWbKRmE", "title": "The enemy of your enemy is NOT your friend", "body": "![](https://images.mirror-media.xyz/publication-images/cd284a3d-d04f-4921-b47e-bd4f43d9cfd8.jpeg?height=218&width=350)\n\nUnbeknownst to the average DeFi user, battlelines are currently being drawn as we speak in the ever evolving realm of MEV (Miner-Extractable Value, or… Maximal-Extractable Value as the cool kids are calling it nowadays).\n\nAs the dust slowly settles from when FrankResearcher [first shared on-chain evidence](https://twitter.com/FrankResearcher/status/1311350156219101185) of explicit arbitrage MEV amongst miners last year, several new groups of participants have been scrambling to establish dominance.\n\nIn this article I explore (just the surface) of the various groups competing to extend their reach across MEV domains and their respective attributes.\n\n\n### The Battlelines\n\nThe new MEV participants have varying degrees of hashpower support from their own circle of MEV-friendly miners but they are broadly categorized into the following:\n\n**Group 1: Frontrunning / Backrunning Cartels** \n\nThese groups were operating long before MEV became the mainstream threat it is today, even dating back to the pre-Defi frontrunning Bancor days in early 2018. Therefore they already have the established infrastructure to easily evolve into monopolistic and horizontally integrated **MEV Searcher Cartels**. \n\nIn plain English, this means:\n\n- They require very little effort to migrate their existing bots onto MEV infrastructure. Since they already have optimized transaction re-ordering algorithms, they only need to build the on-chain miner-bribe logic (i.e. check frontrun/backrun outcome and only release bribe to miners via block.coinbase if prior TXs were successful, otherwise revert).\n- They have the resources to branch out (horizontally integrate) across other bespoke revenue seeking MEV strategies like sandwiching and liquidations. Remember, Sandwiching is essentially a frontrun and a backrun 'sandwiched' on either side of an innocent AMM user's trade, for which these groups are already highly optimized for. MEV-powered liquidations are essentially a rigged backrun (more detail below).\n- They have had more time to build working relationships with the larger mining pools. The larger the hashpower at their disposal, the quicker they win the PoW race against other MEV participants on competing ops. EIP1559 will be of annoyance to them since it would 'technically' diminish their competitive hash power advantage, but as [Stephane alluded to here](https://twitter.com/thegostep/status/1369988957770031104), their supporting mining pools do have the option to simply run a modified Geth if the miners are financially incentivized to do so via MEV profits.\n- Their sheer size will mean they may be slower to adapt to the emergence of new MEV strategies compared to others.\n\n**Group 2: DAO/Protocol-Based MEV Groups** \n\nAs seen with KeeperDAO's [Rook](https://medium.com/keeperdao/caro-kann-introducing-rook-liquidity-mining-arbitrage-mining-adbe319905fd), 1inch's [dark pools](https://twitter.com/1inchExchange/status/1334992381242961930), the miner-centric [ArcherDAO](https://www.archerdao.io/) and more recently the [YCabal proposal](https://forum.sushiswapclassic.org/t/proposal-ycabal-mev-strategy/3159) for SushiSwap, these groups leverage MEV strategies 'for the good of the DAO/Protocol'.\n\nIn plain English, this means:\n\n- They offer their users to opt in and route their transactions through a private relay network (a.k.a. dark pool) straight to mining pools and skip the dreaded mempool (think Samczsun and co's use of Sparkpool's Tai Chi network for that [famous whitehat rescue](https://samczsun.com/escaping-the-dark-forest/) last year).\n- However in addition to the private shielding mechanisms, the transactions themselves are analyzed for downstream MEV opportunities such as flow-on arbitrage, liquidation…etc generated as a result of these transactions and the revenue from these MEVs are atomically extracted within the same block and returned back to a pool controlled by the DAO/protocol.\n- This group's competitive advantage comes from the fact that they control their user's transactional flow, so by routing through private proxies they ensure only the DAO/protocol would have visibility and be in a position to atomically take advantage within the same block before anyone else.\n- Their ability to pivot for bespoke MEV strategies will be limited to how quickly they can get proposals endorsed through their governance process.\n- Then there's Chainlink's [Fair Sequencing Services](https://blog.chain.link/chainlink-fair-sequencing-services-enabling-a-provably-fair-defi-ecosystem/), which somewhat fits into this category, however they don't seem to be extracting anything from the MEV ops but may be incentivizing the payment of Link to sequencers to ensure transaction ordering fairness for anyone using their oracle network. The article on FSS is still light on technical details and they technically may not be able to ensure the entire block's ordering, but I'm keeping a close eye on what comes out of this.\n\n**Group 3: Decentralized MEVs Groups** \n\nThe likes of [Flashbots](https://github.com/flashbots/pm) which is democratizing access to MEV revenue by providing publicly accessible MEV infrastructure along with mining pool support for independent developers across the ecosystem.\n\n- Their role in this ecosystem can not be understated - if it were not for their recent emergence the large cartels would have established near-hegemony over any MEV opportunities that are not privately chaperoned via protocol-specific MEV relays.\n- The decentralized nature of their infrastructure has also  incubated a subcategory within this group - that of independent developers partnering up and forming vertically integrated groups that leverage the Flashbots infrastructure to focus on a particular MEV domain (i.e. 2–3 devs getting together to focus on arb, liquidation or frontrunning only). \n- When a new bespoke opportunity arises this category of MEV participants are likely to be the first to react and pivot given their size and nimbleness.\n- However, the same decentralized nature of Flashbots also allows certain elements of the first group to take advantage of their publicly accessible infrastructure.\n\n\n\n### So what have they been up to?\n\n![What's at stake as per https://explore.flashbots.net](https://images.mirror-media.xyz/publication-images/54836f88-4822-481d-9d98-aef637af4ab1.jpeg?height=114&width=800)\n\n**Mining Pool Participation**\n\nThe following mining pools are all currently competing for a piece of the MEV pie:\n\n- 2Miners\n- Minerall Pool \n- EzilPool\n- BeePool\n- UUPool\n- SpiderPool\n- CrazyPool\n- FlexPool \n\nPrivately mined transactions technically aren't considered MEV but they do complement MEV strategies so it's worth mentioning SparkPool and Ethermine as the main dark pool proponents (77% of all privately mined TXs are mined by Ethermine as quoted from this [research paper](https://arxiv.org/pdf/2101.05511.pdf)).\n\n**Value Extraction**\n\nBased on the Flashbots' [MEV explorer](https://explore.flashbots.net/) we are currently trending over $1.2M worth of MEV revenue extracted across the entire network per day and almost one Beeple NFT per month. Among this, you would have seen plenty of MEV alphas like zero gas flashloan-powered arbitrages, [sandwiches](https://twitter.com/FrankResearcher/status/1366795352330948610) and [NFT rescues](https://twitter.com/andrekorol1/status/1358252320207876104) on Twitter and Etherscan these days. Those are already considered mainstream by MEV standards.\n\n✌️***Value Extraction***✌️\n\nI vaguely touched on a few MEV dark alphas recently and there was interest in clarifying MEV liquidation strategies in detail.\n\nLiquidations, as you well know, is when a particular loan position falls below a protocol-specified threshold (Health Factor). At which point anyone can call the relevant liquidation function for that loan and claim the collateral at a heavy discount at the borrower's expense.\n\nWhich brings us to **Capital loss-generating** ✌️**Liquidation**✌️(a.k.a. Stale Toasting) via MEV. [Tokentax's general advice](https://tokentax.co/guides/defi-crypto-tax/#taxes-for-loans-interest-paid-collateral-liquidations) on liquidation states that any liquidation event will be:\n\n> \"…treated as if you had sold that crypto for fiat, meaning that you realize any capital gain or loss on those assets\"\n\nA shady tactic in this context revolves around purposely lowering the health factor of your position to trigger a liquidation, BUT you end up as the guaranteed liquidator of your own position to trigger a paper loss.\n\nThis is only possible via MEV as you're able to submit both the liquidation triggering Tx and a backrunning Tx within the same MEV bundle, which results in you being the first to liquidate yourself in the same block before any other liquidation bot even sees it. In layman's terms, MEV infrastructure allows you to specify logic that ensures the first Tx is mined ONLY IF the 2nd backrun Tx is successful, otherwise it's as if nothing happened, like a flash loan revert. Unlike a flashloan, you incur zero gas fees when it reverts. It's a cap loss on paper, but in reality you got your collateral back elsewhere. Would be interesting to see whether your local tax office is savvy enough to understand all this.\n\n**This is bananas...**\n\nThis is just the tip of the iceberg and there's a whole dark forest within the dark forest, where unscrupulous predators stalk other successful predators by decoding their transactions so they can keep stalking them even after they change contracts to evade detection, and that's before we even start talking about how MEV will look on L2, but that's an article for another time.\n\n![\"who will sandwich the sandwichers?\" …  J. Delong](https://images.mirror-media.xyz/publication-images/c76ddac8-556b-4a86-acb2-e46f17b6ae32.jpeg?height=198&width=365)\n\n\n\n### What about other chains?\n\n\n**BSC**\n\nThis question has come up a few times because since Binance Smart Chain is a modified fork of Ethereum, shouldn't they face the same threats?\n\n![](https://images.mirror-media.xyz/publication-images/95e312f6-8de5-4c8e-9e98-143b8170dc42.jpeg?height=450&width=800)\n\nThe simple answer is no, it is unlikely any one of the established BSC validators would try to develop self serving MEV arrangements and risk the wrath of CZ. It'd only be a short term gain with long term pain (blacklisting). If they do, I guess you could call it CEV (CZ-approved Exploitable Value), which is unlikely to happen.\n\n**AVAX**\n\nI believe AVAX's consensus model is leaderless, thus theoretically speaking the MEV as we know it in Ethereum would not apply as there isn't a single entity that handles block production or to determine transaction ordering. I say 'theoretically' because whatever consensus mechanism is used in their leaderless model may be gamed to produce a variant of the MEV as we currently know. Similar to the current lack of visibility into L2 MEV dynamics in Ethereum, we won't know for sure until we actually get there. \n\n\n### So what does this mean for you?\n\n- If you're a **DeFi end user**, particularly a Uniswap trader, you might want to review your slippage tolerance settings. You just need to have a look through the various MEV discords to see that there's enough sandwich makers pointed at Uni to make a giant picnic. And their numbers are growing everyday. This would be mitigated if Uni V3 is released with protocol-specific MEV arrangements (not insider alpha, I don't know what's in Uni V3), then all you'll need to do is opt in.\n- \n- If you're a **solo miner** in a MEV-active mining pool, keep in mind they're technically not obligated to share their MEV revenue with you, so it's worth asking the question to get some transparency, as it's not easy for you to calculate this yourself.\n- \n- If you're a **mining pool** that's yet to get involved in MEV then check out the Flashbot's [miner onboarding page](https://github.com/flashbots/pm/blob/main/guides/miner-onboarding.md). Otherwise you're missing out on an emerging revenue stream.\n- \n- If you're an **independent developer** whose arb/liquidation bots have stopped yielding profit, then considering joining the [flashbots discord](https://discord.com/invite/3TjWjBerRb) and partnering up with other like-minded devs to build your own vertically integrated MEV strategies and challenge the cartel's hegemony.\n\n![Can someone build this at the next hackathon and open source it?](https://images.mirror-media.xyz/publication-images/2bc118ae-69a3-4fe0-ba23-f0d80b164a23.jpeg?height=175&width=800)\n\nIt's a scary forest out there, but align yourself with one of the three aforementioned MEV groups instead of going at it alone and you'll have a slightly less horrifying time.\n\n\n\nStay safe,\n\nfifikobayashi\n\n\n**ACK**: Thanks to @[epheph](https://twitter.com/epheph), @[onewayfunction](https://twitter.com/onewayfunction), @[tzhen ](https://twitter.com/tzhen)and the rest of the Flashbots crew for being my technical sounding board on all things MEV.", "timestamp": 1615809366, "digest": "QXdCOAggA5g_j5R_JpO-V5LqK89EbimnYIV6c2rOsT0", "contributor": "0xef03254aBC88C81Cb822b5E4DCDf22D55645bCe6"}
{"id": "X7WGc154r9Lm-nmDdPouCN8bggkTyHpaDDK44BQm_fY", "title": "The enemy of your enemy is NOT your friend", "body": "![](https://images.mirror-media.xyz/publication-images/cd284a3d-d04f-4921-b47e-bd4f43d9cfd8.jpeg?height=218&width=350)\n\nUnbeknownst to the average DeFi user, battlelines are currently being drawn as we speak in the ever evolving realm of MEV (Miner-Extractable Value, or… Maximal-Extractable Value as the cool kids are calling it nowadays).\n\nAs the dust slowly settles from when FrankResearcher [first shared on-chain evidence](https://twitter.com/FrankResearcher/status/1311350156219101185) of explicit arbitrage MEV amongst miners last year, several new groups of participants have been scrambling to establish dominance.\n\nIn this article I explore (just the surface) of the various groups competing to extend their reach across MEV domains and their respective attributes.\n\n\n### The Battlelines\n\nThe new MEV participants have varying degrees of hashpower support from their own circle of MEV-friendly miners but they are broadly categorized into the following:\n\n**Group 1: Frontrunning / Backrunning Cartels** \n\nThese groups were operating long before MEV became the mainstream threat it is today, even dating back to the pre-Defi frontrunning Bancor days in early 2018. Therefore they already have the established infrastructure to easily evolve into monopolistic and horizontally integrated **MEV Searcher Cartels**. \n\nIn plain English, this means:\n\n- They require very little effort to migrate their existing bots onto MEV infrastructure. Since they already have optimized transaction re-ordering algorithms, they only need to build the on-chain miner-bribe logic (i.e. check frontrun/backrun outcome and only release bribe to miners via block.coinbase if prior TXs were successful, otherwise revert).\n- They have the resources to branch out (horizontally integrate) across other bespoke revenue seeking MEV strategies like sandwiching and liquidations. Remember, Sandwiching is essentially a frontrun and a backrun 'sandwiched' on either side of an innocent AMM user's trade, for which these groups are already highly optimized for. MEV-powered liquidations are essentially a rigged backrun (more detail below).\n- They have had more time to build working relationships with the larger mining pools. The larger the hashpower at their disposal, the quicker they win the PoW race against other MEV participants on competing ops. EIP1559 will be of annoyance to them since it would 'technically' diminish their competitive hash power advantage, but as [Stephane alluded to here](https://twitter.com/thegostep/status/1369988957770031104), their supporting mining pools do have the option to simply run a modified Geth if the miners are financially incentivized to do so via MEV profits.\n- Their sheer size will mean they may be slower to adapt to the emergence of new MEV strategies compared to others.\n\n**Group 2: DAO/Protocol-Based MEV Groups** \n\nAs seen with KeeperDAO's [Rook](https://medium.com/keeperdao/caro-kann-introducing-rook-liquidity-mining-arbitrage-mining-adbe319905fd), 1inch's [dark pools](https://twitter.com/1inchExchange/status/1334992381242961930), the miner-centric [ArcherDAO](https://www.archerdao.io/) and more recently the [YCabal proposal](https://forum.sushiswapclassic.org/t/proposal-ycabal-mev-strategy/3159) for SushiSwap, these groups leverage MEV strategies 'for the good of the DAO/Protocol'.\n\nIn plain English, this means:\n\n- They offer their users to opt in and route their transactions through a private relay network (a.k.a. dark pool) straight to mining pools and skip the dreaded mempool (think Samczsun and co's use of Sparkpool's Tai Chi network for that [famous whitehat rescue](https://samczsun.com/escaping-the-dark-forest/) last year).\n- However in addition to the private shielding mechanisms, the transactions themselves are analyzed for downstream MEV opportunities such as flow-on arbitrage, liquidation…etc generated as a result of these transactions and the revenue from these MEVs are atomically extracted within the same block and returned back to a pool controlled by the DAO/protocol.\n- This group's competitive advantage comes from the fact that they control their user's transactional flow, so by routing through private proxies they ensure only the DAO/protocol would have visibility and be in a position to atomically take advantage within the same block before anyone else.\n- Their ability to pivot for bespoke MEV strategies will be limited to how quickly they can get proposals endorsed through their governance process.\n- Then there's Chainlink's [Fair Sequencing Services](https://blog.chain.link/chainlink-fair-sequencing-services-enabling-a-provably-fair-defi-ecosystem/), which somewhat fits into this category, however they don't seem to be extracting anything from the MEV ops but may be incentivizing the payment of Link to sequencers to ensure transaction ordering fairness for anyone using their oracle network. The article on FSS is still light on technical details and they technically may not be able to ensure the entire block's ordering, but I'm keeping a close eye on what comes out of this.\n\n**Group 3: Decentralized MEVs Groups** \n\nThe likes of [Flashbots](https://github.com/flashbots/pm) which is democratizing access to MEV revenue by providing publicly accessible MEV infrastructure along with mining pool support for independent developers across the ecosystem.\n\n- Their role in this ecosystem can not be understated - if it were not for their recent emergence the large cartels would have established near-hegemony over any MEV opportunities that are not privately chaperoned via protocol-specific MEV relays.\n- The decentralized nature of their infrastructure has also  incubated a subcategory within this group - that of independent developers partnering up and forming vertically integrated groups that leverage the Flashbots infrastructure to focus on a particular MEV domain (i.e. 2–3 devs getting together to focus on arb, liquidation or frontrunning only). \n- When a new bespoke opportunity arises this category of MEV participants are likely to be the first to react and pivot given their size and nimbleness.\n- However, the same decentralized nature of Flashbots also allows certain elements of the first group to take advantage of their publicly accessible infrastructure.\n\n\n\n### So what have they been up to?\n\n![What's at stake as per https://explore.flashbots.net](https://images.mirror-media.xyz/publication-images/54836f88-4822-481d-9d98-aef637af4ab1.jpeg?height=114&width=800)\n\n**Mining Pool Participation**\n\nThe following mining pools are all currently competing for a piece of the MEV pie:\n\n- 2Miners\n- Minerall Pool \n- EzilPool\n- BeePool\n- UUPool\n- SpiderPool\n- CrazyPool\n- FlexPool \n\nPrivately mined transactions technically aren't considered MEV but they do complement MEV strategies so it's worth mentioning SparkPool and Ethermine as the main dark pool proponents (77% of all privately mined TXs are mined by Ethermine as quoted from this [research paper](https://arxiv.org/pdf/2101.05511.pdf)).\n\n**Value Extraction**\n\nBased on the Flashbots' [MEV explorer](https://explore.flashbots.net/) we are currently trending over $1.2M worth of MEV revenue extracted across the entire network per day and almost one Beeple NFT per month. Among this, you would have seen plenty of MEV alphas like zero gas flashloan-powered arbitrages, [sandwiches](https://twitter.com/FrankResearcher/status/1366795352330948610) and [NFT rescues](https://twitter.com/andrekorol1/status/1358252320207876104) on Twitter and Etherscan these days. Those are already considered mainstream by MEV standards.\n\n✌️***Value Extraction***✌️\n\nI vaguely touched on a few MEV dark alphas recently and there was interest in clarifying MEV liquidation strategies in detail.\n\nLiquidations, as you well know, is when a particular loan position falls below a protocol-specified threshold (Health Factor). At which point anyone can call the relevant liquidation function for that loan and claim the collateral at a heavy discount at the borrower's expense.\n\nWhich brings us to **Capital loss-generating** ✌️**Liquidation**✌️(a.k.a. Stale Toasting) via MEV. [Tokentax's general advice](https://tokentax.co/guides/defi-crypto-tax/#taxes-for-loans-interest-paid-collateral-liquidations) on liquidation states that any liquidation event will be:\n\n> \"…treated as if you had sold that crypto for fiat, meaning that you realize any capital gain or loss on those assets\"\n\nA shady tactic in this context revolves around purposely lowering the health factor of your position to trigger a liquidation, BUT you end up as the guaranteed liquidator of your own position to trigger a paper loss.\n\nThis is only possible via MEV as you're able to submit both the liquidation triggering Tx and a backrunning Tx within the same MEV bundle, which results in you being the first to liquidate yourself in the same block before any other liquidation bot even sees it. In layman's terms, MEV infrastructure allows you to specify logic that ensures the first Tx is mined ONLY IF the 2nd backrun Tx is successful, otherwise it's as if nothing happened, like a flash loan revert. Unlike a flashloan, you incur zero gas fees when it reverts. It's a cap loss on paper, but in reality you got your collateral back elsewhere. Would be interesting to see whether your local tax office is savvy enough to understand all this.\n\n**This is bananas...**\n\nThis is just the tip of the iceberg and there's a whole dark forest within the dark forest, where unscrupulous predators stalk other successful predators by decoding their transactions so they can keep stalking them even after they change contracts to evade detection, and that's before we even start talking about how MEV will look on L2, but that's an article for another time.\n\n![\"who will sandwich the sandwichers?\" …  J. Delong](https://images.mirror-media.xyz/publication-images/c76ddac8-556b-4a86-acb2-e46f17b6ae32.jpeg?height=198&width=365)\n\n\n\n### What about other chains?\n\n\n**BSC**\n\nThis question has come up a few times because since Binance Smart Chain is a modified fork of Ethereum, shouldn't they face the same threats?\n\n![](https://images.mirror-media.xyz/publication-images/95e312f6-8de5-4c8e-9e98-143b8170dc42.jpeg?height=450&width=800)\n\nThe simple answer is no, it is unlikely any one of the established BSC validators would try to develop self serving MEV arrangements and risk the wrath of CZ. It'd only be a short term gain with long term pain (blacklisting). If they do, I guess you could call it CEV (CZ-approved Exploitable Value), which is unlikely to happen.\n\n**AVAX**\n\nI believe AVAX's consensus model is leaderless, thus theoretically speaking the MEV as we know it in Ethereum would not apply as there isn't a single entity that handles block production or to determine transaction ordering. I say 'theoretically' because whatever consensus mechanism is used in their leaderless model may be gamed to produce a variant of the MEV as we currently know. Similar to the current lack of visibility into L2 MEV dynamics in Ethereum, we won't know for sure until we actually get there. Nevertheless I'm keeping an eye on these folks' progress too (I'm running out of eyes).\n\n\n### So what does this mean for you?\n\n- If you're a **DeFi end user**, particularly a Uniswap trader, you might want to review your slippage tolerance settings. You just need to have a look through the various MEV discords to see that there's enough sandwich makers pointed at Uni to make a giant picnic. And their numbers are growing everyday. This would be mitigated if Uni V3 is released with protocol-specific MEV arrangements (not insider alpha, I don't know what's in Uni V3), then all you'll need to do is opt in.\n- \n- If you're a **solo miner** in a MEV-active mining pool, keep in mind they're technically not obligated to share their MEV revenue with you, so it's worth asking the question to get some transparency, as it's not easy for you to calculate this yourself.\n- \n- If you're a **mining pool** that's yet to get involved in MEV then check out the Flashbot's [miner onboarding page](https://github.com/flashbots/pm/blob/main/guides/miner-onboarding.md). Otherwise you're missing out on an emerging revenue stream.\n- \n- If you're an **independent developer** whose arb/liquidation bots have stopped yielding profit, then considering joining the [flashbots discord](https://discord.com/invite/3TjWjBerRb) and partnering up with other like-minded devs to build your own vertically integrated MEV strategies and challenge the cartel's hegemony.\n\n![Can someone build this at the next hackathon and open source it?](https://images.mirror-media.xyz/publication-images/2bc118ae-69a3-4fe0-ba23-f0d80b164a23.jpeg?height=175&width=800)\n\nIt's a scary forest out there, but align yourself with one of the three aforementioned MEV groups instead of going at it alone and you'll have a slightly less horrifying time.\n\n\n\nStay safe,\n\nfifikobayashi\n\n\n**ACK**: Thanks to @[epheph](https://twitter.com/epheph), @[onewayfunction](https://twitter.com/onewayfunction), @[tzhen ](https://twitter.com/tzhen)and the rest of the Flashbots crew for being my technical sounding board on all things MEV.", "timestamp": 1615810448, "digest": "QXdCOAggA5g_j5R_JpO-V5LqK89EbimnYIV6c2rOsT0", "contributor": "0xef03254aBC88C81Cb822b5E4DCDf22D55645bCe6"}
{"id": "huavd222nfh8-GScTIKDlDn-J2dnFtShxW7xxt98ZVQ", "title": "Fund my stuff", "body": "[Paradigm](crowdfund://0x4C78a5AeF0e86c0BeEE6B6392c42104A7e195A44?network=rinkeby)", "timestamp": 1615823664, "digest": "CT17ZcjyB5v1f4OhbsfKtiX_3vMadK_LUdTbPyjFa8k", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
{"id": "G7NjXE3s2gHg3yZAwBgBD956MEmOkTXNomBEdbEiQGA", "title": "A16z crowdfund", "body": "Chris is writing a post on NFTs\n\n[A16z](crowdfund://0x7F4B4f6ef1DAd02520f4A11d7FfD7ca196b6cD28?network=rinkeby)", "timestamp": 1615831101, "digest": "5rB4v7w7_ksauzvki_f8HI03mpAljaa4VQ52QsN0C8I", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
{"id": "IOdHqdT3wscUUdPc4kvwclXcG-8D06_B5bv3t8_gJys", "title": "Paradigm crowdfund", "body": "Fred's writing a post on NFTs. We're raising 10 ETH.\n\n[Paradigm Crowdfund](crowdfund://0xCDb438Edb9883B3c3C2Aa2FE8015772841E03F0D?network=rinkeby)", "timestamp": 1615853345, "digest": "dX9XmFhz6pSNff_GRZiK-rKEcBTxqiZSDzKXM_qyuw8", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
