{"id": "1qgBeqAyHNaiaSXLLOIgDlFkvWoHXcqw7zWxMwtEo_A", "title": "Funding Friday: PartyBid", "body": "[PartyBid](https://www.partybid.app/) is a fun way to collect NFTs with others.\n\n[Here are some live parties](https://www.partybid.app/parties) you can join and bid with others:\n\n![](https://avc.com/content/uploads/2021/08/Screen-Shot-2021-08-06-at-6.52.48-AM-1-2048x1959.png)\n\nFunding Friday has always been about the idea that others might want to fund things that I am funding. Party Bid takes that idea a step further and makes funding things more social and fun. That’s a really neat idea.\n", "timestamp": 1628247467, "digest": "hOl7si7DCzywHb_qB9BliZ6Iv0hgnKZA9KGCSQWcwhk", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "q73WX_pbIy-vCRNQqbxkY60wJsvpzRw5BdKTQl6WYfo", "title": "CRYPTOPILLED", "body": "## *How I went from knowing next to nothing about crypto to having a full-time job in web3, in under 6 months*\n\nAt the beginning of this year I knew next to nothing about the world of web3 or crypto. Six months later, I quit my job to take a full-time position in the industry.\n\nWhat happened? \n\nThis is the story of some of the major moments within that half-year and the lessons I learned along the way.\n\nIn January of 2021 I felt dissatisfied with the web. I had been feeling this way for years. Don’t get me wrong, there’s a lot that I love about the internet and the communities that it creates. I would have had a *very* different pandemic lockdown experience without spaces like Twitter and the ability to connect with friends and family online.\n\nAnd yet! \n\nSomewhere along the way, the web began to feel stagnant. All technology grows in fits and starts, but it felt like our period of relative dullness had been going on for far too long. \n\nThen, just like that, everything changed.\n\nIn February of 2021 I started hearing rumblings about NFTs. People were saying that these ‘non-fungible tokens’ were a new way for artists to create work online while providing both provenance and patronage. Some of the most interesting people on my Twitter timeline began posting about their upcoming projects. My Clubhouse homepage shifted from conversations about influencers to conversations about cryptocurrency and ‘minting’ NFTs. I watched as internet friends began to sell the work they had created for amounts of money that seemed unfathomable. Thousands of dollars in profits, for digital art? What was happening?\n\nI'm a long-time believer that we need to bring value back to art, but that's definitely not what happened in web 2.0. In an internet where attention seems fleeting and follower counts matter more than anything else, profits have been squeezed out and we've reduced 'art' down to 'content'. \n\nBut the NFTs I saw being sold didn't look like 'content'. They looked like real art being taken seriously by a real community.\n\nI decided to dive in.\n\n### GETTING STARTED IN THE WORLD OF WEB3 - HOW TO SET UP A WALLET AND BUY ETH\n\nTo participate in web3, the first thing you have to do is set up a wallet. Two of the best and most used wallets are [Rainbow](https://rainbow.me/) and [MetaMask](https://metamask.io/), the former of which lives natively as an iOS app and the latter as a Chrome extension. I initially went with MetaMask and immediately recognized the striking difference from a traditional username and password. MetaMask gave me a ‘seed phrase’, a string of 12 words that I absolutely could *not* share or forget. It felt scary but also enticing; this high-stakes web intimidated me *because* of its potential. Most people aren’t that concerned with having their email or social platforms hacked. Why would they be when the worst case scenario is typically a spammy post about buying fake Raybans posted on their profile? You can change your password, delete the post, and forget it ever happened. In the web3 world, getting hacked has real ramifications. How exciting, the idea of a web that actually has the power to change your life, and a secret phrase that actually needs protecting!\n\nI purchased some Ethereum, the digital currency that NFTs run on, and added it to my wallet. A jarring in in seeing how ‘little’ trading your dollars for crypto gets you. Converting $500 and receiving a fraction of a whole number (.2 ETH at the time of this writing) can be hard to understand. Another part of the transaction that’s challenging to newcomers: Recognizing that making any move has a cost. Because everything is hosted 'on-chain' there's a transaction price (called a 'gas fee') attached to anything you might want to do. \n\nWant to buy ETH? Pay gas.\n\nWant to create an NFT? Pay gas. \n\nWant to bid on an NFT? Pay gas. \n\nWant to transfer your ETH back to USD? Pay gas.\n\nJust like gasoline, these fees fluctuate in price based on demand. In the early days these transactions were pennies. But with the popularity of web3 on the rise, they're often now in the $20 range. At the height of the NFT craze, they were in the $100s. Even though the transaction fees can be painful, they’re a vital part of the ecosystem. Not only do they prevent the type of spammy behavior that gets us fake Ray-Ban ads on Instagram, they also add a layer of security as thousands of computers all compete to process transactions accurately and include them in the blockchain ledger.\n\nWith ETH in my wallet, I began the process of creating my first NFT. \n\n### MINTING YOUR FIRST NFT - HOW IT WORKS AND UNDERSTANDING THE PLATFORMS\n\nOne of the first steps any prospective NFT creator has to make is determining which platform it will live on. When I first started, there were a few options open to me: [Foundation](https://foundation.app/), [Zora](https://zora.co/), and [OpenSea](https://opensea.io/). The former two were both invite-only, and I didn’t want to scoop up a precious invite from a friend only to realize that it wasn't for me. OpenSea (as the name might suggest) requires no invite and is open to all. They were also doing something that intrigued me that they called ‘gasless minting’. \n\nPublishing an NFT is called ‘minting’, and as I mentioned earlier, almost every move within the web3 world requires gas. On OpenSea your *first* NFT requires gas, but after that you can make as many as you want without paying that upfront fee. Instead, gas is collected later upon purchase by a collector.\n\nThinking about what type of art I wanted to create, this immediately appealed to me, as I didn't have a singular key piece of work that I wanted to upload. I intended to publish a collection that felt like it would fit nicely within the space. Years ago I had taken a series of photographs of cups of espresso, before and after drinking. The photos had always delighted me but they felt weird online — who actually wanted to see espresso cups on Instagram? \n\nI minted a set of 6 photos and listed them for .1 ETH each (at the time, about $150). Then I went to bed.\n\nhttps://twitter.com/drewcoffman/status/1364097164452892674?s=20\n\nI woke up, opened my computer, and realized that one had already sold. Over the next two days I watched as people snatched up my coffee photos, some of them new Twitter friends, others complete strangers or anonymous. \n\nI had been taking photos for 15 years and no one had ever bought my work. Now, I had sold half a dozen and made $1,000, all by pressing buttons on an online marketplace.\n\nI instantly began thinking about the next project I wanted to mint. I had been working on a video project months prior and abandoned it because I didn't know where it would belong. A short-form music video set to a friend’s music, it didn't fit on my YouTube channel and felt like way too much work to just post on Twitter or Instagram. Could this exist as an NFT? Maybe! I re-assessed the footage and, with my friend's blessing, finished the project over a weekend and minted it, this time to Foundation.\n\n[NFT](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/927)\n\nAnd…it didn't sell!\n\nTo this day, the NFT remains available on Foundation, unsold. And that's okay! **Part of the beauty of the world of NFTs is that the art you create should be just as valuable in your own wallet as it is in someone else's. **Further, because of the nature of the blockchain, this art is *permanent***. If you believe in the world of web3, there's value in letting your work exist on-chain for years to come, whether it sells or not. My NFT lives on the blockchain, future-proofed in a way that anything I host on a centralized platform like Instagram will simply never be.\n\n### FINDING COMMUNITY\n\nFully committed to web3 at this point, I began doing everything I could to find other people within the community. I set up my [ENS domain](https://ens.domains/) and changed my Twitter name to drewcoffman.eth. I followed web3 people on Twitter and joined web3 conversations on Clubhouse. Through a combination of both, I became connected to a group called [Tech0ptimist](https://techoptimist.xyz/) who had [just minted an NFT on Foundation](https://foundation.app/@optimist/cabbage-01-453). As the auction countdown ended, they created a Clubhouse room to cheer the sale and affirm the entire NFT ecosystem. Through the conversation I learned about a mysterious art collector and anonymous Twitter egg named [Aito](https://twitter.com/thisisaito) who was building a serious collection of NFTs. We celebrated Aito on Twitter and Clubhouse. As we joked about him being a 'patron saint' I created an NFT using a photo of a church statue I had taken and swapped out the face, replacing it with an egg. I minted it, posted it to Twitter, and in minutes watched as the NFT disappeared from my wallet — bought by Aito himself.\n\nhttps://twitter.com/drewcoffman/status/1365840718867046400?s=20\n\n[Vision of Aito](https://opensea.io/assets/0x495f947276749ce646f68ac8c248420045cb7b5e/90294439017461790840607179782906946497870244260757743588084955982996617297921) was the first piece of egg-based art to commemorate the patron, and a deluge quickly flooded the marketplaces as artists fought for Aito's attention. Like any art space, the world of NFTs responded to what works, with artists building off each other as they learned what fits. I experienced this myself as I played around with an idea for my next NFT and saw someone else in the community making something that I loved. An artist named [Kate the Cursed](https://twitter.com/katecursed) used a CRT television and a modded SNES to create [glitched-out Mario Paint masterpieces](https://foundation.app/@kate-the-cursed/gamma-ray-graffiti-7694). They were incredible, and seeing someone else make CRT-based art was all the affirmation I needed to go out and make my own. \n\nI once again collaborated with my musician friend and worked for 48 hours to create an NFT I called ‘[◇ 𖥂 ◇ // modular patch](https://foundation.app/@drewcoffman/modular-patch-10266)’, a vaguely ominous looping video of kaleidoscopic visuals set to a synth score, all playing out within a CRT television screen. I felt *extremely* proud of it, not only because I loved what I made but because it felt web3 native. Where in the world of web 2.0 could something like this possibly thrive? Vine existed as a brief paradise for this type of work, but quickly sunsetted and never let the artists actually profit from what they created. To post a looping video on a social platform like Instagram or Twitter just felt underwhelming, and to put it on your own personal site typically meant that it would languish, unseen by all. NFTs were doing something beyond offering a path forward for artists: They were offering a path forward for *art*.\n\n[NFT](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/10266)\n\nTo my surprise (especially since the last NFT I had made never sold), my piece received a bid almost immediately (from internet friend [Jstn](https://twitter.com/jstn) — thanks Jstn!!) and then before it could sell, received another bid. Then another. And another. And another. \n\nJust like my espresso photos were the first time I had ever sold art for profit, this was the first time I had ever seen people fight over something I made. It felt overwhelming to know that my work resonated with others.\n\nThe NFT sold for .8 ETH, a number that would have felt impossible hours before. Instead of cashing out, I used my newfound ETH within the web3 space. I bought an NFT from an avatar project that I loved. I bought another from an artist that seemed up and coming. That instantly proved to be the case, as I sold the same piece a single day later for four times as much as I paid for it. \n\nAnd in one of my best moves, I bought into FWB, a token-gated community.\n\n### GETTING INVOLVED - SOCIAL TOKENS, DAOs, AND GOVERNANCE\n\n[FWB](https://www.fwb.help/) (Friends with Benefits) is a community that you can only access if you’re holding a certain amount of their token in your wallet. Once you hold that amount and apply to join, you get access to the Discord and the insights of the people within. \n\nThat's it! Mostly. Since I joined, FWB has created new initiatives to add more value for owners. They’ve held in-person parties, created city guides, and now send out a weekly TL;DR newsletter to catch people up on the most important news in and around web3. \n\nAt the time of joining, it cost me approximately $500 to enter (and at the time of this writing, entry is valued at around $1,750) which is an incredible price to pay to enter a chatroom — but web3 solves this in a way that web 2.0 never could. I’ve always been wary of gated courses, cohorts, and communities that tell you that by paying a certain amount of money you'll gain access to knowledge and people in a way that you otherwise couldn’t. These, in my experience, almost always disappoint.\n\nThey look enticing from the outside, but once you're in you realize that it's just a structured version of what you could have learned on your own — and of course, there's no refunds. In web3, if you join a token-gated community like FWB and realize that it isn't for you, you can *just sell the coins back and walk away*. This means that a community can't rely on shady tactics and an enticing outer wall to get you to join. It actually has to be good!\n\nFWB, it turns out, was *very, very good*. Accustomed to the cryptobro and wallstreetbets types of communities that often pop up in these spaces, I worried that this group might prove to be toxic at worst and unintentionally exclusionary at best. Instead, I found a friendly, extremely welcoming, diverse, and inclusive crowd. And the channels listed in the Discord weren't just about NFTs and crypto, there were lifestyle channels that included thoughtful conversations about not only music and books but more surprising topics like food and skincare! The people in FWB were truly *friends with benefits*, they had insights and understanding about each of these spaces that I began to pore over, learning not just about the web3 world but the *world as a whole* in ways that I’m very thankful for. And to top it all off, there were geolocated channels, with one of the most active centered in LA. That’s where I am!\n\nSoon after I joined some people from the group began planning one of their initial IRL meetups post-COVID. I went, meeting web3 people in person. FWB felt like the first opportunity that I had to really get *involved* at a community level with something that interested me. And they were still figuring out what they wanted to become in ways that made making meaningful contributions possible. Many web3 organizations and communities have ‘governance’ which allows for decision-making to be decentralized and democratized. Instead of a single person at the top of the food chain making all of the decisions (for better or worse), decisions can be brought to vote. In communities like FWB, if you hold the token, you get to vote. Easy! The challenge (as in IRL situations) lies in *getting people to actually vote*, as most simply don’t bother.\n\nSo, FWB set up a governance committee responsible for ensuring that, among other things, proposals were being understood and seen by members. I quickly began to see more and more governance opportunities and communities pop up. Many of these call themselves DAOs, ‘Decentralized Autonomous Organizations’, a web3 equivalent of an LLC that can take collective action quickly. Some of these, like [PleasrDAO](https://pleasr.org/), focus on purchasing important NFTs. Others, like [Aave Grants](https://twitter.com/aavegrants?lang=en), push an organization’s purpose forward and democratize its future. Others, like [CityDAO](https://city.mirror.xyz/mZOpFWkTi0M2lVE1PsT1e2sJwdUT4PdgetHw_S4hS5A) organize to buy land in the real world.\n\nFWB posted an application form for members to join their governance committee. I clicked it, and then…closed the tab. I’d never been on a governance committee in my life. What could I possibly contribute? Then I realized that being interested in governance and not knowing how to contribute made me the *ideal* candidate for a committee dedicated to moving members from ‘interested’ to ‘activated’. I applied. A few days later, my application got accepted.\n\nOn the governance committee I began helping run monthly FWB Town Halls and set the agenda. I also kept tabs on the dedicated Governance channel and answered any questions people had, making sure that feedback (especially the negative stuff) got seen by staff so that they could course-correct and ensure that people were being heard. As in much of life, certain decisions which were making people grumpy weren't coming from a place of malice, but messiness. So much was so new *so fast* that things were slipping through the cracks. The governance committee helped fix this, leading to a more positive and engaged community overall.\n\nThe governance committee came with a stipend, making it my first paid role in web3 — and they paid in *crypto*, not US dollars. This change fascinated me. Up until this point everything I had done had been funded by that initial deposit in my wallet from USD and the sales from my subsequent NFTs.\n\nNow, after being paid for my art, I was being paid for my participation. \n\n### GOING FULL-TIME\n\nAs the months flew by, I became more and more invested. I met [Justin Boreta](https://twitter.com/boreta) and worked to release [The Song That Owns Itself](https://stoi.org/) (STOI for short), an experiment in ownership where social tokens were given away,  representing ownership in the song itself. I learned about [CabinDAO](https://creators.mirror.xyz/20Eyc57rknNJYL9vJa11zvupU_MXP7NZJUADTzTlCjQ), which crowdfunded resources to create artist residencies, offering up physical space on 30 acres of Texas countryside. As I spent more and more time thinking about web3, I realized how much I wanted to spend *all* of my time thinking about web3. Up to this point, I had been working a full-time job as a Community Manager for a web 2.0 company. Though I loved that work, it became obvious that I felt passionate about pushing this new technology forward. \n\nAn internet friend, [Jackson Dame](https://twitter.com/jacksondame), had just quit their job and taken a role at Rainbow.  I sent them a DM saying that I was interested in doing the same thing. They told me they’d keep an eye out for openings, and to my surprise I began hearing from *many* companies with *many* openings. I realized that a background in Community and Marketing was a major strength in this industry. Tons of projects had momentum behind them and developers were in desperate need of people who could take the reins of these burgeoning audiences. \n\nI interviewed with half-a-dozen web3 organizations until I found one that felt both like a perfect fit and a beautiful closed loop: I joined Aito’s team to work on building out his vision for web3.\n\nSix months ago, I never would have imagined that my life would look so different, centered on a world that I knew nothing about. I couldn’t be happier. Reflecting back, one of the main characteristics of web3 that made me dive in so quickly was its deep value for community. Though the crypto world is unfortunately equated in some people’s minds with get-rich-quick schemes, that simply hasn’t been my experience at all. Instead I’ve found a community of creators who want to push art forward and build a better internet that harkens back to the internet's best days. I think that my desire to be a part of that community is a big part of what made my journey successful. I wasn't focused on selling as many NFTs as possible or networking for networking’s sake; I was investing myself into a community of builders, and now I’m excited to be building right alongside them. \n\nEvery day I wake up looking forward to being a part of the future of web3.\n\nHere's to the next six months.", "timestamp": 1628260853, "digest": "MxT4-NbCJrtSFgGDse-GKP7xW9x_OKyEAeXvLDdJ3lQ", "contributor": "0xc7A0D765C3aF6E2710bA05A56c5E2cA190C2E11e"}
{"id": "Qi93DChIlIqL9E9VeYmCwJTZXtHrrsxt5HLlyBTM8VQ", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628267807, "digest": "R4re4XekWBHg6Mi9Gy7o2wzzkcAaG5Kvzuq3RK20fOU", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "YH8WYLDbnBjsnvEBMO4grb9B6w8zHVfwtBcUYjPBxXE", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628268267, "digest": "eY2FtPg9GxulbUB3wwmcdhdSc0tVgF4ugyIS9lLgauc", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "kzJOfelxWr-ruCpQDYZFQZkpUkIe9N2jms_u5i2FVp8", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628268428, "digest": "4hWxFEDpvGBzL5F2IrDmBFm9XzytDhscErsoVlbid04", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "Kp9q-HfmEagwUNKfYulQRtcRmgVzDtortcCK4_tJnlg", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628268644, "digest": "RLKTcBhCBOGVG0AcJ_AACbGoRaQqWb7UqfrLqTJBl6s", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "9blyjbqFZksIE_mWQV-jVXni8jmHQvxM1liF6jgb_00", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628268924, "digest": "oZTa5S2cJ5Pw352AOb9EJljDMhxXgZ7OKzKBYDGa37Y", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "1V_rowZd-c1DBK5euZfG82zLUP6MeJ830diR_gUzt84", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628269341, "digest": "6SIhwtjjRJUlJFx4EcGFTv7rOQIvFHBowkw6j5YUye4", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "FIpL0t2PTqXKCDe4J4l08nZ269N3J82CLTXsQtS_d9U", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628269432, "digest": "BKGj4iIVq1gaOiNWqPdFFRO7fwsagkqIEnV9x7AGj54", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "8rJ95r0pjcDpn9DD68ATL4WfTTV-WDpAalPRhcawyT0", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628269997, "digest": "Qnayh9xnCsk-sOmXZXSB30ImSN6jEvAEORPOKdql00s", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "J3MwGsazPNnsAq3g3OSgLF9GVuxLsPryA_mSlg2e02w", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628268167, "digest": "FuEKLNqN74Afq7wchYrH_Nkp9cD23U2B9T7S8IR1-XY", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "AouborQ700L899YCWzf9SxC-T3UDbQgvDB_3ZzQMJv0", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628267942, "digest": "wlbXjIIGT4yOi8mkVE82jYgw7zsBqSbk9II8aV5blFI", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "D18gybWqo2al-0vU6Kk8F9_5mmnpt7zIqp-WSTc-H4E", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628271981, "digest": "rnAAdoQ_4tJLoueT2tD5jAwZrezcUQGxvmATyJ3kqzM", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "am3d6uffSJKejKFhilktS6JIgvHtfmXP4C3vwKE4PAA", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628272695, "digest": "X8uvYzp4AFmHmZXdsfQXPnxG4EWphkb7kPIMy3FRi7s", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "GN5T297sAuXDkXxoQ1cLfP3sBr8zvjQWBlda--UjQsM", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628272476, "digest": "V6OxDSxWbyY_AZ-wP_4GlVbojev2jJY_VetFHz-OF_I", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "JezDrNWVAGQaOapAEfTAgC0wx57EARLwiL_fSjx0fjE", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628272796, "digest": "075BxR0m7q6yo52NADrAu7qNDcVLFItCJ2SwAeQ5a1M", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "NQLEQkdNTkGzibytmnyyHBNNvoeApH9ZCeW7XbzelBM", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628273095, "digest": "QSW_ZLIHt8ctZ3e_f8NeLMQhT3QLcT2JbZjyYmMtLAE", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "HhH6mMfNGK6jzTC6BMV6oWtOMS9iwl0BKrZB46hbT9o", "title": "Test Entry Editions", "body": "Test", "timestamp": 1628273712, "digest": "hzHcvjgaIlF8GWi_DMIdNbw_WGT9ZpwUx-rzGtdbcXI", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "8Zqc843C3OexPUAXEqbcFNbgTefIfP85XOyJAuDkalQ", "title": "Our Network: Issue #83", "body": "*All funds raised via NFT sales go directly back to our contributors each week. Thank you for supporting community-driven crypto analytics!* 🤝\n\n**About the editor:** [Spencer Noon](https://twitter.com/spencernoon) is General Partner at [Variant](https://variant.fund/), a first-check crypto VC fund. DMs always open for entrepreneurs.\n\n**[Click here to subscribe to the newsletter](https://ournetwork.substack.com/subscribe)** and get issues delivered straight to your inbox each week.\n\n* * *\n\n## Our Community Is Hiring\n\n###### DATA SCIENCE \n*   **Dune Analytics** is hiring a [Crypto Data Specialist](https://duneanalytics.com/careers)\n*   **Edge & Node** is hiring a [Data Scientist](https://edgeandnode.com/jobs/data-scientist)\n*   **0x** is hiring a [Product Analytics Data Scientist](https://boards.greenhouse.io/0x/jobs/5262505002)\n\n###### ENGINEERING \n*   **Gearbox** is hiring for [multiple engineering roles](https://www.notion.so/gearboxprotocol/Job-Board-407349cd2f9341e1a563cac75e7ec7ed)\n*   **Phantom** is hiring a [Senior iOS / React Native Engineer](https://cryptocurrencyjobs.co/engineering/phantom-senior-ios-react-native-engineer/)\n*   **Sense** is hiring a [Senior Front End Engineer](https://jobs.lever.co/sensefinance/4ae33e2f-6293-457e-94cc-63a57098c523) and a [Senior SC Engineer](https://jobs.lever.co/sensefinance/8c604a7f-0f1b-46de-bb75-90fc4f3aaec6)\n\n###### BIZ DEV & OPS \n*   **Aleo** is hiring a [VP of Marketing](https://www.aleo.org/jobs/vice-president-marketing)\n*   **Yield** is hiring for a [Go To Market Lead](https://yield.is/careers/go-to-market-lead/)\n\n###### EDITOR’S NOTE \n*   **Don’t see your ideal role?** [Fill out my talent form](https://tally.so/r/wbx6Em) and I’ll personally do my best to connect the dots with top projects in our community.\n\n***\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F7282c366-4b49-4d32-891c-86e914ab754c\\_1424x118.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F7282c366-4b49-4d32-891c-86e914ab754c\\_1424x118.png)\n\n*This week our contributor analysts cover NFTs: Axie Infinity, Mirror, and NFT Bots.*\n\n## ① Axie Infinity\n**👥 [Joel John](https://twitter.com/joel_john95) & [Jiho](https://twitter.com/Jihoz_Axie)\n📈 Cumulative Volume On Axie Infinity Crosses $1B\n👉 [Axie Infinity community on Discord](https://discord.com/invite/axie)\n📌 [Sky Mavis job board](https://skymavis.com/careers)\n🔎 [Check out the dashboard](https://www.axieworld.com/en/economics/charts)**\n\n*   Axie Infinity has steadily seen around 25,000 daily users with on-chain transactions over the past month. Important to note, these are users who made a transaction through a wallet. The 25,000 figure is fairly higher than the average AMM or DEX, which tends to see around 5,000 users per day day. The team at Axie Infinity claims to have \\~1 million DAUs, therefore a \\~2.5% user count doing active wallet interactions is a rather healthy indication. (Source: DappRadar)\n\n[![Screenshot-2021-08-06-at-8-44-36-PM](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fd23e0f5d-908f-4e2c-a345-2596815d203c\\_761x377.png \"Screenshot-2021-08-06-at-8-44-36-PM\")](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fd23e0f5d-908f-4e2c-a345-2596815d203c\\_761x377.png)\n\n*   The average transaction size on Axie Infinity today is north of $500, which shows that spam transactions have not taken over the network just yet. The average user engaging with wallets on Axie Infinity completes 1.4 transactions on a given day. (Source: DappRadar)\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4af41301-ed8b-4fa0-91d3-2812f7f4abbb\\_1100x566.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4af41301-ed8b-4fa0-91d3-2812f7f4abbb\\_1100x566.png)\n\n*   The data is further supported by the fact that Axie Infinity ranks the highest among NFT sales according to Cryptoslam. At north of $700 million in NFT sales across a quarter million buyers, the project is in a league of its own. (Source: Cryptoslam)\n\n[![Screenshot-2021-08-06-at-8-48-06-PM](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F9d3780cf-405a-40f7-9642-f976f754bdc9\\_742x235.png \"Screenshot-2021-08-06-at-8-48-06-PM\")](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F9d3780cf-405a-40f7-9642-f976f754bdc9\\_742x235.png)\n\n*   This rapid rising interest has translated to exponential growth in on-chain volume. According to Axie Infinity’s data, the cumulative volume of assets transacted in Axie crossed north of $1 billion in the past month. While much of it has been in the recent past, the chart is a testament to the perseverance and grit of the team over the years. Axie Infinity is proof that product market fit kicking in can lead to exponential growth. (Source: AxieWorld)\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F513c3215-7333-488d-abf4-329b3233f009\\_1472x714.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F513c3215-7333-488d-abf4-329b3233f009\\_1472x714.png)\n\n*   The traction Axie Infinity has achieved also benefits Ethereum as a network. According to Nansen’s gas tracker, Axie Infinity alone accounted for \\~9% of all gas consumed in the last seven days. (Source: Nansen)\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6213dbee-3afe-4784-a9bf-c778000850ef\\_1116x1014.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6213dbee-3afe-4784-a9bf-c778000850ef\\_1116x1014.jpeg)\n\n*   Finally, when examining the activity of large wallets, the number of addresses exiting Axie Infinity over the past few months was quite low. Close to \\~200 wallets have accumulated north of 10,000 tokens over the past six months. The recent price rise has not translated to a sell-off among the large wallets.\n\n    Part of the reason for this may be due to the fact that creating cash flow out of Axie Infinity tokens is possible through programs like those offered by YGG, standing as a proof-point that individuals building a position in Axie still believe there is long-term upside despite the recent massive rally. (Source: Santiment)\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff5d8c721-72b3-4ccf-871d-cd07950e84d3\\_1350x762.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff5d8c721-72b3-4ccf-871d-cd07950e84d3\\_1350x762.png)\n\n***\n## ② Mirror\n**👥 [Andrew Hong](https://twitter.com/andrewhong5297)\n📈 1850+ ETH Raised by Creators and Communities\n🏁 [Join the Write Race](https://mirror.xyz/race)\n🔎 [Check out the dashboard](https://dune.xyz/ilemi/Mirror)**\n\n*   Mirror is a crypto-based publishing platform that aims to connect creators directly with their audience using a combination of Web2 and Web3 native tooling. Writers gain access to the platform by entering the $WRITE race, which occurs every Wednesday at 3pm - 5pm EST. Mirror's current main products for allowing creators to raise funds are editions, crowdfunds, reserve auctions, and splits. Each of these are smart contracts, with multiple iterations of each to date. (Source: Dune Analytics)\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ffece0430-3794-43c6-b07d-9730f915f401\\_2538x967.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ffece0430-3794-43c6-b07d-9730f915f401\\_2538x967.png)\n\n*   Editions have become the most popular product that Mirror creators use, due to the product’s flexibility in creating tiered NFT editions (i.e. with rarities) as well as linking editions directly to crowdfund blocks. (Source: Dune Analytics)\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F021bdd86-d3a2-4768-9450-bd7efcb1bad8\\_2522x947.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F021bdd86-d3a2-4768-9450-bd7efcb1bad8\\_2522x947.png)\n\n*   Mirror links users data across governance ($WRITE race), Ethereum interactions (across various creator blocks), and Twitter conversation threads. Aggregating this data allows the use of \"Betweenness Centrality\" to create a community-specific reputation score (highest ranked are the red dots below).\n\n    [Click here](https://ath.mirror.xyz/aYOJc8pihb9wxI\\_\\__QR9qmM5mQ4caUyQhHJIlevspjw) to learn more about community-specific reputation scoring on Mirror.\n\n***\n## ③ NFT Bots\n**👥 [Drake Danner](https://twitter.com/drakedanner)\n📈 NFT Purchasing Bots Are Producing 50+ ETH Profits\n🔎 [Check out the dashboard](https://dune.xyz/danner_eth/The-Floor-is-WETH)**\n\n*   On OpenSea, it is not hard to notice that nearly all items in popular collections have bids far below the floor price. After observing behavior and speaking to community members, it becomes clear that these bids are placed by bots and that the bots relist these items at the lowest current ask. Some bots have cleared over 50 ETH in profit. While I have not identified all known bots, purchases made by a number of bots compared to other purchases show how bots are able to turn profits over 600 ETH. (Source: Nansen)\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F414694b1-caec-479d-a184-ad734c72156f\\_2646x1494.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F414694b1-caec-479d-a184-ad734c72156f\\_2646x1494.jpeg)\n\n*   Dr_Burry1, a well known NFT bot, has produced over 60 ETH in profit and has realized ROIs in the triple digits. The top ROI by project for this bot is the Forgotten Runes Wizards Cult, at 292.5%. Dr_Burry1 is accompanied by Dr_Burry and Dr_Burry2, and their accounts can be analyzed on NFTBank.ai. (Source: NFTBank.ai)\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fe4f5fc71-5689-4ceb-b3a4-cefbcb26c66a\\_1404x940.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fe4f5fc71-5689-4ceb-b3a4-cefbcb26c66a\\_1404x940.jpeg)\n\n*   Bot bids are pervasive throughout OpenSea, but the purchase transaction share from identified bots is small and concentrated. The highest involvement on a per project basis is Hashmasks, with identified known bots accounting for 2.6% of secondary market purchases and 0.23% of total ETH volume. (Source: Dune Analytics)\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fefd473b5-7207-4ff9-9ba6-ac72c0116916\\_1529x751.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fefd473b5-7207-4ff9-9ba6-ac72c0116916\\_1529x751.jpeg)\n***\n**About the editor:** [Spencer Noon](https://twitter.com/spencernoon) is General Partner at [Variant](https://variant.fund/), a first-check crypto VC fund.", "timestamp": 1628275212, "digest": "BeJYsRCDz4rRKNbGJMg7st2KRlUXlkL-C8cW9srvtU8", "contributor": "0x9C159121CEEBF937E9bad98fd0c895d7f6038bd4"}
{"id": "peqDTiyb6rYIamcA7sPI66IRBm0MlgOAu3xfXRMTF_A", "title": "Test Test TEST", "body": "Halo", "timestamp": 1628277491, "digest": "VlOXMhABB2lg5s2wQRGPILTZ_kgDva6nQDvoqUCozgQ", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "DouUL23ozVDxV_ZbVrnjdDF85YnUdwZZboQKuyhk3_M", "title": "Become the First Citizen of CityDAO and name our first city parcel.", "body": "When Augustus restored the republic of Rome, he himself retained the title “first citizen” of Rome.\n\nWe are releasing citizen NFTs to our early backers, starting with an exclusive edition for the First Citizen. This NFT memorializes the CityDAO Articles of Incorporation as one of the first DAO LLCs in history, showcasing the Articles overlaid on the state of Wyoming and its 23 counties.\n\n**The holder of the CityDAO First Citizen NFT gets:**\n• To name the first parcel, subject to a community approval vote\n• Read access to internal CityDAO team channels\n• Governance and voting rights\n• Pre-sale access to land NFT release\n\n\n[Token #4299](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=4299&auctionId=0x292ac9a2f5751b247fc66dc1f46265ba0f519344ad65f0f705b1452b74032df6)", "timestamp": 1628281352, "digest": "CmZyzy3tuOu4TPUnfsYaR1Zoub1yiej6ZoOEuoayDQM", "contributor": "0x33eD481F752f05A292346C71E16aFbB0fE548656"}
{"id": "H25F98tl5MDPEm3HUbRbmn37NnjILzwwnfaAHE983UU", "title": "Become the First Citizen of CityDAO and name our first city parcel", "body": "When Augustus restored the republic of Rome, he himself retained the title “first citizen” of Rome.\n\nWe are releasing citizen NFTs to our early backers, starting with an exclusive edition for the First Citizen. This NFT memorializes the CityDAO Articles of Incorporation as one of the first DAO LLCs in history, showcasing the Articles overlaid on the state of Wyoming and its 23 counties.\n\n**The holder of the CityDAO First Citizen NFT gets:**\n• To name the first parcel, subject to a community approval vote\n• Read access to internal CityDAO team channels\n• Governance and voting rights\n• Pre-sale access to land NFT release\n\n\n[Token #4299](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=4299&auctionId=0x292ac9a2f5751b247fc66dc1f46265ba0f519344ad65f0f705b1452b74032df6)", "timestamp": 1628281356, "digest": "CmZyzy3tuOu4TPUnfsYaR1Zoub1yiej6ZoOEuoayDQM", "contributor": "0x33eD481F752f05A292346C71E16aFbB0fE548656"}
{"id": "XPtZWWFAQlZK_e72dLsAEroxq27M_kH4QMnlssssErs", "title": "Become the First Citizen of CityDAO and name our first parcel.", "body": "When Augustus restored the republic of Rome, he himself retained the title “first citizen” of Rome.\n\nWe are releasing citizen NFTs to our early backers, starting with an exclusive edition for the First Citizen. This NFT memorializes the CityDAO Articles of Incorporation as one of the first DAO LLCs in history, showcasing the Articles overlaid on the state of Wyoming and its 23 counties.\n\n**The holder of the CityDAO First Citizen NFT gets:**\n• To name the first parcel, subject to a community approval vote\n• Read access to internal CityDAO team channels\n• Governance and voting rights\n• Pre-sale access to land NFT release\n\n\n[Token #4299](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=4299&auctionId=0x292ac9a2f5751b247fc66dc1f46265ba0f519344ad65f0f705b1452b74032df6)", "timestamp": 1628281328, "digest": "CmZyzy3tuOu4TPUnfsYaR1Zoub1yiej6ZoOEuoayDQM", "contributor": "0x33eD481F752f05A292346C71E16aFbB0fE548656"}
{"id": "E7JBt32e36C3WTVrWkLeccjs2EMt6Quwpn5LrcXlEW8", "title": "Testing", "body": "This is a test", "timestamp": 1628281493, "digest": "rpYFFu800utevzvod-01uvfOvI05XRJlkKgMEVucAM4", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "vSTkPi_hB8ydk7PmGEXjAM5oj5iIC0Hlc3-tTuwPz4o", "title": "Become the First Citizen of CityDAO and name our first city parcel", "body": "When Augustus restored the republic of Rome, he himself retained the title “first citizen” of Rome.\n\nWe are releasing citizen NFTs to our early backers, starting with an exclusive edition for the First Citizen. This NFT memorializes the CityDAO Articles of Incorporation as one of the first DAO LLCs in history, showcasing the Articles overlaid on the state of Wyoming and its 23 counties.\n\n**The holder of the CityDAO First Citizen NFT gets:**\n• To name the first parcel, subject to a community approval vote\n• Read access to internal CityDAO team channels\n• Governance and voting rights\n• Pre-sale access to land NFT release\n\n\n[Token #4299](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=4299&auctionId=0x292ac9a2f5751b247fc66dc1f46265ba0f519344ad65f0f705b1452b74032df6)", "timestamp": 1628281838, "digest": "CmZyzy3tuOu4TPUnfsYaR1Zoub1yiej6ZoOEuoayDQM", "contributor": "0x33eD481F752f05A292346C71E16aFbB0fE548656"}
{"id": "YqFMjtdWbtCyr0Q_r1mpK-vPYdiK_6xL1Xcqgb8m7ts", "title": "Test", "body": "test", "timestamp": 1628286837, "digest": "Gk3w3LyPZ5D7QYStdfopv1Gg7se6IVbRZ8SF4-yel3s", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "tVWeUPwoXavJtF2Oo6MZ3U1FYUqNQuuIHkTLO6KJ8n0", "title": "Testing ", "body": "test", "timestamp": 1628286959, "digest": "S6Q1o3SVR-3WKCOr_TQyQe0ak_bDSXsvU2XB0xCBB1Q", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "ZnHCnJP393ZKJ_Do3PDvLNQnRzYSWIXGGIUkV8LJNuo", "title": "Hello there", "body": "Hello", "timestamp": 1628287079, "digest": "ko67oLzH5D9vSjVcTa1nTUnFhyN2ePOd02y56NpVlzQ", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "XN4sl7Lnte2znmqRoZPLfaafFLZM7DxlwlQunFpdfuc", "title": "Reflecting on crypto for a sec", "body": "In crypto, everything moves so fast. With all the Tweets, Discords, and buzz to keep up with, it's hard to force oneself to take a step back and reflect. \n\nSo, this Friday afternoon - with my first post on Mirror (👋) - that's what I'm giving myself space to do.\n \nI've only been deep into crypto for a little over a year now, but I can confidently say that nothing in my professional life has captivated me more than crypto has. What started as a light curiosity gradually became a proper hobby, and now I’d say I’m teetering the brink of obsession. \n\n**What pulls me in?**\n\nThere’s a new world being created: a distributed, user-owned, community-led world. After a decade of dreamers dreaming and builders building and abstract 'what-if' use cases being pontificated, the match has caught and the glimmers of fire are obvious to anyone paying attention. Things are happening - and, *fast*. Crypto is quietly beginning to revolutionize how work is sourced and rewarded, how companies are governed, how and to whom ownership is granted. This world is no longer theoretical.\n\nPart of what's particularly interesting to me is that crypto is capitalizing on a lot of things that *could* be done in Web2, but just aren't being prioritized there. \n\nTo that end, a common question I hear - and one I've asked a million times myself - is: \"but do you *need* crypto for that?\". Fractional ownership, decentralized governance, micro-entrepreneurship: no, you don't need crypto to do them. These are all things that are 100% possible without the blockchain. But, they happen to be first manifesting themselves in a coordinated way in a Web3 context. If you want to explore their possibilities and implementations, there's no better place today than in the crypto community.\n\nPutting my excitement aside for a sec, I want to make it clear that I’m not here to be an all-in crypto bull. I don't want to only tout its benefits; I want to be real and offer measured context and expose my open questions and concerns. And I want to engage in debate & discussion!\n\n**So, just to put it out there...**\n\nI hold views that, in the crypto world, are pretty controversial. After re-entering the crypto space from a lens of macroeconomic curiosity, I actually don’t think Bitcoin or Ether will – or should – completely replace fiat in the near-term; in fact, while it’s the macro piece that initially pulled me back in, it’s the non-macro stuff that has me captivated. \n\nOther controversial views? I believe there are benefits to centralization on certain levels (and I believe that decentralization is not binary, as I've [written about before](https://annikalewis.medium.com/decentralization-is-not-binary-45bbb9946fad)). I also think that many areas of business & society, today, still remain better-suited to an off-chain world.\n\nI also could be wrong on timing. I *think* crypto will begin to play a non-trivial role as a new computing foundation for mainstream society in the next five years, but there’s a chance I’m still too early. Despite the fact that we’re more than a decade into crypto being a thing, it’s still very much nascent, and there’s a lot to be sorted out on scalability, security, and user experience. And, honestly, there are a non-trivial amount of crypto applications that still feel like hammers looking for nails in this workable non-crypto-led earth in which 99% of humans live.\n\nBut despite all of this, I’m here. I can’t not engage. The widespread traction that I see in crypto is at a point where, for me at least, it is becoming very hard to fathom a future in which blockchains don’t play a big role.\n\nStill, the traction is secondary to what really gets me excited.\n\n**It's about the people. It's always about people.**\n\nHonestly, the number one thing pulling me deeper in is the humans. I used to say that it felt like the crypto world was 90% one-sided obnoxiously loud pundits, and 10% brilliant forward-thinking technologists – but that doesn’t ring true anymore. The balance is shifting, and the cast of characters is diversifying beautifully.\n\nI cannot overstate the impact of people in my crypto journey. Countless hours of conversations - largely with people I've met online (!) - have helped push my thinking way beyond the structures of today and drive me to learn at a breakneck pace. The people I'm engaging with in crypto are intellectually rigorous, forward-thinking, measured in their analysis, and – crucially – fun. *You know who you are.*\n\nCrypto sits at the intersection of my passions: data, capital markets, and macroeconomics. It’s a beautiful manifestation of those fields in one crazy world. It is so early in its journey, and I am so early in mine. \n\nI'm going to use Mirror to unpack what I'm thinking about as I go - so if you enjoyed this, follow me here. \n\nHappy Friday! ✌", "timestamp": 1628288360, "digest": "BoVXxWrPVY2nxPdG1XGe2eW2vg4w6tLTj-sHe_WmjIw", "contributor": "0x894Aa5F1E45454677A8560ddE3B45Cb5C427Ef92"}
{"id": "NWcaz72saAoPBTcXfKgIXo56qCTrYWLTX6hSiBhYC_Y", "title": "Final Test", "body": "Final", "timestamp": 1628296155, "digest": "abHVMDhgyMVEwUbzj_Asgaxl1R5WGBM_f3WolFKw7Do", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "kilJ_mx3NPeXikjBPPAuRbRuDhLhcSF41fKVJ9_Gkqc", "title": "Tutorial: How To Register An ENS Name", "body": "✨ Welcome Crypto Explorers ✨\n\nIn today's tutorial, we will be exploring one of the ways to own your identity on the decentralized web. \n\nAn ENS name is your username for the decentralized web that can be used to login across many different blockchain and web3 services. Once you set up your ENS name, you can use it as a website address, your identity, wallet/bank, and more!\n\nLet's get started! \n\n## Watch the full video walkthrough using the shortened bit.ly links below. \n\nHow to register an ENS name: [https://bit.ly/PartOneENSDomains\n](https://bit.ly/PartOneENSDomains)\nHow to set your reverse ENS record: [https://bit.ly/PartTwoENSDomains](https://bit.ly/PartTwoENSDomains)\n\n## Part One: How to register an ENS name\nOnce you learn this skill you will have your very own .eth name!\n\n### 1. Go to the ENS Domains Website\n- https://ens.domains/\n\n### 2. Navigate to the ENS Manager by clicking on Launch App in the top right\n- https://app.ens.domains/\n\n### 3. Search for your desired .ETH name\n- Type into the \"Search Names\" field and click \"Search\"\n- Click on the .ETH domain you want to register if it is available\n\n### 4. Select your time interval\n- You can select how many years to register and pay for the annual fees upfront with the \"+\" and \"-\" buttons.\n- Remember to have enough ETH in your wallet to pay for the full cost of the registration (including gas fees!)\n\n### 5. Start the registration process \n- Click the blue “Request To Register” button on the bottom right. A box should pop up from MetaMask asking you to confirm the transaction. Click the “Confirm” button to confirm it.\n- It will take about a minute for the transaction to confirm.\n\n### 6. Wait\n- Do not close your browser during this process.\n\n### 7. Finish registration\n- Once your wait time is over, orange text will appear that says “Click register to move to the 3rd step.” Click the blue next to it that says “Register.” \n- Once the transaction confirms you can now set the reverse ENS record.\n\n> Part One Video Walkthrough: https://bit.ly/PartOneENSDomains\n\n\n## Part Two: How to set your reverse ENS record\nOnce you learn this skill, you'll be able to set your ERC-20 wallet address to your new .eth address. If your Ethereum account has a reverse record, Etherscan will display the ENS name instead of the 0x address you specified.\n\n### 1. Get an ENS name in the ENS Manager App\n- See the previous steps in part one of the tutorial.\n\n### 2. Go to My Account in the ENS Manager, click \"Reverse record: not set\", select the ENS name you want for your reverse record and submit a transaction to save.\n- ENS Manager: https://app.ens.domains/\n\n> Part Two Video Walkthrough: https://bit.ly/PartTwoENSDomains\n\nYou have now registered your own ENS name and applications like Etherscan will now be able to recognize your ENS name instead of showing your wallet address after setting your ENS reverse record.\n\n## Verify task completion on Rabbithole\n- Go to the ENS Domain skill [url](https://app.rabbithole.gg/skills/identity/ENS1) on Rabbithole.\n- Click \"Redeem\" on the top right of the page.\n- Sign your transaction on Metamask.\n- ✅ You now have earned 250 xp for your Rabbithole profile!\n\n### Keep On Questing and Leveling Up Your Skills! \n\n\n🧙‍♂️ Tutorial created by: @TheAlexYao ", "timestamp": 1628298225, "digest": "kvRCDAWl1Qr3kQFsK8B5avShMhN5ODy44OBHywdPvcY", "contributor": "0x57eFCc7607CD2da49D73E8F9C88ed114CbdC5CF7"}
{"id": "I3o5RLE_2f3UZr7qe-_UHwyVfwAgIRfCgrQXp04LgOc", "title": "$SELF Reflection", "body": "[$SELF](https://dame.mirror.xyz/KHVDbIRgNJCVmEJYbS6T_cdCTfRDB4h0kL6PpLkD6t8) has been completed and each unique NFT is being distributed to the correct participant. If you missed out on the original project, or if you'd like an extra collectible, I've made an image that features all of the pieces in sequential order. You can mint one of these collectibles here on this post.\n\n$SELF was an experiment and a participatory art project. I wanted to see what would happen when relationships, self identity, and blockchain collided. Anyone could join for a minimum of 0.01 ETH. At the beginning, I had no idea what this project would blossom into.\n\nIn the end, I created 72 unique abstract pieces. Each one has different traits, qualities, and complexities. In some ways, they are reminiscent of the generative NFT projects that are popular in the space right now. The difference though is that each $SELF is human-generated. I made each one by hand.\n\nHalfway through the project, I took a snapshot of the participating wallets and analyzed the resulting data. I also [encoded an on-chain message](https://dame.mirror.xyz/5xbwbVzWcO8vQkEIGlMaUjXNM6UNM8labiN-5QkVCHM) that was sent to each participant. Almost half of the participants sent on-chain replies. All of these elements, including some off-chain interactions, influenced my perception and understanding of each $SELF, as well as its relation to my $SELFs.\n\nIf I’m honest, I didn’t like some of the $SELFs I created. Many of the pieces felt quite ugly or nonsensical at times. I struggled with this fact during the creation process but ultimately leaned into it, accepting it as a pure expression of the project’s conceptual roots.\n\nAfter all, $SELF hatred is real. As is $SELF love.\n\nSharing these final NFTs with you is a form of $SELF expression and an invitation into a deeper relationship with your own $SELFs, to each other, and to the blockchain.\n\nI hope they serve as reminders that we don’t just contain multitudes... we are multitudes.\n\n--- \n\nThank you to everyone who participated. We are forever tied together on-chain. [Follow along on Twitter](https://twitter.com/jacksondame) so you don't miss my next art project. It's going to be even more interesting than the last!\n\n[Self](crowdfund://0x972fBE58D550F17eD723Bc4bcEb60163d45E46c1?version=3&network=homestead&features=backers)", "timestamp": 1628300037, "digest": "o4V9Mcjm5pombjhCwqC-NmiGj4PEBNcxhtrd4bDRlfw", "contributor": "0x3B3525F60eeea4a1eF554df5425912c2a532875D"}
{"id": "s8tzpwrMtrIHZ-AE7RgxIlgyIMPscfKIDR3Spi6sKak", "title": "$SELF Reflection", "body": "[View the entire collection](https://opensea.io/collection/dame-self)\n\n[$SELF](https://dame.mirror.xyz/KHVDbIRgNJCVmEJYbS6T_cdCTfRDB4h0kL6PpLkD6t8) has been completed and each unique NFT is being distributed to the correct participant. If you missed out on the original project, or if you'd like an extra collectible, I've made an image that features all of the pieces in sequential order. You can mint one of these collectibles here on this post.\n\n$SELF was an experiment and a participatory art project. I wanted to see what would happen when relationships, self identity, and blockchain collided. Anyone could join for a minimum of 0.01 ETH. At the beginning, I had no idea what this project would blossom into.\n\nIn the end, I created 72 unique abstract pieces. Each one has different traits, qualities, and complexities. In some ways, they are reminiscent of the generative NFT projects that are popular in the space right now. The difference though is that each $SELF is human-generated. I made each one by hand.\n\nHalfway through the project, I took a snapshot of the participating wallets and analyzed the resulting data. I also [encoded an on-chain message](https://dame.mirror.xyz/5xbwbVzWcO8vQkEIGlMaUjXNM6UNM8labiN-5QkVCHM) that was sent to each participant. Almost half of the participants sent on-chain replies. All of these elements, including some off-chain interactions, influenced my perception and understanding of each $SELF, as well as its relation to my $SELFs.\n\nIf I’m honest, I didn’t like some of the $SELFs I created. Many of the pieces felt quite ugly or nonsensical at times. I struggled with this fact during the creation process but ultimately leaned into it, accepting it as a pure expression of the project’s conceptual roots.\n\nAfter all, $SELF hatred is real. As is $SELF love.\n\nSharing these final NFTs with you is a form of $SELF expression and an invitation into a deeper relationship with your own $SELFs, to each other, and to the blockchain.\n\nI hope they serve as reminders that we don’t just contain multitudes... we are multitudes.\n\n--- \n\nThank you to everyone who participated. We are forever tied together on-chain. [Follow along on Twitter](https://twitter.com/jacksondame) so you don't miss my next art project. It's going to be even more interesting than the last!\n\n[Self](crowdfund://0x972fBE58D550F17eD723Bc4bcEb60163d45E46c1?version=3&network=homestead&features=backers)", "timestamp": 1628305694, "digest": "o4V9Mcjm5pombjhCwqC-NmiGj4PEBNcxhtrd4bDRlfw", "contributor": "0x3B3525F60eeea4a1eF554df5425912c2a532875D"}
