{"id": "sAOsUm44OU_K32JWQ5QhTR2XaC6o4V5PPYbd1xoPoNI", "title": "Test", "body": "test", "timestamp": 1623265146, "digest": "IYMDjsFZ4T-m-jAR4h1EACFKScHl2Qo0EuPPJte-1IU", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0xa06997098df1021d2ceb1133977635534fc1f38e5d97b59efeb5aeeb66a9d991\"}"}
{"id": "Sfea57vIBEStvYe2zN4g7ld-hopGnf3KAx_0HpSrqHw", "title": "Test entry NFT minting", "body": "test", "timestamp": 1623265444, "digest": "vbA1StwywLtO7kFhbcZ0gO_EURYJBupVqBg5sYEdlac", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0x84fbcbb2bccfe2f94e4f1031b5eeaadf3ba7a088fe33278160f006aa4ae9048c\"}"}
{"id": "h8GVI0TflgR9XWvTdwbbzo4mGm29MSN61hOJFa8S5m0", "title": "Towards a Decentralized Autonomous Type Foundry Part I", "body": "## Introduction\n\nI've been trying to write something about this for the past few months but I haven't been satisfied with my attempts to articulate the ideas in my head.\n\n**So, rather than letting my thoughts grow stale perhaps I can start by posing a question:**\n\n![](https://images.mirror-media.xyz/publication-images/921953eb-ffbf-4223-a8f2-41b67b7ac461.png?height=987&width=1449&size=large)\n\n\n\nIt's not a whitepaper—but it's a signal of sorts. I know for a fact that I'm not the only person thinking about this. This is a flag that I'm planting with hopes that likeminded people would see it at a distance and respond.\n\nA tapestry of emerging technologies are coalescing to form the next generation of the web that will have a shockwave effect on multiple industries. What implications (good, bad, hypothesized, actualized) do Web3 and blockchain technologies have on the practice of designing and distributing typefaces at large?\n\nWhat are opportunities ahead of us that:\n- Protect the integrity of the industry from bad faith actors and monopolizing forces?\n- Allow for more novel ways to share resources and profits between type designers, foundries, and users of typefaces that subvert the traditional designer / foundry split?\n- Allow for more fairness and equitable inclusion for emerging type designers?\n- Introduce new and novel methods and incentives to fund future type design projects and type design careers?\n- Introduce frictionless bounties for language support, non-latin scripts, and other features that extend the inclusivity and range of any given typeface\n- Allow for better protections against unwanted intellectual property theft? *While* ushering a new culture of consensual remixes, covers, and homages where everyone is compensated and credited fairly?\n- Allow for more streamlined and novel ways to distribute typefaces beyond the current licensing models?\n- Allow for productive and meaningful organizing strategies to enact larger change?\n\nI'll start with that for now.\n\nhttps://twitter.com/_EricHu/status/1380516219204292609\n\n## While You're Waiting: Some Further Reading\n\n[A Beginner's Guide to DAOs](https://linda.mirror.xyz/Vh8K4leCGEO06_qSGx-vS5lvgUqhqkCz9ut81WwCP2o)\n\n[Introducing Splits](https://dev.mirror.xyz/mQ03-JXlfdoBnRrZisC5X3kM9nBkOILlHwxbdq382Gw)\n\n[Creator DAOs: An OS for Participation](url)\n\n[Platform Cooperative](https://en.wikipedia.org/wiki/Platform_cooperative)\n\n[Eight Qualities of Decentralized Autonomous Organizations](https://www.ourmachine.net/writing/eight-qualities-daos/)\n\n[The Ownership Economy\n](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/)\n\n[Now open: ERC-1155 marketplace](https://medium.com/opensea/now-open-erc-1155-marketplace-816257ab0da7)\n\n### Papers\nDigital Social Contracts: A Foundation for an\nEgalitarian and Just Digital Society [[PDF]](http://ceur-ws.org/Vol-2781/paper5.pdf)\n\n### Contact\nTwitter: [@_erichu](http://twitter.com/_erichu)\nEmail: [mail@erichu.info](mailto:mail@erichu.info)\n\n*Special Thanks to Eugene Angelo, and the rest of [FWB](http://fwb.help)* for all the conversations leading up to this.\n\n", "timestamp": 1623268199, "digest": "cuJ-6Ksevx9QuV5peOcw5lpDYVLbPEY5pumZprr8L1Y", "contributor": "0x4628D77ba8fCc7a7F2B6bd4A0363061a06E7a20F"}
{"id": "6z5buy5C-ZBqoNxlGogOXQxta7P6p6iEiTrwK6WRnTE", "title": "Two young digital artists are swimming along when someone says to them \"morning, how're the NFTs?\"", "body": "## What the hell's an NFT?\n\nYou might know this nice fable recounted by David Foster Wallace in a famous commencement address:\n\n> There are these two young fish swimming along and they happen to meet an older fish swimming the other way, who nods at them and says “Morning, boys. How’s the water?” And the two young fish swim on for a bit, and then eventually one of them looks over at the other and goes “What the hell is water?”\n\nWhen you first read this, **you might think the point of the story is that the young fish are basically idiots** who don’t understand something obvious. So maybe, here in an essay proclaiming to be about NFTs, it might seem like we are setting the stage for a lesson like “lots of people don’t know what NFTs are even though it’s simple: NFTs are just ____________.”\n\nQuite the opposite!\n\nI’ll contend that you probably do know what NFTs are. But most everyone you disagree about them probably does too. [And but so](https://ambiguities.wordpress.com/2008/09/20/the-and-but-so/) when people say “it’s simple: NFTs are just _________”, perhaps filling in the blanks variously with “property titles” or “status signals” or \"examples of crudely mimetic speculation\" or “pointers to a file” or “the artist’s signature” they’re probably right. Except for the word “just.”[1] \n\nAnd I will try to prove it to you by drawing on an old study about -- what else? -- water.\n\n## \"What the hell is water?\"\n\nBelieve it or not, the answer to \"what is water?\" isn't simple at all. And perhaps summarizing evidence on this can help us all remain NFT value pluralists, especially here in these early experimental days. While it may be exciting and thought-provoking to speculate on what \"NFTs actually are\", the example of water can remind us just how complex and surprising a truly good answer might be. \n\nGoing back to the parable about the fish, suppose that instead of just swimming away one of the younger fish stops and musters the courage to ask the older fish, “wait, so what *is* water?” What would the older fish say? Maybe, **“Oh water? That’s just H2O”**. \n\n\"Just H2O\" feels like the rigorous answer, but it turns out not to be true. Or rather, it's true except for the word \"just.\" [A remarkable experiment by B.C. Malt](https://philpapers.org/rec/MALWIN) asked subjects to classify various liquids as being “water” or “not water” while also asking them to guess the H2O content. \n\nTables 1 and 2 report the results and the findings are instructive. There are a variety of things which the subjects class as “water” despite having substantially less H2O content than items classed as “non-water.”\n\n### Table 1: A Selection of items classed as “non-water” that have high H2O\n\n![](https://images.mirror-media.xyz/publication-images/a4ae5c10-0790-44ef-8a02-2a42e6848fe4.jpeg?height=186&width=1104)\n\n![](https://images.mirror-media.xyz/publication-images/ad915fb5-924b-47bb-a1d9-1f4824753dce.jpeg?height=258&width=1088)\n\n### Table 2: A Selection of items classed as “water” that have lower H2O\n\n![](https://images.mirror-media.xyz/publication-images/cfd865e8-5c1a-40e2-b080-e3f1a9659bae.jpeg?height=312&width=1100)\n\nThese findings point us to the complexity of our commonsense understandings -- if I dip a teabag into a mug of water it becomes tea, but if I dip a teabag into Hudson River it doesn’t become tea. And if Lipton polluted the Hudson River such that its “tea” content was even higher than the tea in my glass it still wouldn’t be tea. What’s the difference? Linguist [Magdalena Sztencel summarizes](https://www.researchgate.net/publication/318420342_Semantics_Pragmatics_and_Meaning_Revisited_The_Case_of_Conditionals) thus: **“whether we regard something as water or not depends on the intricate interaction of human interests, concerns, beliefs and intentions.”** In this case, likely the fact that I intended to make tea and Lipton didn’t.\n\nIs it so surprising, then, that NFTs can be variously art, property titles, signatures, and so on? An artist/creator/author/scientist’s intention to make an NFT “be” the work itself (or an inseparable component of it) may just be sufficient. \n\n[1] Perhaps interesting to note that early Western visitors to Yap assumed the Rai stones were “just” size-denominated money and failed to understand why the stones had individual names and why the value could depend on “whether it was brought by a famous sailor, or whether people died during its transport”. But size mattered too! [a.]\n\n[a.] Didn't feel right to have a David Foster Wallace-referencing article in here without at least one embedded footnote. \n\n*Thanks to awesome participants in a Kernel Junto for offering feedback and discussion (Vivek Singh, Diana Chen, Estefanía Ochoa, Paul Drouet, Robin Roy Thomas, Colton Brown, Jeet Raut, Mayank Dubey, Miguel Cabeza, Nuno Neto, Rev Miller, Kyle Smith). Simona Pop, Jamsheed Shorish, Michael Zargham, Simon DLR, and Matt G. Condon also offered characteristically brilliant suggestions/thoughts.*\n\n", "timestamp": 1623276142, "digest": "mPxqzSXNOUGcqynUpA1CIHz-Pwuj8pTMxPt1aIyvZEg", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "fdem8sngrBT1xtWzOazF8rxy89Myqh6pS4csFfaR9tc", "title": "Paris Rouzati joins IDEO CoLab Ventures", "body": "![](https://images.mirror-media.xyz/publication-images/4334b73e-f91b-4479-aea7-14229262c5c9.jpg?height=386&width=386)\n\nAs summer begins we have some news that puts a big smile on our faces!\n\nWe’re thrilled to announce that [Paris Rouzati](https://twitter.com/parisrouz) has joined IDEO CoLab Ventures as our newest General Partner, playing a leading role in our next chapter. \n\nIf you know Paris, you know that she’s a force of nature… She’s seemingly everywhere at once and brings her high energy, novel ideas, and strong values to every community she engages with. We met Paris earlier this year when she did a deep-dive as a builder of DAOs and NFTs, including growing [internet cabbages](https://techoptimist.xyz/). We formed an instant connection, and more importantly, we found incredible alignment in each other’s values, principles, and approach to supporting and growing the crypto community.\n\nParis is a savvy investor and community builder who established herself as one of the leading thinkers and angel investors in crypto, particularly in the DeFi, social token, and NFT spaces. Before diving into crypto full-time, Paris worked at Slow Ventures, Medium, and about.me where she worked with founders, built communities, and helped grow companies. In 2016, she was recognized as a rising star on the [Forbes 30 Under 30](https://www.forbes.com/30-under-30-2016/marketing-advertising/#564e97a82c19) list.\n\n[IDEO CoLab Ventures](https://twitter.com/IDEOVC) is not your typical venture firm—we’re building a venture collective that embodies what makes crypto-networks special: openness, community, and collaboration. We pride ourselves on being active and hands-on participants in communities we believe in. For all of these reasons and more, Paris is an incredible addition to our team. \n\nParis will be focusing on our investments in the metaverse, NFTs, social tokens, and DeFi. Her mission is to back the next generation of world-class founders who are making Web3 and its superpowers accessible to new audiences around the world. Paris travels all over the world, but she will often be found in IDEO’s London studio.\n\nPlease join us in welcoming Paris to the IDEO CoLab Ventures family. She already represents the heart and soul of the organization and community we are aiming to build.\n\n> “The only way to make sense out of change is to plunge into it, move with it, and join the dance.” –Alan Watts\n\n*The winner of this NFT will receive a 2-hour design session with the IDEO CoLab Ventures team. All proceeds will be given to [SheFi](shefi.org), a DeFi education initiative for women.*", "timestamp": 1623276164, "digest": "Cnks5hBE5eKIlyXGRrxaCoKQJSYhS2pMxTYap57RJfc", "contributor": "0xA83444576F86C8B59A542eC2F286a19aB12c2666", "nft": "{\"nftTransactionHash\": \"0x6329d61b1d83587196ba06b5626ffa1e0e793d02f6558884d84f4cfdcc8bef50\"}"}
{"id": "kOX5T9ApK_9vTthjcL2klvwRPpJ6_DvpSzApJvKSSKw", "title": "Paris Rouzati joins IDEO CoLab Ventures", "body": "![](https://images.mirror-media.xyz/publication-images/4334b73e-f91b-4479-aea7-14229262c5c9.jpg?height=386&width=386)\n\nAs summer begins we have some news that puts a big smile on our faces!\n\nWe’re thrilled to announce that [Paris Rouzati](https://twitter.com/parisrouz) has joined IDEO CoLab Ventures as our newest General Partner, playing a leading role in our next chapter. \n\nIf you know Paris, you know that she’s a force of nature… She’s seemingly everywhere at once and brings her high energy, novel ideas, and strong values to every community she engages with. We met Paris earlier this year when she did a deep-dive as a builder of DAOs and NFTs, including growing [internet cabbages](https://techoptimist.xyz/). We formed an instant connection, and more importantly, we found incredible alignment in each other’s values, principles, and approach to supporting and growing the crypto community.\n\nParis is a savvy investor and community builder who established herself as one of the leading thinkers and angel investors in crypto, particularly in the DeFi, social token, and NFT spaces. Before diving into crypto full-time, Paris worked at Slow Ventures, Medium, and about.me where she worked with founders, built communities, and helped grow companies. In 2016, she was recognized as a rising star on the [Forbes 30 Under 30](https://www.forbes.com/30-under-30-2016/marketing-advertising/#564e97a82c19) list.\n\n[IDEO CoLab Ventures](https://twitter.com/IDEOVC) is not your typical venture firm—we’re building a venture collective that embodies what makes crypto-networks special: openness, community, and collaboration. We pride ourselves on being active and hands-on participants in communities we believe in. For all of these reasons and more, Paris is an incredible addition to our team. \n\nParis will be focusing on our investments in the metaverse, NFTs, social tokens, and DeFi. Her mission is to back the next generation of world-class founders who are making Web3 and its superpowers accessible to new audiences around the world. Paris travels all over the world, but she will often be found in IDEO’s London studio.\n\nPlease join us in welcoming Paris to the IDEO CoLab Ventures family. She already represents the heart and soul of the organization and community we are aiming to build.\n\n> “The only way to make sense out of change is to plunge into it, move with it, and join the dance.” –Alan Watts\n\n*The winner of this NFT will receive a 2-hour design session with the IDEO CoLab Ventures team. All proceeds will be given to [SheFi](shefi.org), a DeFi education initiative for women.*\n\n[Token #3474](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3474)", "timestamp": 1623276473, "digest": "Cnks5hBE5eKIlyXGRrxaCoKQJSYhS2pMxTYap57RJfc", "contributor": "0xA83444576F86C8B59A542eC2F286a19aB12c2666", "nft": "{\"nftTransactionHash\": \"0x6329d61b1d83587196ba06b5626ffa1e0e793d02f6558884d84f4cfdcc8bef50\"}"}
{"id": "d_yRn1svfNOUf3QyUzEkoSw5dNnvwl5-4aSZhERHsrk", "title": "CabinDAO creator residency program proposal\n", "body": "*This is a proposal for structuring the [creator residency program crowdfunded by CabinDAO](https://creators.mirror.xyz/20Eyc57rknNJYL9vJa11zvupU_MXP7NZJUADTzTlCjQ). We will publish CabinDAO governance proposals publicly.*\n\n*We'd love feedback from the community, whether or not you're a $CABIN hodler. If you do have $CABIN tokens, you can now [join our Discord server](https://discord.gg/N6hVmFygjR) to discuss this proposal! See you there.*\n\n_______________________\n\n\n## 🥅 Goals\n\nThe goals of CabinDAO will ultimately be whatever the DAO decides they are. That said, when the DAO was formed, here are some of the things we intended to accomplish:\n\n> 🌐 Create the conditions for serendipitous in-person collaboration across a diverse internet community 🧑‍🤝‍🧑\n\n> 🏡 Experiment with sustainable models for funding the living expenses of independent online creators 🧑‍🎨 \n\n> 🧭 Explore the idea maze of decentralized governance for physical locations 🗳️ \n\n\n## 🏘️ Residency program\n\nTo accomplish these goals, **we are proposing a 3-month trial of a cohort-based residency, where we bring together groups of 4 independent online creators for 4 weeks to work on projects.**\n\n### 📍 Location\n\nGroups of four residents would spend a month living and working alongside other members of their cohort at [Creators Cabins](https://www.creatorcabins.com/), a 28-acre retreat about 45 minutes outside of Austin, TX. They would stay in a four-bedroom shipping container cabin designed from the ground up for a community of independent online creators:\n\n![](https://images.mirror-media.xyz/publication-images/aff070f7-1ccb-4868-8a53-64505c093fee.jpg?height=1174&width=1710) \n\nWhile these first cohorts would be hosted at Creator Cabins, we hope to expand to other locations supported by the DAO in the future. \n\n\n### 🚧 Projects & outcomes\n\nEach of the residents will come with a project they intend to work on. We expect some will stick to the original plan and others will ride the waves of synchronicity & decide to collaborate on something new.\n\nEither way, the expectation of the residency is that you will complete *something* that can be shared with the community by the end of your stay. At the end of the month, we will help each creator mint an NFT representing their work at the residency. This NFT can either be held in the CabinDAO treasury or auctioned, with a 50/50 split going to the creator & to the DAO to fund future residencies. \n\nOur intention is for the CabinDAO community (IRL in Texas, and globally on Discord) to help creators best use emergent web3 patterns to collaborate and share their work. We expect projects that help push the boundaries of web3 and/or contribute to the ongoing sustainability of the DAO will be more likely to win a residency, but that will be up to $CABIN holders to decide. \n\n\n### 🏕️ Camp counselor\n\nResidents will be supported by a \"camp counselor\", who will help facilitate the experience, pick people up at the airport, create ~~~ gOoD vIbEs ~~~, organize weekly grocery runs, brainstorm wild ideas, and generally try to be helpful. The counselor (and any visitors) will stay in the old cabin. \n\nCounselors are people who have completed a residency before and are coming back to support the community. We expect it will take <10 hours per week of work, so anyone working remotely/flexibly can be a counselor part-time. The counselor role will be compensated with free housing and 500 $CABIN tokens per cohort. \n\n\n### 📅 Cohort dates\n\nWe will run three 4-week cohorts over the next few months:\n\n- Cohort 1: *July 19th - August 15th* (hot DAO summer)\n- Cohort 2: *August 23rd - September 19th* (slightly cooler DAO summer)\n- Cohort 3: *September 20th - October 17th* (hitting-our-stride DAO fall)\n\n\n\n## 📋 Application process\n\nThe residency program is open to anyone creating independently and sharing their work online.\n\nFor each cohort, we will run an application & voting process similar to Mirror's $WRITE RACE. People interested in a residency will submit a short proposal, up to 250 words, outlining how they would spend a month of time at Creator Cabins. \n\n$CABIN holders will be able to cast as many votes as the number of tokens they have. Votes can be split among multiple proposals. At the end of the voting period, the top four proposals will receive a one-month residency for the designated cohort.\n\n**We will start accepting applications for Cohort 1 in late June. [Sign up here for updates on the application process.](https://creatorcabins.ck.page/9e628caec5)**\n\n\n\n## 💰 Budget\n\n### 💸 Costs: 5 ETH + 1500 $CABIN per cohort\n\nWe currently have 15.6 ETH and 15.6k $CABIN in the treasury. This is enough for us to cover three 4-week cohorts at a budget of 5 ETH + 1500 $CABIN per cohort. This will cover the following expenses:\n\n- *1 ETH per week*: renting out the full Creator Cabins property (including both cabins, high-speed internet, utilities, and cleaning). The market rate for the cabins is more than this, but we know a guy 😉\n- *0.25 ETH + 250 $CABIN*: ETH provided at beginning of the program as a stipend for each creator in the cohort to cover food and gas costs to mint the end-of-program NFT. $CABIN provided to each creator after they mint their post-program NFT.\n- *500 $CABIN*: stipend for the camp counselor for each cohort, provided at the end of the month. \n\n\n### 🪂 Airdrop\n\nWe are also planning to airdrop 500 $CABIN each to @p_millerd and @kadlac for their OG contributions before we even officially set up the crowdfund:\n\nhttps://twitter.com/kadlac/status/1394149045757571078\n\n\n## 🔮 Long-term plans\n\nWe are [leaving the crowdfund open](https://creators.mirror.xyz/20Eyc57rknNJYL9vJa11zvupU_MXP7NZJUADTzTlCjQ) so that we can continue to raise additional funds for future cohorts and allow new members to join the DAO. We also hope to raise additional sustainable funds for the program through splits on sales of NFTs produced by residents. \n\nWhile the first use-case for this DAO is creator residencies, we will learn from this experiment and continue to find ways to sustainably fund independent online creators and develop DAO-based governance models for physical spaces.\n\nWe would love your feedback and contributions to this project! Slide into our DMs or tweet **@creatorcabins**, **@jonathanhillis**, **@jongold**, and **@ZFleischmann**. If you're a $CABIN hodler, you can now [join our Discord server](https://discord.gg/N6hVmFygjR) for discussion and governance. \n\nThank you to the 89+ members of CabinDAO—[we'll see you in Discord!](https://discord.gg/N6hVmFygjR)\n\n[CabinDAO](crowdfund://0x94515e4f6fabad73C8bCdd8cd42f0b5C037E2c49?network=homestead)", "timestamp": 1623277194, "digest": "eS6lYIBycHEZmtGpRGwA9lCb3Y_8G4pddHWSKtmWP_I", "contributor": "0xbeC26FFa12c90217943D1b2958f60A821aE6E549"}
{"id": "ApmCgoijfTMzrtjFnLADKQBPXmw2LLhdVPVgINg3uo8", "title": "CabinDAO creator residency program proposal\n", "body": "*This is a proposal for structuring the [creator residency program crowdfunded by CabinDAO](https://creators.mirror.xyz/20Eyc57rknNJYL9vJa11zvupU_MXP7NZJUADTzTlCjQ). We will publish CabinDAO governance proposals publicly.*\n\n*We'd love feedback from the community, whether or not you're a $CABIN hodler. If you do have $CABIN tokens, you can now [join our Discord server](https://discord.gg/N6hVmFygjR) to discuss this proposal! See you there.*\n\n_______________________\n\n\n## 🥅 Goals\n\nThe goals of CabinDAO will ultimately be whatever the DAO decides they are. That said, when the DAO was formed, here are some of the things we intended to accomplish:\n\n> 🌐 Create the conditions for serendipitous in-person collaboration across a diverse internet community 🧑‍🤝‍🧑\n\n> 🏡 Experiment with sustainable models for funding the living expenses of independent online creators 🧑‍🎨 \n\n> 🧭 Explore the idea maze of decentralized governance for physical locations 🗳️ \n\n\n## 🏘️ Residency program\n\nTo accomplish these goals, **we are proposing a 3-month trial of a cohort-based residency, where we bring together groups of 4 independent online creators for 4 weeks to work on projects.**\n\n### 📍 Location\n\nGroups of four residents would spend a month living and working alongside other members of their cohort at [Creators Cabins](https://www.creatorcabins.com/), a 28-acre retreat about 45 minutes outside of Austin, TX. They would stay in a four-bedroom shipping container cabin designed from the ground up for a community of independent online creators:\n\n![](https://images.mirror-media.xyz/publication-images/aff070f7-1ccb-4868-8a53-64505c093fee.jpg?height=1174&width=1710) \n\nWhile these first cohorts would be hosted at Creator Cabins, we hope to expand to other locations supported by the DAO in the future. \n\n\n### 🚧 Projects & outcomes\n\nEach of the residents will come with a project they intend to work on. We expect some will stick to the original plan and others will ride the waves of synchronicity & decide to collaborate on something new.\n\nEither way, the expectation of the residency is that you will complete *something* that can be shared with the community by the end of your stay. At the end of the month, we will help each creator mint an NFT representing their work at the residency. This NFT can either be held in the CabinDAO treasury or auctioned, with a 50/50 split going to the creator & to the DAO to fund future residencies. \n\nOur intention is for the CabinDAO community (IRL in Texas, and globally on Discord) to help creators best use emergent web3 patterns to collaborate and share their work. We expect projects that help push the boundaries of web3 and/or contribute to the ongoing sustainability of the DAO will be more likely to win a residency, but that will be up to $CABIN holders to decide. \n\n\n### 🏕️ Camp counselor\n\nResidents will be supported by a \"camp counselor\", who will help facilitate the experience, pick people up at the airport, create ~~~ gOoD vIbEs ~~~, organize weekly grocery runs, brainstorm wild ideas, and generally try to be helpful. The counselor (and any visitors) will stay in the old cabin. \n\nCounselors are people who have completed a residency before and are coming back to support the community. We expect it will take <10 hours per week of work, so anyone working remotely/flexibly can be a counselor part-time. The counselor role will be compensated with free housing and 500 $CABIN tokens per cohort. \n\n\n### 📅 Cohort dates\n\nWe will run three 4-week cohorts over the next few months:\n\n- Cohort 1: *July 19th - August 15th* (hot DAO summer)\n- Cohort 2: *August 23rd - September 19th* (slightly cooler DAO summer)\n- Cohort 3: *September 20th - October 17th* (hitting-our-stride DAO fall)\n\n\n\n## 📋 Application process\n\nThe residency program is open to anyone creating independently and sharing their work online.\n\nFor each cohort, we will run an application & voting process similar to Mirror's $WRITE RACE. People interested in a residency will submit a short proposal, up to 250 words, outlining how they would spend a month of time at Creator Cabins. \n\n$CABIN holders will be able to cast as many votes as the number of tokens they have. Votes can be split among multiple proposals. At the end of the voting period, the top four proposals will receive a one-month residency for the designated cohort.\n\n**We will start accepting applications for Cohort 1 in late June. [Sign up here for updates on the application process.](https://creatorcabins.ck.page/9e628caec5)**\n\n\n\n## 💰 Budget\n\n### 💸 Costs: 5 ETH + 1500 $CABIN per cohort\n\nWe currently have 16 ETH and 16k $CABIN in the treasury. This is enough for us to cover three 4-week cohorts at a budget of 5 ETH + 1500 $CABIN per cohort. This will cover the following expenses:\n\n- *1 ETH per week*: renting out the full Creator Cabins property (including both cabins, high-speed internet, utilities, and cleaning). The market rate for the cabins is more than this, but we know a guy 😉\n- *0.25 ETH + 250 $CABIN*: ETH provided at beginning of the program as a stipend for each creator in the cohort to cover food and gas costs to mint the end-of-program NFT. $CABIN provided to each creator after they mint their post-program NFT.\n- *500 $CABIN*: stipend for the camp counselor for each cohort, provided at the end of the month. \n\n\n### 🪂 Airdrop\n\nWe are also planning to airdrop 500 $CABIN each to @p_millerd and @kadlac for their OG contributions before we even officially set up the crowdfund:\n\nhttps://twitter.com/kadlac/status/1394149045757571078\n\n\n## 🔮 Long-term plans\n\nWe are [leaving the crowdfund open](https://creators.mirror.xyz/20Eyc57rknNJYL9vJa11zvupU_MXP7NZJUADTzTlCjQ) so that we can continue to raise additional funds for future cohorts and allow new members to join the DAO. We also hope to raise additional sustainable funds for the program through splits on sales of NFTs produced by residents. \n\nWhile the first use-case for this DAO is creator residencies, we will learn from this experiment and continue to find ways to sustainably fund independent online creators and develop DAO-based governance models for physical spaces.\n\nWe would love your feedback and contributions to this project! Slide into our DMs or tweet **@creatorcabins**, **@jonathanhillis**, **@jongold**, and **@ZFleischmann**. If you're a $CABIN hodler, you can now [join our Discord server](https://discord.gg/N6hVmFygjR) for discussion and governance. \n\nThank you to the 89+ members of CabinDAO—[we'll see you in Discord!](https://discord.gg/N6hVmFygjR)\n\n[CabinDAO](crowdfund://0x94515e4f6fabad73C8bCdd8cd42f0b5C037E2c49?network=homestead)", "timestamp": 1623277273, "digest": "eS6lYIBycHEZmtGpRGwA9lCb3Y_8G4pddHWSKtmWP_I", "contributor": "0xbeC26FFa12c90217943D1b2958f60A821aE6E549"}
{"id": "7i4ke0lNJ3-6okdxd3FQlnVDysKkftb8rIvO0dsR3W4", "title": "Crypto governance and vote farming", "body": "The concept of yield farming has reorganized the DeFi landscape. When you deposit money into a protocol, you can earn some tokens or funds the longer your money is there.\n\nDeFi protocols aggressively compete with each other to offer users the most bang for their buck. Often, users choose where to deposit funds based on a combination of where they can get the highest yield and where they can earn the tokens they care most about.\n\nWill crypto governance reach a similar state?\n\nAs UNI and COMP token prices have increased, the price of meaningful participation in governance decisions has already risen far beyond the reach of most individuals. I believe we're heading towards a future where participants in crypto governance will congregate together to control larger amounts of votes as a group, rather than directly participating as individuals.\n\nAs a result, I think it's highly likely that protocols like Uniswap and Compound reach a state where their governance landscape is made up of several powerful factions, each with its own governance token and constituency which is coordinating around protocol-level decisions. These factions will compete with each other for voting power the way political parties do, and therefore will most likely be open to anyone.\n\nFor regular people, gaining power within one of these factions will be the highest-leverage way to have a voice in the broader protocol governance landscape. In such a world, I think we'll see a mechanism emerge for **vote farming**.\n\nWhen you delegate your UNI or COMP votes to a faction or political group, you'll earn more of that faction's sub-governance tokens the longer your votes are delegated there.\n\nIndividuals will begin to delegate their votes to different factions based on who is offering the best rates (as defined by the ratio of sub-governance token yield to that faction's top-level voting power), and more importantly, whose political agenda is aligned with their values.\n\nToday, we're still pretty far away from this kind of reality, but things tend to move pretty quickly in crypto, and my personal goal is to set good precedents in this regard.", "timestamp": 1623282782, "digest": "kGZwXUIfzSyCKktjkoLvehKgB_rZREf9tqezzp48_so", "contributor": "0xB0623C91c65621df716aB8aFE5f66656B21A9108"}
{"id": "YTePeMKw7XcxyFb8oXe2BNF-GrUcJm8V8KXt4ScHCek", "title": "Test entry NFT minting", "body": "test\n\n[Token #1339](auction://0x7c2668bd0d3c050703cecc956c11bd520c26f7d4?network=rinkeby&tokenId=1339&auctionId=0xa762ff057193cd029cdc522e507fc85eb968b43174b36931ea0bc415c9ba04f9)", "timestamp": 1623288160, "digest": "vbA1StwywLtO7kFhbcZ0gO_EURYJBupVqBg5sYEdlac", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0x84fbcbb2bccfe2f94e4f1031b5eeaadf3ba7a088fe33278160f006aa4ae9048c\"}"}
{"id": "-UjctB1IUaob5QYF3BOYfM5ziZ0GIyrU0S0iNJXwpls", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ Raffle Link added soon\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Giveaway link added soon\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ Giveaway link added soon\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ Giveaway link added soon\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ Giveaway link added soon\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway link added soon\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ Giveaway link added soon\n\nQuality, consistency and thoughtfulness wrapped into a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1623294726, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "tRBgMe1nxeVjDVypQZCT5T114wNVQTiK_4zqIeuNqNA", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\n**Read on for more info on how and where to win a copy!**\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\nIf you do win, please note that we will require a physical address to mail it to you. \n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ Raffle Link added soon\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Giveaway link added soon\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ Giveaway link added soon\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ Giveaway link added soon\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ Giveaway link added soon\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway link added soon\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ Giveaway link added soon\n\nQuality, consistency and thoughtfulness wrapped into a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1623295369, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "inC2OkpTuZF1IgX2xrKaGdLXcu2i9REClHFoZr1loow", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. If you're just learning about this project, it's a collection of perspectives from 46 Beacon Chain researchers and implementers that made everything possible, wrapped in delightful graphics. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\n**Read on for more info on how and where to win a copy!**\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\nIf you do win, please note that we will require a physical address to mail it to you. \n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ Raffle Link added soon\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Giveaway link added soon\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ Giveaway link added soon\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ Giveaway link added soon\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ Giveaway link added soon\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway link added soon\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ Giveaway link added soon\n\nQuality, consistency and thoughtfulness wrapped into a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1623295681, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "uunrJUD9YFMkE9p6hpZ16ZzT5sqIFmF7JD8vlLjrPew", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. If you're just learning about this project, it's a collection of perspectives from 46 Beacon Chain researchers and implementers that made everything possible, wrapped in delightful graphics. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\n**Read on for more info on how and where to win a copy!**\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\nIf you do win, please note that we will require a physical address to mail it to you. \n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ Raffle Link added soon\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Giveaway link added soon\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ Giveaway link added soon\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ Giveaway link added soon\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ Giveaway link added soon\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway link added soon\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ Giveaway link added soon\n\nQuality, consistency and thoughtfulness wrapped in\n a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language, so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1623295851, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "-Q1Dc7tsmZQvGDSVp6nOOt5-zgFLgl_XUAAkcFolC8E", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. \n\nIf you're just learning about this project, it's a collection of perspectives from 46 Beacon Chain researchers and implementers, wrapped in delightful graphics. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\n**Read on for more info on how and where to win a copy!**\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\nIf you do win, please note that we will require a physical address to mail it to you. \n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ Raffle Link added soon\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Giveaway link added soon\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ Giveaway link added soon\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ Giveaway link added soon\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ Giveaway link added soon\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway link added soon\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ Giveaway link added soon\n\nQuality, consistency and thoughtfulness wrapped in\n a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language, so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1623296467, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "GY0jPOLCkdlc527sQeyMvXdS4GdWi3-yxKwPYAoXias", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. \n\nIf you're just learning about this project, it's a collection of perspectives from 46 Beacon Chain researchers and implementers, wrapped in delightful graphics. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\n**Read on for more info on how and where to win a copy!**\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\nIf you do win, please note that we will require a physical address to mail it to you. \n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ Giveaway info added soon\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Giveaway info added soon\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ Giveaway info added soon\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ Giveaway info added soon\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ Giveaway info added soon\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway info added soon\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ Giveaway info added soon\n\nQuality, consistency and thoughtfulness wrapped in\n a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language, so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1623296561, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "O7ohXxkngsU11qv_1g1s47BZ3eCkkW4WV375IVt5zhA", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. \n\nIf you're just learning about this project, it's a collection of perspectives from 46 Beacon Chain researchers and implementers, wrapped in delightful graphics. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\n**Read on for more info on how and where to win a copy!**\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\nIf you do win, please note that we will require a physical address to mail it to you. \n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ Giveaway info added soon\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Giveaway info added soon\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ Giveaway info added soon\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ Giveaway info added soon\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ Giveaway info added soon\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway info added soon\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ Giveaway info added soon\n\nQuality, consistency and thoughtfulness wrapped in a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language, so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1623331526, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "DiO7JCUQsW8l0m-gymUs0RJCQB1tOOQZP-IfBMAiahk", "title": "$ZINE - Proof of History - Vol. 1", "body": "The $HASH project struck a unique cord both within ourselves and the community. *What is Ethereum's history?* That is something for all of us to discover and create.\n\nWith the Proof of History series, we want to highlight these mementos of our history and reward the treasure hunters in the community. Mirror's Split functionality is a beautiful way to acknowledge the curators and librarians of our world.\n\n[Token #3476](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3476)\n\n### Process\nVolume 1 of the Proof of History series is a collection of artwork from Proof of Beauty's community Snapshot vote, conducted to decide which TX would be used in the first official POB mural. These 4 transactions have historical significance to both the POB community and broader Ethereum ecosystem. Each TX is displayed in S0: GENESIS and S1: SAGA flavors of artwork. The $ZINE project was created to give back to our community and expand the $HASH-verse. Proceeds from the auction will be split between the collectors and minters. This is ground zero, the beginning of a new era for POB and our community.\n\n[Snapshot Vote](https://twitter.com/prrfbeauty/status/1382742125570318339)\n\n***\n\n![](https://images.mirror-media.xyz/publication-images/73101b95-e2f8-4f29-81c0-02bdc66b3a6d.png?height=1518&width=3036)\n\n***\n \n## The Mints\n\n### ✺ THE FIRST TX ✺\n\nOn August 7, 2015 at 3:30:33 AM UTC, an ETH presale participant sent 0.000000000000031337 ETH to a fresh address, and breathed life into the Ethereum blockchain.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x5c504ed432cb51138bcf09aa5e8a410dd4a1e204ef84bfed1be16dfba1b22060) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953926975274699741220483192166611388333031450) >\n\n- The famous [collector.eth](https://opensea.io/accounts/cryptoart) aka [@timrix](https://twitter.com/timrix) minted this tx on Jan-26-2021.\n- [LazloKovacs](https://opensea.io/accounts/LazloKovacs) purchased the piece for [50 ETH](https://etherscan.io/tx/0x89e37f4f5a501e0fcdf7f934c97044f4a882e64cfc625764f76a8134ec58235e) on Feb-25-2021.\n- POB Studio commissioned [Deanna Mosca](https://twitter.com/deanna_mosca) and [@Kofe](https://discord.gg/x4SH5pGgvj) to create a [mural](https://www.pob.studio/hash/mural) of the S0 artwork to commemorate this foundational moment for the Ethereum community and the $HASH project. \n\n[50 ETH Sale](https://twitter.com/timrix/status/1365006217018400770)\n\n[Bunbury Australia](https://twitter.com/deanna_mosca/status/1394231861388341251)\n\n> A memento of the beginning, the genesis.\n***\n\n### ✺ THE FIRST CONTRACT ✺\n\nThe first ever successful Creation of a smart contract on the Ethereum blockchain. The first step in the past towards the futuristic present we live in.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x31ded263506ea36e6ea777efc2c39a999e6fba4f4d338c7313af6aac6d9bf3e3) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244075) >\n\n- Minted by [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) on Feb-15-2021, this $HASH is Part 1 of 2. The second piece is the [1st nested smart contract creation](https://hash.pob.studio/art/0xd3961e340049c8becf92e3b24372355bee334dd5d3ef5434e55791f560287828). Both of these significant transactions were validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) is an avid hunter of $HASH artwork and has 2 unique $HASH finds in his collection. A great example of the duality of beauty and history.\n\n[THE FIRST CONTRACT](https://twitter.com/ash_bhimasani/status/1402758423578558467)\n***\n\n### ✺ BEGIN ETH2 ✺\n\nThe first transaction of 32 ETH sent to the ETH2 deposit contract. This is the start of a bright, unknown future. History in the making.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x404d8e109822ce448e68f45216c12cb051b784d068fbe98317ab8e50c58304ac) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101243418) >\n\n- Minted by [0x581b...97b1](https://hash.pob.studio/collection/0x581b3d2cdcd3911d9bbf503550c3f6c1f3c997b1) on Feb-10-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n\n[BEGIN ETH2](https://twitter.com/ash_bhimasani/status/1402759919737135109)\n***\n\n### ✺ BEGIN $HASH ✺\n\nThe transaction where the Proof of Beauty project was born. This is the contract creation for the GENESIS season of $HASH.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x6e5fa6686803a5c825b3b03174b2c4a433fdc1b354f05078396b292a78b49879) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244150) >\n\n- Minted by [zacmcc.eth](https://hash.pob.studio/collection/0x7d2855c1472266601af0f8206b0e12a87d934760) on Feb-24-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [PereGuerra](https://opensea.io/PereGuerra) purchased the piece for [6 ETH](https://etherscan.io/tx/0x1ef21f517428f8718ee409406735961cdb9513877d119459bbb408cd32549a41) on Mar-01-2021.\n\n[BEGIN $HASH](https://twitter.com/ash_bhimasani/status/1402760153288556551)\n***\n\n## What’s Next?\nThis is the first of many zines we hope to create with the help of the community. Follow us on Twitter and join our Discord to become a #Historian! We are in the process of expanding the $HASH-verse. So far we dropped our first Mural and Zine as a way to show off our amazing community and give back to $HASH holders. We will continue to make more of these while gearing up for physical items + new features.\n\nStay tuned to see how #OurHistory unfolds!\n\n## About Proof of Beauty\nWe are an experimental digital experience [studio](https://www.pob.studio/). The blockchain is our canvas & tokens our brush.", "timestamp": 1623332304, "digest": "vj7zYf49rLoii2tGT6i09n1crN__oCnEX1zABGE4uB0", "contributor": "0x9428ca8b5fe52C33BD0BD7222d719d788B6467F4"}
{"id": "r_Rx9gXeE5lFWTd5rnSms7_OsflDldkguRjcYekcl20", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. \n\nIf you're just learning about this project, it's a collection of perspectives from 46 Beacon Chain researchers and implementers, wrapped in delightful graphics. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\n**Read on for more info on how and where to win a copy!**\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\nIf you do win, please note that we will require a physical address to mail it to you. Limit one giveaway per identity.\n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ Giveaway info added soon\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Giveaway info added soon\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ Giveaway info added soon\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ Giveaway info added soon\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ Giveaway info added soon\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway info added soon\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ Giveaway info added soon\n\nQuality, consistency and thoughtfulness wrapped in a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language, so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1623332872, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "HXHXYx6vyFonapO-vMJzMn1fWTsy67DgDY-E15X72A0", "title": "TEST Crowdfund: $DIRT, the first NFT-driven newsletter \n", "body": "![](https://images.mirror-media.xyz/publication-images/07be1d82-3233-46bb-8669-eecc90691232.jpeg?height=506&width=1012&size=medium)\n\n## **Summary**\n\nWith this crowdfund, we’re pioneering a way to fund media through NFTs, with a newsletter built on social tokens and NFT sales. It follows the guidelines I described in my [previous sketch on Mirror](https://air.mirror.xyz/bTAwqOAe2vG6UIq5KSPrEho_VbrfDxcswm0ZuUtPGAc). The plan is to turn [Dirt](https://dirt.substack.com), a daily newsletter on streaming and entertainment that I've been developing, into a major voice on digital culture. \n\nTo participate, you can buy Dirt’s new animated NFTs of the [newsletter’s mascot, Dirty](https://dirt.substack.com/p/dirt-introducing-dirty-lockdown-blues). You’ll get the NFT art as well as an airdropped commensurate number of $DIRT-S1 tokens as a reward. There are three versions of NFT: a Pea Green edition of 100, a Pearl Pink edition of 30, and a special Rainbow Wave, which is a single NFT. The 100 edition will get a reward of 50 $DIRT-S1 tokens, the 30 edition 200, and the unique NFT will be auctioned off and the winner will be rewarded 1000 tokens. \n\nThe goal is to crowdfund about 10-15ETH total with NFT edition sales. The funding will go toward paying for editors, writers, artists, and environmental offsets for the entire project. At the end of season 1 of Dirt, we’ll release another round of Dirty NFTs as prizes for $DIRT-S1 holders. Crowdfunders will also get transparent reports on the publication's growth and progress, as well as input on what to cover, writing opportunities, and early access to later NFT and token drops, with conversations held over a listserv. The NFT editions are below, with a detailed explanation of the plan. \n\nBy supporting this project, you’ll help create the first NFT-driven newsletter and demonstrate what is possible with NFT culture, with a front-row seat to the results.\n\n## **Support the project**\n\n### Dirty S1 Rainbow Wave\n*1/1 — Auction at 1ETH*\nReward of 1000 $DIRT-S1 tokens per NFT\n\n### Dirty S1 Pearl Pink\n*30/30 — 0.2ETH*\nReward of 200 $DIRT-S1 tokens per NFT\n— *Pearl Pink buyers will also have their name listed and Twitter handle or website linked in the footer of all Dirt newsletters as Season 1 supporters.*\n\n### Dirty S1 Pea Green\n*100/100 — 0.05ETH*\nReward of 50 $DIRT-S1 tokens per NFT\n\n*All NFT art by [Mark Costello](http://markalancostello.com/)*\n\n[Token #3309](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3309)\n\n[Dirty S1 Pearl Pink](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=3)\n\n*Pearl Pink buyers will also have their name listed and Twitter handle or website linked in the footer of all Dirt newsletters as Season 1 supporters.*\n\n[Dirty S1 Pea Green](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=2)\n\n\n## **What is Dirt?**\n\n![](https://images.mirror-media.xyz/publication-images/c25ede72-4603-4ba2-b487-34402cfd07a0.jpg?height=1074&width=4400)\n\n[Dirt](dirt.substack.com) is a free daily morning newsletter about entertainment broadly, covering streaming TV; YouTube and TikTok; and any kind of interesting digital culture, including NFTs and digital assets. Popular past editions include [TikTok and suburban aesthetics](https://dirt.substack.com/p/dirt-tiktok-and-suburban-gothic) and a [review of a podcast about pasta](https://dirt.substack.com/p/dirt-the-pasta-is-content). The newsletter is anchored by me ([Kyle Chayka](http://kylechayka.com), author and writer for The New Yorker and many other publications as well as co-founder of [Study Hall](studyhall.xyz), a small media company) with contributions from writer [Daisy Alioto](https://www.daisyalioto.com/) (Vox, Paris Review, Longreads) and other freelance writers.\n\nSince launching in December 2021, Dirt has gained 3,600+ organic newsletter subscribers and has been linked to by websites from the Financial Times to Axios and Slate. It is now an established publication in the media landscape, tweeted and shared by influential writers. It has a 40%+ open rate and gets 3,000+ views daily. Readers include executives from Netflix and HBO.\n\n![](https://images.mirror-media.xyz/publication-images/aa2f806d-33bf-4614-a4b0-e7aed6de8fb5.png?height=1150&width=1490)\n\n*Dirt's subscriber growth*\n\nDirt’s tone is accessible and educational, building a broader awareness of digital culture through smart criticism and analysis. It’s about creating engaged entertainment consumers and hosting good dialogue in a digestible format. It is developing an active community of both writers and readers — imagine [The Paris Review](https://www.theparisreview.org/) of digital / streaming culture. Traditional subscription funding supports content that many people already agree on; NFT crowdfunding patronage systems will support more radical and innovative content like Dirt. \n\nThe archive of Dirt posts can be [found here](https://dirt.substack.com/). \n\n![](https://images.mirror-media.xyz/publication-images/f9c17e0a-3474-4662-9c59-18a44a7d276f.png?height=1348&width=1582)\n\n## Dirt growth plan\n\nWith the funding from the new NFT sales, Dirt will commission new freelance contributions, grow the email list, and aggressively cover digital culture, including NFTs, video games, [Metaverse topics](https://www.matthewball.vc/all/themetaverse), and the evolving nature of entertainment on the internet as we move toward Web3.0. This content will create dialogue and education around these topics, developing connoisseurship of digital assets and an aspirational culture. \n\nAt the same time, Dirt will produce a growing content range of NFTs, based on branding assets like our new mascot, Dirty, who was previously commissioned from the artist [Jason Adam Katzenstein](https://www.newyorker.com/contributors/jason-adam-katzenstein) (cartoonist for The New Yorker, author, and illustrator). Here is one of our initial art pieces: \n\n![](https://images.mirror-media.xyz/publication-images/469c62cd-d9b8-416c-80a5-c5012020675c.png?height=500&width=500)\n\nDirty is like the avatar of Dirt: they’re a formless, muddy blob that floats around the internet. What will Dirty do next? Dress up like a TV show character? Become animated or CGI? Imagine a kind of Pokemon or Cryptopunks-esque culture around the publication’s mascot, which gets translated into NFTs and other assets, which fund the publication over time, accruing value. (It’s like if The New Yorker’s [Eustace Tilley](https://www.newyorker.com/magazine/2005/02/14/mystery-man-2) were an NFT.)\n\nOur new animated NFTs, which come in several colorways, are created by the interactive designer [Mark Costello](http://markalancostello.com/), who will produce more animations in the future. \n\nDirt’s content will roll out in seasons: periods of a month or a few months in which the content is fully funded and is branded as such. This first Mirror NFT sale and token creation won’t fund Dirt in perpetuity, but it’s an experiment to see how NFTs can be used to create a specific batch of content and create community in a publication for anyone who wants to participate — a sense of [digital belonging](https://air.mirror.xyz/5A16bvvS2IJK7fVVNb2GwrrEcyey2B4UiH2l1DI_Y2I) for supporters, as I wrote about previously on Mirror, and a chance to pioneer a publication from NFT culture. \n\n— For previous examples of how crowdfunding editorial projects works, see Emily Segal’s [$NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg) and [$GENERALIST](https://generalist.mirror.xyz/1T0h7VGDcECJuifK4TPDfRoUQ3zaO_tPwdZV-dtnNqw). An explanation of [token holder options post-NFT sale is here](https://docs.google.com/document/d/1XO65q7UjVePv7XOu5DEvksaEJTXPozjsTc_toJLmh3A/edit). A clear overall description of the model [is here](https://twitter.com/mariodgabriele/status/1378032448664170505). \n\nFunders will be able to contribute to the success of the project and will be encouraged to participate, give feedback, grow the email list, write for the publication, etc. \n\n## **NFT sales and $DIRT-S1 token**\n\nDirt NFTs are available now in two editions, one of 100 for .05 ETH and one of 30 for .2 ETH. The auction for the singular NFT starts at 1 ETH. Each NFT is in a different colorway: Pea Green, Pearl Pink, and Rainbow Wave. These colors and this animation will never be reused. \n\n![](https://images.mirror-media.xyz/publication-images/5ed927b1-a2ba-4777-a43c-1d0e6bcc7e78.png?height=208&width=884)\n\nSeparately, the **$DIRT-S1 token** will be created and rewarded to backers based on their NFT purchases. Tokens will be minted at a rate of 1000 $DIRT-S1 to 1 ETH of crowdfunding and airdropped to the NFT buyers after the crowdfund ends. (The winner of the auction will receive 1000 $DIRT-S1 no matter what the final price is.) On top of that, 25% extra $DIRT-S1 will be minted to stay with Dirt to reward contributors. \n\nThe total 10 ETH goal will provide funding for Dirt’s first season of content, including writing, editing, freelancers, marketing, and NFT art. If the net funding is higher, season 1 will last for a longer time and grow the publication further.\n\nAt the end of the season of content, another wave of NFT editions will be released to wrap up season 1. Token holders will have access to rewards from those NFTs if they desire to exchange the tokens, and more NFT sales will fund the development of the next round of Dirt NFT expansion: editorial planning, commissioning more art, and environmental offsets. \n\nFuture rounds of crowdfunding will be based on season-themed tokens, like $DIRT-S2, etc (similar to magazine volumes, which are numbered by year and edition). When the publication is on solid footing, I will create a final $DIRT token and airdrop it proportionally to all holders of all previous tokens as a reward. Early token holders will be given preference in all Dirt token and NFT releases.\n\n![](https://images.mirror-media.xyz/publication-images/1aed684b-ee11-4a10-91e0-b0e2b531992b.jpg?height=500&width=500)\n\n*Art by Jason Adam Katzenstein*\n\nThe purpose of Dirt is to create both an editorial and a visual universe. The publication will coexist with the body of Dirty-focused artwork, which will expand as we keep publishing, collaborating with new artists and designers. This is what will drive the Dirt NFT market and continue funding the publication, plus creating a fun new form of content. \n\n## **10-15ETH Budget**\n\n- **`40%`** commissioning freelance content\n- **`25%`** founders editing and writing \n- **`25%`** art & NFT development\n- **`10%`** marketing & partnerships\n\n**Season 1 runtime**: 1-3 months\n\n## **About the founders**\n\nI am well-equipped to run Dirt as a small publication having already executed it for several months, using my own media-industry background. I have written for many major [magazines and websites](kylechayka.com) (New Yorker, New York Times, Vox, etc) and also co-founded and run [Study Hall](studyhall.xyz), a subscription media newsletter company and community with 6,000+ paid subscribers and a staff of 5. It will be simple for me to take this initial funding and execute the season of content, as well as lead the publication as a business going forward. \n\nSome of my popular past essays: \n\n- [Ambient Television](https://www.newyorker.com/culture/cultural-comment/emily-in-paris-and-the-rise-of-ambient-tv) (The New Yorker)\n- [How Do You Describe TikTok?](https://kylechayka.substack.com/p/essay-how-do-you-describe-tiktok) (personal newsletter) \n- [Welcome to AirSpace](https://www.theverge.com/2016/8/3/12325104/airbnb-aesthetic-global-minimalism-startup-gentrification) (The Verge) \n\nI’m excited to use my experience in traditional media spaces to pioneer something new and different in the NFT ecosystem. \n\n## Platform Approach\n\nDirt has already grown on Substack, which is useful for its email functionality and fully developed CMS, as well as its familiarity for readers — Dirt now has organic growth there. Future Dirt content will be cross-posted on Substack and Mirror, where it will also come with updates about the publication and NFT business models. \n\nOn Mirror, I’ll develop approaches for integrating NFTs into editorial and creating a connection between NFTs and storytelling, with the goal of eventually moving the entire project onto Mirror. Traditional paywalls will be avoided in favor of patronage and crowdfunding. The content will also create more context for NFT adoption, exposing Substack readers to the mechanics and culture of NFTs and social tokens. \n\n## Business Model Going Forward\n\n1. Crowdfund ETH via NFT editions.\n2. Create editorial and NFT content.\n3. Grow subscriber base.\n4. Drive more demand for Dirt digital assets.\n5. Sell new NFTs and tokens in future crowdfunds.\n6. Repeat until market for Dirt assets is self-sustaining.\n\nIf this initial NFT model doesn’t work I am committed to developing other options and continuing the relationship with token holders.\n\n## Contact\n\nEmail me at [chaykak@gmail.com](mailto:chaykak@gmail.com) if you have any questions or feedback about the project!\n\n*Disclaimer: $DIRT NFTs and tokens do not represent any form of legal equity in any financial entity; they are crowdfunding rewards for contributing the funds to pay for future Dirt newsletter content and development. No financial gain is implied or guaranteed, only ownership of the NFTs and tokens for supporters.*", "timestamp": 1623334942, "digest": "lmV9Dxeos9HvKSu0BKY9pqARK2vAlPXhrNMt68E4GkI", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
{"id": "icUMg4HFinMurVJ9TZ1d8msb9h7WZGqVdjMpaNKHyTE", "title": "Crowdfund: $DIRT, the first NFT-driven newsletter \n", "body": "![](https://images.mirror-media.xyz/publication-images/07be1d82-3233-46bb-8669-eecc90691232.jpeg?height=506&width=1012&size=medium)\n\n## **Summary**\n\nWith this crowdfund, we’re pioneering a way to fund media through NFTs, with a newsletter built on social tokens and NFT sales. It follows the guidelines I described in my [previous sketch on Mirror](https://air.mirror.xyz/bTAwqOAe2vG6UIq5KSPrEho_VbrfDxcswm0ZuUtPGAc). The plan is to turn [Dirt](https://dirt.substack.com), a daily newsletter on streaming and entertainment that I've been developing, into a major voice on digital culture. \n\nTo participate, you can buy Dirt’s new animated NFTs of the [newsletter’s mascot, Dirty](https://dirt.substack.com/p/dirt-introducing-dirty-lockdown-blues). You’ll get the NFT art as well as an airdropped commensurate number of $DIRT-S1 tokens as a reward. There are three versions of NFT: a Pea Green edition of 100, a Pearl Pink edition of 30, and a special Rainbow Wave, which is a single NFT. The 100 edition will get a reward of 50 $DIRT-S1 tokens, the 30 edition 200, and the unique NFT will be auctioned off and the winner will be rewarded 1000 tokens. \n\nThe goal is to crowdfund about 10-15ETH total with NFT edition sales. The funding will go toward paying for editors, writers, artists, and environmental offsets for the entire project. At the end of season 1 of Dirt, we’ll release another round of Dirty NFTs as prizes for $DIRT-S1 holders. Crowdfunders will also get transparent reports on the publication's growth and progress, as well as input on what to cover, writing opportunities, and early access to later NFT and token drops, with conversations held over a listserv. The NFT editions are below, with a detailed explanation of the plan. \n\nBy supporting this project, you’ll help create the first NFT-driven newsletter and demonstrate what is possible with NFT culture, with a front-row seat to the results.\n\n## **Support the project**\n\n### Dirty S1 Rainbow Wave\n*1/1 — Auction at 1ETH*\nReward of 1000 $DIRT-S1 tokens per NFT\n\n### Dirty S1 Pearl Pink\n*30/30 — 0.2ETH*\nReward of 200 $DIRT-S1 tokens per NFT\n— *Pearl Pink buyers will also have their name listed and Twitter handle or website linked in the footer of all Dirt newsletters as Season 1 supporters.*\n\n### Dirty S1 Pea Green\n*100/100 — 0.05ETH*\nReward of 50 $DIRT-S1 tokens per NFT\n\n*All NFT art by [Mark Costello](http://markalancostello.com/)*\n\n[Token #3309](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3309)\n\n[Dirty S1 Pearl Pink](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=3)\n\n*Pearl Pink buyers will also have their name listed and Twitter handle or website linked in the footer of all Dirt newsletters as Season 1 supporters.*\n\n[Dirty S1 Pea Green](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=2)\n\n\n## **What is Dirt?**\n\n![](https://images.mirror-media.xyz/publication-images/c25ede72-4603-4ba2-b487-34402cfd07a0.jpg?height=1074&width=4400)\n\n[Dirt](dirt.substack.com) is a free daily morning newsletter about entertainment broadly, covering streaming TV; YouTube and TikTok; and any kind of interesting digital culture, including NFTs and digital assets. Popular past editions include [TikTok and suburban aesthetics](https://dirt.substack.com/p/dirt-tiktok-and-suburban-gothic) and a [review of a podcast about pasta](https://dirt.substack.com/p/dirt-the-pasta-is-content). The newsletter is anchored by me ([Kyle Chayka](http://kylechayka.com), author and writer for The New Yorker and many other publications as well as co-founder of [Study Hall](studyhall.xyz), a small media company) with contributions from writer [Daisy Alioto](https://www.daisyalioto.com/) (Vox, Paris Review, Longreads) and other freelance writers.\n\nSince launching in December 2021, Dirt has gained 3,600+ organic newsletter subscribers and has been linked to by websites from the Financial Times to Axios and Slate. It is now an established publication in the media landscape, tweeted and shared by influential writers. It has a 40%+ open rate and gets 3,000+ views daily. Readers include executives from Netflix and HBO.\n\n![](https://images.mirror-media.xyz/publication-images/aa2f806d-33bf-4614-a4b0-e7aed6de8fb5.png?height=1150&width=1490)\n\n*Dirt's subscriber growth*\n\nDirt’s tone is accessible and educational, building a broader awareness of digital culture through smart criticism and analysis. It’s about creating engaged entertainment consumers and hosting good dialogue in a digestible format. It is developing an active community of both writers and readers — imagine [The Paris Review](https://www.theparisreview.org/) of digital / streaming culture. Traditional subscription funding supports content that many people already agree on; NFT crowdfunding patronage systems will support more radical and innovative content like Dirt. \n\nThe archive of Dirt posts can be [found here](https://dirt.substack.com/). \n\n![](https://images.mirror-media.xyz/publication-images/f9c17e0a-3474-4662-9c59-18a44a7d276f.png?height=1348&width=1582)\n\n## Dirt growth plan\n\nWith the funding from the new NFT sales, Dirt will commission new freelance contributions, grow the email list, and aggressively cover digital culture, including NFTs, video games, [Metaverse topics](https://www.matthewball.vc/all/themetaverse), and the evolving nature of entertainment on the internet as we move toward Web3.0. This content will create dialogue and education around these topics, developing connoisseurship of digital assets and an aspirational culture. \n\nAt the same time, Dirt will produce a growing content range of NFTs, based on branding assets like our new mascot, Dirty, who was previously commissioned from the artist [Jason Adam Katzenstein](https://www.newyorker.com/contributors/jason-adam-katzenstein) (cartoonist for The New Yorker, author, and illustrator). Here is one of our initial art pieces: \n\n![](https://images.mirror-media.xyz/publication-images/469c62cd-d9b8-416c-80a5-c5012020675c.png?height=500&width=500)\n\nDirty is like the avatar of Dirt: they’re a formless, muddy blob that floats around the internet. What will Dirty do next? Dress up like a TV show character? Become animated or CGI? Imagine a kind of Pokemon or Cryptopunks-esque culture around the publication’s mascot, which gets translated into NFTs and other assets, which fund the publication over time, accruing value. (It’s like if The New Yorker’s [Eustace Tilley](https://www.newyorker.com/magazine/2005/02/14/mystery-man-2) were an NFT.)\n\nOur new animated NFTs, which come in several colorways, are created by the interactive designer [Mark Costello](http://markalancostello.com/), who will produce more animations in the future. \n\nDirt’s content will roll out in seasons: periods of a month or a few months in which the content is fully funded and is branded as such. This first Mirror NFT sale and token creation won’t fund Dirt in perpetuity, but it’s an experiment to see how NFTs can be used to create a specific batch of content and create community in a publication for anyone who wants to participate — a sense of [digital belonging](https://air.mirror.xyz/5A16bvvS2IJK7fVVNb2GwrrEcyey2B4UiH2l1DI_Y2I) for supporters, as I wrote about previously on Mirror, and a chance to pioneer a publication from NFT culture. \n\n— For previous examples of how crowdfunding editorial projects works, see Emily Segal’s [$NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg) and [$GENERALIST](https://generalist.mirror.xyz/1T0h7VGDcECJuifK4TPDfRoUQ3zaO_tPwdZV-dtnNqw). An explanation of [token holder options post-NFT sale is here](https://docs.google.com/document/d/1XO65q7UjVePv7XOu5DEvksaEJTXPozjsTc_toJLmh3A/edit). A clear overall description of the model [is here](https://twitter.com/mariodgabriele/status/1378032448664170505). \n\nFunders will be able to contribute to the success of the project and will be encouraged to participate, give feedback, grow the email list, write for the publication, etc. \n\n## **NFT sales and $DIRT-S1 token**\n\nDirt NFTs are available now in two editions, one of 100 for .05 ETH and one of 30 for .2 ETH. The auction for the singular NFT starts at 1 ETH. Each NFT is in a different colorway: Pea Green, Pearl Pink, and Rainbow Wave. These colors and this animation will never be reused. \n\n![](https://images.mirror-media.xyz/publication-images/5ed927b1-a2ba-4777-a43c-1d0e6bcc7e78.png?height=208&width=884)\n\nSeparately, the **$DIRT-S1 token** will be created and rewarded to backers based on their NFT purchases. Tokens will be minted at a rate of 1000 $DIRT-S1 to 1 ETH of crowdfunding and airdropped to the NFT buyers after the crowdfund ends. (The winner of the auction will receive 1000 $DIRT-S1 no matter what the final price is.) On top of that, 25% extra $DIRT-S1 will be minted to stay with Dirt to reward contributors. \n\nThe total 10 ETH goal will provide funding for Dirt’s first season of content, including writing, editing, freelancers, marketing, and NFT art. If the net funding is higher, season 1 will last for a longer time and grow the publication further.\n\nAt the end of the season of content, another wave of NFT editions will be released to wrap up season 1. Token holders will have access to rewards from those NFTs if they desire to exchange the tokens, and more NFT sales will fund the development of the next round of Dirt NFT expansion: editorial planning, commissioning more art, and environmental offsets. \n\nFuture rounds of crowdfunding will be based on season-themed tokens, like $DIRT-S2, etc (similar to magazine volumes, which are numbered by year and edition). When the publication is on solid footing, I will create a final $DIRT token and airdrop it proportionally to all holders of all previous tokens as a reward. Early token holders will be given preference in all Dirt token and NFT releases.\n\n![](https://images.mirror-media.xyz/publication-images/1aed684b-ee11-4a10-91e0-b0e2b531992b.jpg?height=500&width=500)\n\n*Art by Jason Adam Katzenstein*\n\nThe purpose of Dirt is to create both an editorial and a visual universe. The publication will coexist with the body of Dirty-focused artwork, which will expand as we keep publishing, collaborating with new artists and designers. This is what will drive the Dirt NFT market and continue funding the publication, plus creating a fun new form of content. \n\n## **10-15ETH Budget**\n\n- **`40%`** commissioning freelance content\n- **`25%`** founders editing and writing \n- **`25%`** art & NFT development\n- **`10%`** marketing & partnerships\n\n**Season 1 runtime**: 1-3 months\n\n## **About the founders**\n\nI am well-equipped to run Dirt as a small publication having already executed it for several months, using my own media-industry background. I have written for many major [magazines and websites](kylechayka.com) (New Yorker, New York Times, Vox, etc) and also co-founded and run [Study Hall](studyhall.xyz), a subscription media newsletter company and community with 6,000+ paid subscribers and a staff of 5. It will be simple for me to take this initial funding and execute the season of content, as well as lead the publication as a business going forward. \n\nSome of my popular past essays: \n\n- [Ambient Television](https://www.newyorker.com/culture/cultural-comment/emily-in-paris-and-the-rise-of-ambient-tv) (The New Yorker)\n- [How Do You Describe TikTok?](https://kylechayka.substack.com/p/essay-how-do-you-describe-tiktok) (personal newsletter) \n- [Welcome to AirSpace](https://www.theverge.com/2016/8/3/12325104/airbnb-aesthetic-global-minimalism-startup-gentrification) (The Verge) \n\nI’m excited to use my experience in traditional media spaces to pioneer something new and different in the NFT ecosystem. \n\n## Platform Approach\n\nDirt has already grown on Substack, which is useful for its email functionality and fully developed CMS, as well as its familiarity for readers — Dirt now has organic growth there. Future Dirt content will be cross-posted on Substack and Mirror, where it will also come with updates about the publication and NFT business models. \n\nOn Mirror, I’ll develop approaches for integrating NFTs into editorial and creating a connection between NFTs and storytelling, with the goal of eventually moving the entire project onto Mirror. Traditional paywalls will be avoided in favor of patronage and crowdfunding. The content will also create more context for NFT adoption, exposing Substack readers to the mechanics and culture of NFTs and social tokens. \n\n## Business Model Going Forward\n\n1. Crowdfund ETH via NFT editions.\n2. Create editorial and NFT content.\n3. Grow subscriber base.\n4. Drive more demand for Dirt digital assets.\n5. Sell new NFTs and tokens in future crowdfunds.\n6. Repeat until market for Dirt assets is self-sustaining.\n\nIf this initial NFT model doesn’t work I am committed to developing other options and continuing the relationship with token holders.\n\n## Contact\n\nEmail me at [chaykak@gmail.com](mailto:chaykak@gmail.com) if you have any questions or feedback about the project!\n\n*Disclaimer: $DIRT NFTs and tokens do not represent any form of legal equity in any financial entity; they are crowdfunding rewards for contributing the funds to pay for future Dirt newsletter content and development. No financial gain is implied or guaranteed, only ownership of the NFTs and tokens for supporters.*", "timestamp": 1623334998, "digest": "lmV9Dxeos9HvKSu0BKY9pqARK2vAlPXhrNMt68E4GkI", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
{"id": "NSDmJ3sSRdEBvu1gEKOiMRwZ06JlKxXEHgYmqmxWmOc", "title": "$ZINE - Proof of History - Vol. 1", "body": "![](https://images.mirror-media.xyz/publication-images/ad28d2b4-c9e6-4b3c-b4fb-db4202ddc2ad.png?height=1518&width=3036)\n\nThe $HASH project struck a unique cord both within ourselves and the community. *What is Ethereum's history?* That is something for all of us to discover and create.\n\nWith the Proof of History series, we want to highlight these mementos of our history and reward the treasure hunters in the community. Mirror's Split functionality is a beautiful way to acknowledge the curators and librarians of our world.\n\n[Token #3476](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3476)\n\n### Process\nVolume 1 of the Proof of History series is a collection of artwork from Proof of Beauty's community Snapshot vote, conducted to decide which TX would be used in the first official POB mural. These 4 transactions have historical significance to both the POB community and broader Ethereum ecosystem. Each TX is displayed in S0: GENESIS and S1: SAGA flavors of artwork. The $ZINE project was created to give back to our community and expand the $HASH-verse. Proceeds from the auction will be split between the collectors and minters. This is ground zero, the beginning of a new era for POB and our community.\n\n[Snapshot Vote](https://twitter.com/prrfbeauty/status/1382742125570318339)\n\n***\n\n![](https://images.mirror-media.xyz/publication-images/73101b95-e2f8-4f29-81c0-02bdc66b3a6d.png?height=1518&width=3036)\n\n***\n \n## The Mints\n\n### ✺ THE FIRST TX ✺\n\nOn August 7, 2015 at 3:30:33 AM UTC, an ETH presale participant sent 0.000000000000031337 ETH to a fresh address, and breathed life into the Ethereum blockchain.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x5c504ed432cb51138bcf09aa5e8a410dd4a1e204ef84bfed1be16dfba1b22060) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953926975274699741220483192166611388333031450) >\n\n- The famous [collector.eth](https://opensea.io/accounts/cryptoart) aka [@timrix](https://twitter.com/timrix) minted this tx on Jan-26-2021.\n- [LazloKovacs](https://opensea.io/accounts/LazloKovacs) purchased the piece for [50 ETH](https://etherscan.io/tx/0x89e37f4f5a501e0fcdf7f934c97044f4a882e64cfc625764f76a8134ec58235e) on Feb-25-2021.\n- POB Studio commissioned [Deanna Mosca](https://twitter.com/deanna_mosca) and [@Kofe](https://discord.gg/x4SH5pGgvj) to create a [mural](https://www.pob.studio/hash/mural) of the S0 artwork to commemorate this foundational moment for the Ethereum community and the $HASH project. \n\n[50 ETH Sale](https://twitter.com/timrix/status/1365006217018400770)\n\n[Bunbury Australia](https://twitter.com/deanna_mosca/status/1394231861388341251)\n\n> A memento of the beginning, the genesis.\n***\n\n### ✺ THE FIRST CONTRACT ✺\n\nThe first ever successful Creation of a smart contract on the Ethereum blockchain. The first step in the past towards the futuristic present we live in.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x31ded263506ea36e6ea777efc2c39a999e6fba4f4d338c7313af6aac6d9bf3e3) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244075) >\n\n- Minted by [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) on Feb-15-2021, this $HASH is Part 1 of 2. The second piece is the [1st nested smart contract creation](https://hash.pob.studio/art/0xd3961e340049c8becf92e3b24372355bee334dd5d3ef5434e55791f560287828). Both of these significant transactions were validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) is an avid hunter of $HASH artwork and has 2 unique $HASH finds in his collection. A great example of the duality of beauty and history.\n\n[THE FIRST CONTRACT](https://twitter.com/ash_bhimasani/status/1402758423578558467)\n***\n\n### ✺ BEGIN ETH2 ✺\n\nThe first transaction of 32 ETH sent to the ETH2 deposit contract. This is the start of a bright, unknown future. History in the making.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x404d8e109822ce448e68f45216c12cb051b784d068fbe98317ab8e50c58304ac) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101243418) >\n\n- Minted by [0x581b...97b1](https://hash.pob.studio/collection/0x581b3d2cdcd3911d9bbf503550c3f6c1f3c997b1) on Feb-10-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n\n[BEGIN ETH2](https://twitter.com/ash_bhimasani/status/1402759919737135109)\n***\n\n### ✺ BEGIN $HASH ✺\n\nThe transaction where the Proof of Beauty project was born. This is the contract creation for the GENESIS season of $HASH.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x6e5fa6686803a5c825b3b03174b2c4a433fdc1b354f05078396b292a78b49879) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244150) >\n\n- Minted by [zacmcc.eth](https://hash.pob.studio/collection/0x7d2855c1472266601af0f8206b0e12a87d934760) on Feb-24-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [PereGuerra](https://opensea.io/PereGuerra) purchased the piece for [6 ETH](https://etherscan.io/tx/0x1ef21f517428f8718ee409406735961cdb9513877d119459bbb408cd32549a41) on Mar-01-2021.\n\n[BEGIN $HASH](https://twitter.com/ash_bhimasani/status/1402760153288556551)\n***\n\n## What’s Next?\nThis is the first of many zines we hope to create with the help of the community. Follow us on Twitter and join our Discord to become a #Historian! We are in the process of expanding the $HASH-verse. So far we dropped our first Mural and Zine as a way to show off our amazing community and give back to $HASH holders. We will continue to make more of these while gearing up for physical items + new features.\n\nStay tuned to see how #OurHistory unfolds!\n\n## About Proof of Beauty\nWe are an experimental digital experience [studio](https://www.pob.studio/). The blockchain is our canvas & tokens our brush.", "timestamp": 1623334325, "digest": "vj7zYf49rLoii2tGT6i09n1crN__oCnEX1zABGE4uB0", "contributor": "0x9428ca8b5fe52C33BD0BD7222d719d788B6467F4"}
{"id": "WDaDFYcWFmUwCFcGDZYhLPbKr7-anGJWzMegMsx3pOw", "title": "$ZINE - Proof of History - Vol. 1", "body": "![](https://images.mirror-media.xyz/publication-images/7e87d951-fd58-4cf1-9c6c-b4d474a33d46.gif?height=1012&width=2024)\n\nThe $HASH project struck a unique cord both within ourselves and the community. *What is Ethereum's history?* That is something for all of us to discover and create.\n\nWith the Proof of History series, we want to highlight these mementos of our history and reward the treasure hunters in the community. Mirror's Split functionality is a beautiful way to acknowledge the curators and librarians of our world.\n\n[Token #3476](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3476)\n\n### Process\nVolume 1 of the Proof of History series is a collection of artwork from Proof of Beauty's community Snapshot vote, conducted to decide which TX would be used in the first official POB mural. These 4 transactions have historical significance to both the POB community and broader Ethereum ecosystem. Each TX is displayed in S0: GENESIS and S1: SAGA flavors of artwork. The $ZINE project was created to give back to our community and expand the $HASH-verse. Proceeds from the auction will be split between the collectors and minters. This is ground zero, the beginning of a new era for POB and our community.\n\n[Snapshot Vote](https://twitter.com/prrfbeauty/status/1382742125570318339)\n\n***\n\n![](https://images.mirror-media.xyz/publication-images/73101b95-e2f8-4f29-81c0-02bdc66b3a6d.png?height=1518&width=3036)\n\n***\n \n## The Mints\n\n### ✺ THE FIRST TX ✺\n\nOn August 7, 2015 at 3:30:33 AM UTC, an ETH presale participant sent 0.000000000000031337 ETH to a fresh address, and breathed life into the Ethereum blockchain.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x5c504ed432cb51138bcf09aa5e8a410dd4a1e204ef84bfed1be16dfba1b22060) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953926975274699741220483192166611388333031450) >\n\n- The famous [collector.eth](https://opensea.io/accounts/cryptoart) aka [@timrix](https://twitter.com/timrix) minted this tx on Jan-26-2021.\n- [LazloKovacs](https://opensea.io/accounts/LazloKovacs) purchased the piece for [50 ETH](https://etherscan.io/tx/0x89e37f4f5a501e0fcdf7f934c97044f4a882e64cfc625764f76a8134ec58235e) on Feb-25-2021.\n- POB Studio commissioned [Deanna Mosca](https://twitter.com/deanna_mosca) and [@Kofe](https://discord.gg/x4SH5pGgvj) to create a [mural](https://www.pob.studio/hash/mural) of the S0 artwork to commemorate this foundational moment for the Ethereum community and the $HASH project. \n\n[50 ETH Sale](https://twitter.com/timrix/status/1365006217018400770)\n\n[Bunbury Australia](https://twitter.com/deanna_mosca/status/1394231861388341251)\n\n> A memento of the beginning, the genesis.\n***\n\n### ✺ THE FIRST CONTRACT ✺\n\nThe first ever successful Creation of a smart contract on the Ethereum blockchain. The first step in the past towards the futuristic present we live in.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x31ded263506ea36e6ea777efc2c39a999e6fba4f4d338c7313af6aac6d9bf3e3) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244075) >\n\n- Minted by [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) on Feb-15-2021, this $HASH is Part 1 of 2. The second piece is the [1st nested smart contract creation](https://hash.pob.studio/art/0xd3961e340049c8becf92e3b24372355bee334dd5d3ef5434e55791f560287828). Both of these significant transactions were validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) is an avid hunter of $HASH artwork and has 2 unique $HASH finds in his collection. A great example of the duality of beauty and history.\n\n[THE FIRST CONTRACT](https://twitter.com/ash_bhimasani/status/1402758423578558467)\n***\n\n### ✺ BEGIN ETH2 ✺\n\nThe first transaction of 32 ETH sent to the ETH2 deposit contract. This is the start of a bright, unknown future. History in the making.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x404d8e109822ce448e68f45216c12cb051b784d068fbe98317ab8e50c58304ac) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101243418) >\n\n- Minted by [0x581b...97b1](https://hash.pob.studio/collection/0x581b3d2cdcd3911d9bbf503550c3f6c1f3c997b1) on Feb-10-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n\n[BEGIN ETH2](https://twitter.com/ash_bhimasani/status/1402759919737135109)\n***\n\n### ✺ BEGIN $HASH ✺\n\nThe transaction where the Proof of Beauty project was born. This is the contract creation for the GENESIS season of $HASH.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x6e5fa6686803a5c825b3b03174b2c4a433fdc1b354f05078396b292a78b49879) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244150) >\n\n- Minted by [zacmcc.eth](https://hash.pob.studio/collection/0x7d2855c1472266601af0f8206b0e12a87d934760) on Feb-24-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [PereGuerra](https://opensea.io/PereGuerra) purchased the piece for [6 ETH](https://etherscan.io/tx/0x1ef21f517428f8718ee409406735961cdb9513877d119459bbb408cd32549a41) on Mar-01-2021.\n\n[BEGIN $HASH](https://twitter.com/ash_bhimasani/status/1402760153288556551)\n***\n\n## What’s Next?\nThis is the first of many zines we hope to create with the help of the community. Follow us on Twitter and join our Discord to become a #Historian! We are in the process of expanding the $HASH-verse. So far we dropped our first Mural and Zine as a way to show off our amazing community and give back to $HASH holders. We will continue to make more of these while gearing up for physical items + new features.\n\nStay tuned to see how #OurHistory unfolds!\n\n## About Proof of Beauty\nWe are an experimental digital experience [studio](https://www.pob.studio/). The blockchain is our canvas & tokens our brush.", "timestamp": 1623336393, "digest": "vj7zYf49rLoii2tGT6i09n1crN__oCnEX1zABGE4uB0", "contributor": "0x9428ca8b5fe52C33BD0BD7222d719d788B6467F4"}
{"id": "ROnbxNOIrEJWUBOpiVeIT7ktYhmv5HskujJM7RX7y_c", "title": "Two young digital artists are swimming along when someone says to them \"morning, how're the NFTs?\"", "body": "## What the hell's an NFT?\n\nYou might know this nice fable recounted by David Foster Wallace in a famous commencement address:\n\n> There are these two young fish swimming along and they happen to meet an older fish swimming the other way, who nods at them and says “Morning, boys. How’s the water?” And the two young fish swim on for a bit, and then eventually one of them looks over at the other and goes “What the hell is water?”\n\nWhen you first read this, **you might think the point of the story is that the young fish are basically idiots** who don’t understand something obvious. So maybe, here in an essay proclaiming to be about NFTs, it might seem like we are setting the stage for a lesson like “lots of people don’t know what NFTs are even though it’s simple: NFTs are just ____________.”\n\nQuite the opposite!\n\nI’ll contend that you probably do know what NFTs are. But most everyone you disagree about them probably does too. [And but so](https://ambiguities.wordpress.com/2008/09/20/the-and-but-so/) when people say “it’s simple: NFTs are just _________”, perhaps filling in the blanks variously with “property titles” or “status signals” or \"examples of crudely mimetic speculation\" or “pointers to a file” or “the artist’s signature” they’re probably right. Except for the word “just.”[1] \n\nAnd I will try to prove it to you by drawing on an old study about -- what else? -- water.\n\n## \"What the hell is water?\"\n\nBelieve it or not, the answer to \"what is water?\" isn't simple at all. And perhaps summarizing evidence on this can help us all remain NFT value pluralists, especially here in these early experimental days. While it may be exciting and thought-provoking to speculate on what \"NFTs actually are\", the example of water can remind us just how complex and surprising a truly good answer might be. \n\nGoing back to the parable about the fish, suppose that instead of just swimming away one of the younger fish stops and musters the courage to ask the older fish, “wait, so what *is* water?” What would the older fish say? Maybe, **“Oh water? That’s just H2O”**. \n\n\"Just H2O\" feels like the rigorous answer, but it turns out not to be true. Or rather, it's true except for the word \"just.\" [A remarkable experiment by B.C. Malt](https://philpapers.org/rec/MALWIN) asked subjects to classify various liquids as being “water” or “not water” while also asking them to guess the H2O content. \n\nTables 1 and 2 report the results and the findings are instructive. There are a variety of things which the subjects class as “water” despite having substantially less H2O content than items classed as “non-water.”\n\n### Table 1: A Selection of items classed as “non-water” that have high H2O\n\n![](https://images.mirror-media.xyz/publication-images/cfd865e8-5c1a-40e2-b080-e3f1a9659bae.jpeg?height=312&width=1100)\n\n### Table 2: A Selection of items classed as “water” that have lower H2O\n\n![](https://images.mirror-media.xyz/publication-images/a4ae5c10-0790-44ef-8a02-2a42e6848fe4.jpeg?height=186&width=1104)\n\n![](https://images.mirror-media.xyz/publication-images/ad915fb5-924b-47bb-a1d9-1f4824753dce.jpeg?height=258&width=1088)\n\nThese findings point us to the complexity of our commonsense understandings -- if I dip a teabag into a mug of water it becomes tea, but if I dip a teabag into Hudson River it doesn’t become tea. And if Lipton polluted the Hudson River such that its “tea” content was even higher than the tea in my glass it still wouldn’t be tea. What’s the difference? Linguist [Magdalena Sztencel summarizes](https://www.researchgate.net/publication/318420342_Semantics_Pragmatics_and_Meaning_Revisited_The_Case_of_Conditionals) thus: **“whether we regard something as water or not depends on the intricate interaction of human interests, concerns, beliefs and intentions.”** In this case, likely the fact that I intended to make tea and Lipton didn’t.\n\nIs it so surprising, then, that NFTs can be variously art, property titles, signatures, and so on? An artist/creator/author/scientist’s intention to make an NFT “be” the work itself (or an inseparable component of it) may just be sufficient. \n\n[1] Perhaps interesting to note that early Western visitors to Yap assumed the Rai stones were “just” size-denominated money and failed to understand why the stones had individual names and why the value could depend on “whether it was brought by a famous sailor, or whether people died during its transport”. But size mattered too! [a.]\n\n[a.] Didn't feel right to have a David Foster Wallace-referencing article in here without at least one embedded footnote. \n\n*Thanks to awesome participants in a Kernel Junto for offering feedback and discussion (Vivek Singh, Diana Chen, Estefanía Ochoa, Paul Drouet, Robin Roy Thomas, Colton Brown, Jeet Raut, Mayank Dubey, Miguel Cabeza, Nuno Neto, Rev Miller, Kyle Smith). Simona Pop, Jamsheed Shorish, Michael Zargham, Simon DLR, and Matt G. Condon also offered characteristically brilliant suggestions/thoughts.*\n\n", "timestamp": 1623336387, "digest": "mPxqzSXNOUGcqynUpA1CIHz-Pwuj8pTMxPt1aIyvZEg", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "a8J9jMBQ2_mqCz6CDiCVTbeAX4jwo4oKI4oqVc2z94U", "title": "$ZINE - Proof of History - Vol. 1", "body": "![](https://images.mirror-media.xyz/publication-images/1d924866-2f17-427c-8999-4ccb7bda24ea.gif?height=1012&width=2024)\n\nThe $HASH project struck a unique cord both within ourselves and the community. *What is Ethereum's history?* That is something for all of us to discover and create.\n\nWith the Proof of History series, we want to highlight these mementos of our history and reward the treasure hunters in the community. Mirror's Split functionality is a beautiful way to acknowledge the curators and librarians of our world.\n\n[Token #3476](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3476)\n\n### Process\nVolume 1 of the Proof of History series is a collection of artwork from Proof of Beauty's community Snapshot vote, conducted to decide which TX would be used in the first official POB mural. These 4 transactions have historical significance to both the POB community and broader Ethereum ecosystem. Each TX is displayed in S0: GENESIS and S1: SAGA flavors of artwork. The $ZINE project was created to give back to our community and expand the $HASH-verse. Proceeds from the auction will be split between the collectors and minters. This is ground zero, the beginning of a new era for POB and our community.\n\n[Snapshot Vote](https://twitter.com/prrfbeauty/status/1382742125570318339)\n\n***\n\n![](https://images.mirror-media.xyz/publication-images/73101b95-e2f8-4f29-81c0-02bdc66b3a6d.png?height=1518&width=3036)\n\n***\n \n## The Mints\n\n### ✺ THE FIRST TX ✺\n\nOn August 7, 2015 at 3:30:33 AM UTC, an ETH presale participant sent 0.000000000000031337 ETH to a fresh address, and breathed life into the Ethereum blockchain.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x5c504ed432cb51138bcf09aa5e8a410dd4a1e204ef84bfed1be16dfba1b22060) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953926975274699741220483192166611388333031450) >\n\n- The famous [collector.eth](https://opensea.io/accounts/cryptoart) aka [@timrix](https://twitter.com/timrix) minted this tx on Jan-26-2021.\n- [LazloKovacs](https://opensea.io/accounts/LazloKovacs) purchased the piece for [50 ETH](https://etherscan.io/tx/0x89e37f4f5a501e0fcdf7f934c97044f4a882e64cfc625764f76a8134ec58235e) on Feb-25-2021.\n- POB Studio commissioned [Deanna Mosca](https://twitter.com/deanna_mosca) and [@Kofe](https://discord.gg/x4SH5pGgvj) to create a [mural](https://www.pob.studio/hash/mural) of the S0 artwork to commemorate this foundational moment for the Ethereum community and the $HASH project. \n\n[50 ETH Sale](https://twitter.com/timrix/status/1365006217018400770)\n\n[Bunbury Australia](https://twitter.com/deanna_mosca/status/1394231861388341251)\n\n> A memento of the beginning, the genesis.\n***\n\n### ✺ THE FIRST CONTRACT ✺\n\nThe first ever successful Creation of a smart contract on the Ethereum blockchain. The first step in the past towards the futuristic present we live in.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x31ded263506ea36e6ea777efc2c39a999e6fba4f4d338c7313af6aac6d9bf3e3) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244075) >\n\n- Minted by [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) on Feb-15-2021, this $HASH is Part 1 of 2. The second piece is the [1st nested smart contract creation](https://hash.pob.studio/art/0xd3961e340049c8becf92e3b24372355bee334dd5d3ef5434e55791f560287828). Both of these significant transactions were validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) is an avid hunter of $HASH artwork and has 2 unique $HASH finds in his collection. A great example of the duality of beauty and history.\n\n[THE FIRST CONTRACT](https://twitter.com/ash_bhimasani/status/1402758423578558467)\n***\n\n### ✺ BEGIN ETH2 ✺\n\nThe first transaction of 32 ETH sent to the ETH2 deposit contract. This is the start of a bright, unknown future. History in the making.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x404d8e109822ce448e68f45216c12cb051b784d068fbe98317ab8e50c58304ac) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101243418) >\n\n- Minted by [0x581b...97b1](https://hash.pob.studio/collection/0x581b3d2cdcd3911d9bbf503550c3f6c1f3c997b1) on Feb-10-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n\n[BEGIN ETH2](https://twitter.com/ash_bhimasani/status/1402759919737135109)\n***\n\n### ✺ BEGIN $HASH ✺\n\nThe transaction where the Proof of Beauty project was born. This is the contract creation for the GENESIS season of $HASH.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x6e5fa6686803a5c825b3b03174b2c4a433fdc1b354f05078396b292a78b49879) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244150) >\n\n- Minted by [zacmcc.eth](https://hash.pob.studio/collection/0x7d2855c1472266601af0f8206b0e12a87d934760) on Feb-24-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [PereGuerra](https://opensea.io/PereGuerra) purchased the piece for [6 ETH](https://etherscan.io/tx/0x1ef21f517428f8718ee409406735961cdb9513877d119459bbb408cd32549a41) on Mar-01-2021.\n\n[BEGIN $HASH](https://twitter.com/ash_bhimasani/status/1402760153288556551)\n***\n\n## What’s Next?\nThis is the first of many zines we hope to create with the help of the community. Follow us on Twitter and join our Discord to become a #Historian! We are in the process of expanding the $HASH-verse. So far we dropped our first Mural and Zine as a way to show off our amazing community and give back to $HASH holders. We will continue to make more of these while gearing up for physical items + new features.\n\nStay tuned to see how #OurHistory unfolds!\n\n## About Proof of Beauty\nWe are an experimental digital experience [studio](https://www.pob.studio/). The blockchain is our canvas & tokens our brush.", "timestamp": 1623336728, "digest": "vj7zYf49rLoii2tGT6i09n1crN__oCnEX1zABGE4uB0", "contributor": "0x9428ca8b5fe52C33BD0BD7222d719d788B6467F4"}
{"id": "6rKVUjY8nYYlnsthblhKvJiKRB6nkY2asAeQ0TjSOSA", "title": "Example", "body": "ruh roh", "timestamp": 1623336751, "digest": "iXNPe8NBwUqRRt6ZukDFU6j0d3u5j63FqZoqKOzbZCc", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "aN_xNSNQPbWifIX6n1G8SYtalwpZzlcUCpWaQf0gMso", "title": "Test entry NFT minting", "body": "hai\n\n[Token #1339](auction://0x7c2668bd0d3c050703cecc956c11bd520c26f7d4?network=rinkeby&tokenId=1339&auctionId=0xa762ff057193cd029cdc522e507fc85eb968b43174b36931ea0bc415c9ba04f9)", "timestamp": 1623337041, "digest": "vbA1StwywLtO7kFhbcZ0gO_EURYJBupVqBg5sYEdlac", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0x84fbcbb2bccfe2f94e4f1031b5eeaadf3ba7a088fe33278160f006aa4ae9048c\"}"}
{"id": "5WowWq2RoEVRj06A9JDqWaApYpG5xN0C0w1AV7z-hzc", "title": "Example", "body": "ruh roh v2", "timestamp": 1623337116, "digest": "iXNPe8NBwUqRRt6ZukDFU6j0d3u5j63FqZoqKOzbZCc", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "coFKp5pSA-MXyxZUAC_-v9eT3QIvFtp_E8wp5H67-iA", "title": "Test entry NFT minting", "body": "hai v2\n\n[Token #1339](auction://0x7c2668bd0d3c050703cecc956c11bd520c26f7d4?network=rinkeby&tokenId=1339&auctionId=0xa762ff057193cd029cdc522e507fc85eb968b43174b36931ea0bc415c9ba04f9)", "timestamp": 1623337869, "digest": "vbA1StwywLtO7kFhbcZ0gO_EURYJBupVqBg5sYEdlac", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0x84fbcbb2bccfe2f94e4f1031b5eeaadf3ba7a088fe33278160f006aa4ae9048c\"}"}
{"id": "6zd1mX4ZCDl681yRrkAyJSYsOFv8UZNUDdh9jDOMzas", "title": "$ZINE - Proof of History - Vol. 1", "body": "The $HASH project struck a unique cord both within ourselves and the community. *What is Ethereum's history?* That is something for all of us to discover and create.\n\nWith the Proof of History series, we want to highlight these mementos of our history and reward the treasure hunters in the community. Mirror's Split functionality is a beautiful way to acknowledge the curators and librarians of our world.\n\n[Token #3476](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3476)\n\n### Process\nVolume 1 of the Proof of History series is a collection of artwork from Proof of Beauty's community Snapshot vote, conducted to decide which TX would be used in the first official POB mural. These 4 transactions have historical significance to both the POB community and broader Ethereum ecosystem. Each TX is displayed in S0: GENESIS and S1: SAGA flavors of artwork. The $ZINE project was created to give back to our community and expand the $HASH-verse. Proceeds from the auction will be split between the collectors and minters. This is ground zero, the beginning of a new era for POB and our community.\n\n[Snapshot Vote](https://twitter.com/prrfbeauty/status/1382742125570318339)\n\n***\n\n![](https://images.mirror-media.xyz/publication-images/73101b95-e2f8-4f29-81c0-02bdc66b3a6d.png?height=1518&width=3036)\n\n***\n \n## The Mints\n\n### ✺ THE FIRST TX ✺\n\nOn August 7, 2015 at 3:30:33 AM UTC, an ETH presale participant sent 0.000000000000031337 ETH to a fresh address, and breathed life into the Ethereum blockchain.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x5c504ed432cb51138bcf09aa5e8a410dd4a1e204ef84bfed1be16dfba1b22060) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953926975274699741220483192166611388333031450) >\n\n- The famous [collector.eth](https://opensea.io/accounts/cryptoart) aka [@timrix](https://twitter.com/timrix) minted this tx on Jan-26-2021.\n- [LazloKovacs](https://opensea.io/accounts/LazloKovacs) purchased the piece for [50 ETH](https://etherscan.io/tx/0x89e37f4f5a501e0fcdf7f934c97044f4a882e64cfc625764f76a8134ec58235e) on Feb-25-2021.\n- POB Studio commissioned [Deanna Mosca](https://twitter.com/deanna_mosca) and [@Kofe](https://discord.gg/x4SH5pGgvj) to create a [mural](https://www.pob.studio/hash/mural) of the S0 artwork to commemorate this foundational moment for the Ethereum community and the $HASH project. \n\n[50 ETH Sale](https://twitter.com/timrix/status/1365006217018400770)\n\n[Bunbury Australia](https://twitter.com/deanna_mosca/status/1394231861388341251)\n\n> A memento of the beginning, the genesis.\n***\n\n### ✺ THE FIRST CONTRACT ✺\n\nThe first ever successful Creation of a smart contract on the Ethereum blockchain. The first step in the past towards the futuristic present we live in.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x31ded263506ea36e6ea777efc2c39a999e6fba4f4d338c7313af6aac6d9bf3e3) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244075) >\n\n- Minted by [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) on Feb-15-2021, this $HASH is Part 1 of 2. The second piece is the [1st nested smart contract creation](https://hash.pob.studio/art/0xd3961e340049c8becf92e3b24372355bee334dd5d3ef5434e55791f560287828). Both of these significant transactions were validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) is an avid hunter of $HASH artwork and has 2 unique $HASH finds in his collection. A great example of the duality of beauty and history.\n\n[THE FIRST CONTRACT](https://twitter.com/ash_bhimasani/status/1402758423578558467)\n***\n\n### ✺ BEGIN ETH2 ✺\n\nThe first transaction of 32 ETH sent to the ETH2 deposit contract. This is the start of a bright, unknown future. History in the making.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x404d8e109822ce448e68f45216c12cb051b784d068fbe98317ab8e50c58304ac) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101243418) >\n\n- Minted by [0x581b...97b1](https://hash.pob.studio/collection/0x581b3d2cdcd3911d9bbf503550c3f6c1f3c997b1) on Feb-10-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n\n[BEGIN ETH2](https://twitter.com/ash_bhimasani/status/1402759919737135109)\n***\n\n### ✺ BEGIN $HASH ✺\n\nThe transaction where the Proof of Beauty project was born. This is the contract creation for the GENESIS season of $HASH.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x6e5fa6686803a5c825b3b03174b2c4a433fdc1b354f05078396b292a78b49879) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244150) >\n\n- Minted by [zacmcc.eth](https://hash.pob.studio/collection/0x7d2855c1472266601af0f8206b0e12a87d934760) on Feb-24-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [PereGuerra](https://opensea.io/PereGuerra) purchased the piece for [6 ETH](https://etherscan.io/tx/0x1ef21f517428f8718ee409406735961cdb9513877d119459bbb408cd32549a41) on Mar-01-2021.\n\n[BEGIN $HASH](https://twitter.com/ash_bhimasani/status/1402760153288556551)\n***\n\n## What’s Next?\nThis is the first of many zines we hope to create with the help of the community. Follow us on Twitter and join our Discord to become a #Historian! We are in the process of expanding the $HASH-verse. So far we dropped our first Mural and Zine as a way to show off our amazing community and give back to $HASH holders. We will continue to make more of these while gearing up for physical items + new features.\n\nStay tuned to see how #OurHistory unfolds!\n\n## About Proof of Beauty\nWe are an experimental digital experience [studio](https://www.pob.studio/). The blockchain is our canvas & tokens our brush.", "timestamp": 1623338589, "digest": "vj7zYf49rLoii2tGT6i09n1crN__oCnEX1zABGE4uB0", "contributor": "0x9428ca8b5fe52C33BD0BD7222d719d788B6467F4"}
{"id": "jKFrmrS_xdVKN29GRzhbopU1cbI6f7rZbWHEaKBAbAQ", "title": "$ZINE - Proof of History - Vol. 1", "body": "The $HASH project struck a unique cord both within ourselves and the community. *What is Ethereum's history?* That is something for all of us to discover and create.\n\nWith the Proof of History series, we want to highlight these mementos of our history and reward the treasure hunters in the community. Mirror's Split functionality is a beautiful way to acknowledge the curators and librarians of our world.\n\n[Token #3476](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3476)\n\n### Process\nVolume 1 of the Proof of History series is a collection of artwork from Proof of Beauty's community Snapshot vote, conducted to decide which TX would be used in the first official POB mural. These 4 transactions have historical significance to both the POB community and broader Ethereum ecosystem. Each TX is displayed in S0: GENESIS and S1: SAGA flavors of artwork. The $ZINE project was created to give back to our community and expand the $HASH-verse. Proceeds from the auction will be split between the collectors and minters. This is ground zero, the beginning of a new era for POB and our community.\n\n[Snapshot Vote](https://twitter.com/prrfbeauty/status/1382742125570318339)\n\n***\n\n> Proceeds from the auction will be split between collectors and minters\n\n***\n \n## The Mints\n\n### ✺ THE FIRST TX ✺\n\nOn August 7, 2015 at 3:30:33 AM UTC, an ETH presale participant sent 0.000000000000031337 ETH to a fresh address, and breathed life into the Ethereum blockchain.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x5c504ed432cb51138bcf09aa5e8a410dd4a1e204ef84bfed1be16dfba1b22060) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953926975274699741220483192166611388333031450) >\n\n- The famous [collector.eth](https://opensea.io/accounts/cryptoart) aka [@timrix](https://twitter.com/timrix) minted this tx on Jan-26-2021.\n- [LazloKovacs](https://opensea.io/accounts/LazloKovacs) purchased the piece for [50 ETH](https://etherscan.io/tx/0x89e37f4f5a501e0fcdf7f934c97044f4a882e64cfc625764f76a8134ec58235e) on Feb-25-2021.\n- POB Studio commissioned [Deanna Mosca](https://twitter.com/deanna_mosca) and [@Kofe](https://discord.gg/x4SH5pGgvj) to create a [mural](https://www.pob.studio/hash/mural) of the S0 artwork to commemorate this foundational moment for the Ethereum community and the $HASH project. \n\n[50 ETH Sale](https://twitter.com/timrix/status/1365006217018400770)\n\n[Bunbury Australia](https://twitter.com/deanna_mosca/status/1394231861388341251)\n\n***\n> A memento of the beginning. The birth of Ethereum.\n***\n\n### ✺ THE FIRST CONTRACT ✺\n\nThe first ever successful Creation of a smart contract on the Ethereum blockchain. The first step in the past towards the futuristic present we live in.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x31ded263506ea36e6ea777efc2c39a999e6fba4f4d338c7313af6aac6d9bf3e3) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244075) >\n\n- Minted by [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) on Feb-15-2021, this $HASH is Part 1 of 2. The second piece is the [1st nested smart contract creation](https://hash.pob.studio/art/0xd3961e340049c8becf92e3b24372355bee334dd5d3ef5434e55791f560287828). Both of these significant transactions were validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [0x4621...e8a9](https://hash.pob.studio/collection/0x46210b09cd0b5a80bfbcdd46e497e895ebf7e8a9) is an avid hunter of $HASH artwork and has 2 unique $HASH finds in his collection. A great example of the duality of beauty and history.\n\n[THE FIRST CONTRACT](https://twitter.com/ash_bhimasani/status/1402758423578558467)\n***\n\n### ✺ BEGIN ETH2 ✺\n\nThe first transaction of 32 ETH sent to the ETH2 deposit contract. This is the start of a bright, unknown future. History in the making.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x404d8e109822ce448e68f45216c12cb051b784d068fbe98317ab8e50c58304ac) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101243418) >\n\n- Minted by [0x581b...97b1](https://hash.pob.studio/collection/0x581b3d2cdcd3911d9bbf503550c3f6c1f3c997b1) on Feb-10-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n\n[BEGIN ETH2](https://twitter.com/ash_bhimasani/status/1402759919737135109)\n***\n\n### ✺ BEGIN $HASH ✺\n\nThe transaction where the Proof of Beauty project was born. This is the contract creation for the GENESIS season of $HASH.\n\n< [hash.pob.studio](https://hash.pob.studio/art/0x6e5fa6686803a5c825b3b03174b2c4a433fdc1b354f05078396b292a78b49879) > < [opensea](https://opensea.io/assets/0xE18a32192ED95b0FE9D70D19e5025f103475d7BA/57896044618658097711785492504343953927315557066662158946655541218820101244150) >\n\n- Minted by [zacmcc.eth](https://hash.pob.studio/collection/0x7d2855c1472266601af0f8206b0e12a87d934760) on Feb-24-2021. The significant transaction was validated by our [#historians](https://discord.gg/x4SH5pGgvj) Discord community.\n- [PereGuerra](https://opensea.io/PereGuerra) purchased the piece for [6 ETH](https://etherscan.io/tx/0x1ef21f517428f8718ee409406735961cdb9513877d119459bbb408cd32549a41) on Mar-01-2021.\n\n[BEGIN $HASH](https://twitter.com/ash_bhimasani/status/1402760153288556551)\n***\n\n## What’s Next?\nThis is the first of many zines we hope to create with the help of the community. Follow us on Twitter and join our Discord to become a #Historian! We are in the process of expanding the $HASH-verse. So far we dropped our first Mural and Zine as a way to show off our amazing community and give back to $HASH holders. We will continue to make more of these while gearing up for physical items + new features.\n\nStay tuned to see how #OurHistory unfolds!\n\n## About Proof of Beauty\nWe are an experimental digital experience [studio](https://www.pob.studio/). The blockchain is our canvas & tokens our brush.", "timestamp": 1623339472, "digest": "vj7zYf49rLoii2tGT6i09n1crN__oCnEX1zABGE4uB0", "contributor": "0x9428ca8b5fe52C33BD0BD7222d719d788B6467F4"}
{"id": "SPfwlhV5xeUOBaKcn4TnFNRatRnvNV0bDBDk11zNrgI", "title": "CabinDAO creator residency program proposal\n", "body": "*This is a proposal for structuring the [creator residency program crowdfunded by CabinDAO](https://creators.mirror.xyz/20Eyc57rknNJYL9vJa11zvupU_MXP7NZJUADTzTlCjQ). We will publish CabinDAO governance proposals publicly.*\n\n*We'd love feedback from the community, whether or not you're a $CABIN hodler. If you do have $CABIN tokens, you can now [join our Discord server](https://discord.gg/N6hVmFygjR) to discuss this proposal. [Voting is now open on Snapshot](https://snapshot.org/#/cabindao.eth/proposal/QmY6cRpsXfpuxvAKpxbgU8SdYtUaaVXHwAWqf4dPi2ADRM)!*\n\n_______________________\n\n\n## 🥅 Goals\n\nThe goals of CabinDAO will ultimately be whatever the DAO decides they are. That said, when the DAO was formed, here are some of the things we intended to accomplish:\n\n> 🌐 Create the conditions for serendipitous in-person collaboration across a diverse internet community 🧑‍🤝‍🧑\n\n> 🏡 Experiment with sustainable models for funding the living expenses of independent online creators 🧑‍🎨 \n\n> 🧭 Explore the idea maze of decentralized governance for physical locations 🗳️ \n\n\n## 🏘️ Residency program\n\nTo accomplish these goals, **we are proposing a 3-month trial of a cohort-based residency, where we bring together groups of 4 independent online creators for 4 weeks to work on projects.**\n\n### 📍 Location\n\nGroups of four residents would spend a month living and working alongside other members of their cohort at [Creators Cabins](https://www.creatorcabins.com/), a 28-acre retreat about 45 minutes outside of Austin, TX. They would stay in a four-bedroom shipping container cabin designed from the ground up for a community of independent online creators:\n\n![](https://images.mirror-media.xyz/publication-images/aff070f7-1ccb-4868-8a53-64505c093fee.jpg?height=1174&width=1710) \n\nWhile these first cohorts would be hosted at Creator Cabins, we hope to expand to other locations supported by the DAO in the future. \n\n\n### 🚧 Projects & outcomes\n\nEach of the residents will come with a project they intend to work on. We expect some will stick to the original plan and others will ride the waves of synchronicity & decide to collaborate on something new.\n\nEither way, the expectation of the residency is that you will complete *something* that can be shared with the community by the end of your stay. At the end of the month, we will help each creator mint an NFT representing their work at the residency. This NFT can either be held in the CabinDAO treasury or auctioned, with a 50/50 split going to the creator & to the DAO to fund future residencies. \n\nOur intention is for the CabinDAO community (IRL in Texas, and globally on Discord) to help creators best use emergent web3 patterns to collaborate and share their work. We expect projects that help push the boundaries of web3 and/or contribute to the ongoing sustainability of the DAO will be more likely to win a residency, but that will be up to $CABIN holders to decide. \n\n\n### 🏕️ Camp counselor\n\nResidents will be supported by a \"camp counselor\", who will help facilitate the experience, pick people up at the airport, create ~~~ gOoD vIbEs ~~~, organize weekly grocery runs, brainstorm wild ideas, and generally try to be helpful. The counselor (and any visitors) will stay in the old cabin. \n\nCounselors are people who have completed a residency before and are coming back to support the community. We expect it will take <10 hours per week of work, so anyone working remotely/flexibly can be a counselor part-time. The counselor role will be compensated with free housing and 500 $CABIN tokens per cohort. \n\n\n### 📅 Cohort dates\n\nWe will run three 4-week cohorts over the next few months:\n\n- Cohort 1: *July 19th - August 15th* (hot DAO summer)\n- Cohort 2: *August 23rd - September 19th* (slightly cooler DAO summer)\n- Cohort 3: *September 20th - October 17th* (hitting-our-stride DAO fall)\n\n\n\n## 📋 Application process\n\nThe residency program is open to anyone creating independently and sharing their work online.\n\nFor each cohort, we will run an application & voting process similar to Mirror's $WRITE RACE. People interested in a residency will submit a short proposal, up to 250 words, outlining how they would spend a month of time at Creator Cabins. \n\n$CABIN holders will be able to cast as many votes as the number of tokens they have. Votes can be split among multiple proposals. At the end of the voting period, the top four proposals will receive a one-month residency for the designated cohort.\n\n**We will start accepting applications for Cohort 1 in late June. [Sign up here for updates on the application process.](https://creatorcabins.ck.page/9e628caec5)**\n\n\n\n## 💰 Budget\n\n### 💸 Costs: 5 ETH + 1500 $CABIN per cohort\n\nWe currently have 16 ETH and 16k $CABIN in the treasury. This is enough for us to cover three 4-week cohorts at a budget of 5 ETH + 1500 $CABIN per cohort. This will cover the following expenses:\n\n- *1 ETH per week*: renting out the full Creator Cabins property (including both cabins, high-speed internet, utilities, and cleaning). The market rate for the cabins is more than this, but we know a guy 😉\n- *0.25 ETH + 250 $CABIN*: ETH provided at beginning of the program as a stipend for each creator in the cohort to cover food and gas costs to mint the end-of-program NFT. $CABIN provided to each creator after they mint their post-program NFT.\n- *500 $CABIN*: stipend for the camp counselor for each cohort, provided at the end of the month. \n\n\n### 🪂 Airdrop\n\nWe are also planning to airdrop 500 $CABIN each to @p_millerd and @kadlac for their OG contributions before we even officially set up the crowdfund:\n\nhttps://twitter.com/kadlac/status/1394149045757571078\n\n\n## 🔮 Long-term plans\n\nWe are [leaving the crowdfund open](https://creators.mirror.xyz/20Eyc57rknNJYL9vJa11zvupU_MXP7NZJUADTzTlCjQ) so that we can continue to raise additional funds for future cohorts and allow new members to join the DAO. We also hope to raise additional sustainable funds for the program through splits on sales of NFTs produced by residents. \n\nWhile the first use-case for this DAO is creator residencies, we will learn from this experiment and continue to find ways to sustainably fund independent online creators and develop DAO-based governance models for physical spaces.\n\nWe would love your feedback and contributions to this project! Slide into our DMs or tweet **@creatorcabins**, **@jonathanhillis**, **@jongold**, and **@ZFleischmann**. If you're a $CABIN hodler, you can now [join our Discord server](https://discord.gg/N6hVmFygjR) for discussion and governance. \n\nThank you to the 89+ members of CabinDAO—[we'll see you in Discord!](https://discord.gg/N6hVmFygjR)\n\n[CabinDAO](crowdfund://0x94515e4f6fabad73C8bCdd8cd42f0b5C037E2c49?network=homestead)", "timestamp": 1623339452, "digest": "eS6lYIBycHEZmtGpRGwA9lCb3Y_8G4pddHWSKtmWP_I", "contributor": "0xbeC26FFa12c90217943D1b2958f60A821aE6E549"}
{"id": "8yIhHmnlngQQf_l4fTBpnuM9wMlMuRYET6oQUsEly3Y", "title": "Test entry NFT minting", "body": "hai v2\n\n[Token #2914](auction://0x7c2668bd0d3c050703cecc956c11bd520c26f7d4?network=rinkeby&tokenId=2914&auctionId=0x78fe9d106a6857d3ed80ad719eb6fb0367a6bd0ac31a727ef906a2896e14c34c)", "timestamp": 1623342445, "digest": "vbA1StwywLtO7kFhbcZ0gO_EURYJBupVqBg5sYEdlac", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0x84fbcbb2bccfe2f94e4f1031b5eeaadf3ba7a088fe33278160f006aa4ae9048c\"}"}
{"id": "NgSRxGK3lAKWEeEJi9cozimfkSw7zHqhixrmHAU3fZY", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. \n\nIf you're just learning about this project, it's a collection of perspectives from 46 Beacon Chain researchers and implementers, wrapped in delightful graphics. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\n**Read on for more info on how and where to win a copy!**\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\nIf you do win, please note that we will require a physical address to mail it to you. Limit one giveaway per identity.\n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ Giveaway info added soon\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Giveaway info added soon\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ Giveaway info added soon\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ Giveaway info added soon\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ Giveaway info added soon\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway info added soon\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ [Join the discord to enter the giveaway](https://discord.gg/j6TYyRz7hV) - See #announcements channel!\n\nQuality, consistency and thoughtfulness wrapped in a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language, so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1623346956, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "AAyA4COCNK5Lod7snBT_WaH-l4ToGLbYUr6E0dHnl7Q", "title": "Boardroom Integrates DAO Treasuries via MultiSafe Finance", "body": "*[Boardroom](https://www.boardroom.info/) has integrated with MultiSafe to bring transparency, access, and readability to DAO treasuries on our [governance portal](https://app.boardroom.info/)*\n\n![](https://images.mirror-media.xyz/publication-images/a63eb532-6478-497b-8a96-4ea77935ef6b.jpeg?height=611&width=1080)\n\nFor the past few months, we have been working with the [MultiSafe Finance](https://multisafe.finance) team to integrate [Gnosis Safe](https://gnosis-safe.io/) information for projects onboarded to the Boardroom Portal. We are thrilled to share that anyone can now review treasury balances, activity, and payment details for DAOs directly on a project's dashboard. Some initial example integrations include [Compound Grants](https://app.boardroom.info/compoundgrants.eth/treasuryOverview), [Bankless DAO](https://app.boardroom.info/banklessvault.eth/treasuryOverview), [Synthetix DAO](https://app.boardroom.info/snxgov.eth/treasuryOverview), amongst others.\n\nThe new treasury tab, found under every project in the portal, will enable DAO communities to maximize transparency by displaying real-time balance, flows, and transaction information originating from the project's default multisig. The feature:\n- Directly integrates with any Gnosis Safe\n- Displays transaction recipient and approval details\n- Enables team and contributor categorization via the MultiSafe admin dashboard\n\nAs the DAO ecosystem continues to grow in diversity and use cases, we recognized that stakeholders at the core of these digital ecosystems are coordinating around two main decision vectors: Capital and Talent allocation. Treasury management and payroll distributions are two of the most common types of decisions that DAO members make. Boardroom Treasury information, enabled by our integration with MultiSafe, will help distributed organizations make those decisions more efficiently and effectively.\n\nIn particular, we feel it's important to contextualize these transactions by eventually relating them back to the governance votes that made them possible, as well as the discussions that brought them about. By categorizing the transactions by 'Teams' and 'Contributors', we're able to create granular filters that help parties - both internal and external to the DAO - understand who is getting paid, and why. \n\n## How It Works\nAny project that has **already onboarded** to the Boardroom Portal will be prompted to sign up for MultiSafe and import their Gnosis Safe in order to unlock the Treasury tab. Simply follow the instructions in the documentation and you're all set! \n\n![](https://images.mirror-media.xyz/publication-images/d83ea7ea-fd24-45f4-9e1a-e4b1dee15f21.jpeg?height=791&width=1125)\n\nIf your project is not onboarded to the Portal but uses a Gnosis Safe to manage its treasury, you can follow [these instructions](https://docs.boardroom.info/boardroom-portal-1/adding-your-project) to begin the integration process. \n\n## Looking Forward\n\nWe'll continue to link fragmented areas of DAO operations and management moving forward, with a focus on treasury distributions as a primary execution step post governance vote.\n\n- Proposals can be linked to specific transactions directly on the interface.\n- As smaller, 'sub-DAOs' proliferate and service larger treasuries, we can map the relationships and transaction history between them.\n- As MultiSafe extends its functionality, governance could start weighing in on more granular asset allocation, accounting, and payroll decisions with less friction via the Boardroom portal.\n\nFeel free to reach out with questions on our [Discord](https://discord.com/invite/CEZ8WfuK8s) or [Landing Page](https://boardroom.info/) anytime, we're here to help! \n\n### About Boardroom\nBoardroom facilitates simple and transparent stakeholder oversight and management of DAOs - distributed organisations and protocols.\n[Website](https://boardroom.info/), [Twitter](https://twitter.com/boardroom_info), [Discord](https://discord.com/invite/CEZ8WfuK8s)\n\n### About MultiSafe\nMultiSafe aims to simplify crypto treasury management for Companies & DAOs - built using Gnosis Safe, IPFS & Filecoin.\n[Website](https://multisafe.finance/), [Twitter](https://twitter.com/0xMultisafe), [Discord](https://discord.gg/fDTPwMmyav)", "timestamp": 1623347168, "digest": "Dsv2_1-BhTDcc4D_Wiv0Tew4vieHXl1G1OwKrag14LU", "contributor": "0xb1676B5Ab63F01F154bb9938F5e8999d9Da5444B"}
{"id": "YlTy7FoVsKTaOIJZ8lZbVGfTg4HxIjYIu-U-vYQFXA8", "title": "Boardroom Integrates DAO Treasuries via MultiSafe Finance", "body": "*[Boardroom](https://www.boardroom.info/) has integrated with MultiSafe to bring transparency, access, and readability to DAO treasuries on our [governance portal](https://app.boardroom.info/)*\n\n![](https://images.mirror-media.xyz/publication-images/a63eb532-6478-497b-8a96-4ea77935ef6b.jpeg?height=611&width=1080)\n\nFor the past few months, we have been working with the [MultiSafe Finance](https://multisafe.finance) team to integrate [Gnosis Safe](https://gnosis-safe.io/) information for projects onboarded to the Boardroom Portal. We are thrilled to share that anyone can now review treasury balances, activity, and payment details for DAOs directly on a project's dashboard. Some initial example integrations include [Compound Grants](https://app.boardroom.info/compoundgrants.eth/treasuryOverview), [Bankless DAO](https://app.boardroom.info/banklessvault.eth/treasuryOverview), [Synthetix DAO](https://app.boardroom.info/snxgov.eth/treasuryOverview), amongst others.\n\nThe new treasury tab, found under every project in the portal, will enable DAO communities to maximize transparency by displaying real-time balance, flows, and transaction information originating from the project's default multisig. The feature:\n- Directly integrates with any Gnosis Safe\n- Displays transaction recipient and approval details\n- Enables team and contributor categorization via the MultiSafe admin dashboard\n\nhttps://twitter.com/boardroom_info/status/1403052037156311046?s=20\n\nAs the DAO ecosystem continues to grow in diversity and use cases, we recognized that stakeholders at the core of these digital ecosystems are coordinating around two main decision vectors: Capital and Talent allocation. Treasury management and payroll distributions are two of the most common types of decisions that DAO members make. Boardroom Treasury information, enabled by our integration with MultiSafe, will help distributed organizations make those decisions more efficiently and effectively.\n\nIn particular, we feel it's important to contextualize these transactions by eventually relating them back to the governance votes that made them possible, as well as the discussions that brought them about. By categorizing the transactions by 'Teams' and 'Contributors', we're able to create granular filters that help parties - both internal and external to the DAO - understand who is getting paid, and why. \n\n## How It Works\nAny project that has **already onboarded** to the Boardroom Portal will be prompted to sign up for MultiSafe and import their Gnosis Safe in order to unlock the Treasury tab. Simply follow the instructions in the documentation and you're all set! \n\n![](https://images.mirror-media.xyz/publication-images/d83ea7ea-fd24-45f4-9e1a-e4b1dee15f21.jpeg?height=791&width=1125)\n\nIf your project is not onboarded to the Portal but uses a Gnosis Safe to manage its treasury, you can follow [these instructions](https://docs.boardroom.info/boardroom-portal-1/adding-your-project) to begin the integration process. \n\n## Looking Forward\n\nWe'll continue to link fragmented areas of DAO operations and management moving forward, with a focus on treasury distributions as a primary execution step post governance vote.\n\n- Proposals can be linked to specific transactions directly on the interface.\n- As smaller, 'sub-DAOs' proliferate and service larger treasuries, we can map the relationships and transaction history between them.\n- As MultiSafe extends its functionality, governance could start weighing in on more granular asset allocation, accounting, and payroll decisions with less friction via the Boardroom portal.\n\nFeel free to reach out with questions on our [Discord](https://discord.com/invite/CEZ8WfuK8s) or [Landing Page](https://boardroom.info/) anytime, we're here to help! \n\n### About Boardroom\nBoardroom facilitates simple and transparent stakeholder oversight and management of DAOs - distributed organisations and protocols.\n[Website](https://boardroom.info/), [Twitter](https://twitter.com/boardroom_info), [Discord](https://discord.com/invite/CEZ8WfuK8s)\n\n### About MultiSafe\nMultiSafe aims to simplify crypto treasury management for Companies & DAOs - built using Gnosis Safe, IPFS & Filecoin.\n[Website](https://multisafe.finance/), [Twitter](https://twitter.com/0xMultisafe), [Discord](https://discord.gg/fDTPwMmyav)", "timestamp": 1623348694, "digest": "Dsv2_1-BhTDcc4D_Wiv0Tew4vieHXl1G1OwKrag14LU", "contributor": "0xb1676B5Ab63F01F154bb9938F5e8999d9Da5444B"}
{"id": "KWIru1EiMRwNx1FXGBCWc4W1n8BaxBvHc8LzdYaRM8w", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. \n\nIf you're just learning about this project, it's a collection of perspectives from 46 Beacon Chain researchers and implementers, wrapped in delightful graphics. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\n**Read on for more info on how and where to win a copy!**\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\nIf you do win, please note that we will require a physical address to mail it to you. Limit one giveaway per identity.\n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ Giveaway info added soon\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Giveaway info added soon\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ [Giveaway Contest here](https://twitter.com/EthereumMemes/status/1403061212745801728)\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ Giveaway info added soon\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ Giveaway info added soon\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway info added soon\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ [Join the discord to enter the giveaway](https://discord.gg/j6TYyRz7hV) - See #announcements channel!\n\nQuality, consistency and thoughtfulness wrapped in a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language, so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1623351852, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "0dGy9XEjB3qAei_0Noj-A_EMLeILqR4EhA3x0d-vNeg", "title": "overflow", "body": "![](https://images.mirror-media.xyz/publication-images/f9108473-f1f8-423b-929b-295488d0a6b6.png?height=406&width=1593)\n\nthe river would practically overflow one day and barely trickle the next. it should have been because of the rain but it was because some guys would come along every once in a while wearing orange and yellow reflective suits and change the level of the dam. it seemed like it just went somewhere else. not any particular place, just elsewhere. it looked better on the days when it was moving fast. it seemed fresher, clearer—defined by its movement rather than its being. like if it stopped it wouldn’t be the same thing anymore. like all it could do was leave.\n\ni thought i’d like to stay a bit longer, but some bright flash in my brain convinced me i had to move on. i told myself i could stop and look at it whenever i wanted, but i knew i never would. ", "timestamp": 1623366009, "digest": "jaiAdbvawDh-f0xUdLzHcBziM0gC3t9Fd276JhBSTRA", "contributor": "0x64298A72F4E3e23387EFc409fc424a3f17356fC4"}
