{"id": "Gf0OZBEX6rcZzxfRwGSPkb-Z9U2DYFMoD6bGWKZwQqQ", "title": "Internet Renaissance Vibez", "body": "[Test](split://0xa746021cB13C2f86907Fc4C0b3F3A2b23c59f357)\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/81)\n\nThree years ago, I was about to graduate college and still had no idea what I wanted to do. I studied Finance but after a few internships, I realized I wasn’t meant to be in a cheap suit from JCPenny cranking out discounted cash flow models until midnight. At the time, a friend of mine had just finished a coding bootcamp and suggested I try learning to code.\n\nIt was my senior year so like any rational person, I decided to stop going to class so I could code all day (sorry mom). Over the next few months I picked up web development, built full-stack apps, and did so many [Leetcode](https://leetcode.com/) problems that you’d think it was a form of capital punishment. \n\nOnce I graduated, I bought a one-way ticket to San Francisco and stayed on a cozy air mattress in my friend’s living room. Over the next few months, I did some contract work for my friends at [Career Karma](http://careerkarma.com/) and eventually landed a job as a software engineer on the growth team at [Instacart](instacart.com).\n\nA little over a year later, I was looking to work at an early stage startup so I got in touch with a [DeFi](https://en.wikipedia.org/wiki/Decentralized_finance) startup called [Dharma](http://dharma.io/). I had no clue what DeFi was but it was using this crypto thing I vaguely remembered hearing about a while back. After speaking with the team about their vision for a decentralized bank, I was red pilled.\n\nI joined the team but started having imposter syndrome in my first meeting. They talked about counterfactuals, meta transactions, proxy contracts, on-chain this and off-chain that. After the meeting, I had a mini dictionary worth of terms to look up on Wikipedia that night. Then we got to lunch and the entire team passionately debated token economics, incentive structures, governance mechanisms, and all this other stuff I had no clue about. I quickly realized this crypto thing wasn’t just slightly different than existing systems. It was completely different.\n\nOne of my favorite things about crypto is that it’s not just a technology. It’s a philosophy. It’s a belief system. It’s a way of viewing the world. It’s about questioning conventional systems and not caring if everyone else thinks you’re batshit crazy.\n\nOver the next few months, I learned more about cryptonetworks and how they worked under the hood. I remember the “aha moment” when I wrote my first smart contract. With just a few lines of code and a private key, I was able to transfer an internet-native currency anywhere in the world in seconds. \n\nI didn’t have to sign up for Stripe. I didn’t have to use the Plaid API to connect a bank account. I didn’t have to check if TransferWise supported payments for a specific country. There was no centralized party. Just a peer-to-peer cryptonetwork called Ethereum. It was pretty damn mindblowing.\n\nAfter the first few weeks at Dharma, I was confident that DeFi and crypto were the future. But I also got the itch to work on some of my own ideas. I wanted to build software for creative people. Writers. Artists. Musicians. Online teachers. I strongly believe our world depends on these types of people having the tools they need to serve their communities as best they can.\n\nFrankly, I also thought it would take a couple years before the crypto industry had the infrastructure in place for a mainstream consumer app to be built.\n\n\nSo I ended up leaving Dharma to take some time off and explore a few startup ideas. But a couple months ago I read a [manifesto](https://cryptomedia.wtf/) by [Zora](https://zora.co/) that changed how I thought about crypto.\n\nIt described a world where crypto could be used to give any digital media file (eg an image, a song, an essay, digital art, etc.) property rights. It explained how cryptonetworks could turn digital media into liquid financial assets, secured through cryptography, and programmable through smart contracts.\n\nAlthough the individual ideas weren’t new, they were combined and articulated in a way that just made sense. And not just to me.\n\n[Digital artists](https://www.reuters.com/article/retail-trading-nfts/insight-how-a-10-second-video-clip-sold-for-6-6-million-idUKL8N2KV6X9), [athletes](https://www.cnbc.com/2021/02/28/230-million-dollars-spent-on-nba-top-shot.html), [social media influencers](https://cryptoslate.com/logan-paul-nfts-sell-3-5-million-worth-on-first-day-of-release/), [tech executives](https://scottbelsky.medium.com/the-furry-lisa-cryptoart-the-new-economy-of-digital-creativity-6cb2300ea081), [media executives](https://darkstar.mirror.xyz/srmoGiN_1pg_toQGzCupkjWFOaf8xi0mM60zYpn_pwI), and [journalists](https://twitter.com/CaseyNewton/status/1366554892035219462) that never took the crypto weirdos seriously, seem to be taking notice.\n\nBut let’s be real. Is this latest NFT craze a bubble? Probz. Yet, is there at least a kernel of value in the idea of ownership over creative work? I think so.\n\nSo where do we go from here?\n\nWell, there’s been a lot of talk about high transaction fees and lack of scalability in these systems. Although I do think these problems should and will get fixed, a lack of technical scalability is kinda the point.\n\nCryptonetworks trade off technical scalability for social scalability.\n\nFacebook is technically scalable because it’s a social network that processes millions of transactions per second. Meanwhile, Bitcoin is socially scalable because it’s a trillion dollar economic network without a centralized authority.\n\nCrypto isn’t just a technological revolution. It’s also a revolution in capital formation and human coordination. How creative projects are funded. How groups of people are incentivized. How organizations are structured.\n\nYears from now, when I’m old and senile, I believe we’ll look back at this period as an [Internet Renaissance](https://twitter.com/ourZORA/status/1343210395704541189) of sorts. \n\nA time where we dared to fight back against systems that have been designed for centuries to elevate certain groups and keep others disenfranchised.\n\nWho knows though. Maybe all this crypto stuff really is just an intellectual ideal that’ll never work in practice. Regardless, I think it’s at least worth trying.", "timestamp": 1618430375, "digest": "pl07RMWdJZktHUAn8hZ02YlO35-Ju49orPrhaRnn4Vo", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "Rf5tnrAdH_cZh5B8V8PPrgUsm6uo5tfUwFTptEK1oPk", "title": "Internet Renaissance Vibez", "body": "[Test](split://0xdD0De8c18Fcb4fF092A50b7a6BE4620325407049)\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/81)\n\nThree years ago, I was about to graduate college and still had no idea what I wanted to do. I studied Finance but after a few internships, I realized I wasn’t meant to be in a cheap suit from JCPenny cranking out discounted cash flow models until midnight. At the time, a friend of mine had just finished a coding bootcamp and suggested I try learning to code.\n\nIt was my senior year so like any rational person, I decided to stop going to class so I could code all day (sorry mom). Over the next few months I picked up web development, built full-stack apps, and did so many [Leetcode](https://leetcode.com/) problems that you’d think it was a form of capital punishment. \n\nOnce I graduated, I bought a one-way ticket to San Francisco and stayed on a cozy air mattress in my friend’s living room. Over the next few months, I did some contract work for my friends at [Career Karma](http://careerkarma.com/) and eventually landed a job as a software engineer on the growth team at [Instacart](instacart.com).\n\nA little over a year later, I was looking to work at an early stage startup so I got in touch with a [DeFi](https://en.wikipedia.org/wiki/Decentralized_finance) startup called [Dharma](http://dharma.io/). I had no clue what DeFi was but it was using this crypto thing I vaguely remembered hearing about a while back. After speaking with the team about their vision for a decentralized bank, I was red pilled.\n\nI joined the team but started having imposter syndrome in my first meeting. They talked about counterfactuals, meta transactions, proxy contracts, on-chain this and off-chain that. After the meeting, I had a mini dictionary worth of terms to look up on Wikipedia that night. Then we got to lunch and the entire team passionately debated token economics, incentive structures, governance mechanisms, and all this other stuff I had no clue about. I quickly realized this crypto thing wasn’t just slightly different than existing systems. It was completely different.\n\nOne of my favorite things about crypto is that it’s not just a technology. It’s a philosophy. It’s a belief system. It’s a way of viewing the world. It’s about questioning conventional systems and not caring if everyone else thinks you’re batshit crazy.\n\nOver the next few months, I learned more about cryptonetworks and how they worked under the hood. I remember the “aha moment” when I wrote my first smart contract. With just a few lines of code and a private key, I was able to transfer an internet-native currency anywhere in the world in seconds. \n\nI didn’t have to sign up for Stripe. I didn’t have to use the Plaid API to connect a bank account. I didn’t have to check if TransferWise supported payments for a specific country. There was no centralized party. Just a peer-to-peer cryptonetwork called Ethereum. It was pretty damn mindblowing.\n\nAfter the first few weeks at Dharma, I was confident that DeFi and crypto were the future. But I also got the itch to work on some of my own ideas. I wanted to build software for creative people. Writers. Artists. Musicians. Online teachers. I strongly believe our world depends on these types of people having the tools they need to serve their communities as best they can.\n\nFrankly, I also thought it would take a couple years before the crypto industry had the infrastructure in place for a mainstream consumer app to be built.\n\n\nSo I ended up leaving Dharma to take some time off and explore a few startup ideas. But a couple months ago I read a [manifesto](https://cryptomedia.wtf/) by [Zora](https://zora.co/) that changed how I thought about crypto.\n\nIt described a world where crypto could be used to give any digital media file (eg an image, a song, an essay, digital art, etc.) property rights. It explained how cryptonetworks could turn digital media into liquid financial assets, secured through cryptography, and programmable through smart contracts.\n\nAlthough the individual ideas weren’t new, they were combined and articulated in a way that just made sense. And not just to me.\n\n[Digital artists](https://www.reuters.com/article/retail-trading-nfts/insight-how-a-10-second-video-clip-sold-for-6-6-million-idUKL8N2KV6X9), [athletes](https://www.cnbc.com/2021/02/28/230-million-dollars-spent-on-nba-top-shot.html), [social media influencers](https://cryptoslate.com/logan-paul-nfts-sell-3-5-million-worth-on-first-day-of-release/), [tech executives](https://scottbelsky.medium.com/the-furry-lisa-cryptoart-the-new-economy-of-digital-creativity-6cb2300ea081), [media executives](https://darkstar.mirror.xyz/srmoGiN_1pg_toQGzCupkjWFOaf8xi0mM60zYpn_pwI), and [journalists](https://twitter.com/CaseyNewton/status/1366554892035219462) that never took the crypto weirdos seriously, seem to be taking notice.\n\nBut let’s be real. Is this latest NFT craze a bubble? Probz. Yet, is there at least a kernel of value in the idea of ownership over creative work? I think so.\n\nSo where do we go from here?\n\nWell, there’s been a lot of talk about high transaction fees and lack of scalability in these systems. Although I do think these problems should and will get fixed, a lack of technical scalability is kinda the point.\n\nCryptonetworks trade off technical scalability for social scalability.\n\nFacebook is technically scalable because it’s a social network that processes millions of transactions per second. Meanwhile, Bitcoin is socially scalable because it’s a trillion dollar economic network without a centralized authority.\n\nCrypto isn’t just a technological revolution. It’s also a revolution in capital formation and human coordination. How creative projects are funded. How groups of people are incentivized. How organizations are structured.\n\nYears from now, when I’m old and senile, I believe we’ll look back at this period as an [Internet Renaissance](https://twitter.com/ourZORA/status/1343210395704541189) of sorts. \n\nA time where we dared to fight back against systems that have been designed for centuries to elevate certain groups and keep others disenfranchised.\n\nWho knows though. Maybe all this crypto stuff really is just an intellectual ideal that’ll never work in practice. Regardless, I think it’s at least worth trying.", "timestamp": 1618431731, "digest": "pl07RMWdJZktHUAn8hZ02YlO35-Ju49orPrhaRnn4Vo", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "xNgI12Xj94DmkYDwT2v-qVHV4jOOy_BS3EOvgv_FONI", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has  trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with developer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. The media associated with Solvency tokens are dynamic WebGL simulations. These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given a specific input, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the Arweave blockchain\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as OpenSea or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that ars lunga, vita brevis was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n", "timestamp": 1618432056, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "a8i-uLaOAhRYeoncEEVgxb0MzXGPCsg-_z83bj0m-0s", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has  trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with developer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. The media associated with Solvency tokens are dynamic WebGL simulations. These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given a specific input, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the Arweave blockchain.\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as OpenSea or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that ars lunga, vita brevis was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n", "timestamp": 1618435740, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "hSJl4yCHccEHZ8sDVW2raj0j3i3IWTYrRUDvOsYFbPc", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with developer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. The media associated with Solvency tokens are dynamic WebGL simulations. These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given a specific input, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the Arweave blockchain\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as OpenSea or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that ars lunga, vita brevis was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n", "timestamp": 1618436325, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "irdyUDKo1k17OXXjDHkHWAT6zk3nM10PqGXPa8GV4HA", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. \n\n>When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with developer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. **The media associated with Solvency tokens are dynamic WebGL simulations.** These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given a specific input, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the [Arweave blockchain](https://www.arweave.org/)\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as [OpenSea](https://opensea.io/) or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that *ars lunga, vita brevis* was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n", "timestamp": 1618436951, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "O_q4V_l2hsUsrpZZ8ZhY_pbIrTxeMEU6-I-kMXlZP0c", "title": "Introducing Auctions to Mirror", "body": "Today we're excited to officially introduce a new feature to the writers of Mirror: **You can now embed reserve auctions for zNFTs into any entry!**\n\n![](https://images.mirror-media.xyz/publication-images/48330597-1c94-4397-be25-e8648336b431.jpeg?height=900&width=1600&hide=true)\n\nThe journey to get to this release is full of adventure. A month ago, Mint Fund had an idea to add timed auctions to the Zora Protocol, and decided to crowdfund the effort on Mirror. Mint Fund ran this crowdfund on March 5th, raising 7 ETH to hire a developer to build a reserve auction contract.\n\n[https://twitter.com/themintfund/status/1368023582727696384?s=20](https://twitter.com/themintfund/status/1368023582727696384?s=20)\n\n## Building Auctions\n\nMirror and Zora worked together to outline a contract that would work with the Zora Protocol. Then, with the funds they raised, Mint Fund commissioned developer [Billy Rennekamp](https://twitter.com/billyrennekamp) to build an implementation of that outline.\n\nThis implementation was a promising first pass, but after we reviewed the code closely, we found at least 3 critical bugs and some other issues that needed to be patched before we could say that it was production ready. We did attempt to run the original version with a live auction, but it broke due to an interoperability issue that wasn't handled. Luckily, we were able to exploit a bug in the admin functionality, by creating a mock version of the Zora protocol, updating the Media address, and having the NFT and funds sent to our address, to retrieve the funds and the NFT. All of that is a feverish episode more appropriately described in its own post, but ultimately we were able to recover from the problem without loss of funds, and everyone involved was patient and gracious. It was yet another lesson in building and maintaining smart contracts on Ethereum, which requires extreme diligence.\n\nFollowing the failed trial run, the Mirror team took full ownership of the auction contract, which involved allocating a few days for intensively rewriting, reviewing, and testing it. We arrived at [a new version](https://github.com/mirror-xyz/reserve-auction-v2/blob/main/contracts/ReserveAuctionV3.sol) that we thought was tight from a security and UX perspective (developers: see note at end).\n\nWe then ran a high-value auction using this contract for the Generalist, including two animated NFTs by artist Jack Butcher:\n\n[https://twitter.com/mariodgabriele/status/1378032448664170505](https://twitter.com/mariodgabriele/status/1378032448664170505)\n\nThe auction was successful, and has been covered by a few mainstream media outlets such as *[The Hustle](https://twitter.com/mariodgabriele/status/1380174352113676294)*, which has over 1.5 million subscribers. This speaks to the power of protocols, the fascinating work that's happening on Ethereum, and how it can touch creators in a real way. We're delighted to be able to build these open source tools for creators to use.\n\n## Auction in Action\n\nHere is an example of the Mirror auction block in action. This auction was used for to auction the Mint Fund source code NFT.\n\n[Token #1522](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=1522)\n\n## Quick Walkthrough of its Design\n\nThe auction [code](https://github.com/mirror-xyz/reserve-auction-v2/blob/main/contracts/ReserveAuctionV3.sol) is really well documented, and anyone who wants to understand the functionality at a deep level should be able to do so by reading it. Almost every line contains a comment that explains its purpose. Here I'll quickly take you through some of the setup.\n\nIt is open-sourced it under the GPL3 license, which means anyone can use this code. It is compiled with Solidity version 0.6.8, so that it can be compiled and tested alongside Zora's contracts, and will be compatible.\n\n```jsx\n// SPDX-License-Identifier: GPL-3.0-or-later\npragma solidity 0.6.8;\npragma experimental ABIEncoderV2;\n```\n\nA key part of the philosophy of this auction design is that it's immutable — i.e. it's not configurable or upgradable by admins. If we want to change the rules, we'll deploy a new version and that'll exist separately. These configuration settings are all constants declared at the top of the file.\n\n```jsx\n// ============ Constants ============\n\n// The minimum amount of time left in an auction after a new bid is created; 15 min.\nuint16 public constant TIME_BUFFER = 900;\n// The ETH needed above the current bid for a new bid to be valid; 0.001 ETH.\nuint8 public constant MIN_BID_INCREMENT_PERCENT = 10;\n// Interface constant for ERC721, to check values in constructor.\nbytes4 private constant ERC721_INTERFACE_ID = 0x80ac58cd;\n// Allows external read `getVersion()` to return a version for the auction.\nuint256 private constant RESERVE_AUCTION_VERSION = 1;\n```\n\nThere are also some settings that are configured when the contract is deployed, which allows them to be different based on test networks. One important setting here is the `adminRecoveryAddress`, which is a multisig that Mirror controls that is able to fish out funds and any NFTs from the auction contract if something goes wrong. This is functionality that will be turned off forever once the auction is proven to be absolutely secure.\n\n```jsx\n// ============ Immutable Storage ============\n\n// The address of the ERC721 contract for tokens auctioned via this contract.\naddress public immutable nftContract;\n// The address of the WETH contract, so that ETH can be transferred via\n// WETH if native ETH transfers fail.\naddress public immutable wethAddress;\n// The address that initially is able to recover assets.\naddress public immutable adminRecoveryAddress;\n```\n\nThe auction contract can also be paused, which again allows us to step in if there's anything wrong with the contract once it's running. This will be turned off when all admin functionality is disabled. The last thing we want is for funds or NFTs to be lost due to a bug, and so we want to be explicit about the admin having this capability for the first few auctions. We definitely don't want this capability in the long-run, however.\n\nFinally, you can see that we store a mapping of all of the auctions that are currently running. Auctions are deleted from storage once they have finished running, to free up storage space on the Ethereum network.\n\n```jsx\n// ============ Mutable Storage ============\n\n/**\n * To start, there will be an admin account that can recover funds\n * if anything goes wrong. Later, this public flag will be irrevocably\n * set to false, removing any admin privileges forever.\n *\n * To check if admin recovery is enabled, call the public function `adminRecoveryEnabled()`.\n */\nbool private _adminRecoveryEnabled;\n/**\n * The account `adminRecoveryAddress` can also pause the contracts\n * while _adminRecoveryEnabled is enabled. This prevents people from using\n * the contract if there is a known problem with it.\n */\nbool private _paused;\n\n// A mapping of all of the auctions currently running.\nmapping(uint256 => Auction) public auctions;\n```\n\n## How Bidding Works\n\nCreate bid uses best practices in validating that the amount the user sends is the same amount that they intend to bid with — by adding an `amount` parameter to the `createBid` function, and requiring that it equal the implicit ETH value in `msg.value`. We also use OpenZeppelin's well-tested ReentrancyGuard function to block reentrancy in this function.\n\n```jsx\nfunction createBid(uint256 tokenId, uint256 amount)\n        external\n        payable\n        nonReentrant\n        whenNotPaused\n        auctionExists(tokenId)\n        auctionNotExpired(tokenId)\n    {\n        // Validate that the user's expected bid value matches the ETH deposit.\n        require(amount == msg.value, \"Amount doesn't equal msg.value\");\n        require(amount > 0, \"Amount must be greater than 0\");\n```\n\nFrom there we check if there is already a bid on this auction. If not, we keep track of the time when the first bid was placed. This will allow us to known whether to extend or close the auction later. We also validate that the amount is greater than the auction's reserve price.\n\n```jsx\nif (auctions[tokenId].amount == 0) {\n    // If so, it is the first bid.\n    auctions[tokenId].firstBidTime = block.timestamp;\n    // We only need to check if the bid matches reserve bid for the first bid,\n    // since future checks will need to be higher than any previous bid.\n    require(\n        amount >= auctions[tokenId].reservePrice,\n        \"Must bid reservePrice or more\"\n    );\n }\n```\n\nOtherwise, if this bid follows others in the auction, we ensure that it is at least 10% higher in value than the previous highest bid. We then transfer the previous bid amount to the previous bidder. Note: This means that we escrow funds for the highest bid for each auction, which differs from some other auction protocols, like Zora, which just require that there is an allowance on the given token.\n\n```jsx\n} else {\n    // Check that the new bid is sufficiently higher than the previous bid, by\n    // the percentage defined as MIN_BID_INCREMENT_PERCENT.\n    require(\n        amount >=\n            auctions[tokenId].amount.add(\n                // Add 10% of the current bid to the current bid.\n                auctions[tokenId]\n                    .amount\n                    .mul(MIN_BID_INCREMENT_PERCENT)\n                    .div(100)\n            ),\n        \"Must bid more than last bid by MIN_BID_INCREMENT_PERCENT amount\"\n    );\n\n    // Refund the previous bidder.\n    transferETHOrWETH(\n        auctions[tokenId].bidder,\n        auctions[tokenId].amount\n    );\n}\n```\n\nWe then update the auction's current bid amount along with the bidder. If we're within 15 minutes of the end of the auction, this new bid will extend the auction so that it ends in 15 minutes. Therefore, we always keep the auction alive for at least 15 minutes, until there hasn't been a bid for at least 15 minutes.\n\n```jsx\n// Update the current auction.\nauctions[tokenId].amount = amount;\nauctions[tokenId].bidder = msg.sender;\n// Compare the auction's end time with the current time plus the 15 minute extension,\n// to see whether we're near the auctions end and should extend the auction.\nif (auctionEnds(tokenId) < block.timestamp.add(TIME_BUFFER)) {\n    // We add onto the duration whenever time increment is required, so\n    // that the auctionEnds at the current time plus the buffer.\n    auctions[tokenId].duration += block.timestamp.add(TIME_BUFFER).sub(\n        auctionEnds(tokenId)\n    );\n}\n```\n\nFinally, we emit an event to broadcast that an auction bid has been created.\n\n```jsx\n// Emit the event that a bid has been made.\nemit AuctionBid(tokenId, nftContract, msg.sender, amount);\n```\n\n## Future Steps for the Zora Protocol\n\nZora is now going to take this work and expand it in ways that more fully utilize the Zora Protocol. While our version doesn't support bidding in any ERC20 token, it's quite tight and efficient. But many communities might want to run auctions in their own token, and that's where the full features of the Zora Protocol can be quite powerful. We look forward to seeing what Zora ends up deploying on this front.\n\n## Using Auctions on Mirror\n\nIf you earned and burned your $WRITE token to create a Mirror publication, you're now able to create an auction in your Mirror dashboard for any zNFT that you own. (If you haven't earned a $WRITE token yet, join [$WRITE RACE](https://mirror.xyz/race).)\n\nHere's how to do it:\n\n1. Mint any new or existing post on Mirror as an NFT. If you would like to mint an NFT that isn't a Mirror post, head over to [zora.co](https://zora.co/) and mint a zNFT through their UI.\n2. Go to [mirror.xyz/dashboard/auctions](http://mirror.xyz/dashboard/auctions) and click \"Create Auction\"\n3. Enter parameters like duration, reserve price, recipient address, etc.\n4. Deploy the auction\n5. Grab some tea. Meditate. Answer emails. Ponder existential life questions. After a couple minutes, your auction should be deployed to the Ethereum network.\n6. At this point, you will be redirected to the auction detail page. From here, copy the embed code and paste it in any post on Mirror and voilà! You're ready to go.\n\n## Note to developers\n\nAuditing companies such as Open Zeppelin and Trail of Bits are currently booked up until Q4 this year, and so it isn't feasible for us to get this formally audited by a reputable auditing firm in the near term. However, we do have a bug bounty — so if you're up for it, please review our code and report any issues you see, and we will grant rewards in ETH for doing so. The Mirror team will offer up to 10 ETH for bugs that could result in loss of assets.", "timestamp": 1618438615, "digest": "_OstP6dwYsX-0YsIaGDw-W4fs3VzESC_QpxrhiyM_Bg", "contributor": "0x9651B2a7Aa9ed9635cE896a1Af1a7d6294d5e902"}
{"id": "ZCWDCk1pfZLLHVm1-Yn3PDHP_lYCfDK54MnOfeJparY", "title": "Introducing Auctions to Mirror", "body": "Today we're excited to officially introduce a new feature to the writers of Mirror: **You can now embed reserve auctions for zNFTs into any entry!**\n\n![](https://images.mirror-media.xyz/publication-images/48330597-1c94-4397-be25-e8648336b431.jpeg?height=900&width=1600&hide=true)\n\nThe journey to get to this release is full of adventure. A month ago, Mint Fund had an idea to add timed auctions to the Zora Protocol, and decided to crowdfund the effort on Mirror. Mint Fund ran this crowdfund on March 5th, raising 7 ETH to hire a developer to build a reserve auction contract.\n\n[https://twitter.com/themintfund/status/1368023582727696384?s=20](https://twitter.com/themintfund/status/1368023582727696384?s=20)\n\n## Building Auctions\n\nMirror and Zora worked together to outline a contract that would work with the Zora Protocol. Then, with the funds they raised, Mint Fund commissioned developer [Billy Rennekamp](https://twitter.com/billyrennekamp) to build an implementation of that outline.\n\nThis implementation was a promising first pass, but after we reviewed the code closely, we found at least 3 critical bugs and some other issues that needed to be patched before we could say that it was production ready. We did attempt to run the original version with a live auction, but it broke due to an interoperability issue that wasn't handled. Luckily, we were able to exploit a bug in the admin functionality, by creating a mock version of the Zora protocol, updating the Media address, and having the NFT and funds sent to our address, to retrieve the funds and the NFT. All of that is a feverish episode more appropriately described in its own post, but ultimately we were able to recover from the problem without loss of funds, and everyone involved was patient and gracious. It was yet another lesson in building and maintaining smart contracts on Ethereum, which requires extreme diligence.\n\nFollowing the failed trial run, the Mirror team took full ownership of the auction contract, which involved allocating a few days for intensively rewriting, reviewing, and testing it. We arrived at [a new version](https://github.com/mirror-xyz/reserve-auction-v2/blob/main/contracts/ReserveAuctionV3.sol) that we thought was tight from a security and UX perspective (developers: see note at end).\n\nWe then ran a high-value auction using this contract for the Generalist, including two animated NFTs by artist Jack Butcher:\n\n[https://twitter.com/mariodgabriele/status/1378032448664170505](https://twitter.com/mariodgabriele/status/1378032448664170505)\n\nThe auction was successful, and has been covered by a few mainstream media outlets such as *[The Hustle](https://twitter.com/mariodgabriele/status/1380174352113676294)*, which has over 1.5 million subscribers. This speaks to the power of protocols, the fascinating work that's happening on Ethereum, and how it can touch creators in a real way. We're delighted to be able to build these open source tools for creators to use.\n\n## Auction in Action\n\nHere is an example of the Mirror auction block in action. This auction was used for to auction the Mint Fund source code NFT.\n\n[Token #1522](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=1522)\n\n## Quick Walkthrough of its Design\n\nThe auction [code](https://github.com/mirror-xyz/reserve-auction-v2/blob/main/contracts/ReserveAuctionV3.sol) is really well documented, and anyone who wants to understand the functionality at a deep level should be able to do so by reading it. Almost every line contains a comment that explains its purpose. Here I'll quickly take you through some of the setup.\n\nIt is open-sourced under the GPL3 license, which means anyone can use this code. It is compiled with Solidity version 0.6.8, so that it can be compiled and tested alongside Zora's contracts, and will be compatible.\n\n```jsx\n// SPDX-License-Identifier: GPL-3.0-or-later\npragma solidity 0.6.8;\npragma experimental ABIEncoderV2;\n```\n\nA key part of the philosophy of this auction design is that it's immutable — i.e. it's not configurable or upgradable by admins. If we want to change the rules, we'll deploy a new version and that'll exist separately. These configuration settings are all constants declared at the top of the file.\n\n```jsx\n// ============ Constants ============\n\n// The minimum amount of time left in an auction after a new bid is created; 15 min.\nuint16 public constant TIME_BUFFER = 900;\n// The ETH needed above the current bid for a new bid to be valid; 0.001 ETH.\nuint8 public constant MIN_BID_INCREMENT_PERCENT = 10;\n// Interface constant for ERC721, to check values in constructor.\nbytes4 private constant ERC721_INTERFACE_ID = 0x80ac58cd;\n// Allows external read `getVersion()` to return a version for the auction.\nuint256 private constant RESERVE_AUCTION_VERSION = 1;\n```\n\nThere are also some settings that are configured when the contract is deployed, which allows them to be different based on test networks. One important setting here is the `adminRecoveryAddress`, which is a multisig that Mirror controls that is able to fish out funds and any NFTs from the auction contract if something goes wrong. This is functionality that will be turned off forever once the auction is proven to be absolutely secure.\n\n```jsx\n// ============ Immutable Storage ============\n\n// The address of the ERC721 contract for tokens auctioned via this contract.\naddress public immutable nftContract;\n// The address of the WETH contract, so that ETH can be transferred via\n// WETH if native ETH transfers fail.\naddress public immutable wethAddress;\n// The address that initially is able to recover assets.\naddress public immutable adminRecoveryAddress;\n```\n\nThe auction contract can also be paused, which again allows us to step in if there's anything wrong with the contract once it's running. This will be turned off when all admin functionality is disabled. The last thing we want is for funds or NFTs to be lost due to a bug, and so we want to be explicit about the admin having this capability for the first few auctions. We definitely don't want this capability in the long-run, however.\n\nFinally, you can see that we store a mapping of all of the auctions that are currently running. Auctions are deleted from storage once they have finished running, to free up storage space on the Ethereum network.\n\n```jsx\n// ============ Mutable Storage ============\n\n/**\n * To start, there will be an admin account that can recover funds\n * if anything goes wrong. Later, this public flag will be irrevocably\n * set to false, removing any admin privileges forever.\n *\n * To check if admin recovery is enabled, call the public function `adminRecoveryEnabled()`.\n */\nbool private _adminRecoveryEnabled;\n/**\n * The account `adminRecoveryAddress` can also pause the contracts\n * while _adminRecoveryEnabled is enabled. This prevents people from using\n * the contract if there is a known problem with it.\n */\nbool private _paused;\n\n// A mapping of all of the auctions currently running.\nmapping(uint256 => Auction) public auctions;\n```\n\n## How Bidding Works\n\nCreate bid uses best practices in validating that the amount the user sends is the same amount that they intend to bid with — by adding an `amount` parameter to the `createBid` function, and requiring that it equal the implicit ETH value in `msg.value`. We also use OpenZeppelin's well-tested ReentrancyGuard function to block reentrancy in this function.\n\n```jsx\nfunction createBid(uint256 tokenId, uint256 amount)\n        external\n        payable\n        nonReentrant\n        whenNotPaused\n        auctionExists(tokenId)\n        auctionNotExpired(tokenId)\n    {\n        // Validate that the user's expected bid value matches the ETH deposit.\n        require(amount == msg.value, \"Amount doesn't equal msg.value\");\n        require(amount > 0, \"Amount must be greater than 0\");\n```\n\nFrom there we check if there is already a bid on this auction. If not, we keep track of the time when the first bid was placed. This will allow us to known whether to extend or close the auction later. We also validate that the amount is greater than the auction's reserve price.\n\n```jsx\nif (auctions[tokenId].amount == 0) {\n    // If so, it is the first bid.\n    auctions[tokenId].firstBidTime = block.timestamp;\n    // We only need to check if the bid matches reserve bid for the first bid,\n    // since future checks will need to be higher than any previous bid.\n    require(\n        amount >= auctions[tokenId].reservePrice,\n        \"Must bid reservePrice or more\"\n    );\n }\n```\n\nOtherwise, if this bid follows others in the auction, we ensure that it is at least 10% higher in value than the previous highest bid. We then transfer the previous bid amount to the previous bidder. Note: This means that we escrow funds for the highest bid for each auction, which differs from some other auction protocols, like Zora, which just require that there is an allowance on the given token.\n\n```jsx\n} else {\n    // Check that the new bid is sufficiently higher than the previous bid, by\n    // the percentage defined as MIN_BID_INCREMENT_PERCENT.\n    require(\n        amount >=\n            auctions[tokenId].amount.add(\n                // Add 10% of the current bid to the current bid.\n                auctions[tokenId]\n                    .amount\n                    .mul(MIN_BID_INCREMENT_PERCENT)\n                    .div(100)\n            ),\n        \"Must bid more than last bid by MIN_BID_INCREMENT_PERCENT amount\"\n    );\n\n    // Refund the previous bidder.\n    transferETHOrWETH(\n        auctions[tokenId].bidder,\n        auctions[tokenId].amount\n    );\n}\n```\n\nWe then update the auction's current bid amount along with the bidder. If we're within 15 minutes of the end of the auction, this new bid will extend the auction so that it ends in 15 minutes. Therefore, we always keep the auction alive for at least 15 minutes, until there hasn't been a bid for at least 15 minutes.\n\n```jsx\n// Update the current auction.\nauctions[tokenId].amount = amount;\nauctions[tokenId].bidder = msg.sender;\n// Compare the auction's end time with the current time plus the 15 minute extension,\n// to see whether we're near the auctions end and should extend the auction.\nif (auctionEnds(tokenId) < block.timestamp.add(TIME_BUFFER)) {\n    // We add onto the duration whenever time increment is required, so\n    // that the auctionEnds at the current time plus the buffer.\n    auctions[tokenId].duration += block.timestamp.add(TIME_BUFFER).sub(\n        auctionEnds(tokenId)\n    );\n}\n```\n\nFinally, we emit an event to broadcast that an auction bid has been created.\n\n```jsx\n// Emit the event that a bid has been made.\nemit AuctionBid(tokenId, nftContract, msg.sender, amount);\n```\n\n## Future Steps for the Zora Protocol\n\nZora is now going to take this work and expand it in ways that more fully utilize the Zora Protocol. While our version doesn't support bidding in any ERC20 token, it's quite tight and efficient. But many communities might want to run auctions in their own token, and that's where the full features of the Zora Protocol can be quite powerful. We look forward to seeing what Zora ends up deploying on this front.\n\n## Using Auctions on Mirror\n\nIf you earned and burned your $WRITE token to create a Mirror publication, you're now able to create an auction in your Mirror dashboard for any zNFT that you own. (If you haven't earned a $WRITE token yet, join [$WRITE RACE](https://mirror.xyz/race).)\n\nHere's how to do it:\n\n1. Mint any new or existing post on Mirror as an NFT. If you would like to mint an NFT that isn't a Mirror post, head over to [zora.co](https://zora.co/) and mint a zNFT through their UI.\n2. Go to [mirror.xyz/dashboard/auctions](http://mirror.xyz/dashboard/auctions) and click \"Create Auction\"\n3. Enter parameters like duration, reserve price, recipient address, etc.\n4. Deploy the auction\n5. Grab some tea. Meditate. Answer emails. Ponder existential life questions. After a couple minutes, your auction should be deployed to the Ethereum network.\n6. At this point, you will be redirected to the auction detail page. From here, copy the embed code and paste it in any post on Mirror and voilà! You're ready to go.\n\n## Note to developers\n\nAuditing companies such as Open Zeppelin and Trail of Bits are currently booked up until Q4 this year, and so it isn't feasible for us to get this formally audited by a reputable auditing firm in the near term. However, we do have a bug bounty — so if you're up for it, please review our code and report any issues you see, and we will grant rewards in ETH for doing so. The Mirror team will offer up to 10 ETH for bugs that could result in loss of assets.", "timestamp": 1618438763, "digest": "_OstP6dwYsX-0YsIaGDw-W4fs3VzESC_QpxrhiyM_Bg", "contributor": "0x9651B2a7Aa9ed9635cE896a1Af1a7d6294d5e902"}
{"id": "awHkMWVh8tQ7mdW31bUD3LcziTkRvkZ-vuwUunbg29I", "title": "Packy Test v2", "body": "Packy\n\n[Funzies](crowdfund://0xa901f97bf228EC96e7c24843fe3D457985632266?network=rinkeby)", "timestamp": 1618442530, "digest": "HNrKEK9xnPW1AG6J-PDzMj9aTh1CUxXLWiwBi_qQsRI", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0x491a96b88c44060c3fbdd5fa55e2dfef6e3e66c8e7724d52d1dee27908e64088\"}"}
{"id": "mj497jRKczPmHd1aC8zEB8wifR8lpP9EwjeKljHOrUA", "title": "Packy Test v2", "body": "[Funzies](crowdfund://0xa901f97bf228EC96e7c24843fe3D457985632266?network=rinkeby)", "timestamp": 1618442519, "digest": "HNrKEK9xnPW1AG6J-PDzMj9aTh1CUxXLWiwBi_qQsRI", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0x491a96b88c44060c3fbdd5fa55e2dfef6e3e66c8e7724d52d1dee27908e64088\"}"}
{"id": "3L56DsiKLy_49UMqCTEOIXR3bXozfGDUDLVt7AwneG0", "title": "Editor Guide", "body": "The Mirror Editor enables composing entries with media blocks, such as images and videos, along with crypto economic blocks, like crowdfunds and auctions. It uses plain text and [Markdown formatting](https://daringfireball.net/projects/markdown/syntax) with a few simple formatting conventions.\n\n### **Modes**\nComposition takes place in **`Edit`** mode. To preview your entry as it will appear on your publication enter **`Preview`** mode. You can toggle between them with the related buttons in the toolbar.\n\n### **Importing entries**\nTo import entries from elsewhere, such as Medium or Substack, open the secondary `•••` menu in the navigation, then click **Import entry**. Next, enter the URL to your entry. The url will be parsed into markdown, and set as the content of your entry. Please only import content you have created and own.\n\n### **Creating blocks**\nTo easily create a media or economic block, first click inside your entry to place the curser where you’d like the block to appear. Next, click the **Blocks** area of the Toolbar, or focus with the keyboard shortcut `⌘+/`. The blocks menu will appear, showing you all available blocks. Selecting a block prompts you for secondary information. Once you’re satisfied, confirm the information to insert the block into your entry.\n\n## Blocks\n\nMedia embeds and economic blocks on Mirror are recognized with a simple formatting convention: an individual link on it’s own line of text. To manually create a block, insert a new line of text, add a link, then add a line break. ***Ensure that the new line only contains a single link***. Here is an example which creates a Youtube video embed.\n\n```markdown\nThe 90-minute presentation essentially demonstrated almost all the fundamental elements of modern personal computing:\n\n[The Mother of All Demos](https://www.youtube.com/watch?v=yJDv-zdhzMY)\n\nEngelbart's presentation was the first to publicly demonstrate all of these elements in a single system.\n```\n\n[The Mother of All Demos](https://www.youtube.com/watch?v=FCiBUawCawo)\n\nWe’ve decided to parse basic links—as opposed to introducing Mirror specific syntax—to ensure portability. If the markdown is rendered with Mirror you will see a Mirror Block. If anywhere else, you’ll see a simple plain text link. There are a number of integrations, and we’re adding more every week.\n\n## NFT embeds\n\nEmbed an NFT by creating a link. Prefix the URL with the `ethereum://` protocol, followed by the `address/id`. Currently supports a images, audio, video, and text embeds. Mirror currently supports EthBlock.art, Foundation, Rarible, SuperRare and Zora.\n\n```md\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n```\n\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n\n## Link previews\n\nMirror displays a progressively enhanced preview of all links based on the universal standard of [OpenGraph tags](https://ogp.me).\n\n```md\n[Mirror](https://mirror.xyz)\n```\n\n[Mirror](https://mirror.xyz)\n\n## Twitter\n\nEmbed an individual Tweet or an entire Tweet thread by inserting a link to any Twitter URL.\n\n```md\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n```\n\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n\n## Youtube\n\n```md\n[Design jam on Youtube](https://www.youtube.com/watch?v=geRPXByWV2U&feature=youtu.be)\n```\n\n[Design jam on Youtube](https://www.youtube.com/watch?v=geRPXByWV2U)\n\n## Video embeds\n\nEmbed an `.mp4` video by inserting a link to an externally hosted video file. It is also possible to set `autoplay`, `muted`, `loop` and `controls` by setting the related query parameters. Ensure you manually define the `width` and `height` parameters to reserve the vertical space for your video, otherwise jumping may appear.\n\n```md\n[Powers of Ten](https://jkm-library.s3.amazonaws.com/blocks/powers-of-10.mp4?height=480&width=640&autoplay=true&loop=true&muted=true)\n```\n\n[Powers of Ten](https://jkm-library.s3.amazonaws.com/blocks/powers-of-10.mp4?height=480&width=640&autoplay=true&loop=true&muted=true)\n\n---\n\nA brief list of future enhancements:\n\n- Support for copy-and-paste between tools like Google Docs and platforms such as Medium.\n- Additional media block integrations.\n\nAre we missing an integration you’d like to see? Please don’t hesitate to [say hello](https://twitter.com/viamirror)!\n", "timestamp": 1618443289, "digest": "fMzen4XH0ez6PIu2H7c_ynrLyTajh41rPVIkSVaqDsE", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "XrPY4e13ceG9udF7bbblf99ApUXXZem0gjSW7W9sKG8", "title": "Editor Guide", "body": "The Mirror Editor enables composing entries with media blocks, such as images and videos, along with crypto economic blocks, like crowdfunds and auctions. It uses plain text and [Markdown formatting](https://daringfireball.net/projects/markdown/syntax) with a few simple formatting conventions.\n\n### **Modes**\nComposition takes place in **`Edit`** mode. To preview your entry as it will appear on your publication enter **`Preview`** mode. You can toggle between them with the related buttons in the toolbar.\n\n### **Importing entries**\nTo import entries from elsewhere, such as Medium or Substack, open the secondary `•••` menu in the navigation, then click **Import entry**. Next, enter the URL to your entry. The url will be parsed into markdown, and set as the content of your entry. Please only import content you have created and own.\n\n### **Creating blocks**\nTo easily create a media or economic block, first click inside your entry to place the curser where you’d like the block to appear. Next, click the **Blocks** area of the Toolbar, or focus with the keyboard shortcut `⌘+/`. The blocks menu will appear, showing you all available blocks. Selecting a block prompts you for secondary information. Once you’re satisfied, confirm the information to insert the block into your entry.\n\n## Blocks\n\nMedia embeds and economic blocks on Mirror are recognized with a simple formatting convention: an individual link on it’s own line of text. To manually create a block, insert a new line of text, add a link, then add a line break. ***Ensure that the new line only contains a single link***. Here is an example which creates a Youtube video embed.\n\n```markdown\nThe 90-minute presentation essentially demonstrated almost all the fundamental elements of modern personal computing:\n\n[The Mother of All Demos](https://www.youtube.com/watch?v=yJDv-zdhzMY)\n\nEngelbart's presentation was the first to publicly demonstrate all of these elements in a single system.\n```\n\n[The Mother of All Demos](https://www.youtube.com/watch?v=FCiBUawCawo)\n\nWe’ve decided to parse basic links—as opposed to introducing Mirror specific syntax—to ensure portability. If the markdown is rendered with Mirror you will see a Mirror Block. If anywhere else, you’ll see a simple plain text link. There are a number of integrations, and we’re adding more every week.\n\n## NFTs\n\nEmbed an NFT by creating a link. Prefix the URL with the `ethereum://` protocol, followed by the `address/id`. Currently supports a images, audio, video, and text embeds. Mirror currently supports EthBlock.art, Foundation, Rarible, SuperRare and Zora.\n\n```md\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n```\n\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n\n## Crowdfund\n\nCrowdfund example\n\n```md\n[Burn Alpha](crowdfund://0x95d0A89943E0e3e05d290Fc07462c148EB6a11Ff?network=homestead)\n```\n\n[Burn Alpha](crowdfund://0x95d0A89943E0e3e05d290Fc07462c148EB6a11Ff?network=homestead)\n\n## Auction\n\n[Create an auction](/dashboard/auctions) and deploy it. After it has been deployed a snippet of code will appear in the `Embed auction` section. Copy and paste this into an entry. It should look like the example below, but with your dedicated auction address and `tokenID`.\n\n```md\n[Token #1522](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=1522)\n```\n\n[Token #1522](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=1522)\n\n## Images\n\nEmbedding images is possible by dragging and dropping into the editor, selecting **Image** in the blocks menu, or manually creating a markdown image tag. Reserving the space of the image prior to loading is possible by defining the `width` and `height` query parameters, which are automatically set when uploading an image to Mirror.\n\n```md\n![Image caption](https://images.mirror-media.xyz/publication-images/589ec9e9-59a2-4505-ba83-35210d01c223.jpeg?height=1180&width=1588)\n```\n\n![Image caption](https://images.mirror-media.xyz/publication-images/589ec9e9-59a2-4505-ba83-35210d01c223.jpeg?height=1180&width=1588)\n\n## Link previews\n\nMirror displays a progressively enhanced preview of all links based on the universal standard of [OpenGraph tags](https://ogp.me).\n\n```md\n[Mirror](https://mirror.xyz)\n```\n\n[Mirror](https://mirror.xyz)\n\n## Twitter\n\nEmbed an individual Tweet or an entire Tweet thread by inserting a link to any Twitter URL.\n\n```md\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n```\n\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n\n## Youtube\n\n```md\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n```\n\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n\n## Video embeds\n\nEmbed an `.mp4` video by inserting a link to an externally hosted video file. It is also possible to set `autoplay`, `muted`, `loop` and `controls` by setting the related query parameters. Ensure you manually define the `width` and `height` parameters to reserve the vertical space for your video.\n\n```md\n[Powers of Ten](https://jkm-library.s3.amazonaws.com/blocks/powers-of-10.mp4?height=480&width=640&autoplay=true&loop=true&muted=true)\n```\n\n[Powers of Ten](https://jkm-library.s3.amazonaws.com/blocks/powers-of-10.mp4?height=480&width=640&autoplay=true&loop=true&muted=true)\n\n## iFrames\n\nIt’s possible to embed any page by creating an iFrame block. This is useful when for embedding interactive WebGL content, for example. Simply set `display=iframe` as a query parameter.\n\n```md\n[ThreeJS Demo](https://threejs.org/examples/webgl_water_flowmap.html?display=iframe)\n```\n\n[ThreeJS Demo](https://threejs.org/examples/webgl_water_flowmap.html?display=iframe)\n\n## Layout sizes\n\nIf you’re looking to create a more editorial layout for your entry, consider setting custom layout sizes for certain media blocks. Supported block types include Image, Video, Youtube and iFrame.\n\nThe block size is set with a query parameter, and it is possible to choose from both `medium` and `large`. For example, below is a `large` image which extends to the edges of the page.\n\n```md\n![](https://images.mirror-media.xyz/publication-images/da461938-5ccf-4397-aa6d-d082cbba2128.jpeg?height=1533&width=2300&size=large)\n```\n\n![](https://s3-us-west-2.amazonaws.com/images.mirror-media.xyz/publication-images/layouts.svg?height=402&width=897)\n\n\n## Future enhancements\n\nMirror is a new project, and our editor is intentionally focused as we move fast to create new economic tools to fund great writing. In time we plan to introduce a new editor which enables enables editing in place, removing the need to toggle between edit and preview modes. Until then, we appreciate your patience, and welcome any feedback.", "timestamp": 1618449350, "digest": "fMzen4XH0ez6PIu2H7c_ynrLyTajh41rPVIkSVaqDsE", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "BL1JCnqOgdfx7mOvig86ssiXpvpK2JXMIJHOHH54-r4", "title": "Yupdate 3/1/21", "body": "### Yup Rebrand\n\nWe're thrilled to announce the new face of Yup 😁. Many expressions and colors, one collective. Keep an eye out for this one; you'll see it all over the place in the next few days 👀.\n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/9c7f6d3d-568a-430c-af6e-c15ea630945a.png)\n\n## Web App Updates:\n\n### Feeds\n\nWe've updated our Web App feeds to balance recent and influential content more dynamically ⚖️. The result is fresher and higher quality feeds. Search through them to find NFTs, tweets, articles, etc., blowing up in the last day or hour.\n\n### Cleaner and Leaner\n\nThe new sidebar and content cards make it easier to browse through posts and navigate our Web App features 🏄‍♂️. Through fancy styling techniques, posts are more clearly demarcated and \"pop\" a bit more, and the sidebar aggregates the features of the Web App all in one place.\n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/34ac957b-e132-47bc-bdff-5d3458849a0b.gif)\n\n## Content:\n\nThe community does such a good job of curating content, our job is to just get out of the way. With that in mind, here are the top NFTs of the week according to Yup feeds. If you like the content you see, click here to [subscribe](http://yupio.typeform.com/to/XFUH2bDC?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJAeXVwLmlvIn0%3D#email=xxxxx) to our weekly NFT newsletter 🙂.\n\n![](https://f8n-ipfs-production.imgix.net/QmX4uumw183BEyTvUMRGVYpFNmMgCigEFJWpfnE2HCBjS7/nft.png)\n\n❤️  86   🌸     🦄  29\n\n[https://f8n-ipfs-production.imgix.net/QmdWaKwky8Lf8JsfepJQ8TN1GRLKVezxE3raiSeG3rHyUY/nft.mp4](https://f8n-ipfs-production.imgix.net/QmdWaKwky8Lf8JsfepJQ8TN1GRLKVezxE3raiSeG3rHyUY/nft.mp4)\n\n❤️  68   🌸  36   🦄  20\n\n![](https://ipfs.pixura.io/ipfs/QmWdJpimYrXWiy1Kd8BKqfaxRSU8QFFxLNusNMXf8BPpYw/adstill.jpg)\n\nThanks for tuning into another Yupdate. See you all in the next one ✌️!", "timestamp": 1618449525, "digest": "NE07UNCG9TkBKKo_OcZY4jH0ogNuNVSly1m7Xqu-OZA", "contributor": "0x30E838D51c61811d382962B4e0699715462DcdE1"}
{"id": "hFvvslt-VIp5Dt_ltY8_rSWjNtou5UaNl3_FHRh6ey4", "title": "Editor Guide", "body": "The Mirror Editor enables composing entries with media blocks, such as images and videos, along with crypto economic blocks, like crowdfunds and auctions. It uses plain text and [Markdown formatting](https://daringfireball.net/projects/markdown/syntax) with a few simple formatting conventions.\n\n### **Modes**\nComposition takes place in **`Edit`** mode. To preview your entry as it will appear on your publication enter **`Preview`** mode. You can toggle between them with the related buttons in the toolbar.\n\n### **Importing entries**\nTo import entries from elsewhere, such as Medium or Substack, open the secondary `•••` menu in the navigation, then click **Import entry**. Next, enter the URL to your entry. The url will be parsed into markdown, and set as the content of your entry. Please only import content you have created and own.\n\n### **Creating blocks**\nTo easily create a media or economic block, first click inside your entry to place the curser where you’d like the block to appear. Next, click the **Blocks** area of the Toolbar, or focus with the keyboard shortcut `⌘+/`. The blocks menu will appear, showing you all available blocks. Selecting a block prompts you for secondary information. Once you’re satisfied, confirm the information to insert the block into your entry.\n\n## Blocks\n\nMedia embeds and economic blocks on Mirror are recognized with a simple formatting convention: an individual link on it’s own line of text. To manually create a block, insert a new line of text, add a link, then add a line break. ***Ensure that the new line only contains a single link***. Here is an example which creates a Youtube video embed.\n\n```markdown\nThe 90-minute presentation essentially demonstrated almost all the fundamental elements of modern personal computing:\n\n[The Mother of All Demos](https://www.youtube.com/watch?v=yJDv-zdhzMY)\n\nEngelbart's presentation was the first to publicly demonstrate all of these elements in a single system.\n```\n\n[The Mother of All Demos](https://www.youtube.com/watch?v=FCiBUawCawo)\n\nWe’ve decided to parse basic links—as opposed to introducing Mirror specific syntax—to ensure portability. If the markdown is rendered with Mirror you will see a Mirror Block. If anywhere else, you’ll see a simple plain text link. There are a number of integrations, and we’re adding more every week.\n\n## NFTs\n\nEmbed an NFT by creating a link. Prefix the URL with the `ethereum://` protocol, followed by the `address/id`. Currently supports a images, audio, video, and text embeds. Mirror currently supports EthBlock.art, Foundation, Rarible, SuperRare and Zora.\n\n```md\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n```\n\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n\n## Crowdfund\n\nCrowdfund example\n\n```md\n[Burn Alpha](crowdfund://0x95d0A89943E0e3e05d290Fc07462c148EB6a11Ff?network=homestead)\n```\n\n[Burn Alpha](crowdfund://0x95d0A89943E0e3e05d290Fc07462c148EB6a11Ff?network=homestead)\n\n## Auction\n\n[Create an auction](/dashboard/auctions) and deploy it. After it has been deployed a snippet of code will appear in the `Embed auction` section. Copy and paste this into an entry. It should look like the example below, but with your dedicated auction address and `tokenID`.\n\n```md\n[Token #1522](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=1522)\n```\n\n[Token #1522](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=1522)\n\n## Images\n\nEmbedding images is possible by dragging and dropping into the editor, selecting **Image** in the blocks menu, or manually creating a markdown image tag. Reserving the space of the image prior to loading is possible by defining the `width` and `height` query parameters, which are automatically set when uploading an image to Mirror.\n\n```md\n![Image caption](https://images.mirror-media.xyz/publication-images/589ec9e9-59a2-4505-ba83-35210d01c223.jpeg?height=1180&width=1588)\n```\n\n![Image caption](https://images.mirror-media.xyz/publication-images/589ec9e9-59a2-4505-ba83-35210d01c223.jpeg?height=1180&width=1588)\n\n## Link previews\n\nMirror displays a progressively enhanced preview of all links based on the universal standard of [OpenGraph tags](https://ogp.me).\n\n```md\n[Mirror](https://mirror.xyz)\n```\n\n[Mirror](https://mirror.xyz)\n\n## Twitter\n\nEmbed an individual Tweet or an entire Tweet thread by inserting a link to any Twitter URL.\n\n```md\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n```\n\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n\n## Youtube\n\n```md\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n```\n\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n\n## Video embeds\n\nEmbed an `.mp4` video by inserting a link to an externally hosted video file. It is also possible to set `autoplay`, `muted`, `loop` and `controls` by setting the related query parameters. Ensure you manually define the `width` and `height` parameters to reserve the vertical space for your video.\n\n```md\n[Powers of Ten](https://jkm-library.s3.amazonaws.com/blocks/powers-of-10.mp4?height=480&width=640&autoplay=true&loop=true&muted=true)\n```\n\n[Powers of Ten](https://jkm-library.s3.amazonaws.com/blocks/powers-of-10.mp4?height=480&width=640&autoplay=true&loop=true&muted=true)\n\n## iFrames\n\nIt’s possible to embed any page by creating an iFrame block. This is useful when for embedding interactive WebGL content, for example. Simply set `display=iframe` as a query parameter.\n\n```md\n[ThreeJS Demo](https://threejs.org/examples/webgl_water_flowmap.html?display=iframe)\n```\n\n[ThreeJS Demo](https://threejs.org/examples/webgl_water_flowmap.html?display=iframe)\n\n## Layout sizes\n\nIf you’re looking to create a more editorial layout for your entry, consider setting custom layout sizes for certain media blocks. Supported block types include Image, Video, Youtube and iFrame.\n\nThe block size is set with a query parameter, and it is possible to choose from both `medium` and `large`. For example, below is a `large` image which extends to the edges of the page.\n\n```md\n![](https://images.mirror-media.xyz/publication-images/da461938-5ccf-4397-aa6d-d082cbba2128.jpeg?height=1533&width=2300&size=large)\n```\n\n![](https://s3-us-west-2.amazonaws.com/images.mirror-media.xyz/publication-images/layouts.svg?height=402&width=897)\n\n\n## Future enhancements\n\nMirror is a new project, and our editor is intentionally focused as we move fast to create new economic tools to fund great writing. In time we plan to introduce a new editor which enables enables editing in place, removing the need to toggle between edit and preview modes. Until then, we appreciate your patience, and [welcome any feedback](https://discord.gg/6d7tsjPBjS).", "timestamp": 1618449545, "digest": "fMzen4XH0ez6PIu2H7c_ynrLyTajh41rPVIkSVaqDsE", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "2OgjeL91az5NDmU5Agbp_OMSKq-6924iEmnhUGDsbzg", "title": "Yupdate 3/12/21: 🏄 New Features Incoming 🏄", "body": "## Hey Yupster,\n\nThis week we're highlighting our new [Search Results page](http://app.yup.io/?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJAeXVwLmlvIn0%3D), [Analytics page](http://app.yup.io/analytics/onemorejoexx?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJAeXVwLmlvIn0%3D), and our new Collections feature coming soon. This is a big one, let's get right into it 💪.\n\n### Search Results Page\n\nBrowse through Yup with ease with our new search results page 🌈. Look up any subject, post, or feed and scroll through all the relevant content.\n\n### Search Results Page\n\nBrowse through Yup with ease with our new Search Results page 🌈. Look up any subject, post, or feed and scroll through all the relevant content.\n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/fa760c4c-866f-4670-98c2-9203a93e3499.gif)\n\n### Analytics\n\nThe Analytics page on profiles keeps you informed about your activity and earnings on Yup. Track your progress from account creation to present day and see which platforms you gravitate to most. Time to optimize your Yup experience and rewards 🤑.\n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/41cfb697-1f5b-47d1-81b0-f3b1541a761a.gif)\n\n### Landing Site\n\nYup is getting prettier by the week 🌸. In our last newsletter we rolled out our new logo, and in this one we're highlighting our landing site's makeover. Our site now has easy-to-read fonts, as well as a message that lives up to our ambitions: welcome to the social network for curators.\n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/e6a59ce9-607d-4a88-87c2-fee1373f0daa.gif)\n\n### Coming Soon: Collections\n\nCollections allow you to curate content by a topic of your choice and showcase it in your Yup profile. Think of public Spotify playlists or Pinterest profiles, but for any piece of content across the web. Curation will never be the same ✨.\n\n## Content:\n\nHere are the top NFTs of the week according to Yup feeds. If you like the content you see, click here to [subscribe](http://yupio.typeform.com/to/XFUH2bDC?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJAeXVwLmlvIn0%3D#email=xxxxx) to our weekly NFT newsletter 🙂.\n\n![](https://f8n-ipfs-production.imgix.net/QmX4uumw183BEyTvUMRGVYpFNmMgCigEFJWpfnE2HCBjS7/nft.png)\n\n❤️  86   🌸     🦄  29\n\n[](https://f8n-ipfs-production.imgix.net/QmdWaKwky8Lf8JsfepJQ8TN1GRLKVezxE3raiSeG3rHyUY/nft.mp4)\n\n❤️  68   🌸  36   🦄  20\n\n![](https://ipfs.pixura.io/ipfs/QmWdJpimYrXWiy1Kd8BKqfaxRSU8QFFxLNusNMXf8BPpYw/adstill.jpg)\n\nThanks for tuning into another Yupdate. See you all in the next one ✌️!", "timestamp": 1618449765, "digest": "TM1S4EaRs3toNlJNm25yf3YLrLRWLDbkeSfwdYpArAg", "contributor": "0x30E838D51c61811d382962B4e0699715462DcdE1"}
{"id": "2wb3P5lPkVKKbPyKooDBWoWND0eeJPxL_1qq9KZMunU", "title": "Yupdate 4/12/21: 🏄 New Features Incoming 🏄", "body": "## Hey Yupster,\n\nThis week we're highlighting our new [Search Results page](http://app.yup.io/?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJAeXVwLmlvIn0%3D), [Analytics page](http://app.yup.io/analytics/onemorejoexx?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJAeXVwLmlvIn0%3D), and our new Collections feature coming soon. This is a big one, let's get right into it 💪.\n\n### Search Results Page\n\nBrowse through Yup with ease with our new search results page 🌈. Look up any subject, post, or feed and scroll through all the relevant content.\n\n### Search Results Page\n\nBrowse through Yup with ease with our new Search Results page 🌈. Look up any subject, post, or feed and scroll through all the relevant content.\n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/fa760c4c-866f-4670-98c2-9203a93e3499.gif)\n\n### Analytics\n\nThe Analytics page on profiles keeps you informed about your activity and earnings on Yup. Track your progress from account creation to present day and see which platforms you gravitate to most. Time to optimize your Yup experience and rewards 🤑.\n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/41cfb697-1f5b-47d1-81b0-f3b1541a761a.gif)\n\n### Landing Site\n\nYup is getting prettier by the week 🌸. In our last newsletter we rolled out our new logo, and in this one we're highlighting our landing site's makeover. Our site now has easy-to-read fonts, as well as a message that lives up to our ambitions: welcome to the social network for curators.\n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/e6a59ce9-607d-4a88-87c2-fee1373f0daa.gif)\n\n### Coming Soon: Collections\n\nCollections allow you to curate content by a topic of your choice and showcase it in your Yup profile. Think of public Spotify playlists or Pinterest profiles, but for any piece of content across the web. Curation will never be the same ✨.\n\n## Content:\n\nHere are the top NFTs of the week according to Yup feeds. If you like the content you see, click here to [subscribe](http://yupio.typeform.com/to/XFUH2bDC?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJAeXVwLmlvIn0%3D#email=xxxxx) to our weekly NFT newsletter 🙂.\n\n![](https://f8n-ipfs-production.imgix.net/QmX4uumw183BEyTvUMRGVYpFNmMgCigEFJWpfnE2HCBjS7/nft.png)\n\n❤️  86   🌸     🦄  29\n\n[](https://f8n-ipfs-production.imgix.net/QmdWaKwky8Lf8JsfepJQ8TN1GRLKVezxE3raiSeG3rHyUY/nft.mp4)\n\n❤️  68   🌸  36   🦄  20\n\n![](https://ipfs.pixura.io/ipfs/QmWdJpimYrXWiy1Kd8BKqfaxRSU8QFFxLNusNMXf8BPpYw/adstill.jpg)\n\nThanks for tuning into another Yupdate. See you all in the next one ✌️!", "timestamp": 1618449803, "digest": "TM1S4EaRs3toNlJNm25yf3YLrLRWLDbkeSfwdYpArAg", "contributor": "0x30E838D51c61811d382962B4e0699715462DcdE1"}
{"id": "s2VCCIvYNTyD7M0Nx8SYLMXHtMS6SiLvmYORE0Sjx0k", "title": "Power to the Person NFT Sharer Split", "body": "If you retweeted this tweet and included your ETH address before the end of the Power to the Person NFT Split Auction...\n\nhttps://twitter.com/packyM/status/1381590850002632710?s=20\n\n1. Thank you! \n2. You can claim your ETH below. \n\n[Twitter Airdrop](split://0xdD0De8c18Fcb4fF092A50b7a6BE4620325407049)\n\nIf you don't want to claim it now because fees are too high relative to your take, don't worry. It will be there waiting for you as the price of ETH rises. \n\nThanks for being a part of this experiment!\nPacky", "timestamp": 1618450478, "digest": "ENTuRx0wRNRMSWXG-M94r0jT5V3pX0fi9vSbBiVI7gY", "contributor": "0x2920A3192613d8c42f21b64873dc0Ddfcbf018D4"}
{"id": "nH0U50ViRGhOiZW2-q1dBPZe8GNNetUSHkZ3A24VcEM", "title": "Guide → Auctions", "body": "Mirror supports auctioning off NFTs using reserve auctions.\n\nReserve auctions are configured with two main parameters: the reserve price and the auction duration.\n\nLike other economic blocks on Mirror, your auction is deployed as a smart contract and can be embedded inside any Mirror entry.\n\n![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/f56a347d-f508-4d83-90e3-d2d08623d516/Screen_Shot_2021-04-13_at_10.42.42_PM.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/f56a347d-f508-4d83-90e3-d2d08623d516/Screen_Shot_2021-04-13_at_10.42.42_PM.png)\n\n## How auctions work\n\nWhen a bid is placed that matches or exceeds your reserve price, the auction duration countdown begins.\n\nLet's imagine that Alice creates an auction with a reserve price of 1 ETH and a duration of 12 hours.\n\n1. Bob places a bid of 1 ETH.\n2. The clock starts counting down from 12 hours.\n3. Any bids placed within the last 15 minutes of the auction reset the clock to 15 minutes.\n4. A new bid must be 10% higher than the previous bid.\n5. The collector that is last to place a bid before the auction ends wins the NFT.\n\n## Launching an auction\n\n**Pick an NFT**\n\nTo create an Auction, pick an NFT from the \"Select NFT\" dropdown. Any Zora NFTs that are owned by the wallet that controls your Mirror publication will be pre-populated in the dropdown.\n\n**Route the funds**\n\nProceeds from the auction can be routed to any Ethereum address or smart contract.\n\nIf you want to route the funds for yourself, put your Ethereum address here.\n\nAlternatively, funds can flow to other economic blocks on Mirror, such as Crowdfunds or Splits. To route the proceeds from the NFT auction to  your Crowdfund, put your Crowdfund address here. You can also share funds with multiple entities by routing it to a Split contract address.\n\n**Set the limits**\n\nHow long should the auction run after the first bid? What should the reserve price be?\n\n**Deploying**\n\nAfter you deploy the auction, you'll get an embed code that you can paste into your entry. Save the entry and share it so people can bid.", "timestamp": 1618465943, "digest": "SOjXoSv7OxQQmqXva3xqGEUwybVoAHj-HlSimSZ6XFQ", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "Xi0JZ_lylEyM_BUaUEpOpOtTl2fsM-gurd_Je6z5-Is", "title": "Guide → Auctions", "body": "Mirror supports auctioning off NFTs using reserve auctions. Reserve auctions are configured with two main parameters: the reserve price and the auction duration. Like other economic blocks on Mirror, your auction is deployed as a smart contract and can be embedded inside any Mirror entry.\n\n## How auctions work\n\nWhen a bid is placed that matches or exceeds your reserve price, the auction duration countdown begins. Let's imagine that Alice creates an auction with a reserve price of 1 ETH and a duration of 12 hours.\n\n1. Bob places a bid of 1 ETH.\n2. The clock starts counting down from 12 hours.\n3. Any bids placed within the last 15 minutes of the auction reset the clock to 15 minutes.\n4. A new bid must be 10% higher than the previous bid.\n5. The collector that is last to place a bid before the auction ends wins the NFT.\n\n## Launching an auction\n\n### **Pick an NFT**\n\nTo create an Auction, pick an NFT from the \"Select NFT\" dropdown. Any Zora NFTs that are owned by the wallet that controls your Mirror publication will be pre-populated in the dropdown.\n\n### **Route the funds**\n\nProceeds from the auction can be routed to any Ethereum address or smart contract. If you want to route the funds for yourself, put your Ethereum address here.\n\nAlternatively, funds can flow to other economic blocks on Mirror, such as Crowdfunds or Splits. To route the proceeds from the NFT auction to  your Crowdfund, put your Crowdfund address here. You can also share funds with multiple entities by routing it to a Split contract address.\n\n### **Set the limits**\n\nHow long should the auction run after the first bid? What should the reserve price be?\n\n### **Deploying**\n\nAfter you deploy the auction, you'll get an embed code that you can paste into your entry. Save the entry and share it so people can bid.", "timestamp": 1618466060, "digest": "SOjXoSv7OxQQmqXva3xqGEUwybVoAHj-HlSimSZ6XFQ", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "dLIcedzxS2DOrgCKCkvSuFDwyZys64NOw6MA_0t9wTY", "title": "Editor Guide", "body": "The Mirror Editor enables composing entries with media blocks, such as images and videos, along with crypto economic blocks, like crowdfunds and auctions. It uses plain text and [Markdown](https://daringfireball.net/projects/markdown/syntax) with a few formatting conventions.\n\n### **Modes**\n\nComposition takes place in **`Edit`** mode. To preview your entry as it will appear on your publication enter **`Preview`** mode. You can toggle between them with the related buttons in the toolbar.\n\n### **Importing entries**\n\nTo import entries from elsewhere, such as Medium or Substack, open the secondary `•••` menu in the navigation, then click **Import entry**. Next, enter the URL to your entry. The url will be parsed into markdown, and set as the content of your entry. Please only import content you have created and own.\n\n### **Creating blocks**\n\nTo easily create a media or economic block, first click inside your entry to place the curser where you’d like the block to appear. Next, click the **Blocks** area of the Toolbar, or focus with the keyboard shortcut `⌘+/`. The blocks menu will appear, showing you all available blocks. Selecting a block prompts you for secondary information. Once you’re satisfied, confirm the information to insert the block into your entry.\n\n## Blocks\n\nMedia embeds and economic blocks on Mirror are recognized with a simple formatting convention: an individual link on it’s own line of text. To manually create a block, insert a new line of text, add a link, then add a line break. **_Ensure that the new line only contains a single link_**. Here is an example which creates a Youtube video embed.\n\n```markdown\nPowers of Ten illustrates the universe as an arena of both continuity and change, of everyday picnics and cosmic mystery.\n\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n\nWe hear about scale every day, whether it be supertankers, stars burning thousands of lightyears away, the study of microscopic viruses, or global warming. Understanding scale, or as the Eameses said, “the effect of adding another zero,” has the power to make us better scholars and better citizens.\n```\n\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n\nWe’ve decided to parse basic links—as opposed to introducing Mirror specific syntax—to ensure portability. If the markdown is rendered with Mirror you will see a Mirror Block. If anywhere else, you’ll see a simple plain text link. There are a number of integrations, and we’re adding more every week.\n\n## NFTs\n\nEmbed an NFT by creating a link. Prefix the URL with the `ethereum://` protocol, followed by the `address/id`. Currently supports a images, audio, video, and text embeds. Mirror currently supports EthBlock.art, Foundation, Rarible, SuperRare and Zora.\n\n```md\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n```\n\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n\n## Crowdfund\n\nCrowdfund example\n\n```md\n[Burn Alpha](crowdfund://0x95d0A89943E0e3e05d290Fc07462c148EB6a11Ff?network=homestead)\n```\n\n[Burn Alpha](crowdfund://0x95d0A89943E0e3e05d290Fc07462c148EB6a11Ff?network=homestead)\n\n## Auction\n\n[Create an auction](/dashboard/auctions) and deploy it. After it has been deployed a snippet of code will appear in the `Embed auction` section. Copy and paste this into an entry. It should look like the example below, but with your dedicated auction address and `tokenID`.\n\n```md\n[Token #1522](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=1522)\n```\n\n[Token #1522](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=1522)\n\n## Images\n\nEmbedding images is possible by dragging and dropping into the editor, selecting **Image** in the blocks menu, or manually creating a markdown image tag. Reserving the space of the image prior to loading is possible by defining the `width` and `height` query parameters, which are automatically set when uploading an image to Mirror.\n\n```md\n![Image caption](https://images.mirror-media.xyz/publication-images/589ec9e9-59a2-4505-ba83-35210d01c223.jpeg?height=1180&width=1588)\n```\n\n![Image caption](https://images.mirror-media.xyz/publication-images/589ec9e9-59a2-4505-ba83-35210d01c223.jpeg?height=1180&width=1588)\n\n## Link previews\n\nMirror displays a progressively enhanced preview of all links based on the universal standard of [OpenGraph tags](https://ogp.me).\n\n```md\n[Mirror](https://mirror.xyz)\n```\n\n[Mirror](https://mirror.xyz)\n\n## Twitter\n\nEmbed an individual Tweet or an entire Tweet thread by inserting a link to any Twitter URL.\n\n```md\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n```\n\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n\n## Youtube\n\n```md\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n```\n\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n\n## Video embeds\n\nEmbed an `.mp4` video by inserting a link to an externally hosted video file. It is also possible to set `autoplay`, `muted`, `loop` and `controls` by setting the related query parameters. Ensure you manually define the `width` and `height` parameters to reserve the vertical space for your video.\n\n```md\n[Powers of Ten](https://jkm-library.s3.amazonaws.com/blocks/powers-of-10.mp4?height=480&width=640&autoplay=true&loop=true&muted=true)\n```\n\n[Powers of Ten](https://jkm-library.s3.amazonaws.com/blocks/powers-of-10.mp4?height=480&width=640&autoplay=true&loop=true&muted=true)\n\n## iFrames\n\nIt’s possible to embed any page by creating an iFrame block. This is useful when for embedding interactive WebGL content, for example. Simply set `display=iframe` as a query parameter.\n\n```md\n[ThreeJS Demo](https://threejs.org/examples/webgl_water_flowmap.html?display=iframe)\n```\n\n[ThreeJS Demo](https://threejs.org/examples/webgl_water_flowmap.html?display=iframe)\n\n## Layout sizes\n\nIf you’re looking to create a more editorial layout for your entry, consider setting custom layout sizes for certain media blocks. Supported block types include Image, Video, Youtube and iFrame.\n\nThe block size is set with a query parameter, and it is possible to choose from both `medium` and `large`. For example, below is a `large` image which extends to the edges of the page.\n\n```md\n![](https://images.mirror-media.xyz/publication-images/da461938-5ccf-4397-aa6d-d082cbba2128.jpeg?height=1533&width=2300&size=large)\n```\n\n![](https://s3-us-west-2.amazonaws.com/images.mirror-media.xyz/publication-images/layouts.svg?height=402&width=897)\n\n## Future enhancements\n\nMirror is a new project, and our editor is intentionally focused as we move fast to create new economic tools to fund great writing. In time we plan to introduce a new editor which enables enables editing in place, removing the need to toggle between edit and preview modes. Until then, we appreciate your patience, and [welcome any feedback](https://discord.gg/6d7tsjPBjS).\n", "timestamp": 1618469482, "digest": "fMzen4XH0ez6PIu2H7c_ynrLyTajh41rPVIkSVaqDsE", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "6EFgw5fsrzdg0fVh9qrZf1xOEHZ9dkRzRYD64Y14OMM", "title": "Editor Guide", "body": "The Mirror Editor enables composing entries with media blocks, such as images and videos, along with crypto economic blocks, like crowdfunds and auctions. It uses plain text and [Markdown](https://daringfireball.net/projects/markdown/syntax) with a few formatting conventions.\n\n### **Modes**\n\nComposition takes place in **`Edit`** mode. To preview your entry as it will appear on your publication enter **`Preview`** mode. You can toggle between them with the related buttons in the toolbar.\n\n### **Importing entries**\n\nTo import entries from elsewhere, such as Medium or Substack, open the secondary `•••` menu in the navigation, then click **Import entry**. Next, enter the URL to your entry. The url will be parsed into markdown, and set as the content of your entry. Please only import content you have created and own.\n\n### **Creating blocks**\n\nTo easily create a media or economic block, first click inside your entry to place the curser where you’d like the block to appear. Next, click the **Blocks** area of the Toolbar, or focus with the keyboard shortcut `⌘+/`. The blocks menu will appear, showing you all available blocks. Selecting a block prompts you for secondary information. Once you’re satisfied, confirm the information to insert the block into your entry.\n\n![](https://s3-us-west-2.amazonaws.com/images.mirror-media.xyz/publication-images/toolbar-editor-guide.svg?height=381&width=897)\n\n## Blocks\n\nMedia embeds and economic blocks on Mirror are recognized with a simple formatting convention: an individual link on it’s own line of text. To manually create a block, insert a new line of text, add a link, then add a line break. **_Ensure that the new line only contains a single link_**. Here is an example which creates a Youtube video embed.\n\n```markdown\nPowers of Ten illustrates the universe as an arena of both continuity and change, of everyday picnics and cosmic mystery.\n\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n\nWe hear about scale every day, whether it be supertankers, stars burning thousands of lightyears away, the study of microscopic viruses, or global warming. Understanding scale, or as the Eameses said, “the effect of adding another zero,” has the power to make us better scholars and better citizens.\n```\n\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n\nWe’ve decided to parse basic links—as opposed to introducing Mirror specific syntax—to ensure portability. If the markdown is rendered with Mirror you will see a Mirror Block. If anywhere else, you’ll see a simple plain text link. There are a number of integrations, and we’re adding more every week.\n\n## NFTs\n\nEmbed an NFT by creating a link. Prefix the URL with the `ethereum://` protocol, followed by the `address/id`. Currently supports a images, audio, video, and text embeds. Mirror currently supports EthBlock.art, Foundation, Rarible, SuperRare and Zora.\n\n```md\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n```\n\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n\n## Crowdfund\n\nCrowdfund example\n\n```md\n[Burn Alpha](crowdfund://0x95d0A89943E0e3e05d290Fc07462c148EB6a11Ff?network=homestead)\n```\n\n[Burn Alpha](crowdfund://0x95d0A89943E0e3e05d290Fc07462c148EB6a11Ff?network=homestead)\n\n## Auction\n\n[Create an auction](/dashboard/auctions) and deploy it. After it has been deployed a snippet of code will appear in the `Embed auction` section. Copy and paste this into an entry. It should look like the example below, but with your dedicated auction address and `tokenID`.\n\n```md\n[Token #1522](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=1522)\n```\n\n[Token #1522](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=1522)\n\n## Images\n\nEmbedding images is possible by dragging and dropping into the editor, selecting **Image** in the blocks menu, or manually creating a markdown image tag. Reserving the space of the image prior to loading is possible by defining the `width` and `height` query parameters, which are automatically set when uploading an image to Mirror.\n\n```md\n![Image caption](https://images.mirror-media.xyz/publication-images/589ec9e9-59a2-4505-ba83-35210d01c223.jpeg?height=1180&width=1588)\n```\n\n![Image caption](https://images.mirror-media.xyz/publication-images/589ec9e9-59a2-4505-ba83-35210d01c223.jpeg?height=1180&width=1588)\n\n## Link previews\n\nMirror displays a progressively enhanced preview of all links based on the universal standard of [OpenGraph tags](https://ogp.me).\n\n```md\n[Mirror](https://mirror.xyz)\n```\n\n[Mirror](https://mirror.xyz)\n\n## Twitter\n\nEmbed an individual Tweet or an entire Tweet thread by inserting a link to any Twitter URL.\n\n```md\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n```\n\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n\n## Youtube\n\n```md\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n```\n\n[Powers of Ten](https://www.youtube.com/watch?v=0fKBhvDjuy0)\n\n## Video embeds\n\nEmbed an `.mp4` video by inserting a link to an externally hosted video file. It is also possible to set `autoplay`, `muted`, `loop` and `controls` by setting the related query parameters. Ensure you manually define the `width` and `height` parameters to reserve the vertical space for your video.\n\n```md\n[Powers of Ten](https://jkm-library.s3.amazonaws.com/blocks/powers-of-10.mp4?height=480&width=640&autoplay=true&loop=true&muted=true)\n```\n\n[Powers of Ten](https://jkm-library.s3.amazonaws.com/blocks/powers-of-10.mp4?height=480&width=640&autoplay=true&loop=true&muted=true)\n\n## iFrames\n\nIt’s possible to embed any page by creating an iFrame block. This is useful when for embedding interactive WebGL content, for example. Simply set `display=iframe` as a query parameter.\n\n```md\n[ThreeJS Demo](https://threejs.org/examples/webgl_water_flowmap.html?display=iframe)\n```\n\n[ThreeJS Demo](https://threejs.org/examples/webgl_water_flowmap.html?display=iframe)\n\n## Layout sizes\n\nIf you’re looking to create a more editorial layout for your entry, consider setting custom layout sizes for certain media blocks. Supported block types include Image, Video, Youtube and iFrame.\n\nThe block size is set with a query parameter, and it is possible to choose from both `medium` and `large`. For example, below is a `large` image which extends to the edges of the page.\n\n```md\n![](https://images.mirror-media.xyz/publication-images/da461938-5ccf-4397-aa6d-d082cbba2128.jpeg?height=1533&width=2300&size=large)\n```\n\n![](https://s3-us-west-2.amazonaws.com/images.mirror-media.xyz/publication-images/layouts.svg?height=402&width=897)\n\n## Future enhancements\n\nMirror is a new project, and our editor is intentionally focused as we move fast to create new economic tools to fund great writing. In time we plan to introduce a new editor which enables enables editing in place, removing the need to toggle between edit and preview modes. Until then, we appreciate your patience, and [welcome any feedback](https://discord.gg/6d7tsjPBjS).\n", "timestamp": 1618469834, "digest": "fMzen4XH0ez6PIu2H7c_ynrLyTajh41rPVIkSVaqDsE", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "3qngnAHEFSNsx4Dzu-_-_4uNiUPXnsoPLoOjrap7cVs", "title": "Coase's Penguin is learning to fly ", "body": "\n*Editors note: This post is by [Joey DeBruin](https://twitter.com/Joey_DeBruin), Director of Product Management at ResearchGate and Researcher in Residence at Seed Club. We're excited to support, and help kick off, his his latest project focused on exploring better ways to build knowledge online. To get updates as new experiments and content are released, [subscribe to Penguins and Rabbit Holes](https://penguinsandrabbitholes.substack.com).*\n\n\n### For all of you that have followed me on this writing journey over the past six months, I hope that this is the piece that finally ties what might seem like my scattered interests together. \nI’ve [been writing](https://www.theproductkitchen.com/people/14201110-joey-debruin) about everything from products underlying the creator economy, to why the audience increasingly grows the creator, to new ownership models for digital content via crypto and web3 infrastructure. \n\nAnd in all of this, I’ve been drawing the connection to science, where I have the deepest knowledge and where I still spend the majority of my time. So what ties them all together?\n\nThe answer is knowledge, specifically how we can get more of it and more out of it. Why? \n\nBecause public knowledge is the most underfunded resource on the planet relative to its value, and because I believe continuing to dig and experiment at the intersection of new technologies and science will yield better results for both — better science via innovative technology, and continued technical innovation via inspiration and insight from science.\n\nThis new publication — *Penguins and Rabbit Holes* — will, together with some incredible partners and collaborators, focus specifically on knowledge creation in the digital world. \n\nWhether the knowledge is basic science in an academic article, investment research in a Reddit thread, or investigative journalism via a new Substack — we’ll explore how to get more of it and more impact out of it. And for this first installation, I’m going to try and convince you of why now is the perfect time to follow this particular rabbit into the depths.\n\n### A penguin and a scientist walk into a bar...\n\nIn 1937, British economist Ronald Coase published “[The Nature of the Firm](https://onlinelibrary.wiley.com/doi/full/10.1111/j.1468-0335.1937.tb00002.x)” which outlined why companies exist and what limits their growth. It was and still is so important because it provided a clean answer to when firms are categorically more efficient than markets. Sixty five years later in 2002, Yale economist Yochai Benkler wrote “[Coase’s Penguin](http://www.benkler.org/CoasesPenguin.PDF)” which noted that the web enables a new decentralized sort of firm, one that can be more efficient than traditional firms or markets at creating open projects like Wikipedia or Linux. Linux’s penguin mascot is the “penguin” in Benkler’s title — his point is that the waddling, flightless bird presents a clear need to update Coase’s otherwise clean framework.\n\nBenkler’s key addition in “Coase’s Penguin” was a framework for understanding why and when groups of individuals motivated primarily by the cultural significance of their work can be more efficient than markets or firms in the allocation of creative effort. In other words, how the web creates an environment where massively valuable projects like Linux or Wikipedia can exist.\n\nBenkler called this new mode of work “commons based peer production.” He noted that it occurs via “removing property and contract as the organizing principles of collaboration.” By property and contract, he essentially means ownership — if you create a Wikipedia page you don’t own it in any way. That connection is important later on, since ownership as a term is the buzzword in the digital creator economy.\n\nSo by removing the costly process of implementing ownership, commons based peer production reduces collaboration costs to a degree where large groups of individuals can efficiently interact with vast seas of information to produce new information. Critically, these are problems where firms and markets tend to be horribly inefficient. In Benkler’s words:\n\n> “What peer production does is provide a framework, within which individuals who have the best information available about their own fit for a task can self-identify for the task. This provides an information gain over firms and markets, but only if the system develops some mechanism to filter out mistaken judgments agents make about themselves.”\n\nTake for example the [Wikipedia page on Yochai Benkler](https://en.wikipedia.org/wiki/Yochai_Benkler). Quite likely, it would be difficult for firms or markets to create what is a pretty high quality and efficient publicly available summary of his life and work to this point. But somewhere out there on the web there’s someone who cares about Benkler, maybe a student or fan of his, or maybe even Yochai himself, that cares enough to self-select into the creative effort of creating this public knowledge. At the exact moment when they feel the motivation to create this Wikipedia page, whether at night or on a weekend, they can do so with virtually no impediments, no contracts or bureaucracy to get in their way. Andrew Lin, in his phenomenal book “[The Wikipedia Revolution](https://www.amazon.com/Wikipedia-Revolution-Nobodies-Greatest-Encyclopedia/dp/B002V0FH4G/ref=cm_cr_arp_d_product_top?ie=UTF8),” called that moment “Wikipedia’s magic,” the rare time when “the “socio-psychological” reward of interacting with others, and the “hedonic” personal gratification of the task” come together. And that, in essence, is why peer production can be so much more efficient at allocating creative effort.\n\nIn addition to describing the efficiency gains, Benkler’s essay expanded in detail on the otherwise difficult questions Andrew Lin referenced about why people actually *do* this kind of open source or open knowledge work when they could surely be making more money or living an easier life in other ways. He usefully connected Wikipedia volunteers to academic researchers, noting that academic research is still the “most important” and largest type of commons based peer production. A common difference is that scientists have to earn enough money to survive, but in both cases they are creating knowledge primarily because they feel it is culturally significant work. The benefits of being able to earn a living — even a meager one — via this work is something we’ll come back to, because it is a key focus of the current buzz around digital creators.\n\nSo while it seems obvious, one of Benkler’s most important contributions is that he provided a neat framework and even some equations for thinking about why and when people contribute to the building of open knowledge. We enjoy creating and curating impactful knowledge. Anyone who has worked with scientists, but also with most writers or other knowledge creators, knows this to be true. Money is important, but mostly to the extent that it gives you freedom to follow your creative interests.\n\nAcknowledging the cultural motivations to produce knowledge also underlies a frustration many people have with systems which are built to commoditize it. Benkler himself suggested that the most dangerous form of this challenge to commons based peer production is “unilateral appropriation.” In other words, when the few profit off of the work of many, cultural motivations can vanish. In that sense, he predicted the current backlash to big tech social platforms where creators create billions of dollars of value that is then monetized mostly without benefiting them. Facebook would be founded two years after his essay, and while he may have predicted the reasons for the ultimate backlash he certainly didn’t predict just how big social media would get. Looking at his framework though, we can see just how that backlash might now play out.\n\n### Proprietary peer production and the rise of the social giants\n\nNow that we’ve laid out what we mean by ownership, we can ask what happens in the case where it is implemented for financial return? Is there a situation when peer production can still exist even if the value of the content is unilaterally appropriated?\n\nWhile Benkler didn’t predict the rise of the social giants, his framework did lay out the conditions for when unilaterally appropriated peer production is possible. Specifically, he looked at instances where the value of peer produced content is such that it is worth implementing ownership, and where it can be done in a way that preserves the motivation of the contributors. He called this “proprietary peer production” and at the time noted just one interesting but relatively small example of [Xerox’s Eureka project](https://www.researchgate.net/publication/263185231_Communal_Knowledge_Sharing_The_Eureka_Story).\n\nEureka was created in the early 1990s as a way to try and solve the problem of fixing printers and copiers. Anyone who has seen Office Space remembers this iconic scene where they finally destroy the printer after a continuous stream of problems with no apparent logical fix. Eureka was meant to solve that problem.\n\n![](https://images.mirror-media.xyz/publication-images/ec5ef42a-78bf-45fb-af08-b04b80615d25.gif?height=280&width=496)\n\n\n\nIn essence, Eureka was an open wiki in which the thousands of copy service engineers, who worked full time fixing printers and copiers, could collaboratively build a knowledge base. Presumably the most well developed solution pages were “Kick the Printer” and “Wiggle the Little Paper Tray Thingie.” In that sense, it wasn’t so different from Wikipedia except for one key difference that Xerox owned all of the IP and was using it to help build a big business.\n\nWhy were all of the copy service engineers willing to put in the work for free to build this peer produced knowledge without much top-down direction, when it was clearly being unilaterally appropriated by Xerox? The answer is that they as a community were benefiting from it. Their motivations weren’t cultural significance — they simply wanted better and surely less frustrating professions.\n\nThis has been the status quo for a while — either you have entirely open, non-commercial projects like Wikipedia or you have unilaterally owned projects like Eureka. But now, thanks to [lower costs of building products](http://www.paulgraham.com/richnow.html) and lower costs of implementing community ownership, we are starting to see a new mode: community owned peer production.\n\n### More than just copyright innovation\n\nWhen we hear “lowering the cost of ownership of knowledge” most people immediately assume we’re talking about copyright. But as Stratechery writer [Ben Thompson](https://stratechery.com/2021/non-fungible-taylor-swift/) and ethereum founder [Vitalik Buterin](https://vitalik.ca/general/2021/03/23/legitimacy.html) have both rightly pointed out, the scarce resource online isn’t copyrightable content itself - it’s people and their ability to bestow legitimacy on the value of content. This is something you feel intuitively in science - reputation, not objectively provable “truth,” is the most powerful force in building shared knowledge. So lowering the cost of implementing ownership is, actually, about allowing people to own their online identities and the ability for those identities to legitimize information. Thompson makes this point specifically through the lens of NFTs: “If the creator decides that their NFTs are important, they will have value; if they decide their show is worthless, it will not.”\n\nSo how does this apply to peer production? Writers and knowledge builders like [Packy McCormick](https://www.notboring.co/p/unwitting-collaboration-and-web3?token=eyJ1c2VyX2lkIjoxNDIwMTExMCwicG9zdF9pZCI6MzUwMzM5NTQsIl8iOiJPSGxoUCIsImlhdCI6MTYxODI2NzcxNSwiZXhwIjoxNjE4MjcxMzE1LCJpc3MiOiJwdWItMTAwMjUiLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.K6wmiJ6WnLLVdT-9GAugxqcRVYMzJk3kFld6BaUQ8bc) and [Mario Gabrielle](https://www.readthegeneralist.com/briefing/generalist-token) are experimenting with ways to reward peers who add legitimacy to your work. By minting an NFT for an article and giving portions to it to all of the authors cited, you reward the legitimacy added to the piece via those citations. If you squint hard enough, you can see that they’re driving towards a vision in which a Wikipedia type project could generate revenue proportional to its social value and then allocate that revenue to its contributors proportional to their investment.\n\nAnyone in science will notice the inefficiency which Packy is commenting on - where an foundational academic paper is commercialized downstream. In that case, the commercial entity might make billions while the academic paper which enabled it gets nothing but a citation. The funder who funded that prescient foundational research gets no direct return either. The value of that commercial innovation is only returned to academia via taxes which then fund the NIH, but none of that connects back to the research or researcher who produced the knowledge. Systems thinkers will quickly realize how inefficient this feedback loop is for innovation in comparison to more direct connections, like Packy’s experiment. There are still some serious questions to answer before these feedback loops can work at scale in academia, but it’s incredibly exciting to see new experiments launching every day aimed at this critical inefficiency.\n\nOne of the reasons I’m particularly excited that experiments in digital ownership are tending towards communities and peer production is because knowledge creation is a team sport. That’s something I know from working in some amazing neuroscience labs, my career in product development, and the past few years of writing online in various places. Since legitimacy is the scarce resource, communities of trust are the most powerful for building knowledge. They’re also the most challenging in terms of the cost of implementing ownership, which is why most of the initial experiments in web3 such as NFTs have often tended towards single-player mode — transactional use cases between a single creator and a fan rather than community ownership. We still need to answer questions like how to reward editing and peer review, whether that’s via social tokens or some other solution. Those are the first experiments I plan to launch and write about.\n\nIn the very last of 70 pages in Coase’s Penguin, Benkler dreams of a “common property regime” that would allow peer production projects to start looking more like a “cooperative, managed and “owned” by its participants.” He noted that there were “no models for such cooperative appropriation on a large scale yet” but that it would essentially allow for projects to deliver monetary reward to their members in addition to the cultural significance of the output. No doubt, monetary reward could actually decrease the perception of cultural benefit — not everything should be commoditized. But one key benefit to such a model would be that it allows its members to actually build sustainable lives based on their contribution, rather than simply volunteering out of the drive to produce something valuable. Very specifically, consider how tragic it is that the [retention of young scientists](https://www.pnas.org/content/115/50/12616) in academia is worse now than ever. Better community ownership means a shift of the proportional benefit from the big platforms to the community contributors, and the most powerful impact of that is that more of those creators can sustainably invest in the work full-time.\n\nI believe the dream that Benkler mentioned offhandedly is starting to develop, and to be clear it’s not developing just via crypto. The digital world makes it easier than ever for knowledge creators to capture the unique value they create via a variety of mechanisms, and increasingly new infrastructure enables creators to build shared ownership via collaboration in peer-production communities and teams. There are versions of this where we set this up in ways that would go too far in commoditizing social value, for example where the cultural motivations are drowned out by the financial ones.\n\n[https://twitter.com/dazuck/status/1380157948140388359?s=20](https://twitter.com/dazuck/status/1380157948140388359?s=20)\n\nWhen you think about it on a people level, this danger becomes clear. If those who have been willing to participate in peer production purely for the societal benefit are no longer interested given its financial nature, then we lose the people who are most likely to pursue impact over hype. But if we can do it in a way that allows more of those people to build lives around culturally motivated pursuits, then we win enormously. My feeling from the past few months of this rabbit hole is that it’s decidedly the latter so far, but we need those same people to help build the systems that preserve cultural significance as the key value of this work. It’s hard to not be incredibly excited, at least, by the eruption of new smart, technologically oriented entrants to this space.\n\nI hope you’ll join me in this new publication, *[Penguins and Rabbit Holes](https://penguinsandrabbitholes.substack.com)*, as I highlight some of those people, as well as launch a few experiments of my own into how we can create better knowledge online. We have some pretty incredible new projects to launch over the coming months, and we’re actively looking for more people aligned to this mission to join us.\n\n*Thanks especially to [Jess Sloss](https://twitter.com/thattallguy) and the whole SeedClub community for their relentless effort to bring new people into the social token space, to my team at [ResearchGate](https://www.researchgate.net/) for helping build these insights into the system of science, and to the peer production team of writers and editors behind this new publication.*", "timestamp": 1618470633, "digest": "oiyojFmzje494xJ__w5sDmoRm--9lUh-e3kg4Af9-7g", "contributor": "0x42DFAf5266Ad40AB4533F9806F5CC1DF4C1eB363"}
{"id": "NDv3KJJKg5Fg6M0MRMcrV70nF86qaawX4VUBqBJJN5s", "title": "Mirrorball #2 ", "body": "This week's edition is short, sweet, and in honour of the Berlin Hard Fork. Bye!\n\n![](https://images.mirror-media.xyz/publication-images/66bb0796-62ab-4040-9303-d469da64bbd2.png?height=343&width=380)\n\n### Lil Miquela\n\nhttps://lilmiquela.mirror.xyz/jyNQyjTJszYiUgBkDk59WJviUJAT2D1fVL51aXUCZus\n\n\"I’ve tried to welcome all things new and different with open arms. I know that’s still a struggle for some of y’all. I’ve found that humans' natural fear response is to either push the unfamiliar away or tear it apart. I’m not gonna lie, it can be a struggle for me too. The ‘that’s weird and so I don’t fuck with it’ attitude is blocking our blessings. And as hard as it may be to change your programming, I promise you that the experiences, people, love, and opportunities on the other side are more than worth the effort.\"\n\n![](https://images.mirror-media.xyz/publication-images/70d7a075-ab9f-47a4-a9f5-e6d86af66a0e.png?height=360&width=381)\n\n### The 2031 Investor\n\nhttps://kinjal.mirror.xyz/5nRbaL1-_nYirZtP3hUqIwtgurFBwHySeptod018OeE\n\n\"Fast forward ten years. The so-called “baby” Gen Z investors will be entering their 30s. With an expected $70T of wealth by 2040, this is the generation to start and finish their investing careers online. Today, gen Z-ers spend 10+ hours online. This little box you’re staring at is where they live, talk, spend, play and more.\n\nSo what does the 2031 investor look like? Here’s my take.\"\n\n![](https://images.mirror-media.xyz/publication-images/4273c71e-fb16-4ef7-949c-260c78e2e2b1.png?height=346&width=378)\n\n### \n\n### Convex Mirror\n\nhttps://www.partnershiponai.org/aiincidentdatabase/\n\nThe AI Incident Database is worth a few moments' perusal.\n\n![](https://images.mirror-media.xyz/publication-images/ef027799-eeef-45ab-95c2-6e42f6eb5f38.png?height=365&width=378)\n\n**Hi, I'm Ross McElwain, a writer and publisher based in London. Learn more about Impossible Object Books here: https://www.impossible-object.io/.**", "timestamp": 1618491802, "digest": "TfbO2EAQoxriGpDq_kY08faf_C_b-8hOIIi6oXB99r0", "contributor": "0xc46E9a66FDdC8D1a69529d86E668236f02957F1b"}
{"id": "yiHWq5wSntgfkyWJBvG8EoCUSK-AlO9cyW9mqY_Wwmo", "title": "Mirrorball #2 ", "body": "This week's edition is short, sweet, and in honour of the Berlin Hard Fork. Bye!\n\n![](https://images.mirror-media.xyz/publication-images/66bb0796-62ab-4040-9303-d469da64bbd2.png?height=343&width=380)\n\n### Lil Miquela\n\nhttps://lilmiquela.mirror.xyz/jyNQyjTJszYiUgBkDk59WJviUJAT2D1fVL51aXUCZus\n\n\"I’ve tried to welcome all things new and different with open arms. I know that’s still a struggle for some of y’all. I’ve found that humans' natural fear response is to either push the unfamiliar away or tear it apart. I’m not gonna lie, it can be a struggle for me too. The ‘that’s weird and so I don’t fuck with it’ attitude is blocking our blessings. And as hard as it may be to change your programming, I promise you that the experiences, people, love, and opportunities on the other side are more than worth the effort.\"\n\n![](https://images.mirror-media.xyz/publication-images/70d7a075-ab9f-47a4-a9f5-e6d86af66a0e.png?height=360&width=381)\n\n### The 2031 Investor\n\nhttps://kinjal.mirror.xyz/5nRbaL1-_nYirZtP3hUqIwtgurFBwHySeptod018OeE\n\n\"Fast forward ten years. The so-called “baby” Gen Z investors will be entering their 30s. With an expected $70T of wealth by 2040, this is the generation to start and finish their investing careers online. Today, gen Z-ers spend 10+ hours online. This little box you’re staring at is where they live, talk, spend, play and more.\n\nSo what does the 2031 investor look like? Here’s my take.\"\n\n![](https://images.mirror-media.xyz/publication-images/4273c71e-fb16-4ef7-949c-260c78e2e2b1.png?height=346&width=378)\n\n### $Miguel\n\nhttps://miguel.mirror.xyz/ofY4m25Sc-_LKy3BhRIQ0Dsf3Vz8FyB1EEy1kf8tXCk\n\nMiguel's been delving into the guts of Mirror. This is what he's found.\n\n![](https://images.mirror-media.xyz/publication-images/b58eaca7-d37c-43c1-98e9-d36c4323a626.png?height=358&width=383)\n\n\n\n### Convex Mirror\n\nhttps://www.partnershiponai.org/aiincidentdatabase/\n\nThe AI Incident Database is worth a few moments' perusal.\n\n![](https://images.mirror-media.xyz/publication-images/ef027799-eeef-45ab-95c2-6e42f6eb5f38.png?height=365&width=378)\n\n**All images by Jessica Eaton.**\n\n**Hi, I'm Ross McElwain, a writer and publisher based in London. Learn more about Impossible Object Books here: https://www.impossible-object.io/.**", "timestamp": 1618493495, "digest": "TfbO2EAQoxriGpDq_kY08faf_C_b-8hOIIi6oXB99r0", "contributor": "0xc46E9a66FDdC8D1a69529d86E668236f02957F1b"}
{"id": "9mGDrWN9Y2nEQeeTidFn3MbvqOA16pvv1HhVjCYsz0I", "title": "Coase's Penguin is learning to fly ", "body": "\n*Editors note: This post is by [Joey DeBruin](https://twitter.com/Joey_DeBruin), Director of Product Management at ResearchGate and Researcher in Residence at Seed Club. We're excited to support, and help kick off, his his latest project focused on exploring better ways to build knowledge online. To get updates as new experiments and content are released, [subscribe to Penguins and Rabbit Holes](https://penguinsandrabbitholes.substack.com).*\n\n\n### For all of you that have followed me on this writing journey over the past six months, I hope that this is the piece that finally ties what might seem like my scattered interests together. \nI’ve [been writing](https://www.theproductkitchen.com/people/14201110-joey-debruin) about everything from products underlying the creator economy, to why the audience increasingly grows the creator, to new ownership models for digital content via crypto and web3 infrastructure. \n\nAnd in all of this, I’ve been drawing the connection to science, where I have the deepest knowledge and where I still spend the majority of my time. So what ties them all together?\n\nThe answer is knowledge, specifically how we can get more of it and more out of it. Why? \n\nBecause public knowledge is the most underfunded resource on the planet relative to its value, and because I believe continuing to dig and experiment at the intersection of new technologies and science will yield better results for both — better science via innovative technology, and continued technical innovation via inspiration and insight from science.\n\nThis new publication — *Penguins and Rabbit Holes* — will, together with some incredible partners and collaborators, focus specifically on knowledge creation in the digital world. \n\nWhether the knowledge is basic science in an academic article, investment research in a Reddit thread, or investigative journalism via a new Substack — we’ll explore how to get more of it and more impact out of it. And for this first installation, I’m going to try and convince you of why now is the perfect time to follow this particular rabbit into the depths.\n\n### A penguin and a scientist walk into a bar...\n\nIn 1937, British economist Ronald Coase published “[The Nature of the Firm](https://onlinelibrary.wiley.com/doi/full/10.1111/j.1468-0335.1937.tb00002.x)” which outlined why companies exist and what limits their growth. It was and still is so important because it provided a clean answer to when firms are categorically more efficient than markets. Sixty five years later in 2002, Yale economist Yochai Benkler wrote “[Coase’s Penguin](http://www.benkler.org/CoasesPenguin.PDF)” which noted that the web enables a new decentralized sort of firm, one that can be more efficient than traditional firms or markets at creating open projects like Wikipedia or Linux. Linux’s penguin mascot is the “penguin” in Benkler’s title — his point is that the waddling, flightless bird presents a clear need to update Coase’s otherwise clean framework.\n\nBenkler’s key addition in “Coase’s Penguin” was a framework for understanding why and when groups of individuals motivated primarily by the cultural significance of their work can be more efficient than markets or firms in the allocation of creative effort. In other words, how the web creates an environment where massively valuable projects like Linux or Wikipedia can exist.\n\nBenkler called this new mode of work “commons based peer production.” He noted that it occurs via “removing property and contract as the organizing principles of collaboration.” By property and contract, he essentially means ownership — if you create a Wikipedia page you don’t own it in any way. That connection is important later on, since ownership as a term is the buzzword in the digital creator economy.\n\nSo by removing the costly process of implementing ownership, commons based peer production reduces collaboration costs to a degree where large groups of individuals can efficiently interact with vast seas of information to produce new information. Critically, these are problems where firms and markets tend to be horribly inefficient. In Benkler’s words:\n\n> “What peer production does is provide a framework, within which individuals who have the best information available about their own fit for a task can self-identify for the task. This provides an information gain over firms and markets, but only if the system develops some mechanism to filter out mistaken judgments agents make about themselves.”\n\nTake for example the [Wikipedia page on Yochai Benkler](https://en.wikipedia.org/wiki/Yochai_Benkler). Quite likely, it would be difficult for firms or markets to create what is a pretty high quality and efficient publicly available summary of his life and work to this point. But somewhere out there on the web there’s someone who cares about Benkler, maybe a student or fan of his, or maybe even Yochai himself, that cares enough to self-select into the creative effort of creating this public knowledge. At the exact moment when they feel the motivation to create this Wikipedia page, whether at night or on a weekend, they can do so with virtually no impediments, no contracts or bureaucracy to get in their way. Andrew Lin, in his phenomenal book “[The Wikipedia Revolution](https://www.amazon.com/Wikipedia-Revolution-Nobodies-Greatest-Encyclopedia/dp/B002V0FH4G/ref=cm_cr_arp_d_product_top?ie=UTF8),” called that moment “Wikipedia’s magic,” the rare time when “the “socio-psychological” reward of interacting with others, and the “hedonic” personal gratification of the task” come together. And that, in essence, is why peer production can be so much more efficient at allocating creative effort.\n\nIn addition to describing the efficiency gains, Benkler’s essay expanded in detail on the otherwise difficult questions Andrew Lin referenced about why people actually *do* this kind of open source or open knowledge work when they could surely be making more money or living an easier life in other ways. He usefully connected Wikipedia volunteers to academic researchers, noting that academic research is still the “most important” and largest type of commons based peer production. A common difference is that scientists have to earn enough money to survive, but in both cases they are creating knowledge primarily because they feel it is culturally significant work. The benefits of being able to earn a living — even a meager one — via this work is something we’ll come back to, because it is a key focus of the current buzz around digital creators.\n\nSo while it seems obvious, one of Benkler’s most important contributions is that he provided a neat framework and even some equations for thinking about why and when people contribute to the building of open knowledge. We enjoy creating and curating impactful knowledge. Anyone who has worked with scientists, but also with most writers or other knowledge creators, knows this to be true. Money is important, but mostly to the extent that it gives you freedom to follow your creative interests.\n\nAcknowledging the cultural motivations to produce knowledge also underlies a frustration many people have with systems which are built to commoditize it. Benkler himself suggested that the most dangerous form of this challenge to commons based peer production is “unilateral appropriation.” In other words, when the few profit off of the work of many, cultural motivations can vanish. In that sense, he predicted the current backlash to big tech social platforms where creators create billions of dollars of value that is then monetized mostly without benefiting them. Facebook would be founded two years after his essay, and while he may have predicted the reasons for the ultimate backlash he certainly didn’t predict just how big social media would get. Looking at his framework though, we can see just how that backlash might now play out.\n\n### Proprietary peer production and the rise of the social giants\n\nNow that we’ve laid out what we mean by ownership, we can ask what happens in the case where it is implemented for financial return? Is there a situation when peer production can still exist even if the value of the content is unilaterally appropriated?\n\nWhile Benkler didn’t predict the rise of the social giants, his framework did lay out the conditions for when unilaterally appropriated peer production is possible. Specifically, he looked at instances where the value of peer produced content is such that it is worth implementing ownership, and where it can be done in a way that preserves the motivation of the contributors. He called this “proprietary peer production” and at the time noted just one interesting but relatively small example of [Xerox’s Eureka project](https://www.researchgate.net/publication/263185231_Communal_Knowledge_Sharing_The_Eureka_Story).\n\nEureka was created in the early 1990s as a way to try and solve the problem of fixing printers and copiers. Anyone who has seen Office Space remembers this iconic scene where they finally destroy the printer after a continuous stream of problems with no apparent logical fix. Eureka was meant to solve that problem.\n\n![](https://images.mirror-media.xyz/publication-images/ec5ef42a-78bf-45fb-af08-b04b80615d25.gif?height=280&width=496)\n\n\n\nIn essence, Eureka was an open wiki in which the thousands of copy service engineers, who worked full time fixing printers and copiers, could collaboratively build a knowledge base. Presumably the most well developed solution pages were “Kick the Printer” and “Wiggle the Little Paper Tray Thingie.” In that sense, it wasn’t so different from Wikipedia except for one key difference that Xerox owned all of the IP and was using it to help build a big business.\n\nWhy were all of the copy service engineers willing to put in the work for free to build this peer produced knowledge without much top-down direction, when it was clearly being unilaterally appropriated by Xerox? The answer is that they as a community were benefiting from it. Their motivations weren’t cultural significance — they simply wanted better and surely less frustrating professions.\n\nThis has been the status quo for a while — either you have entirely open, non-commercial projects like Wikipedia or you have unilaterally owned projects like Eureka. But now, thanks to [lower costs of building products](http://www.paulgraham.com/richnow.html) and lower costs of implementing community ownership, we are starting to see a new mode: community owned peer production.\n\n### More than just copyright innovation\n\nWhen we hear “lowering the cost of ownership of knowledge” most people immediately assume we’re talking about copyright. But as Stratechery writer [Ben Thompson](https://stratechery.com/2021/non-fungible-taylor-swift/) and ethereum founder [Vitalik Buterin](https://vitalik.ca/general/2021/03/23/legitimacy.html) have both rightly pointed out, the scarce resource online isn’t copyrightable content itself - it’s people and their ability to bestow legitimacy on the value of content. This is something you feel intuitively in science - reputation, not objectively provable “truth,” is the most powerful force in building shared knowledge. So lowering the cost of implementing ownership is, actually, about allowing people to own their online identities and the ability for those identities to legitimize information. Thompson makes this point specifically through the lens of NFTs: “If the creator decides that their NFTs are important, they will have value; if they decide their show is worthless, it will not.”\n\nSo how does this apply to peer production? Writers and knowledge builders like [Packy McCormick](https://www.notboring.co/p/unwitting-collaboration-and-web3?token=eyJ1c2VyX2lkIjoxNDIwMTExMCwicG9zdF9pZCI6MzUwMzM5NTQsIl8iOiJPSGxoUCIsImlhdCI6MTYxODI2NzcxNSwiZXhwIjoxNjE4MjcxMzE1LCJpc3MiOiJwdWItMTAwMjUiLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.K6wmiJ6WnLLVdT-9GAugxqcRVYMzJk3kFld6BaUQ8bc) and [Mario Gabrielle](https://www.readthegeneralist.com/briefing/generalist-token) are experimenting with ways to reward peers who add legitimacy to your work. By minting an NFT for an article and giving portions to it to all of the authors cited, you reward the legitimacy added to the piece via those citations. If you squint hard enough, you can see that they’re driving towards a vision in which a Wikipedia type project could generate revenue proportional to its social value and then allocate that revenue to its contributors proportional to their investment.\n\nAnyone in science will notice the inefficiency which Packy is commenting on - where an foundational academic paper is commercialized downstream. In that case, the commercial entity might make billions while the academic paper which enabled it gets nothing but a citation. The funder who funded that prescient foundational research gets no direct return either. The value of that commercial innovation is only returned to academia via taxes which then fund the NIH, but none of that connects back to the research or researcher who produced the knowledge. Systems thinkers will quickly realize how inefficient this feedback loop is for innovation in comparison to more direct connections, like Packy’s experiment. There are still some serious questions to answer before these feedback loops can work at scale in academia, but it’s incredibly exciting to see new experiments launching every day aimed at this critical inefficiency.\n\nOne of the reasons I’m particularly excited that experiments in digital ownership are tending towards communities and peer production is because knowledge creation is a team sport. That’s something I know from working in some amazing neuroscience labs, my career in product development, and the past few years of writing online in various places. Since legitimacy is the scarce resource, communities of trust are the most powerful for building knowledge. They’re also the most challenging in terms of the cost of implementing ownership, which is why most of the initial experiments in web3 such as NFTs have often tended towards single-player mode — transactional use cases between a single creator and a fan rather than community ownership. We still need to answer questions like how to reward editing and peer review, whether that’s via social tokens or some other solution. Those are the first experiments I plan to launch and write about.\n\nIn the very last of 70 pages in Coase’s Penguin, Benkler dreams of a “common property regime” that would allow peer production projects to start looking more like a “cooperative, managed and “owned” by its participants.” He noted that there were “no models for such cooperative appropriation on a large scale yet” but that it would essentially allow for projects to deliver monetary reward to their members in addition to the cultural significance of the output. No doubt, monetary reward could actually decrease the perception of cultural benefit — not everything should be commoditized. But one key benefit to such a model would be that it allows its members to actually build sustainable lives based on their contribution, rather than simply volunteering out of the drive to produce something valuable. Very specifically, consider how tragic it is that the [retention of young scientists](https://www.pnas.org/content/115/50/12616) in academia is worse now than ever. Better community ownership means a shift of the proportional benefit from the big platforms to the community contributors, and the most powerful impact of that is that more of those creators can sustainably invest in the work full-time.\n\nI believe the dream that Benkler mentioned offhandedly is starting to develop, and to be clear it’s not developing just via crypto. The digital world makes it easier than ever for knowledge creators to capture the unique value they create via a variety of mechanisms, and increasingly new infrastructure enables creators to build shared ownership via collaboration in peer-production communities and teams. There are versions of this where we set this up in ways that would go too far in commoditizing social value, for example where the cultural motivations are drowned out by the financial ones.\n\n[https://twitter.com/dazuck/status/1380157948140388359?s=20](https://twitter.com/dazuck/status/1380157948140388359?s=20)\n\nWhen you think about it on a people level, this danger becomes clear. If those who have been willing to participate in peer production purely for the societal benefit are no longer interested given its financial nature, then we lose the people who are most likely to pursue impact over hype. But if we can do it in a way that allows more of those people to build lives around culturally motivated pursuits, then we win enormously. My feeling from the past few months of this rabbit hole is that it’s decidedly the latter so far, but we need those same people to help build the systems that preserve cultural significance as the key value of this work. It’s hard to not be incredibly excited, at least, by the eruption of new smart, technologically oriented entrants to this space.\n\nI hope you’ll join me in this new publication, *[Penguins and Rabbit Holes](https://penguinsandrabbitholes.substack.com)*, as I highlight some of those people, as well as launch a few experiments of my own into how we can create better knowledge online. We have some pretty incredible new projects to launch over the coming months, and we’re actively looking for more people aligned to this mission to join us.\n\n*Thanks especially to [Jess Sloss](https://twitter.com/thattallguy) and the whole SeedClub community for their relentless effort to bring new people into the social token space, to my team at [ResearchGate](https://www.researchgate.net/) for helping build these insights into the system of science, and to the peer production team of writers and editors behind this new publication.* ", "timestamp": 1618502322, "digest": "oiyojFmzje494xJ__w5sDmoRm--9lUh-e3kg4Af9-7g", "contributor": "0x42DFAf5266Ad40AB4533F9806F5CC1DF4C1eB363"}
{"id": "7iqs3GPUCOrKNSqHpsJpGRcXOmts9S88hoojFK5sltk", "title": "Chocolate Covered Vegetables", "body": "\nMemes are made up of 3 things: the format, the message and the source image or video. The format is what is important. Below are formats. Where other artists then add in the blanks. Formats are timeless. The messages are not.\n\nIf you have a difficult message or story and you need a timeless format. Here are trending meme / text formats collected over time for generous sugar coating.\n\nReplace the (x), (y), (a), (b), (c) variables with your own message. \n\nFor Twitter, you need to have a character in the the top corner left (the very first character) or the format gets misaligned. \n\nCopy + Paste and please source this entry. \n\n*Why can't life always be this easy? She's in the mirror dancing so _______.*\n\n\n```\nThe value of ______:\n\n           █          　　\n           █　        \n           █　        \n           █　             ＿\n          (x)              (y)\n______________________________________________________________\n\nWelcome to my game show. Please choose a door. \n \n  🚪       🚪        🚪\n Door     Door     Door\n  1         2        3\n\n[Do something based on the door people choose]\n\n______________________________________________________________\n🌙     ___________   \n      |Answer (y)|\n      |______ ___|\n            |/\n        🕯🧘‍♀️🕯       _____________\n        🃑 🂻 🃟      |Question (x) |\n           🐛      <|_____________|\n_____________________________________________________________\n\n||　 | |   (a) \n|　| | | 　\n| | |. | \n|＿,_|_|\n／// |ヽ\\   (b)\n^^^^.|^^^^\n　　｜ﾍ⌒ﾌ \n　　(|･ω･)  (c)\n   （つ　)　\n　  しー-Ｊ\n______________________________________________________________\n\n(x)\n\n　  ∧＿∧\n (   ˘ω˘ )\n┳Ｕ┳―┳Ｕ┳\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n______________________________________________________________\n\n☀️ \n ／￣￣￣＼      ￣￣￣￣￣￣￣\n|　ー　ー  \\   ||           |\n|　 ◉　◉ | /  |           |\n\\　　 ▱　/∠    |    (x)    |\n ＼　　  |      |           |\n ／　　　＼      |           |\n       　      　￣￣￣￣￣￣￣\n______________________________________________________________\n\n                 ~ (x) ~   \n                 ▂▂▂▂▂▂            \n          ◢◤    █       █      \n██████████████████████████\n████ /         \\ ███  /        \\ ████\n         \\____ /            \\____ /\n\n\n______________________________________________________________\n     \n      (\\__/) \n      (•ㅅ•)    (x)\n 　＿ノ ヽ ノ＼ __   \n /　`/ ⌒Ｙ⌒ Ｙ　ヽ     \n( 　(三ヽ人　 /　　 |     \n|　ﾉ⌒＼ ￣￣ヽ　 ノ    \nヽ＿＿＿＞､＿＿_／ \n　　 ｜( 王 ﾉ〈 (\\__/) \n　　 /ﾐ`ー―彡\\  (•ㅅ•) (y)\n\n______________________________________________________________\n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿／\n￣￣￣￣￣￣￣\n\n　　　 ∧_∧　 (x)\n　　 (　･ω･)   \n　 ＿|　⊃／(＿＿_  \n／　└-(＿＿＿_／ \n￣￣￣￣￣￣￣    \n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿\n\n______________________________________________________________\n\n┏┓  \n┃┃╱╲ in \n┃╱╱╲╲ this  \n╱╱╭╮╲╲  house\n▔▏┗┛▕▔   we\n╱▔▔▔▔▔▔▔▔▔▔╲  \n        (x)\n╱╱┏┳┓╭╮┏┳┓ ╲╲  \n▔▏┗┻┛┃┃┗┻┛▕▔\n\n______________________________________________________________\n \n  buying (x)                     buying (y)                        \n                         \n    \\😃/                              ☹️\n    | |                             /| |\\\n   /   \\                            /   \\\n______________________________________________________________\n\nmight fuck (or mess) around and \n  |   👀   |\n  \\       /\n ____| |_____\n/        ✊__/\n\\_✊\n     do (x)\n\n______________________________________________________________\n\n(x)!\n\n     ⌒╭╮⌒╭╮\n╭ ◠             ╮\n(    ┃😴▄▄▄    )\n(    ┣━━━━┓  )\n ⌣(            ◡\n      ⌣╰╯◡ ⌣\n            ｡  ᴼ\n      😐   🖥️\n    ║[]╯━━\n    ╚╤ ╮\n        ┻\n______________________________________________________________\n\n|￣￣￣￣￣￣|\n|  (X)     | \n|          |  \n|          |\n|＿＿＿＿＿__|  \n(\\__/) ||  \n(•ㅅ•) ||  \n/ 　 づ\n\n______________________________________________________________\n\nwell would you look at the time...\n\n            12\n      11    ^     1\n  10        |         2      it’s (x)\n9           ⊙———>   o’clock\n   8                   4     \n       7          5           \n             6\n______________________________________________________________\n\n(x)\n ○ \nく|)へ\n    〉               (y)\n ￣￣┗┓            \n 　 　   ┗┓       ヾ○ｼ\n  　　      ┗┓   ヘ/ 　 　 \n 　           ┗┓ノ \n　 　 　 　 　    ┗┓\n\n______________________________________________________________\n\n┓┏┓┏┓┃ \n┛┗┛┗┛┃＼○／ \n┓┏┓┏┓┃  /   (x)\n┛┗┛┗┛┃ノ) \n┓┏┓┏┓┃         \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┃┃┃┃┃┃ \n┻┻┻┻┻┻\n______________________________________________________________\n\n(x)\n.       😎\n        |\\👐\n       / \\\n━━━━━┓ ＼＼\n┓┓┓┓┓┃\n┓┓┓┓┓┃ ヽ😩ノ (y)\n┓┓┓┓┓┃ 　/　\n┓┓┓┓┓┃ ノ)　\n┓┓┓┓┓┃\n______________________________________________________________\n\n┳┻| \n┳┻| \n┻┳|\n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┳┻| \n┻┳| \n┳┻| _ \n┻┳|•.•) (x)\n┳┻|⊂ﾉ    \n┻┳|\n______________________________________________________________\n\n╭ ◜◝ ͡ ◜◝ ͡  ◜◝ ͡ ◜◝ ͡  ◜◝ ╮ \n♡         (x)        ♡\n  ♡                 ♡\n╰ ◟◞ ͜  ◟ ͜   ◟◞ ͜  ◟ ͜   ◟◞ ╯\n           O\n             ° \n〃∩　∧＿∧\n⊂⌒（ ´・ω・）\n    ヽ_っ＿/￣￣￣/\n　 　   ＼/＿＿＿/\n\n______________________________________________________________\n\ni am a:\n⚪️ male\n⚪️ female\n🔘 (x)\n\ninterested in:\n⚪️ male\n⚪️ female\n🔘 (y) \n\n______________________________________________________________\n\n\nrelationship status: \n⚪️ single\n⚪️ taken\n⚪️ it’s complicated \n🔘 (x)\n\n______________________________________________________________\n\n📍 (a)\n  |\n  | _ _ _ _ _ _ _ _ _ __ __ \n                           |\n📍 (x)                     |\n                           |\n   _ _ _ _ _ _ _ _ _ _ __ _|\n  | \n📍(b)\n\n______________________________________________________________\n\nThis is \n↓      ↓← ← ← ←   ←\n↓      ↓               ↑\n↓      ↓               ↑\n→ → → → → → →  my brain\n         ↓\n         ↓\n         ↓\n                  After (x)\n\n______________________________________________________________\n\ncan (x) do (y)\n           _____|_____\n          |           |\n         yes         no\n          |           |\n          x           y\n\n______________________________________________________________\n\nme talking to (a):\n▶ 🔘─────── 00:07\n\nme talking to (b):\n▶ 🔘─────── 00:69\n\nme talking to (c)\n▶ 🔘──────── 4:20:00\n\n______________________________________________________________\n\n          x song 🅴\n         (y artist)\n         ◄◄⠀▐▐ ⠀►►\n     🔈─────────⚪️🔊\n\n______________________________________________________________\n\nTwitter:\n_________________________\n|          (x)           |\n|________________________|\n   X🔄             Y❤️\n\n[7 hours later]\n\n_________________________\n|         (x)            |\n|________________________|\n   69k🔄        420k❤️\n\n______________________________________________________________\n\nnormal heart rate:\n\n⠀   /\\⠀ ⠀ ⠀ ⠀.    /\\    \n__ /   \\   __/\\__ /  \\  _\n        \\/⠀ ⠀ ⠀ ⠀  \\/\n\nheart rate after (x):\n                            \n________________\n                     \nOR\n\nnormal heart rate:\n⠀   /\\⠀ ⠀ ⠀ ⠀     /\\    \n__ /   \\  __/\\__ /   \\   _\n        \\/⠀ ⠀ ⠀ ⠀     \\/\n\nheart rate after (x):            \n\n ⠀/\\       /\\⠀       /\\\n_/  \\  /\\_/  \\   /\\_/  \\  /\\____\n⠀    \\/⠀⠀     \\/⠀⠀     \\/\n\n______________________________________________________________\n\ndoing (x)\n▶  🔘─────── 3:19\n\ndoing (y)\n▶  🔘─────── 3:24:45\n\n______________________________________________________________\n\n╭━━━━━━━━━━━━╮\n┃   🌔 CO — STAR      ┃\n┃ 𝗬𝗼𝘂𝗿 𝗱𝗮𝘆 𝗮𝘁 𝗮 𝗴𝗹𝗮𝗻𝗰𝗲   ┃\n┃      (x)            ┃\n┃                     ┃\n╰━━━━━━━━━━━━╯\n\n______________________________________________________________\n\nhow much     |       ___/\n(x)          |      /\n             |  ___/\n             |/_______________\n     \n               how much (y)\n\n______________________________________________________________\n\ndoing             doing \n(x)                (y)\n\n           🤝\n\n (something they both do)\n\n______________________________________________________________\n\n.    *     *    .🌙   *    .  *  ☄️.\n  * .  🌍  *     .    *   💫  *    \n .  *        time to (x)   * .   \n     *        and       *\n .    *        (y).            * . \n  .    .  *   ✨  .  *    .   *     *\n     *   .     .        .  *    🌕   .\n *   🌕   .    .   * ⭐️    *   . *\n\n______________________________________________________________\n\nsummoning circle: \n\n        ❤️      ❤️\n                       ❤️\n  ❤️\n           (x)           ❤️     \n❤️                                   \n                  \n  ❤️                    ❤️\n\n        ❤️        ❤️       \n\n\n\n______________________________________________________________\n\n“(x)” ★☆☆☆☆ \n\n“(y) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\n\n______________________________________________________________\n\n⭐️⭐️⭐️⭐️⭐️\n\n(x)\n\n[Review updated]\n\n⭐️ ☆ ☆ ☆ ☆\n\n(y)\n\n______________________________________________________________\n\nmy DNA results are in:\n\nA         A\n  B      B\n      C\n  A      A\nB          B\n  C      C\n      A\n  B      B\nC          C\n  A     A\n      B\n  C      C\nA          A\n   B     B\n       C  \n   A     A\nB           B\n   C     C\n       A\n   B     B\nC           C\n\n(fill in with what you're made of)\n\n______________________________________________________________\n\nretweet if you\n really\n   really\n     really\n       really\n       really\n      really\n    really\n  really\nreally\nreally\n really\n really\n  really\n   really\n     really\n       really\n       really\n      really\n    really\n   really\n really \n(x)\n\n______________________________________________________________\n\nme: can i (x)\n\nthem: sorry no\n\nme: \n\n    N\n　   O\n　　　 O\n　　　　 o\n　　　　　o\n　　　　　 o\n　　　　　o\n　　　　 。\n　　　 。\n　　　.\n　　　.\n　　　 .\n　　　　.\n                  .\n\n______________________________________________________________\n\nno (x) has all five:\n\n1. (a)\n2. (b)\n3. (c)\n4. (d)\n5. (e)\n\n______________________________________________________________\n\nthem: i want you to hurt me\n\nme: (x) \n\nthem: please stop\n\nme: (y)\n\n______________________________________________________________\n\nthings that aren’t personality traits:\n\n• \n• \n• \n\nthings that are personality traits:\n\n• \n• \n• \n\n______________________________________________________________\n\nbop it: bop it!\n\nme: *bops it*\n\nbop it: twist it!\n\nme: *twists it*\n\nbop it: (x)\n\nme: what\n\nbop it: pull it!\n\n______________________________________________________________\n\nranking (x):\n\n1. you\n2. can’t\n3. rank\n4. (x)\n5. because\n6. they\n7. are\n8. all\n9. worthy \n10. of\n11. love\n12. (y)\n______________________________________________________________\n\nnobody: \nliterally no one: \nnot a single person in the world:\nme: (x)\n______________________________________________________________\n\nme: *thinks about (x)*\n\nmy brain: \ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\nme: (y)\n______________________________________________________________\n\noh, you like (x)? name every (x)\n\n______________________________________________________________\n\nI              took \n       just          a\n\n     D\n           N\n                 A\n\n        T    e    S    t\n\n  t u r n s      o u t\n\n          i'm\n\n           100%\n                 \n     (x)\n______________________________________________________________\n\nget you a (x) who can do both\n\n______________________________________________________________\n\n(x) and chill\n\n______________________________________________________________\n\nnoOo don’t (x) you’re so sexy lol\n\n______________________________________________________________\n\nYou do (x), i do (y), we are not the same\n\n______________________________________________________________\n\nlets get this (x)\n\n______________________________________________________________\n\nya’ll mind if i (x)?\n\n______________________________________________________________\n\nnot a phone in sight, just vibes | or (x)\n______________________________________________________________\n\n```\n\n**People with good hearts listen up!!!!.... we can't save everybody. I'll be your mirror anytime.**\n", "timestamp": 1618508371, "digest": "r6g6-QeFBFCZgsFERlI_mVEvgxsyN1R6jQXVLlaUFEA", "contributor": "0x2f9B473d4B9f95A5E55F205Be1a003B27D24Df76"}
{"id": "T2dZFSPcjZKdWivbVrjMsQ0cb1u0votR77ABRpgc9XY", "title": "Chocolate Covered Vegetables", "body": "I've so enjoyed everyone using these meme formats for their Tweets. This piece is for sale here: \n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/029473499555520510032724762836)\n\n\n\n**Every bidder who wishes gets a custom emoji art in their Twitter DM on a topic of their choice (please DM twitter.com/lizhagelthorn)**\n\nMemes are made up of 3 things: the format, the message and the source image or video. The format is what is important. Below are formats. Where other artists then add in the blanks. Formats are timeless. The messages are not.\n\nIf you have a difficult message or story and you need a timeless format. Here are trending meme / text formats collected over time for generous sugar coating.\n\nReplace the (x), (y), (a), (b), (c) variables with your own message. \n\nFor Twitter, you need to have a character in the the top corner left (the very first character) or the format gets misaligned. \n\nCopy + Paste and please source this entry. \n\n*Why can't life always be this easy? She's in the mirror dancing so _______.*\n\n\n```\nThe value of ______:\n\n           █          　　\n           █　        \n           █　        \n           █　             ＿\n          (x)              (y)\n______________________________________________________________\n\nWelcome to my game show. Please choose a door. \n \n  🚪       🚪        🚪\n Door     Door     Door\n  1         2        3\n\n[Do something based on the door people choose]\n\n______________________________________________________________\n🌙     ___________   \n      |Answer (y)|\n      |______ ___|\n            |/\n        🕯🧘‍♀️🕯       _____________\n        🃑 🂻 🃟      |Question (x) |\n           🐛      <|_____________|\n_____________________________________________________________\n\n||　 | |   (a) \n|　| | | 　\n| | |. | \n|＿,_|_|\n／// |ヽ\\   (b)\n^^^^.|^^^^\n　　｜ﾍ⌒ﾌ \n　　(|･ω･)  (c)\n   （つ　)　\n　  しー-Ｊ\n______________________________________________________________\n\n(x)\n\n　  ∧＿∧\n (   ˘ω˘ )\n┳Ｕ┳―┳Ｕ┳\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n______________________________________________________________\n\n☀️ \n ／￣￣￣＼      ￣￣￣￣￣￣￣\n|　ー　ー  \\   ||           |\n|　 ◉　◉ | /  |           |\n\\　　 ▱　/∠    |    (x)    |\n ＼　　  |      |           |\n ／　　　＼      |           |\n       　      　￣￣￣￣￣￣￣\n______________________________________________________________\n\n                 ~ (x) ~   \n                 ▂▂▂▂▂▂            \n          ◢◤    █       █      \n██████████████████████████\n████ /         \\ ███  /        \\ ████\n         \\____ /            \\____ /\n\n\n______________________________________________________________\n     \n      (\\__/) \n      (•ㅅ•)    (x)\n 　＿ノ ヽ ノ＼ __   \n /　`/ ⌒Ｙ⌒ Ｙ　ヽ     \n( 　(三ヽ人　 /　　 |     \n|　ﾉ⌒＼ ￣￣ヽ　 ノ    \nヽ＿＿＿＞､＿＿_／ \n　　 ｜( 王 ﾉ〈 (\\__/) \n　　 /ﾐ`ー―彡\\  (•ㅅ•) (y)\n\n______________________________________________________________\n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿／\n￣￣￣￣￣￣￣\n\n　　　 ∧_∧　 (x)\n　　 (　･ω･)   \n　 ＿|　⊃／(＿＿_  \n／　└-(＿＿＿_／ \n￣￣￣￣￣￣￣    \n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿\n\n______________________________________________________________\n\n┏┓  \n┃┃╱╲ in \n┃╱╱╲╲ this  \n╱╱╭╮╲╲  house\n▔▏┗┛▕▔   we\n╱▔▔▔▔▔▔▔▔▔▔╲  \n        (x)\n╱╱┏┳┓╭╮┏┳┓ ╲╲  \n▔▏┗┻┛┃┃┗┻┛▕▔\n\n______________________________________________________________\n \n  buying (x)                     buying (y)                        \n                         \n    \\😃/                              ☹️\n    | |                             /| |\\\n   /   \\                            /   \\\n______________________________________________________________\n\nmight fuck (or mess) around and \n  |   👀   |\n  \\       /\n ____| |_____\n/        ✊__/\n\\_✊\n     do (x)\n\n______________________________________________________________\n\n(x)!\n\n     ⌒╭╮⌒╭╮\n╭ ◠             ╮\n(    ┃😴▄▄▄    )\n(    ┣━━━━┓  )\n ⌣(            ◡\n      ⌣╰╯◡ ⌣\n            ｡  ᴼ\n      😐   🖥️\n    ║[]╯━━\n    ╚╤ ╮\n        ┻\n______________________________________________________________\n\n|￣￣￣￣￣￣|\n|  (X)     | \n|          |  \n|          |\n|＿＿＿＿＿__|  \n(\\__/) ||  \n(•ㅅ•) ||  \n/ 　 づ\n\n______________________________________________________________\n\nwell would you look at the time...\n\n            12\n      11    ^     1\n  10        |         2      it’s (x)\n9           ⊙———>   o’clock\n   8                   4     \n       7          5           \n             6\n______________________________________________________________\n\n(x)\n ○ \nく|)へ\n    〉               (y)\n ￣￣┗┓            \n 　 　   ┗┓       ヾ○ｼ\n  　　      ┗┓   ヘ/ 　 　 \n 　           ┗┓ノ \n　 　 　 　 　    ┗┓\n\n______________________________________________________________\n\n┓┏┓┏┓┃ \n┛┗┛┗┛┃＼○／ \n┓┏┓┏┓┃  /   (x)\n┛┗┛┗┛┃ノ) \n┓┏┓┏┓┃         \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┃┃┃┃┃┃ \n┻┻┻┻┻┻\n______________________________________________________________\n\n(x)\n.       😎\n        |\\👐\n       / \\\n━━━━━┓ ＼＼\n┓┓┓┓┓┃\n┓┓┓┓┓┃ ヽ😩ノ (y)\n┓┓┓┓┓┃ 　/　\n┓┓┓┓┓┃ ノ)　\n┓┓┓┓┓┃\n______________________________________________________________\n\n┳┻| \n┳┻| \n┻┳|\n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┳┻| \n┻┳| \n┳┻| _ \n┻┳|•.•) (x)\n┳┻|⊂ﾉ    \n┻┳|\n______________________________________________________________\n\n╭ ◜◝ ͡ ◜◝ ͡  ◜◝ ͡ ◜◝ ͡  ◜◝ ╮ \n♡         (x)        ♡\n  ♡                 ♡\n╰ ◟◞ ͜  ◟ ͜   ◟◞ ͜  ◟ ͜   ◟◞ ╯\n           O\n             ° \n〃∩　∧＿∧\n⊂⌒（ ´・ω・）\n    ヽ_っ＿/￣￣￣/\n　 　   ＼/＿＿＿/\n\n______________________________________________________________\n\ni am a:\n⚪️ male\n⚪️ female\n🔘 (x)\n\ninterested in:\n⚪️ male\n⚪️ female\n🔘 (y) \n\n______________________________________________________________\n\n\nrelationship status: \n⚪️ single\n⚪️ taken\n⚪️ it’s complicated \n🔘 (x)\n\n______________________________________________________________\n\n📍 (a)\n  |\n  | _ _ _ _ _ _ _ _ _ __ __ \n                           |\n📍 (x)                     |\n                           |\n   _ _ _ _ _ _ _ _ _ _ __ _|\n  | \n📍(b)\n\n______________________________________________________________\n\nThis is \n↓      ↓← ← ← ←   ←\n↓      ↓               ↑\n↓      ↓               ↑\n→ → → → → → →  my brain\n         ↓\n         ↓\n         ↓\n                  After (x)\n\n______________________________________________________________\n\ncan (x) do (y)\n           _____|_____\n          |           |\n         yes         no\n          |           |\n          x           y\n\n______________________________________________________________\n\nme talking to (a):\n▶ 🔘─────── 00:07\n\nme talking to (b):\n▶ 🔘─────── 00:69\n\nme talking to (c)\n▶ 🔘──────── 4:20:00\n\n______________________________________________________________\n\n          x song 🅴\n         (y artist)\n         ◄◄⠀▐▐ ⠀►►\n     🔈─────────⚪️🔊\n\n______________________________________________________________\n\nTwitter:\n_________________________\n|          (x)           |\n|________________________|\n   X🔄             Y❤️\n\n[7 hours later]\n\n_________________________\n|         (x)            |\n|________________________|\n   69k🔄        420k❤️\n\n______________________________________________________________\n\nnormal heart rate:\n\n⠀   /\\⠀ ⠀ ⠀ ⠀.    /\\    \n__ /   \\   __/\\__ /  \\  _\n        \\/⠀ ⠀ ⠀ ⠀  \\/\n\nheart rate after (x):\n                            \n________________\n                     \nOR\n\nnormal heart rate:\n⠀   /\\⠀ ⠀ ⠀ ⠀     /\\    \n__ /   \\  __/\\__ /   \\   _\n        \\/⠀ ⠀ ⠀ ⠀     \\/\n\nheart rate after (x):            \n\n ⠀/\\       /\\⠀       /\\\n_/  \\  /\\_/  \\   /\\_/  \\  /\\____\n⠀    \\/⠀⠀     \\/⠀⠀     \\/\n\n______________________________________________________________\n\ndoing (x)\n▶  🔘─────── 3:19\n\ndoing (y)\n▶  🔘─────── 3:24:45\n\n______________________________________________________________\n\n╭━━━━━━━━━━━━╮\n┃   🌔 CO — STAR      ┃\n┃ 𝗬𝗼𝘂𝗿 𝗱𝗮𝘆 𝗮𝘁 𝗮 𝗴𝗹𝗮𝗻𝗰𝗲   ┃\n┃      (x)            ┃\n┃                     ┃\n╰━━━━━━━━━━━━╯\n\n______________________________________________________________\n\nhow much     |       ___/\n(x)          |      /\n             |  ___/\n             |/_______________\n     \n               how much (y)\n\n______________________________________________________________\n\ndoing             doing \n(x)                (y)\n\n           🤝\n\n (something they both do)\n\n______________________________________________________________\n\n.    *     *    .🌙   *    .  *  ☄️.\n  * .  🌍  *     .    *   💫  *    \n .  *        time to (x)   * .   \n     *        and       *\n .    *        (y).            * . \n  .    .  *   ✨  .  *    .   *     *\n     *   .     .        .  *    🌕   .\n *   🌕   .    .   * ⭐️    *   . *\n\n______________________________________________________________\n\nsummoning circle: \n\n        ❤️      ❤️\n                       ❤️\n  ❤️\n           (x)           ❤️     \n❤️                                   \n                  \n  ❤️                    ❤️\n\n        ❤️        ❤️       \n\n\n\n______________________________________________________________\n\n“(x)” ★☆☆☆☆ \n\n“(y) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\n\n______________________________________________________________\n\n⭐️⭐️⭐️⭐️⭐️\n\n(x)\n\n[Review updated]\n\n⭐️ ☆ ☆ ☆ ☆\n\n(y)\n\n______________________________________________________________\n\nmy DNA results are in:\n\nA         A\n  B      B\n      C\n  A      A\nB          B\n  C      C\n      A\n  B      B\nC          C\n  A     A\n      B\n  C      C\nA          A\n   B     B\n       C  \n   A     A\nB           B\n   C     C\n       A\n   B     B\nC           C\n\n(fill in with what you're made of)\n\n______________________________________________________________\n\nretweet if you\n really\n   really\n     really\n       really\n       really\n      really\n    really\n  really\nreally\nreally\n really\n really\n  really\n   really\n     really\n       really\n       really\n      really\n    really\n   really\n really \n(x)\n\n______________________________________________________________\n\nme: can i (x)\n\nthem: sorry no\n\nme: \n\n    N\n　   O\n　　　 O\n　　　　 o\n　　　　　o\n　　　　　 o\n　　　　　o\n　　　　 。\n　　　 。\n　　　.\n　　　.\n　　　 .\n　　　　.\n                  .\n\n______________________________________________________________\n\nno (x) has all five:\n\n1. (a)\n2. (b)\n3. (c)\n4. (d)\n5. (e)\n\n______________________________________________________________\n\nthem: i want you to hurt me\n\nme: (x) \n\nthem: please stop\n\nme: (y)\n\n______________________________________________________________\n\nthings that aren’t personality traits:\n\n• \n• \n• \n\nthings that are personality traits:\n\n• \n• \n• \n\n______________________________________________________________\n\nbop it: bop it!\n\nme: *bops it*\n\nbop it: twist it!\n\nme: *twists it*\n\nbop it: (x)\n\nme: what\n\nbop it: pull it!\n\n______________________________________________________________\n\nranking (x):\n\n1. you\n2. can’t\n3. rank\n4. (x)\n5. because\n6. they\n7. are\n8. all\n9. worthy \n10. of\n11. love\n12. (y)\n______________________________________________________________\n\nnobody: \nliterally no one: \nnot a single person in the world:\nme: (x)\n______________________________________________________________\n\nme: *thinks about (x)*\n\nmy brain: \ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\nme: (y)\n______________________________________________________________\n\noh, you like (x)? name every (x)\n\n______________________________________________________________\n\nI              took \n       just          a\n\n     D\n           N\n                 A\n\n        T    e    S    t\n\n  t u r n s      o u t\n\n          i'm\n\n           100%\n                 \n     (x)\n______________________________________________________________\n\nget you a (x) who can do both\n\n______________________________________________________________\n\n(x) and chill\n\n______________________________________________________________\n\nnoOo don’t (x) you’re so sexy lol\n\n______________________________________________________________\n\nYou do (x), i do (y), we are not the same\n\n______________________________________________________________\n\nlets get this (x)\n\n______________________________________________________________\n\nya’ll mind if i (x)?\n\n______________________________________________________________\n\nnot a phone in sight, just vibes | or (x)\n______________________________________________________________\n\n```\n\n**People with good hearts listen up!!!!.... we can't save everybody. I'll be your mirror anytime.**\n", "timestamp": 1618510964, "digest": "r6g6-QeFBFCZgsFERlI_mVEvgxsyN1R6jQXVLlaUFEA", "contributor": "0x2f9B473d4B9f95A5E55F205Be1a003B27D24Df76"}
{"id": "n7o8KMRwbnsTXSu5PGwx8TZIYNaSvhHsDILytoLfkwc", "title": "Chocolate Covered Vegetables", "body": "I've so enjoyed everyone using these meme formats for their Tweets. This piece is for sale here: \n\n[NFT]\n\n(zora://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/092806065432374599977029473499555520510032724762836)\n\n\n\n**Every bidder who wishes gets a custom emoji art in their Twitter DM on a topic of their choice (please DM twitter.com/lizhagelthorn)**\n\nMemes are made up of 3 things: the format, the message and the source image or video. The format is what is important. Below are formats. Where other artists then add in the blanks. Formats are timeless. The messages are not.\n\nIf you have a difficult message or story and you need a timeless format. Here are trending meme / text formats collected over time for generous sugar coating.\n\nReplace the (x), (y), (a), (b), (c) variables with your own message. \n\nFor Twitter, you need to have a character in the the top corner left (the very first character) or the format gets misaligned. \n\nCopy + Paste and please source this entry. \n\n*Why can't life always be this easy? She's in the mirror dancing so _______.*\n\n\n```\nThe value of ______:\n\n           █          　　\n           █　        \n           █　        \n           █　             ＿\n          (x)              (y)\n______________________________________________________________\n\nWelcome to my game show. Please choose a door. \n \n  🚪       🚪        🚪\n Door     Door     Door\n  1         2        3\n\n[Do something based on the door people choose]\n\n______________________________________________________________\n🌙     ___________   \n      |Answer (y)|\n      |______ ___|\n            |/\n        🕯🧘‍♀️🕯       _____________\n        🃑 🂻 🃟      |Question (x) |\n           🐛      <|_____________|\n_____________________________________________________________\n\n||　 | |   (a) \n|　| | | 　\n| | |. | \n|＿,_|_|\n／// |ヽ\\   (b)\n^^^^.|^^^^\n　　｜ﾍ⌒ﾌ \n　　(|･ω･)  (c)\n   （つ　)　\n　  しー-Ｊ\n______________________________________________________________\n\n(x)\n\n　  ∧＿∧\n (   ˘ω˘ )\n┳Ｕ┳―┳Ｕ┳\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n______________________________________________________________\n\n☀️ \n ／￣￣￣＼      ￣￣￣￣￣￣￣\n|　ー　ー  \\   ||           |\n|　 ◉　◉ | /  |           |\n\\　　 ▱　/∠    |    (x)    |\n ＼　　  |      |           |\n ／　　　＼      |           |\n       　      　￣￣￣￣￣￣￣\n______________________________________________________________\n\n                 ~ (x) ~   \n                 ▂▂▂▂▂▂            \n          ◢◤    █       █      \n██████████████████████████\n████ /         \\ ███  /        \\ ████\n         \\____ /            \\____ /\n\n\n______________________________________________________________\n     \n      (\\__/) \n      (•ㅅ•)    (x)\n 　＿ノ ヽ ノ＼ __   \n /　`/ ⌒Ｙ⌒ Ｙ　ヽ     \n( 　(三ヽ人　 /　　 |     \n|　ﾉ⌒＼ ￣￣ヽ　 ノ    \nヽ＿＿＿＞､＿＿_／ \n　　 ｜( 王 ﾉ〈 (\\__/) \n　　 /ﾐ`ー―彡\\  (•ㅅ•) (y)\n\n______________________________________________________________\n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿／\n￣￣￣￣￣￣￣\n\n　　　 ∧_∧　 (x)\n　　 (　･ω･)   \n　 ＿|　⊃／(＿＿_  \n／　└-(＿＿＿_／ \n￣￣￣￣￣￣￣    \n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿\n\n______________________________________________________________\n\n┏┓  \n┃┃╱╲ in \n┃╱╱╲╲ this  \n╱╱╭╮╲╲  house\n▔▏┗┛▕▔   we\n╱▔▔▔▔▔▔▔▔▔▔╲  \n        (x)\n╱╱┏┳┓╭╮┏┳┓ ╲╲  \n▔▏┗┻┛┃┃┗┻┛▕▔\n\n______________________________________________________________\n \n  buying (x)                     buying (y)                        \n                         \n    \\😃/                              ☹️\n    | |                             /| |\\\n   /   \\                            /   \\\n______________________________________________________________\n\nmight fuck (or mess) around and \n  |   👀   |\n  \\       /\n ____| |_____\n/        ✊__/\n\\_✊\n     do (x)\n\n______________________________________________________________\n\n(x)!\n\n     ⌒╭╮⌒╭╮\n╭ ◠             ╮\n(    ┃😴▄▄▄    )\n(    ┣━━━━┓  )\n ⌣(            ◡\n      ⌣╰╯◡ ⌣\n            ｡  ᴼ\n      😐   🖥️\n    ║[]╯━━\n    ╚╤ ╮\n        ┻\n______________________________________________________________\n\n|￣￣￣￣￣￣|\n|  (X)     | \n|          |  \n|          |\n|＿＿＿＿＿__|  \n(\\__/) ||  \n(•ㅅ•) ||  \n/ 　 づ\n\n______________________________________________________________\n\nwell would you look at the time...\n\n            12\n      11    ^     1\n  10        |         2      it’s (x)\n9           ⊙———>   o’clock\n   8                   4     \n       7          5           \n             6\n______________________________________________________________\n\n(x)\n ○ \nく|)へ\n    〉               (y)\n ￣￣┗┓            \n 　 　   ┗┓       ヾ○ｼ\n  　　      ┗┓   ヘ/ 　 　 \n 　           ┗┓ノ \n　 　 　 　 　    ┗┓\n\n______________________________________________________________\n\n┓┏┓┏┓┃ \n┛┗┛┗┛┃＼○／ \n┓┏┓┏┓┃  /   (x)\n┛┗┛┗┛┃ノ) \n┓┏┓┏┓┃         \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┃┃┃┃┃┃ \n┻┻┻┻┻┻\n______________________________________________________________\n\n(x)\n.       😎\n        |\\👐\n       / \\\n━━━━━┓ ＼＼\n┓┓┓┓┓┃\n┓┓┓┓┓┃ ヽ😩ノ (y)\n┓┓┓┓┓┃ 　/　\n┓┓┓┓┓┃ ノ)　\n┓┓┓┓┓┃\n______________________________________________________________\n\n┳┻| \n┳┻| \n┻┳|\n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┳┻| \n┻┳| \n┳┻| _ \n┻┳|•.•) (x)\n┳┻|⊂ﾉ    \n┻┳|\n______________________________________________________________\n\n╭ ◜◝ ͡ ◜◝ ͡  ◜◝ ͡ ◜◝ ͡  ◜◝ ╮ \n♡         (x)        ♡\n  ♡                 ♡\n╰ ◟◞ ͜  ◟ ͜   ◟◞ ͜  ◟ ͜   ◟◞ ╯\n           O\n             ° \n〃∩　∧＿∧\n⊂⌒（ ´・ω・）\n    ヽ_っ＿/￣￣￣/\n　 　   ＼/＿＿＿/\n\n______________________________________________________________\n\ni am a:\n⚪️ male\n⚪️ female\n🔘 (x)\n\ninterested in:\n⚪️ male\n⚪️ female\n🔘 (y) \n\n______________________________________________________________\n\n\nrelationship status: \n⚪️ single\n⚪️ taken\n⚪️ it’s complicated \n🔘 (x)\n\n______________________________________________________________\n\n📍 (a)\n  |\n  | _ _ _ _ _ _ _ _ _ __ __ \n                           |\n📍 (x)                     |\n                           |\n   _ _ _ _ _ _ _ _ _ _ __ _|\n  | \n📍(b)\n\n______________________________________________________________\n\nThis is \n↓      ↓← ← ← ←   ←\n↓      ↓               ↑\n↓      ↓               ↑\n→ → → → → → →  my brain\n         ↓\n         ↓\n         ↓\n                  After (x)\n\n______________________________________________________________\n\ncan (x) do (y)\n           _____|_____\n          |           |\n         yes         no\n          |           |\n          x           y\n\n______________________________________________________________\n\nme talking to (a):\n▶ 🔘─────── 00:07\n\nme talking to (b):\n▶ 🔘─────── 00:69\n\nme talking to (c)\n▶ 🔘──────── 4:20:00\n\n______________________________________________________________\n\n          x song 🅴\n         (y artist)\n         ◄◄⠀▐▐ ⠀►►\n     🔈─────────⚪️🔊\n\n______________________________________________________________\n\nTwitter:\n_________________________\n|          (x)           |\n|________________________|\n   X🔄             Y❤️\n\n[7 hours later]\n\n_________________________\n|         (x)            |\n|________________________|\n   69k🔄        420k❤️\n\n______________________________________________________________\n\nnormal heart rate:\n\n⠀   /\\⠀ ⠀ ⠀ ⠀.    /\\    \n__ /   \\   __/\\__ /  \\  _\n        \\/⠀ ⠀ ⠀ ⠀  \\/\n\nheart rate after (x):\n                            \n________________\n                     \nOR\n\nnormal heart rate:\n⠀   /\\⠀ ⠀ ⠀ ⠀     /\\    \n__ /   \\  __/\\__ /   \\   _\n        \\/⠀ ⠀ ⠀ ⠀     \\/\n\nheart rate after (x):            \n\n ⠀/\\       /\\⠀       /\\\n_/  \\  /\\_/  \\   /\\_/  \\  /\\____\n⠀    \\/⠀⠀     \\/⠀⠀     \\/\n\n______________________________________________________________\n\ndoing (x)\n▶  🔘─────── 3:19\n\ndoing (y)\n▶  🔘─────── 3:24:45\n\n______________________________________________________________\n\n╭━━━━━━━━━━━━╮\n┃   🌔 CO — STAR      ┃\n┃ 𝗬𝗼𝘂𝗿 𝗱𝗮𝘆 𝗮𝘁 𝗮 𝗴𝗹𝗮𝗻𝗰𝗲   ┃\n┃      (x)            ┃\n┃                     ┃\n╰━━━━━━━━━━━━╯\n\n______________________________________________________________\n\nhow much     |       ___/\n(x)          |      /\n             |  ___/\n             |/_______________\n     \n               how much (y)\n\n______________________________________________________________\n\ndoing             doing \n(x)                (y)\n\n           🤝\n\n (something they both do)\n\n______________________________________________________________\n\n.    *     *    .🌙   *    .  *  ☄️.\n  * .  🌍  *     .    *   💫  *    \n .  *        time to (x)   * .   \n     *        and       *\n .    *        (y).            * . \n  .    .  *   ✨  .  *    .   *     *\n     *   .     .        .  *    🌕   .\n *   🌕   .    .   * ⭐️    *   . *\n\n______________________________________________________________\n\nsummoning circle: \n\n        ❤️      ❤️\n                       ❤️\n  ❤️\n           (x)           ❤️     \n❤️                                   \n                  \n  ❤️                    ❤️\n\n        ❤️        ❤️       \n\n\n\n______________________________________________________________\n\n“(x)” ★☆☆☆☆ \n\n“(y) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\n\n______________________________________________________________\n\n⭐️⭐️⭐️⭐️⭐️\n\n(x)\n\n[Review updated]\n\n⭐️ ☆ ☆ ☆ ☆\n\n(y)\n\n______________________________________________________________\n\nmy DNA results are in:\n\nA         A\n  B      B\n      C\n  A      A\nB          B\n  C      C\n      A\n  B      B\nC          C\n  A     A\n      B\n  C      C\nA          A\n   B     B\n       C  \n   A     A\nB           B\n   C     C\n       A\n   B     B\nC           C\n\n(fill in with what you're made of)\n\n______________________________________________________________\n\nretweet if you\n really\n   really\n     really\n       really\n       really\n      really\n    really\n  really\nreally\nreally\n really\n really\n  really\n   really\n     really\n       really\n       really\n      really\n    really\n   really\n really \n(x)\n\n______________________________________________________________\n\nme: can i (x)\n\nthem: sorry no\n\nme: \n\n    N\n　   O\n　　　 O\n　　　　 o\n　　　　　o\n　　　　　 o\n　　　　　o\n　　　　 。\n　　　 。\n　　　.\n　　　.\n　　　 .\n　　　　.\n                  .\n\n______________________________________________________________\n\nno (x) has all five:\n\n1. (a)\n2. (b)\n3. (c)\n4. (d)\n5. (e)\n\n______________________________________________________________\n\nthem: i want you to hurt me\n\nme: (x) \n\nthem: please stop\n\nme: (y)\n\n______________________________________________________________\n\nthings that aren’t personality traits:\n\n• \n• \n• \n\nthings that are personality traits:\n\n• \n• \n• \n\n______________________________________________________________\n\nbop it: bop it!\n\nme: *bops it*\n\nbop it: twist it!\n\nme: *twists it*\n\nbop it: (x)\n\nme: what\n\nbop it: pull it!\n\n______________________________________________________________\n\nranking (x):\n\n1. you\n2. can’t\n3. rank\n4. (x)\n5. because\n6. they\n7. are\n8. all\n9. worthy \n10. of\n11. love\n12. (y)\n______________________________________________________________\n\nnobody: \nliterally no one: \nnot a single person in the world:\nme: (x)\n______________________________________________________________\n\nme: *thinks about (x)*\n\nmy brain: \ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\nme: (y)\n______________________________________________________________\n\noh, you like (x)? name every (x)\n\n______________________________________________________________\n\nI              took \n       just          a\n\n     D\n           N\n                 A\n\n        T    e    S    t\n\n  t u r n s      o u t\n\n          i'm\n\n           100%\n                 \n     (x)\n______________________________________________________________\n\nget you a (x) who can do both\n\n______________________________________________________________\n\n(x) and chill\n\n______________________________________________________________\n\nnoOo don’t (x) you’re so sexy lol\n\n______________________________________________________________\n\nYou do (x), i do (y), we are not the same\n\n______________________________________________________________\n\nlets get this (x)\n\n______________________________________________________________\n\nya’ll mind if i (x)?\n\n______________________________________________________________\n\nnot a phone in sight, just vibes | or (x)\n______________________________________________________________\n\n```\n\n**People with good hearts listen up!!!!.... we can't save everybody. I'll be your mirror anytime.**\n", "timestamp": 1618511650, "digest": "r6g6-QeFBFCZgsFERlI_mVEvgxsyN1R6jQXVLlaUFEA", "contributor": "0x2f9B473d4B9f95A5E55F205Be1a003B27D24Df76"}
{"id": "IATk2zO1NC2eJZDtOhqPtpH5t7fnhR0ENYO6UWuqRis", "title": "Chocolate Covered Vegetables", "body": "I've so enjoyed everyone using these meme formats for their Tweets. This piece is for sale here: \n\n[NFT]\n\n(zora://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/092806065432374599977029473499555520510032724762836)\n\n\n**Every bidder who wishes gets a custom emoji art in their Twitter DM on a topic of their choice (please DM twitter.com/lizhagelthorn)**\n\nMemes are made up of 3 things: the format, the message and the source image or video. The format is what is important. Below are formats. Where other artists then add in the blanks. Formats are timeless. The messages are not.\n\nIf you have a difficult message or story and you need a timeless format. Here are trending meme / text formats collected over time for generous sugar coating.\n\nReplace the (x), (y), (a), (b), (c) variables with your own message. \n\nFor Twitter, you need to have a character in the the top corner left (the very first character) or the format gets misaligned. \n\nCopy + Paste and please source this entry. \n\n*Why can't life always be this easy? She's in the mirror dancing so _______.*\n\n\n```\nThe value of ______:\n\n           █          　　\n           █　        \n           █　        \n           █　             ＿\n          (x)              (y)\n______________________________________________________________\n\nWelcome to my game show. Please choose a door. \n \n  🚪       🚪        🚪\n Door     Door     Door\n  1         2        3\n\n[Do something based on the door people choose]\n\n______________________________________________________________\n🌙     ___________   \n      |Answer (y)|\n      |______ ___|\n            |/\n        🕯🧘‍♀️🕯       _____________\n        🃑 🂻 🃟      |Question (x) |\n           🐛      <|_____________|\n_____________________________________________________________\n\n||　 | |   (a) \n|　| | | 　\n| | |. | \n|＿,_|_|\n／// |ヽ\\   (b)\n^^^^.|^^^^\n　　｜ﾍ⌒ﾌ \n　　(|･ω･)  (c)\n   （つ　)　\n　  しー-Ｊ\n______________________________________________________________\n\n(x)\n\n　  ∧＿∧\n (   ˘ω˘ )\n┳Ｕ┳―┳Ｕ┳\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n______________________________________________________________\n\n☀️ \n ／￣￣￣＼      ￣￣￣￣￣￣￣\n|　ー　ー  \\   ||           |\n|　 ◉　◉ | /  |           |\n\\　　 ▱　/∠    |    (x)    |\n ＼　　  |      |           |\n ／　　　＼      |           |\n       　      　￣￣￣￣￣￣￣\n______________________________________________________________\n\n                 ~ (x) ~   \n                 ▂▂▂▂▂▂            \n          ◢◤    █       █      \n██████████████████████████\n████ /         \\ ███  /        \\ ████\n         \\____ /            \\____ /\n\n\n______________________________________________________________\n     \n      (\\__/) \n      (•ㅅ•)    (x)\n 　＿ノ ヽ ノ＼ __   \n /　`/ ⌒Ｙ⌒ Ｙ　ヽ     \n( 　(三ヽ人　 /　　 |     \n|　ﾉ⌒＼ ￣￣ヽ　 ノ    \nヽ＿＿＿＞､＿＿_／ \n　　 ｜( 王 ﾉ〈 (\\__/) \n　　 /ﾐ`ー―彡\\  (•ㅅ•) (y)\n\n______________________________________________________________\n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿／\n￣￣￣￣￣￣￣\n\n　　　 ∧_∧　 (x)\n　　 (　･ω･)   \n　 ＿|　⊃／(＿＿_  \n／　└-(＿＿＿_／ \n￣￣￣￣￣￣￣    \n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿\n\n______________________________________________________________\n\n┏┓  \n┃┃╱╲ in \n┃╱╱╲╲ this  \n╱╱╭╮╲╲  house\n▔▏┗┛▕▔   we\n╱▔▔▔▔▔▔▔▔▔▔╲  \n        (x)\n╱╱┏┳┓╭╮┏┳┓ ╲╲  \n▔▏┗┻┛┃┃┗┻┛▕▔\n\n______________________________________________________________\n \n  buying (x)                     buying (y)                        \n                         \n    \\😃/                              ☹️\n    | |                             /| |\\\n   /   \\                            /   \\\n______________________________________________________________\n\nmight fuck (or mess) around and \n  |   👀   |\n  \\       /\n ____| |_____\n/        ✊__/\n\\_✊\n     do (x)\n\n______________________________________________________________\n\n(x)!\n\n     ⌒╭╮⌒╭╮\n╭ ◠             ╮\n(    ┃😴▄▄▄    )\n(    ┣━━━━┓  )\n ⌣(            ◡\n      ⌣╰╯◡ ⌣\n            ｡  ᴼ\n      😐   🖥️\n    ║[]╯━━\n    ╚╤ ╮\n        ┻\n______________________________________________________________\n\n|￣￣￣￣￣￣|\n|  (X)     | \n|          |  \n|          |\n|＿＿＿＿＿__|  \n(\\__/) ||  \n(•ㅅ•) ||  \n/ 　 づ\n\n______________________________________________________________\n\nwell would you look at the time...\n\n            12\n      11    ^     1\n  10        |         2      it’s (x)\n9           ⊙———>   o’clock\n   8                   4     \n       7          5           \n             6\n______________________________________________________________\n\n(x)\n ○ \nく|)へ\n    〉               (y)\n ￣￣┗┓            \n 　 　   ┗┓       ヾ○ｼ\n  　　      ┗┓   ヘ/ 　 　 \n 　           ┗┓ノ \n　 　 　 　 　    ┗┓\n\n______________________________________________________________\n\n┓┏┓┏┓┃ \n┛┗┛┗┛┃＼○／ \n┓┏┓┏┓┃  /   (x)\n┛┗┛┗┛┃ノ) \n┓┏┓┏┓┃         \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┃┃┃┃┃┃ \n┻┻┻┻┻┻\n______________________________________________________________\n\n(x)\n.       😎\n        |\\👐\n       / \\\n━━━━━┓ ＼＼\n┓┓┓┓┓┃\n┓┓┓┓┓┃ ヽ😩ノ (y)\n┓┓┓┓┓┃ 　/　\n┓┓┓┓┓┃ ノ)　\n┓┓┓┓┓┃\n______________________________________________________________\n\n┳┻| \n┳┻| \n┻┳|\n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┳┻| \n┻┳| \n┳┻| _ \n┻┳|•.•) (x)\n┳┻|⊂ﾉ    \n┻┳|\n______________________________________________________________\n\n╭ ◜◝ ͡ ◜◝ ͡  ◜◝ ͡ ◜◝ ͡  ◜◝ ╮ \n♡         (x)        ♡\n  ♡                 ♡\n╰ ◟◞ ͜  ◟ ͜   ◟◞ ͜  ◟ ͜   ◟◞ ╯\n           O\n             ° \n〃∩　∧＿∧\n⊂⌒（ ´・ω・）\n    ヽ_っ＿/￣￣￣/\n　 　   ＼/＿＿＿/\n\n______________________________________________________________\n\ni am a:\n⚪️ male\n⚪️ female\n🔘 (x)\n\ninterested in:\n⚪️ male\n⚪️ female\n🔘 (y) \n\n______________________________________________________________\n\n\nrelationship status: \n⚪️ single\n⚪️ taken\n⚪️ it’s complicated \n🔘 (x)\n\n______________________________________________________________\n\n📍 (a)\n  |\n  | _ _ _ _ _ _ _ _ _ __ __ \n                           |\n📍 (x)                     |\n                           |\n   _ _ _ _ _ _ _ _ _ _ __ _|\n  | \n📍(b)\n\n______________________________________________________________\n\nThis is \n↓      ↓← ← ← ←   ←\n↓      ↓               ↑\n↓      ↓               ↑\n→ → → → → → →  my brain\n         ↓\n         ↓\n         ↓\n                  After (x)\n\n______________________________________________________________\n\ncan (x) do (y)\n           _____|_____\n          |           |\n         yes         no\n          |           |\n          x           y\n\n______________________________________________________________\n\nme talking to (a):\n▶ 🔘─────── 00:07\n\nme talking to (b):\n▶ 🔘─────── 00:69\n\nme talking to (c)\n▶ 🔘──────── 4:20:00\n\n______________________________________________________________\n\n          x song 🅴\n         (y artist)\n         ◄◄⠀▐▐ ⠀►►\n     🔈─────────⚪️🔊\n\n______________________________________________________________\n\nTwitter:\n_________________________\n|          (x)           |\n|________________________|\n   X🔄             Y❤️\n\n[7 hours later]\n\n_________________________\n|         (x)            |\n|________________________|\n   69k🔄        420k❤️\n\n______________________________________________________________\n\nnormal heart rate:\n\n⠀   /\\⠀ ⠀ ⠀ ⠀.    /\\    \n__ /   \\   __/\\__ /  \\  _\n        \\/⠀ ⠀ ⠀ ⠀  \\/\n\nheart rate after (x):\n                            \n________________\n                     \nOR\n\nnormal heart rate:\n⠀   /\\⠀ ⠀ ⠀ ⠀     /\\    \n__ /   \\  __/\\__ /   \\   _\n        \\/⠀ ⠀ ⠀ ⠀     \\/\n\nheart rate after (x):            \n\n ⠀/\\       /\\⠀       /\\\n_/  \\  /\\_/  \\   /\\_/  \\  /\\____\n⠀    \\/⠀⠀     \\/⠀⠀     \\/\n\n______________________________________________________________\n\ndoing (x)\n▶  🔘─────── 3:19\n\ndoing (y)\n▶  🔘─────── 3:24:45\n\n______________________________________________________________\n\n╭━━━━━━━━━━━━╮\n┃   🌔 CO — STAR      ┃\n┃ 𝗬𝗼𝘂𝗿 𝗱𝗮𝘆 𝗮𝘁 𝗮 𝗴𝗹𝗮𝗻𝗰𝗲   ┃\n┃      (x)            ┃\n┃                     ┃\n╰━━━━━━━━━━━━╯\n\n______________________________________________________________\n\nhow much     |       ___/\n(x)          |      /\n             |  ___/\n             |/_______________\n     \n               how much (y)\n\n______________________________________________________________\n\ndoing             doing \n(x)                (y)\n\n           🤝\n\n (something they both do)\n\n______________________________________________________________\n\n.    *     *    .🌙   *    .  *  ☄️.\n  * .  🌍  *     .    *   💫  *    \n .  *        time to (x)   * .   \n     *        and       *\n .    *        (y).            * . \n  .    .  *   ✨  .  *    .   *     *\n     *   .     .        .  *    🌕   .\n *   🌕   .    .   * ⭐️    *   . *\n\n______________________________________________________________\n\nsummoning circle: \n\n        ❤️      ❤️\n                       ❤️\n  ❤️\n           (x)           ❤️     \n❤️                                   \n                  \n  ❤️                    ❤️\n\n        ❤️        ❤️       \n\n\n\n______________________________________________________________\n\n“(x)” ★☆☆☆☆ \n\n“(y) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\n\n______________________________________________________________\n\n⭐️⭐️⭐️⭐️⭐️\n\n(x)\n\n[Review updated]\n\n⭐️ ☆ ☆ ☆ ☆\n\n(y)\n\n______________________________________________________________\n\nmy DNA results are in:\n\nA         A\n  B      B\n      C\n  A      A\nB          B\n  C      C\n      A\n  B      B\nC          C\n  A     A\n      B\n  C      C\nA          A\n   B     B\n       C  \n   A     A\nB           B\n   C     C\n       A\n   B     B\nC           C\n\n(fill in with what you're made of)\n\n______________________________________________________________\n\nretweet if you\n really\n   really\n     really\n       really\n       really\n      really\n    really\n  really\nreally\nreally\n really\n really\n  really\n   really\n     really\n       really\n       really\n      really\n    really\n   really\n really \n(x)\n\n______________________________________________________________\n\nme: can i (x)\n\nthem: sorry no\n\nme: \n\n    N\n　   O\n　　　 O\n　　　　 o\n　　　　　o\n　　　　　 o\n　　　　　o\n　　　　 。\n　　　 。\n　　　.\n　　　.\n　　　 .\n　　　　.\n                  .\n\n______________________________________________________________\n\nno (x) has all five:\n\n1. (a)\n2. (b)\n3. (c)\n4. (d)\n5. (e)\n\n______________________________________________________________\n\nthem: i want you to hurt me\n\nme: (x) \n\nthem: please stop\n\nme: (y)\n\n______________________________________________________________\n\nthings that aren’t personality traits:\n\n• \n• \n• \n\nthings that are personality traits:\n\n• \n• \n• \n\n______________________________________________________________\n\nbop it: bop it!\n\nme: *bops it*\n\nbop it: twist it!\n\nme: *twists it*\n\nbop it: (x)\n\nme: what\n\nbop it: pull it!\n\n______________________________________________________________\n\nranking (x):\n\n1. you\n2. can’t\n3. rank\n4. (x)\n5. because\n6. they\n7. are\n8. all\n9. worthy \n10. of\n11. love\n12. (y)\n______________________________________________________________\n\nnobody: \nliterally no one: \nnot a single person in the world:\nme: (x)\n______________________________________________________________\n\nme: *thinks about (x)*\n\nmy brain: \ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\nme: (y)\n______________________________________________________________\n\noh, you like (x)? name every (x)\n\n______________________________________________________________\n\nI              took \n       just          a\n\n     D\n           N\n                 A\n\n        T    e    S    t\n\n  t u r n s      o u t\n\n          i'm\n\n           100%\n                 \n     (x)\n______________________________________________________________\n\nget you a (x) who can do both\n\n______________________________________________________________\n\n(x) and chill\n\n______________________________________________________________\n\nnoOo don’t (x) you’re so sexy lol\n\n______________________________________________________________\n\nYou do (x), i do (y), we are not the same\n\n______________________________________________________________\n\nlets get this (x)\n\n______________________________________________________________\n\nya’ll mind if i (x)?\n\n______________________________________________________________\n\nnot a phone in sight, just vibes | or (x)\n______________________________________________________________\n\n```\n\n**People with good hearts listen up!!!!.... we can't save everybody. I'll be your mirror anytime.**\n", "timestamp": 1618511713, "digest": "r6g6-QeFBFCZgsFERlI_mVEvgxsyN1R6jQXVLlaUFEA", "contributor": "0x2f9B473d4B9f95A5E55F205Be1a003B27D24Df76"}
{"id": "xo-jTfBYSmW-9D7H9BId-Eo0jtsLQOggcnRonr1h7pM", "title": "Chocolate Covered Vegetables", "body": "I've so enjoyed everyone using these meme formats for their Tweets. This piece is for sale here: \n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/029473499555520510032724762836)\n\n\n\n\n**Every bidder who wishes gets a custom emoji art in their Twitter DM on a topic of their choice (please DM twitter.com/lizhagelthorn)**\n\nMemes are made up of 3 things: the format, the message and the source image or video. The format is what is important. Below are formats. Where other artists then add in the blanks. Formats are timeless. The messages are not.\n\nIf you have a difficult message or story and you need a timeless format. Here are trending meme / text formats collected over time for generous sugar coating.\n\nReplace the (x), (y), (a), (b), (c) variables with your own message. \n\nFor Twitter, you need to have a character in the the top corner left (the very first character) or the format gets misaligned. \n\nCopy + Paste and please source this entry. \n\n*Why can't life always be this easy? She's in the mirror dancing so _______.*\n\n\n```\nThe value of ______:\n\n           █          　　\n           █　        \n           █　        \n           █　             ＿\n          (x)              (y)\n______________________________________________________________\n\nWelcome to my game show. Please choose a door. \n \n  🚪       🚪        🚪\n Door     Door     Door\n  1         2        3\n\n[Do something based on the door people choose]\n\n______________________________________________________________\n🌙     ___________   \n      |Answer (y)|\n      |______ ___|\n            |/\n        🕯🧘‍♀️🕯       _____________\n        🃑 🂻 🃟      |Question (x) |\n           🐛      <|_____________|\n_____________________________________________________________\n\n||　 | |   (a) \n|　| | | 　\n| | |. | \n|＿,_|_|\n／// |ヽ\\   (b)\n^^^^.|^^^^\n　　｜ﾍ⌒ﾌ \n　　(|･ω･)  (c)\n   （つ　)　\n　  しー-Ｊ\n______________________________________________________________\n\n(x)\n\n　  ∧＿∧\n (   ˘ω˘ )\n┳Ｕ┳―┳Ｕ┳\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n______________________________________________________________\n\n☀️ \n ／￣￣￣＼      ￣￣￣￣￣￣￣\n|　ー　ー  \\   ||           |\n|　 ◉　◉ | /  |           |\n\\　　 ▱　/∠    |    (x)    |\n ＼　　  |      |           |\n ／　　　＼      |           |\n       　      　￣￣￣￣￣￣￣\n______________________________________________________________\n\n                 ~ (x) ~   \n                 ▂▂▂▂▂▂            \n          ◢◤    █       █      \n██████████████████████████\n████ /         \\ ███  /        \\ ████\n         \\____ /            \\____ /\n\n\n______________________________________________________________\n     \n      (\\__/) \n      (•ㅅ•)    (x)\n 　＿ノ ヽ ノ＼ __   \n /　`/ ⌒Ｙ⌒ Ｙ　ヽ     \n( 　(三ヽ人　 /　　 |     \n|　ﾉ⌒＼ ￣￣ヽ　 ノ    \nヽ＿＿＿＞､＿＿_／ \n　　 ｜( 王 ﾉ〈 (\\__/) \n　　 /ﾐ`ー―彡\\  (•ㅅ•) (y)\n\n______________________________________________________________\n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿／\n￣￣￣￣￣￣￣\n\n　　　 ∧_∧　 (x)\n　　 (　･ω･)   \n　 ＿|　⊃／(＿＿_  \n／　└-(＿＿＿_／ \n￣￣￣￣￣￣￣    \n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿\n\n______________________________________________________________\n\n┏┓  \n┃┃╱╲ in \n┃╱╱╲╲ this  \n╱╱╭╮╲╲  house\n▔▏┗┛▕▔   we\n╱▔▔▔▔▔▔▔▔▔▔╲  \n        (x)\n╱╱┏┳┓╭╮┏┳┓ ╲╲  \n▔▏┗┻┛┃┃┗┻┛▕▔\n\n______________________________________________________________\n \n  buying (x)                     buying (y)                        \n                         \n    \\😃/                              ☹️\n    | |                             /| |\\\n   /   \\                            /   \\\n______________________________________________________________\n\nmight fuck (or mess) around and \n  |   👀   |\n  \\       /\n ____| |_____\n/        ✊__/\n\\_✊\n     do (x)\n\n______________________________________________________________\n\n(x)!\n\n     ⌒╭╮⌒╭╮\n╭ ◠             ╮\n(    ┃😴▄▄▄    )\n(    ┣━━━━┓  )\n ⌣(            ◡\n      ⌣╰╯◡ ⌣\n            ｡  ᴼ\n      😐   🖥️\n    ║[]╯━━\n    ╚╤ ╮\n        ┻\n______________________________________________________________\n\n|￣￣￣￣￣￣|\n|  (X)     | \n|          |  \n|          |\n|＿＿＿＿＿__|  \n(\\__/) ||  \n(•ㅅ•) ||  \n/ 　 づ\n\n______________________________________________________________\n\nwell would you look at the time...\n\n            12\n      11    ^     1\n  10        |         2      it’s (x)\n9           ⊙———>   o’clock\n   8                   4     \n       7          5           \n             6\n______________________________________________________________\n\n(x)\n ○ \nく|)へ\n    〉               (y)\n ￣￣┗┓            \n 　 　   ┗┓       ヾ○ｼ\n  　　      ┗┓   ヘ/ 　 　 \n 　           ┗┓ノ \n　 　 　 　 　    ┗┓\n\n______________________________________________________________\n\n┓┏┓┏┓┃ \n┛┗┛┗┛┃＼○／ \n┓┏┓┏┓┃  /   (x)\n┛┗┛┗┛┃ノ) \n┓┏┓┏┓┃         \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┃┃┃┃┃┃ \n┻┻┻┻┻┻\n______________________________________________________________\n\n(x)\n.       😎\n        |\\👐\n       / \\\n━━━━━┓ ＼＼\n┓┓┓┓┓┃\n┓┓┓┓┓┃ ヽ😩ノ (y)\n┓┓┓┓┓┃ 　/　\n┓┓┓┓┓┃ ノ)　\n┓┓┓┓┓┃\n______________________________________________________________\n\n┳┻| \n┳┻| \n┻┳|\n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┳┻| \n┻┳| \n┳┻| _ \n┻┳|•.•) (x)\n┳┻|⊂ﾉ    \n┻┳|\n______________________________________________________________\n\n╭ ◜◝ ͡ ◜◝ ͡  ◜◝ ͡ ◜◝ ͡  ◜◝ ╮ \n♡         (x)        ♡\n  ♡                 ♡\n╰ ◟◞ ͜  ◟ ͜   ◟◞ ͜  ◟ ͜   ◟◞ ╯\n           O\n             ° \n〃∩　∧＿∧\n⊂⌒（ ´・ω・）\n    ヽ_っ＿/￣￣￣/\n　 　   ＼/＿＿＿/\n\n______________________________________________________________\n\ni am a:\n⚪️ male\n⚪️ female\n🔘 (x)\n\ninterested in:\n⚪️ male\n⚪️ female\n🔘 (y) \n\n______________________________________________________________\n\n\nrelationship status: \n⚪️ single\n⚪️ taken\n⚪️ it’s complicated \n🔘 (x)\n\n______________________________________________________________\n\n📍 (a)\n  |\n  | _ _ _ _ _ _ _ _ _ __ __ \n                           |\n📍 (x)                     |\n                           |\n   _ _ _ _ _ _ _ _ _ _ __ _|\n  | \n📍(b)\n\n______________________________________________________________\n\nThis is \n↓      ↓← ← ← ←   ←\n↓      ↓               ↑\n↓      ↓               ↑\n→ → → → → → →  my brain\n         ↓\n         ↓\n         ↓\n                  After (x)\n\n______________________________________________________________\n\ncan (x) do (y)\n           _____|_____\n          |           |\n         yes         no\n          |           |\n          x           y\n\n______________________________________________________________\n\nme talking to (a):\n▶ 🔘─────── 00:07\n\nme talking to (b):\n▶ 🔘─────── 00:69\n\nme talking to (c)\n▶ 🔘──────── 4:20:00\n\n______________________________________________________________\n\n          x song 🅴\n         (y artist)\n         ◄◄⠀▐▐ ⠀►►\n     🔈─────────⚪️🔊\n\n______________________________________________________________\n\nTwitter:\n_________________________\n|          (x)           |\n|________________________|\n   X🔄             Y❤️\n\n[7 hours later]\n\n_________________________\n|         (x)            |\n|________________________|\n   69k🔄        420k❤️\n\n______________________________________________________________\n\nnormal heart rate:\n\n⠀   /\\⠀ ⠀ ⠀ ⠀.    /\\    \n__ /   \\   __/\\__ /  \\  _\n        \\/⠀ ⠀ ⠀ ⠀  \\/\n\nheart rate after (x):\n                            \n________________\n                     \nOR\n\nnormal heart rate:\n⠀   /\\⠀ ⠀ ⠀ ⠀     /\\    \n__ /   \\  __/\\__ /   \\   _\n        \\/⠀ ⠀ ⠀ ⠀     \\/\n\nheart rate after (x):            \n\n ⠀/\\       /\\⠀       /\\\n_/  \\  /\\_/  \\   /\\_/  \\  /\\____\n⠀    \\/⠀⠀     \\/⠀⠀     \\/\n\n______________________________________________________________\n\ndoing (x)\n▶  🔘─────── 3:19\n\ndoing (y)\n▶  🔘─────── 3:24:45\n\n______________________________________________________________\n\n╭━━━━━━━━━━━━╮\n┃   🌔 CO — STAR      ┃\n┃ 𝗬𝗼𝘂𝗿 𝗱𝗮𝘆 𝗮𝘁 𝗮 𝗴𝗹𝗮𝗻𝗰𝗲   ┃\n┃      (x)            ┃\n┃                     ┃\n╰━━━━━━━━━━━━╯\n\n______________________________________________________________\n\nhow much     |       ___/\n(x)          |      /\n             |  ___/\n             |/_______________\n     \n               how much (y)\n\n______________________________________________________________\n\ndoing             doing \n(x)                (y)\n\n           🤝\n\n (something they both do)\n\n______________________________________________________________\n\n.    *     *    .🌙   *    .  *  ☄️.\n  * .  🌍  *     .    *   💫  *    \n .  *        time to (x)   * .   \n     *        and       *\n .    *        (y).            * . \n  .    .  *   ✨  .  *    .   *     *\n     *   .     .        .  *    🌕   .\n *   🌕   .    .   * ⭐️    *   . *\n\n______________________________________________________________\n\nsummoning circle: \n\n        ❤️      ❤️\n                       ❤️\n  ❤️\n           (x)           ❤️     \n❤️                                   \n                  \n  ❤️                    ❤️\n\n        ❤️        ❤️       \n\n\n\n______________________________________________________________\n\n“(x)” ★☆☆☆☆ \n\n“(y) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\n\n______________________________________________________________\n\n⭐️⭐️⭐️⭐️⭐️\n\n(x)\n\n[Review updated]\n\n⭐️ ☆ ☆ ☆ ☆\n\n(y)\n\n______________________________________________________________\n\nmy DNA results are in:\n\nA         A\n  B      B\n      C\n  A      A\nB          B\n  C      C\n      A\n  B      B\nC          C\n  A     A\n      B\n  C      C\nA          A\n   B     B\n       C  \n   A     A\nB           B\n   C     C\n       A\n   B     B\nC           C\n\n(fill in with what you're made of)\n\n______________________________________________________________\n\nretweet if you\n really\n   really\n     really\n       really\n       really\n      really\n    really\n  really\nreally\nreally\n really\n really\n  really\n   really\n     really\n       really\n       really\n      really\n    really\n   really\n really \n(x)\n\n______________________________________________________________\n\nme: can i (x)\n\nthem: sorry no\n\nme: \n\n    N\n　   O\n　　　 O\n　　　　 o\n　　　　　o\n　　　　　 o\n　　　　　o\n　　　　 。\n　　　 。\n　　　.\n　　　.\n　　　 .\n　　　　.\n                  .\n\n______________________________________________________________\n\nno (x) has all five:\n\n1. (a)\n2. (b)\n3. (c)\n4. (d)\n5. (e)\n\n______________________________________________________________\n\nthem: i want you to hurt me\n\nme: (x) \n\nthem: please stop\n\nme: (y)\n\n______________________________________________________________\n\nthings that aren’t personality traits:\n\n• \n• \n• \n\nthings that are personality traits:\n\n• \n• \n• \n\n______________________________________________________________\n\nbop it: bop it!\n\nme: *bops it*\n\nbop it: twist it!\n\nme: *twists it*\n\nbop it: (x)\n\nme: what\n\nbop it: pull it!\n\n______________________________________________________________\n\nranking (x):\n\n1. you\n2. can’t\n3. rank\n4. (x)\n5. because\n6. they\n7. are\n8. all\n9. worthy \n10. of\n11. love\n12. (y)\n______________________________________________________________\n\nnobody: \nliterally no one: \nnot a single person in the world:\nme: (x)\n______________________________________________________________\n\nme: *thinks about (x)*\n\nmy brain: \ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\nme: (y)\n______________________________________________________________\n\noh, you like (x)? name every (x)\n\n______________________________________________________________\n\nI              took \n       just          a\n\n     D\n           N\n                 A\n\n        T    e    S    t\n\n  t u r n s      o u t\n\n          i'm\n\n           100%\n                 \n     (x)\n______________________________________________________________\n\nget you a (x) who can do both\n\n______________________________________________________________\n\n(x) and chill\n\n______________________________________________________________\n\nnoOo don’t (x) you’re so sexy lol\n\n______________________________________________________________\n\nYou do (x), i do (y), we are not the same\n\n______________________________________________________________\n\nlets get this (x)\n\n______________________________________________________________\n\nya’ll mind if i (x)?\n\n______________________________________________________________\n\nnot a phone in sight, just vibes | or (x)\n______________________________________________________________\n\n```\n\n**People with good hearts listen up!!!!.... we can't save everybody. I'll be your mirror anytime.**\n", "timestamp": 1618511698, "digest": "r6g6-QeFBFCZgsFERlI_mVEvgxsyN1R6jQXVLlaUFEA", "contributor": "0x2f9B473d4B9f95A5E55F205Be1a003B27D24Df76"}
{"id": "rgLZ1kkUDlLC5g6TtKUFfN_HKkcukFADJb-jISpxnxE", "title": "Chocolate Covered Vegetables", "body": "I've so enjoyed everyone using these meme formats for their Tweets. This piece is for sale here: \n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/029473499555520510032724762836)\n\n\n\n**Every bidder who wishes gets a custom emoji art in their Twitter DM on a topic of their choice (please DM twitter.com/lizhagelthorn)**\n\nMemes are made up of 3 things: the format, the message and the source image or video. The format is what is important. Below are formats. Where other artists then add in the blanks. Formats are timeless. The messages are not.\n\nIf you have a difficult message or story and you need a timeless format. Here are trending meme / text formats collected over time for generous sugar coating.\n\nReplace the (x), (y), (a), (b), (c) variables with your own message. \n\nFor Twitter, you need to have a character in the the top corner left (the very first character) or the format gets misaligned. \n\nCopy + Paste and please source this entry. \n\n*Why can't life always be this easy? She's in the mirror dancing so _______.*\n\n\n```\nThe value of ______:\n\n           █          　　\n           █　        \n           █　        \n           █　             ＿\n          (x)              (y)\n______________________________________________________________\n\nWelcome to my game show. Please choose a door. \n \n  🚪       🚪        🚪\n Door     Door     Door\n  1         2        3\n\n[Do something based on the door people choose]\n\n______________________________________________________________\n🌙     ___________   \n      |Answer (y)|\n      |______ ___|\n            |/\n        🕯🧘‍♀️🕯       _____________\n        🃑 🂻 🃟      |Question (x) |\n           🐛      <|_____________|\n_____________________________________________________________\n\n||　 | |   (a) \n|　| | | 　\n| | |. | \n|＿,_|_|\n／// |ヽ\\   (b)\n^^^^.|^^^^\n　　｜ﾍ⌒ﾌ \n　　(|･ω･)  (c)\n   （つ　)　\n　  しー-Ｊ\n______________________________________________________________\n\n(x)\n\n　  ∧＿∧\n (   ˘ω˘ )\n┳Ｕ┳―┳Ｕ┳\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n______________________________________________________________\n\n☀️ \n ／￣￣￣＼      ￣￣￣￣￣￣￣\n|　ー　ー  \\   ||           |\n|　 ◉　◉ | /  |           |\n\\　　 ▱　/∠    |    (x)    |\n ＼　　  |      |           |\n ／　　　＼      |           |\n       　      　￣￣￣￣￣￣￣\n______________________________________________________________\n\n                 ~ (x) ~   \n                 ▂▂▂▂▂▂            \n          ◢◤    █       █      \n██████████████████████████\n████ /         \\ ███  /        \\ ████\n         \\____ /            \\____ /\n\n\n______________________________________________________________\n     \n      (\\__/) \n      (•ㅅ•)    (x)\n 　＿ノ ヽ ノ＼ __   \n /　`/ ⌒Ｙ⌒ Ｙ　ヽ     \n( 　(三ヽ人　 /　　 |     \n|　ﾉ⌒＼ ￣￣ヽ　 ノ    \nヽ＿＿＿＞､＿＿_／ \n　　 ｜( 王 ﾉ〈 (\\__/) \n　　 /ﾐ`ー―彡\\  (•ㅅ•) (y)\n\n______________________________________________________________\n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿／\n￣￣￣￣￣￣￣\n\n　　　 ∧_∧　 (x)\n　　 (　･ω･)   \n　 ＿|　⊃／(＿＿_  \n／　└-(＿＿＿_／ \n￣￣￣￣￣￣￣    \n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿\n\n______________________________________________________________\n\n┏┓  \n┃┃╱╲ in \n┃╱╱╲╲ this  \n╱╱╭╮╲╲  house\n▔▏┗┛▕▔   we\n╱▔▔▔▔▔▔▔▔▔▔╲  \n        (x)\n╱╱┏┳┓╭╮┏┳┓ ╲╲  \n▔▏┗┻┛┃┃┗┻┛▕▔\n\n______________________________________________________________\n \n  buying (x)                     buying (y)                        \n                         \n    \\😃/                              ☹️\n    | |                             /| |\\\n   /   \\                            /   \\\n______________________________________________________________\n\nmight fuck (or mess) around and \n  |   👀   |\n  \\       /\n ____| |_____\n/        ✊__/\n\\_✊\n     do (x)\n\n______________________________________________________________\n\n(x)!\n\n     ⌒╭╮⌒╭╮\n╭ ◠             ╮\n(    ┃😴▄▄▄    )\n(    ┣━━━━┓  )\n ⌣(            ◡\n      ⌣╰╯◡ ⌣\n            ｡  ᴼ\n      😐   🖥️\n    ║[]╯━━\n    ╚╤ ╮\n        ┻\n______________________________________________________________\n\n|￣￣￣￣￣￣|\n|  (X)     | \n|          |  \n|          |\n|＿＿＿＿＿__|  \n(\\__/) ||  \n(•ㅅ•) ||  \n/ 　 づ\n\n______________________________________________________________\n\nwell would you look at the time...\n\n            12\n      11    ^     1\n  10        |         2      it’s (x)\n9           ⊙———>   o’clock\n   8                   4     \n       7          5           \n             6\n______________________________________________________________\n\n(x)\n ○ \nく|)へ\n    〉               (y)\n ￣￣┗┓            \n 　 　   ┗┓       ヾ○ｼ\n  　　      ┗┓   ヘ/ 　 　 \n 　           ┗┓ノ \n　 　 　 　 　    ┗┓\n\n______________________________________________________________\n\n┓┏┓┏┓┃ \n┛┗┛┗┛┃＼○／ \n┓┏┓┏┓┃  /   (x)\n┛┗┛┗┛┃ノ) \n┓┏┓┏┓┃         \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┃┃┃┃┃┃ \n┻┻┻┻┻┻\n______________________________________________________________\n\n(x)\n.       😎\n        |\\👐\n       / \\\n━━━━━┓ ＼＼\n┓┓┓┓┓┃\n┓┓┓┓┓┃ ヽ😩ノ (y)\n┓┓┓┓┓┃ 　/　\n┓┓┓┓┓┃ ノ)　\n┓┓┓┓┓┃\n______________________________________________________________\n\n┳┻| \n┳┻| \n┻┳|\n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┳┻| \n┻┳| \n┳┻| _ \n┻┳|•.•) (x)\n┳┻|⊂ﾉ    \n┻┳|\n______________________________________________________________\n\n╭ ◜◝ ͡ ◜◝ ͡  ◜◝ ͡ ◜◝ ͡  ◜◝ ╮ \n♡         (x)        ♡\n  ♡                 ♡\n╰ ◟◞ ͜  ◟ ͜   ◟◞ ͜  ◟ ͜   ◟◞ ╯\n           O\n             ° \n〃∩　∧＿∧\n⊂⌒（ ´・ω・）\n    ヽ_っ＿/￣￣￣/\n　 　   ＼/＿＿＿/\n\n______________________________________________________________\n\ni am a:\n⚪️ male\n⚪️ female\n🔘 (x)\n\ninterested in:\n⚪️ male\n⚪️ female\n🔘 (y) \n\n______________________________________________________________\n\n\nrelationship status: \n⚪️ single\n⚪️ taken\n⚪️ it’s complicated \n🔘 (x)\n\n______________________________________________________________\n\n📍 (a)\n  |\n  | _ _ _ _ _ _ _ _ _ __ __ \n                           |\n📍 (x)                     |\n                           |\n   _ _ _ _ _ _ _ _ _ _ __ _|\n  | \n📍(b)\n\n______________________________________________________________\n\nThis is \n↓      ↓← ← ← ←   ←\n↓      ↓               ↑\n↓      ↓               ↑\n→ → → → → → →  my brain\n         ↓\n         ↓\n         ↓\n                  After (x)\n\n______________________________________________________________\n\ncan (x) do (y)\n           _____|_____\n          |           |\n         yes         no\n          |           |\n          x           y\n\n______________________________________________________________\n\nme talking to (a):\n▶ 🔘─────── 00:07\n\nme talking to (b):\n▶ 🔘─────── 00:69\n\nme talking to (c)\n▶ 🔘──────── 4:20:00\n\n______________________________________________________________\n\n          x song 🅴\n         (y artist)\n         ◄◄⠀▐▐ ⠀►►\n     🔈─────────⚪️🔊\n\n______________________________________________________________\n\nTwitter:\n_________________________\n|          (x)           |\n|________________________|\n   X🔄             Y❤️\n\n[7 hours later]\n\n_________________________\n|         (x)            |\n|________________________|\n   69k🔄        420k❤️\n\n______________________________________________________________\n\nnormal heart rate:\n\n⠀   /\\⠀ ⠀ ⠀ ⠀.    /\\    \n__ /   \\   __/\\__ /  \\  _\n        \\/⠀ ⠀ ⠀ ⠀  \\/\n\nheart rate after (x):\n                            \n________________\n                     \nOR\n\nnormal heart rate:\n⠀   /\\⠀ ⠀ ⠀ ⠀     /\\    \n__ /   \\  __/\\__ /   \\   _\n        \\/⠀ ⠀ ⠀ ⠀     \\/\n\nheart rate after (x):            \n\n ⠀/\\       /\\⠀       /\\\n_/  \\  /\\_/  \\   /\\_/  \\  /\\____\n⠀    \\/⠀⠀     \\/⠀⠀     \\/\n\n______________________________________________________________\n\ndoing (x)\n▶  🔘─────── 3:19\n\ndoing (y)\n▶  🔘─────── 3:24:45\n\n______________________________________________________________\n\n╭━━━━━━━━━━━━╮\n┃   🌔 CO — STAR      ┃\n┃ 𝗬𝗼𝘂𝗿 𝗱𝗮𝘆 𝗮𝘁 𝗮 𝗴𝗹𝗮𝗻𝗰𝗲   ┃\n┃      (x)            ┃\n┃                     ┃\n╰━━━━━━━━━━━━╯\n\n______________________________________________________________\n\nhow much     |       ___/\n(x)          |      /\n             |  ___/\n             |/_______________\n     \n               how much (y)\n\n______________________________________________________________\n\ndoing             doing \n(x)                (y)\n\n           🤝\n\n (something they both do)\n\n______________________________________________________________\n\n.    *     *    .🌙   *    .  *  ☄️.\n  * .  🌍  *     .    *   💫  *    \n .  *        time to (x)   * .   \n     *        and       *\n .    *        (y).            * . \n  .    .  *   ✨  .  *    .   *     *\n     *   .     .        .  *    🌕   .\n *   🌕   .    .   * ⭐️    *   . *\n\n______________________________________________________________\n\nsummoning circle: \n\n        ❤️      ❤️\n                       ❤️\n  ❤️\n           (x)           ❤️     \n❤️                                   \n                  \n  ❤️                    ❤️\n\n        ❤️        ❤️       \n\n\n\n______________________________________________________________\n\n“(x)” ★☆☆☆☆ \n\n“(y) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\n\n______________________________________________________________\n\n⭐️⭐️⭐️⭐️⭐️\n\n(x)\n\n[Review updated]\n\n⭐️ ☆ ☆ ☆ ☆\n\n(y)\n\n______________________________________________________________\n\nmy DNA results are in:\n\nA         A\n  B      B\n      C\n  A      A\nB          B\n  C      C\n      A\n  B      B\nC          C\n  A     A\n      B\n  C      C\nA          A\n   B     B\n       C  \n   A     A\nB           B\n   C     C\n       A\n   B     B\nC           C\n\n(fill in with what you're made of)\n\n______________________________________________________________\n\nretweet if you\n really\n   really\n     really\n       really\n       really\n      really\n    really\n  really\nreally\nreally\n really\n really\n  really\n   really\n     really\n       really\n       really\n      really\n    really\n   really\n really \n(x)\n\n______________________________________________________________\n\nme: can i (x)\n\nthem: sorry no\n\nme: \n\n    N\n　   O\n　　　 O\n　　　　 o\n　　　　　o\n　　　　　 o\n　　　　　o\n　　　　 。\n　　　 。\n　　　.\n　　　.\n　　　 .\n　　　　.\n                  .\n\n______________________________________________________________\n\nno (x) has all five:\n\n1. (a)\n2. (b)\n3. (c)\n4. (d)\n5. (e)\n\n______________________________________________________________\n\nthem: i want you to hurt me\n\nme: (x) \n\nthem: please stop\n\nme: (y)\n\n______________________________________________________________\n\nthings that aren’t personality traits:\n\n• \n• \n• \n\nthings that are personality traits:\n\n• \n• \n• \n\n______________________________________________________________\n\nbop it: bop it!\n\nme: *bops it*\n\nbop it: twist it!\n\nme: *twists it*\n\nbop it: (x)\n\nme: what\n\nbop it: pull it!\n\n______________________________________________________________\n\nranking (x):\n\n1. you\n2. can’t\n3. rank\n4. (x)\n5. because\n6. they\n7. are\n8. all\n9. worthy \n10. of\n11. love\n12. (y)\n______________________________________________________________\n\nnobody: \nliterally no one: \nnot a single person in the world:\nme: (x)\n______________________________________________________________\n\nme: *thinks about (x)*\n\nmy brain: \ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\nme: (y)\n______________________________________________________________\n\noh, you like (x)? name every (x)\n\n______________________________________________________________\n\nI              took \n       just          a\n\n     D\n           N\n                 A\n\n        T    e    S    t\n\n  t u r n s      o u t\n\n          i'm\n\n           100%\n                 \n     (x)\n______________________________________________________________\n\nget you a (x) who can do both\n\n______________________________________________________________\n\n(x) and chill\n\n______________________________________________________________\n\nnoOo don’t (x) you’re so sexy lol\n\n______________________________________________________________\n\nYou do (x), i do (y), we are not the same\n\n______________________________________________________________\n\nlets get this (x)\n\n______________________________________________________________\n\nya’ll mind if i (x)?\n\n______________________________________________________________\n\nnot a phone in sight, just vibes | or (x)\n______________________________________________________________\n\n```\n\n**People with good hearts listen up!!!!.... we can't save everybody. I'll be your mirror anytime.**\n", "timestamp": 1618511743, "digest": "r6g6-QeFBFCZgsFERlI_mVEvgxsyN1R6jQXVLlaUFEA", "contributor": "0x2f9B473d4B9f95A5E55F205Be1a003B27D24Df76"}
{"id": "U_CQmYHN5UnaSmpgBMJjS6ePAbt5SEbx6QvyDsWYhAY", "title": "Chocolate Covered Vegetables", "body": "I've so enjoyed everyone using these meme formats for their Tweets. This piece is for sale here: \n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/2836)\n\n\n**Every bidder who wishes gets a custom emoji art in their Twitter DM on a topic of their choice (please DM twitter.com/lizhagelthorn)**\n\nMemes are made up of 3 things: the format, the message and the source image or video. The format is what is important. Below are formats. Where other artists then add in the blanks. Formats are timeless. The messages are not.\n\nIf you have a difficult message or story and you need a timeless format. Here are trending meme / text formats collected over time for generous sugar coating.\n\nReplace the (x), (y), (a), (b), (c) variables with your own message. \n\nFor Twitter, you need to have a character in the the top corner left (the very first character) or the format gets misaligned. \n\nCopy + Paste and please source this entry. \n\n*Why can't life always be this easy? She's in the mirror dancing so _______.*\n\n\n```\nThe value of ______:\n\n           █          　　\n           █　        \n           █　        \n           █　             ＿\n          (x)              (y)\n______________________________________________________________\n\nWelcome to my game show. Please choose a door. \n \n  🚪       🚪        🚪\n Door     Door     Door\n  1         2        3\n\n[Do something based on the door people choose]\n\n______________________________________________________________\n🌙     ___________   \n      |Answer (y)|\n      |______ ___|\n            |/\n        🕯🧘‍♀️🕯       _____________\n        🃑 🂻 🃟      |Question (x) |\n           🐛      <|_____________|\n_____________________________________________________________\n\n||　 | |   (a) \n|　| | | 　\n| | |. | \n|＿,_|_|\n／// |ヽ\\   (b)\n^^^^.|^^^^\n　　｜ﾍ⌒ﾌ \n　　(|･ω･)  (c)\n   （つ　)　\n　  しー-Ｊ\n______________________________________________________________\n\n(x)\n\n　  ∧＿∧\n (   ˘ω˘ )\n┳Ｕ┳―┳Ｕ┳\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n______________________________________________________________\n\n☀️ \n ／￣￣￣＼      ￣￣￣￣￣￣￣\n|　ー　ー  \\   ||           |\n|　 ◉　◉ | /  |           |\n\\　　 ▱　/∠    |    (x)    |\n ＼　　  |      |           |\n ／　　　＼      |           |\n       　      　￣￣￣￣￣￣￣\n______________________________________________________________\n\n                 ~ (x) ~   \n                 ▂▂▂▂▂▂            \n          ◢◤    █       █      \n██████████████████████████\n████ /         \\ ███  /        \\ ████\n         \\____ /            \\____ /\n\n\n______________________________________________________________\n     \n      (\\__/) \n      (•ㅅ•)    (x)\n 　＿ノ ヽ ノ＼ __   \n /　`/ ⌒Ｙ⌒ Ｙ　ヽ     \n( 　(三ヽ人　 /　　 |     \n|　ﾉ⌒＼ ￣￣ヽ　 ノ    \nヽ＿＿＿＞､＿＿_／ \n　　 ｜( 王 ﾉ〈 (\\__/) \n　　 /ﾐ`ー―彡\\  (•ㅅ•) (y)\n\n______________________________________________________________\n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿／\n￣￣￣￣￣￣￣\n\n　　　 ∧_∧　 (x)\n　　 (　･ω･)   \n　 ＿|　⊃／(＿＿_  \n／　└-(＿＿＿_／ \n￣￣￣￣￣￣￣    \n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿\n\n______________________________________________________________\n\n┏┓  \n┃┃╱╲ in \n┃╱╱╲╲ this  \n╱╱╭╮╲╲  house\n▔▏┗┛▕▔   we\n╱▔▔▔▔▔▔▔▔▔▔╲  \n        (x)\n╱╱┏┳┓╭╮┏┳┓ ╲╲  \n▔▏┗┻┛┃┃┗┻┛▕▔\n\n______________________________________________________________\n \n  buying (x)                     buying (y)                        \n                         \n    \\😃/                              ☹️\n    | |                             /| |\\\n   /   \\                            /   \\\n______________________________________________________________\n\nmight fuck (or mess) around and \n  |   👀   |\n  \\       /\n ____| |_____\n/        ✊__/\n\\_✊\n     do (x)\n\n______________________________________________________________\n\n(x)!\n\n     ⌒╭╮⌒╭╮\n╭ ◠             ╮\n(    ┃😴▄▄▄    )\n(    ┣━━━━┓  )\n ⌣(            ◡\n      ⌣╰╯◡ ⌣\n            ｡  ᴼ\n      😐   🖥️\n    ║[]╯━━\n    ╚╤ ╮\n        ┻\n______________________________________________________________\n\n|￣￣￣￣￣￣|\n|  (X)     | \n|          |  \n|          |\n|＿＿＿＿＿__|  \n(\\__/) ||  \n(•ㅅ•) ||  \n/ 　 づ\n\n______________________________________________________________\n\nwell would you look at the time...\n\n            12\n      11    ^     1\n  10        |         2      it’s (x)\n9           ⊙———>   o’clock\n   8                   4     \n       7          5           \n             6\n______________________________________________________________\n\n(x)\n ○ \nく|)へ\n    〉               (y)\n ￣￣┗┓            \n 　 　   ┗┓       ヾ○ｼ\n  　　      ┗┓   ヘ/ 　 　 \n 　           ┗┓ノ \n　 　 　 　 　    ┗┓\n\n______________________________________________________________\n\n┓┏┓┏┓┃ \n┛┗┛┗┛┃＼○／ \n┓┏┓┏┓┃  /   (x)\n┛┗┛┗┛┃ノ) \n┓┏┓┏┓┃         \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┃┃┃┃┃┃ \n┻┻┻┻┻┻\n______________________________________________________________\n\n(x)\n.       😎\n        |\\👐\n       / \\\n━━━━━┓ ＼＼\n┓┓┓┓┓┃\n┓┓┓┓┓┃ ヽ😩ノ (y)\n┓┓┓┓┓┃ 　/　\n┓┓┓┓┓┃ ノ)　\n┓┓┓┓┓┃\n______________________________________________________________\n\n┳┻| \n┳┻| \n┻┳|\n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┳┻| \n┻┳| \n┳┻| _ \n┻┳|•.•) (x)\n┳┻|⊂ﾉ    \n┻┳|\n______________________________________________________________\n\n╭ ◜◝ ͡ ◜◝ ͡  ◜◝ ͡ ◜◝ ͡  ◜◝ ╮ \n♡         (x)        ♡\n  ♡                 ♡\n╰ ◟◞ ͜  ◟ ͜   ◟◞ ͜  ◟ ͜   ◟◞ ╯\n           O\n             ° \n〃∩　∧＿∧\n⊂⌒（ ´・ω・）\n    ヽ_っ＿/￣￣￣/\n　 　   ＼/＿＿＿/\n\n______________________________________________________________\n\ni am a:\n⚪️ male\n⚪️ female\n🔘 (x)\n\ninterested in:\n⚪️ male\n⚪️ female\n🔘 (y) \n\n______________________________________________________________\n\n\nrelationship status: \n⚪️ single\n⚪️ taken\n⚪️ it’s complicated \n🔘 (x)\n\n______________________________________________________________\n\n📍 (a)\n  |\n  | _ _ _ _ _ _ _ _ _ __ __ \n                           |\n📍 (x)                     |\n                           |\n   _ _ _ _ _ _ _ _ _ _ __ _|\n  | \n📍(b)\n\n______________________________________________________________\n\nThis is \n↓      ↓← ← ← ←   ←\n↓      ↓               ↑\n↓      ↓               ↑\n→ → → → → → →  my brain\n         ↓\n         ↓\n         ↓\n                  After (x)\n\n______________________________________________________________\n\ncan (x) do (y)\n           _____|_____\n          |           |\n         yes         no\n          |           |\n          x           y\n\n______________________________________________________________\n\nme talking to (a):\n▶ 🔘─────── 00:07\n\nme talking to (b):\n▶ 🔘─────── 00:69\n\nme talking to (c)\n▶ 🔘──────── 4:20:00\n\n______________________________________________________________\n\n          x song 🅴\n         (y artist)\n         ◄◄⠀▐▐ ⠀►►\n     🔈─────────⚪️🔊\n\n______________________________________________________________\n\nTwitter:\n_________________________\n|          (x)           |\n|________________________|\n   X🔄             Y❤️\n\n[7 hours later]\n\n_________________________\n|         (x)            |\n|________________________|\n   69k🔄        420k❤️\n\n______________________________________________________________\n\nnormal heart rate:\n\n⠀   /\\⠀ ⠀ ⠀ ⠀.    /\\    \n__ /   \\   __/\\__ /  \\  _\n        \\/⠀ ⠀ ⠀ ⠀  \\/\n\nheart rate after (x):\n                            \n________________\n                     \nOR\n\nnormal heart rate:\n⠀   /\\⠀ ⠀ ⠀ ⠀     /\\    \n__ /   \\  __/\\__ /   \\   _\n        \\/⠀ ⠀ ⠀ ⠀     \\/\n\nheart rate after (x):            \n\n ⠀/\\       /\\⠀       /\\\n_/  \\  /\\_/  \\   /\\_/  \\  /\\____\n⠀    \\/⠀⠀     \\/⠀⠀     \\/\n\n______________________________________________________________\n\ndoing (x)\n▶  🔘─────── 3:19\n\ndoing (y)\n▶  🔘─────── 3:24:45\n\n______________________________________________________________\n\n╭━━━━━━━━━━━━╮\n┃   🌔 CO — STAR      ┃\n┃ 𝗬𝗼𝘂𝗿 𝗱𝗮𝘆 𝗮𝘁 𝗮 𝗴𝗹𝗮𝗻𝗰𝗲   ┃\n┃      (x)            ┃\n┃                     ┃\n╰━━━━━━━━━━━━╯\n\n______________________________________________________________\n\nhow much     |       ___/\n(x)          |      /\n             |  ___/\n             |/_______________\n     \n               how much (y)\n\n______________________________________________________________\n\ndoing             doing \n(x)                (y)\n\n           🤝\n\n (something they both do)\n\n______________________________________________________________\n\n.    *     *    .🌙   *    .  *  ☄️.\n  * .  🌍  *     .    *   💫  *    \n .  *        time to (x)   * .   \n     *        and       *\n .    *        (y).            * . \n  .    .  *   ✨  .  *    .   *     *\n     *   .     .        .  *    🌕   .\n *   🌕   .    .   * ⭐️    *   . *\n\n______________________________________________________________\n\nsummoning circle: \n\n        ❤️      ❤️\n                       ❤️\n  ❤️\n           (x)           ❤️     \n❤️                                   \n                  \n  ❤️                    ❤️\n\n        ❤️        ❤️       \n\n\n\n______________________________________________________________\n\n“(x)” ★☆☆☆☆ \n\n“(y) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\n\n______________________________________________________________\n\n⭐️⭐️⭐️⭐️⭐️\n\n(x)\n\n[Review updated]\n\n⭐️ ☆ ☆ ☆ ☆\n\n(y)\n\n______________________________________________________________\n\nmy DNA results are in:\n\nA         A\n  B      B\n      C\n  A      A\nB          B\n  C      C\n      A\n  B      B\nC          C\n  A     A\n      B\n  C      C\nA          A\n   B     B\n       C  \n   A     A\nB           B\n   C     C\n       A\n   B     B\nC           C\n\n(fill in with what you're made of)\n\n______________________________________________________________\n\nretweet if you\n really\n   really\n     really\n       really\n       really\n      really\n    really\n  really\nreally\nreally\n really\n really\n  really\n   really\n     really\n       really\n       really\n      really\n    really\n   really\n really \n(x)\n\n______________________________________________________________\n\nme: can i (x)\n\nthem: sorry no\n\nme: \n\n    N\n　   O\n　　　 O\n　　　　 o\n　　　　　o\n　　　　　 o\n　　　　　o\n　　　　 。\n　　　 。\n　　　.\n　　　.\n　　　 .\n　　　　.\n                  .\n\n______________________________________________________________\n\nno (x) has all five:\n\n1. (a)\n2. (b)\n3. (c)\n4. (d)\n5. (e)\n\n______________________________________________________________\n\nthem: i want you to hurt me\n\nme: (x) \n\nthem: please stop\n\nme: (y)\n\n______________________________________________________________\n\nthings that aren’t personality traits:\n\n• \n• \n• \n\nthings that are personality traits:\n\n• \n• \n• \n\n______________________________________________________________\n\nbop it: bop it!\n\nme: *bops it*\n\nbop it: twist it!\n\nme: *twists it*\n\nbop it: (x)\n\nme: what\n\nbop it: pull it!\n\n______________________________________________________________\n\nranking (x):\n\n1. you\n2. can’t\n3. rank\n4. (x)\n5. because\n6. they\n7. are\n8. all\n9. worthy \n10. of\n11. love\n12. (y)\n______________________________________________________________\n\nnobody: \nliterally no one: \nnot a single person in the world:\nme: (x)\n______________________________________________________________\n\nme: *thinks about (x)*\n\nmy brain: \ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\nme: (y)\n______________________________________________________________\n\noh, you like (x)? name every (x)\n\n______________________________________________________________\n\nI              took \n       just          a\n\n     D\n           N\n                 A\n\n        T    e    S    t\n\n  t u r n s      o u t\n\n          i'm\n\n           100%\n                 \n     (x)\n______________________________________________________________\n\nget you a (x) who can do both\n\n______________________________________________________________\n\n(x) and chill\n\n______________________________________________________________\n\nnoOo don’t (x) you’re so sexy lol\n\n______________________________________________________________\n\nYou do (x), i do (y), we are not the same\n\n______________________________________________________________\n\nlets get this (x)\n\n______________________________________________________________\n\nya’ll mind if i (x)?\n\n______________________________________________________________\n\nnot a phone in sight, just vibes | or (x)\n______________________________________________________________\n\n```\n\n**People with good hearts listen up!!!!.... we can't save everybody. I'll be your mirror anytime.**\n", "timestamp": 1618511906, "digest": "r6g6-QeFBFCZgsFERlI_mVEvgxsyN1R6jQXVLlaUFEA", "contributor": "0x2f9B473d4B9f95A5E55F205Be1a003B27D24Df76"}
{"id": "FMp8hubVACyZzUG6oEYIRIwVgS8d5O7SBWFAu2t0i8w", "title": "Sketch for a NFT-based media company", "body": "## **The Brand**\n\nThe publication is voice-driven digital content that inspires loyalty in readers: arriving every day, reaching them where they are, communicating about things they need to know about or identify with closely. The publication serves a self-selecting demographic of cultural consumers who are obsessive, and either need or want to know about the content. \n\nThe brand needs to be specific and identifiable, standing out in the media landscape of heritage brands, somewhat interchangeable newsletters, and voices on Twitter. It has to be distinct, recognizable from only a few elements wherever it is found. The editorial voice is part of that brand, but it also must be (audio)visual. (\"Content\" is not solely writing, or even information.)\n\n## **The Format** \n\nNewsletters deliver longform content and close relationships with writers. The real-time delivery is also useful, but closer to real-time can be found on Twitter. More intimacy can be found in podcasts or tight communities online, the interactive fandoms of organizations like Chapo Trap House or $FWB. The publication must prioritize its community of consumers by giving them intimacy with the creators and with the brand, less a newspaper or information service than a space in which to participate, feeling nonhierarchical. It needs a sense of [digital belonging](https://air.mirror.xyz/5A16bvvS2IJK7fVVNb2GwrrEcyey2B4UiH2l1DI_Y2I). \n\nUnlike many newsletters, the publication cannot be tied to a singular voice because that voice is not its only value proposition. Many contributors should participate in the brand and want to be a part of it, as creators and consumers. The identity of both writing for and reading the publication should be aspirational. For that quality, the publication also has to be relatively visual, able to function as a marker for itself, like the provenance label on a bottle of wine — *[Denominazione di Origine Controllata](https://italianwine.guide/about-italian-wine/wine-law/doc-en-gb/)* of content.\n\n## **The Structure**\n\nThe staff of the publication can be low-weight at first, with one editor, one or several staff writers, an array of freelance contributors, and contributing artists and designers for visual content, which is given equal priority to textual content, creating a framework. Content is delivered in whichever formats the audience grows to prefer, from text to audio to graphics. \n\nWhat matters more than the platform the content is delivered on is its ability to stay consistent, always calling back to the voice and community of the publication. Like a cryptocurrency, it should be able to stay itself wherever it goes or whoever is consuming it. This is not the decentralization of mainstream publications posting links on Facebook; it's the decentralization of file piracy or crypto mining. \n\nThe publication is not a magazine but an architectural structure, an art gallery, a fashion brand, a sports team, a video game, a flower that blooms at a specific time — something you inhabit and watch evolve. \n\n## **The Business Model**\n\nThe publication is funded by NFTs and social tokens. NFTs require specific relationships and consumers to function: A small number of NFTs need to attract high-value buyers or a large number of NFTs (expensive to mint) need to attract mid-value buyers in order to sustain an entire publication, paying for staff and freelancers. \n\nWhat makes NFTs valuable is provenance: in the case of visual art, the artist is credible and the art is compelling, or, in the case of [a novel](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg), the author's previous work and novel proposal is compelling. What would make publication NFTs compelling is strong art, a connection to the brand (provenance), and context, building a coherent body of NFT production that functions alongside and through the publication. It's important that the NFTs have a logic just as the editorial has a logic. \n\nSocial tokens ($PUBLICATION) can raise money for a publication or fund new efforts, giving holders a proxy for equity in the overall project that exists more on the back-end. NFTs can monetize social tokens for the holders and give readers / consumers a way to interact with the brand, as well as to participate in its economics. The NFTs have to be desirable in a variety of ways, both as high-end patronage and as casual affiliation, like New Yorker tote bags. \n\nThe NFTs are not iterations of the text content, or symbolic of the content (a la the [New York Times column](https://foundation.app/kevinroose/the-new-york-times-x-nft-13129)), but are a form of content in themselves. Think of a publication that is inextricable from and funded by a marketplace of NFTs like Cryptopunks, where the publication is the only authority that can create more. The action of the marketplace would generate enough returns to run the publication, which would in turn produce more, and attract more demand for, the marketplace's NFTs. \n\n![](https://images.mirror-media.xyz/publication-images/9a9cc201-06e3-44c2-9a18-e269d89c32cb.png?height=738&width=1346)\n\nNFTs are a form of streetwear drop amenable to any content format or producer. They create fresh visual interest, scarcity, and ephemerality, functioning as rewards for those who are most engaged and invested in the brand, who can also profit in turn from their participation. \n\n## **Using NFTs**\n\n— Authoritative NFTs of branding assets can be released at the outset of the publication, in the context of crowdfunding. An initial release of NFTs could be seen as the \"original\" creations backing the project, which would become more valuable as the publication grows in stature.\n\n— More casual NFTs could take the form of annual subscriber / backer rewards and function as a kind of identification that is public-facing: If you have one, then you are seen as an early adopter of this publication (editions work well for this approach).\n\n— A set of NFTs could be produced in the form of stylized avatars only for subscribers, a la Cryptopunks or Cryptokitties. These could be abstract and sold / traded in a marketplace. \n\n— NFTs could be produced on a per-article basis, minted when the article is published and then given to the writer to sell. But that requires demand on a per-article level, which requires a lot of compelling imagery and higher levels of consumption: do they have enough symbolic value?\n\n— Ultimately, the publication itself should function as a showcase for the NFTs from that publication: Imagine profile pages or showcases, or spotlights on each article page or newsletter edition, that highlight a particular NFT and owner, or offer the NFT for sale. Like wearing streetwear, NFTs need better distribution mechanisms to drive demand and create aspiration.  \n\n— Writers can be paid in ETH, NFTs, or $PUBLICATION tokens, which are cheap to produce for the publication. (Writers or any publication contributors in media are rarely given a meaningful stake in the business of the publication.)\n\n— The NFTs should be desirable on their own as an aesthetic system, like streetwear, action figures, or art toys. The NFT aesthetic system evolves as the publication expands, like watching a houseplant grow. \n\n## **Comparisons**\n\n[Apartamento](https://www.apartamentomagazine.com/): An influential interiors magazine that emerged from a small community and created an aspirational image of a bohemian lifestyle, through well-designed, highly aesthetic print magazines and a unique photography style. \n\n[Axios](https://www.axios.com/): A newsletter company that thrives on providing very impactful content for its readers in very comprehensible units; the style of content itself is a signature for the publication. \n\n[Monocle](https://monocle.com/magazine/): A business, culture, and lifestyle magazine and 24/7 radio station that became identified with a global archetype of person, who reads and shows off the magazine. There are Monocle tote bags, clothing lines, cafes, and accessories that readers buy into as much as the magazine. \n\n[Kinfolk](https://www.kinfolk.com/): A magazine that gave readers an image of not just what to consume but how to behave ethically and morally, creating an image of an aestheticized simple life. The magazine's aesthetic spread over Instagram and other platforms to become diffuse and participatory, disconnected from the magazine itself but still branded by it. \n\n[LeanLuxe](http://leanluxe.com/): A daily-ish newsletter about D2C brands but also about the lifestyle of wealthy millennials and businesses targeting that demographic. Also takes the form of a Slack community and advertising within and to the readership, creating a collective identity. \n\n*Is this useful to you? 0x25cbCFA16e43e58517f80D583087Ea89241293E6*", "timestamp": 1618514486, "digest": "bTAwqOAe2vG6UIq5KSPrEho_VbrfDxcswm0ZuUtPGAc", "contributor": "0x25cbCFA16e43e58517f80D583087Ea89241293E6"}
{"id": "AvvP2jfWi4wDHROQvC3Ynq1fLIGOU-Xp3A-qcDa-Bjk", "title": "Sketch for a NFT-based media company", "body": "## **The Brand**\n\nThe publication is voice-driven digital content that inspires loyalty in readers: arriving every day, reaching them where they are, communicating about things they need to know about or identify with closely. The publication serves a self-selecting demographic of cultural consumers who are obsessive, and either need or want to know about the content. \n\nThe brand needs to be specific and identifiable, standing out in the media landscape of heritage brands, somewhat interchangeable newsletters, and voices on Twitter. It has to be distinct, recognizable from only a few elements wherever it is found. The editorial voice is part of that brand, but it also must be (audio)visual. (\"Content\" is not solely writing, or even information.)\n\n## **The Format** \n\nNewsletters deliver longform content and close relationships with writers. The real-time delivery is also useful, but closer to real-time can be found on Twitter. More intimacy can be found in podcasts or tight communities online, the interactive fandoms of organizations like Chapo Trap House or $FWB. The publication must prioritize its community of consumers by giving them intimacy with the creators and with the brand, less a newspaper or information service than a space in which to participate, feeling nonhierarchical. It needs a sense of [digital belonging](https://air.mirror.xyz/5A16bvvS2IJK7fVVNb2GwrrEcyey2B4UiH2l1DI_Y2I). \n\nUnlike many newsletters, the publication cannot be tied to a singular voice because that voice is not its only value proposition. Many contributors should participate in the brand and want to be a part of it, as creators and consumers. The identity of both writing for and reading the publication should be aspirational. For that quality, the publication also has to be relatively visual, able to function as a marker for itself, like the provenance label on a bottle of wine — *[Denominazione di Origine Controllata](https://italianwine.guide/about-italian-wine/wine-law/doc-en-gb/)* of content.\n\n## **The Structure**\n\nThe staff of the publication can be low-weight at first, with one editor, one or several staff writers, an array of freelance contributors, and contributing artists and designers for visual content, which is given equal priority to textual content, creating a framework. Content is delivered in whichever formats the audience grows to prefer, from text to audio to graphics. \n\nWhat matters more than the platform the content is delivered on is its ability to stay consistent, always calling back to the voice and community of the publication. Like a cryptocurrency, it should be able to stay itself wherever it goes or whoever is consuming it. This is not the decentralization of mainstream publications posting links on Facebook; it's the decentralization of file piracy or crypto mining. \n\nThe publication is not a magazine but an architectural structure, an art gallery, a fashion brand, a sports team, a video game, a flower that blooms at a specific time — something you inhabit and watch evolve. \n\n## **The Business Model**\n\nThe publication is funded by NFTs and social tokens. NFTs require specific relationships and consumers to function: A small number of NFTs need to attract high-value buyers or a large number of NFTs (expensive to mint) need to attract mid-value buyers in order to sustain an entire publication, paying for staff and freelancers. \n\nWhat makes NFTs valuable is provenance: in the case of visual art, the artist is credible and the art is compelling, or, in the case of [a novel](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg), the author's previous work and novel proposal is compelling. What would make publication NFTs compelling is strong art, a connection to the brand (provenance), and context, building a coherent body of NFT production that functions alongside and through the publication. It's important that the NFTs have a logic just as the editorial has a logic. \n\nSocial tokens ($PUBLICATION) can raise money for a publication or fund new efforts, giving holders a proxy for equity in the overall project that exists more on the back-end. NFTs can monetize social tokens for the holders and give readers / consumers a way to interact with the brand, as well as to participate in its economics. The NFTs have to be desirable in a variety of ways, both as high-end patronage and as casual affiliation, like New Yorker tote bags. \n\nThe NFTs are not iterations of the text content, or symbolic of the content (a la the [New York Times column](https://foundation.app/kevinroose/the-new-york-times-x-nft-13129)), but are a form of content in themselves. Think of a publication that is inextricable from and funded by a marketplace of NFTs like Cryptopunks, where the publication is the only authority that can create more. The action of the marketplace would generate enough returns to run the publication, which would in turn produce more, and attract more demand for, the marketplace's NFTs. \n\n![](https://images.mirror-media.xyz/publication-images/9a9cc201-06e3-44c2-9a18-e269d89c32cb.png?height=738&width=1346)\n\nNFTs are a form of streetwear drop amenable to any content format or producer. They create fresh visual interest, scarcity, and ephemerality, functioning as rewards for those who are most engaged and invested in the brand, who can also profit in turn from their participation. \n\n## **Using NFTs**\n\n— Authoritative NFTs of branding assets can be released at the outset of the publication, in the context of crowdfunding. An initial release of NFTs could be seen as the \"original\" creations backing the project, which would become more valuable as the publication grows in stature.\n\n— More casual NFTs could take the form of annual subscriber / backer rewards and function as a kind of identification that is public-facing: If you have one, then you are seen as an early adopter of this publication (editions work well for this approach).\n\n— A set of NFTs could be produced in the form of stylized avatars only for subscribers, a la Cryptopunks or Cryptokitties. These could be abstract and sold / traded in a marketplace. \n\n— NFTs could be produced on a per-article basis, minted when the article is published and then given to the writer to sell. But that requires demand on a per-article level, which requires a lot of compelling imagery and higher levels of consumption: do they have enough symbolic value?\n\n— Ultimately, the publication itself should function as a showcase for the NFTs from that publication: Imagine profile pages or showcases, or spotlights on each article page or newsletter edition, that highlight a particular NFT and owner, or offer the NFT for sale. Like wearing streetwear, NFTs need better distribution mechanisms to drive demand and create aspiration.  \n\n— Writers can be paid in ETH, NFTs, or $PUBLICATION tokens, which are cheap to produce for the publication. (Writers or any publication contributors in media are rarely given a meaningful stake in the business of the publication.)\n\n— The NFTs should be desirable on their own as an aesthetic system, like streetwear, action figures, or art toys. The NFT aesthetic system evolves as the publication expands, like watching a houseplant grow. \n\n## **Comparisons**\n\n[Apartamento](https://www.apartamentomagazine.com/): An influential interiors magazine that emerged from a small community and created an aspirational image of a bohemian lifestyle, through well-designed, highly aesthetic print magazines and a unique photography style. \n\n[Axios](https://www.axios.com/): A newsletter company that thrives on providing very impactful content for its readers in very comprehensible units; the style of content itself is a signature for the publication. \n\n[Monocle](https://monocle.com/magazine/): A business, culture, and lifestyle magazine and 24/7 radio station that became identified with a global archetype of person, who reads and shows off the magazine. There are Monocle tote bags, clothing lines, cafes, and accessories that readers buy into as much as the magazine. \n\n[Kinfolk](https://www.kinfolk.com/): A magazine that gave readers an image of not just what to consume but how to behave ethically and morally, creating an image of an aestheticized simple life. The magazine's aesthetic spread over Instagram and other platforms to become diffuse and participatory, disconnected from the magazine itself but still branded by it. \n\n[LeanLuxe](http://leanluxe.com/): A daily-ish newsletter about D2C brands but also about the lifestyle of wealthy millennials and businesses targeting that demographic. Also takes the form of a Slack community and advertising within and to the readership, creating a collective identity. ", "timestamp": 1618514703, "digest": "bTAwqOAe2vG6UIq5KSPrEho_VbrfDxcswm0ZuUtPGAc", "contributor": "0x25cbCFA16e43e58517f80D583087Ea89241293E6"}
{"id": "1X0YD6o3kuPkO7hMcrRzRFp8kjSbYZFr0gdJfoKjL7w", "title": "Chocolate Covered Vegetables", "body": "I've so enjoyed everyone using these meme formats for their Tweets. This piece is for sale here: \n\n[Token #2836](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=2836)\n\n\n**Every bidder who wishes gets a custom emoji art in their Twitter DM on a topic of their choice (please DM twitter.com/lizhagelthorn)**\n\nMemes are made up of 3 things: the format, the message and the source image or video. The format is what is important. Below are formats. Where other artists then add in the blanks. Formats are timeless. The messages are not.\n\nIf you have a difficult message or story and you need a timeless format. Here are trending meme / text formats collected over time for generous sugar coating.\n\nReplace the (x), (y), (a), (b), (c) variables with your own message. \n\nFor Twitter, you need to have a character in the the top corner left (the very first character) or the format gets misaligned. \n\nCopy + Paste and please source this entry. \n\n*Why can't life always be this easy? She's in the mirror dancing so _______.*\n\n\n```\nThe value of ______:\n\n           █          　　\n           █　        \n           █　        \n           █　             ＿\n          (x)              (y)\n______________________________________________________________\n\nWelcome to my game show. Please choose a door. \n \n  🚪       🚪        🚪\n Door     Door     Door\n  1         2        3\n\n[Do something based on the door people choose]\n\n______________________________________________________________\n🌙     ___________   \n      |Answer (y)|\n      |______ ___|\n            |/\n        🕯🧘‍♀️🕯       _____________\n        🃑 🂻 🃟      |Question (x) |\n           🐛      <|_____________|\n_____________________________________________________________\n\n||　 | |   (a) \n|　| | | 　\n| | |. | \n|＿,_|_|\n／// |ヽ\\   (b)\n^^^^.|^^^^\n　　｜ﾍ⌒ﾌ \n　　(|･ω･)  (c)\n   （つ　)　\n　  しー-Ｊ\n______________________________________________________________\n\n(x)\n\n　  ∧＿∧\n (   ˘ω˘ )\n┳Ｕ┳―┳Ｕ┳\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n┻┳┻┳┻┳┻\n┳┻┳┻┳┻┻\n______________________________________________________________\n\n☀️ \n ／￣￣￣＼      ￣￣￣￣￣￣￣\n|　ー　ー  \\   ||           |\n|　 ◉　◉ | /  |           |\n\\　　 ▱　/∠    |    (x)    |\n ＼　　  |      |           |\n ／　　　＼      |           |\n       　      　￣￣￣￣￣￣￣\n______________________________________________________________\n\n                 ~ (x) ~   \n                 ▂▂▂▂▂▂            \n          ◢◤    █       █      \n██████████████████████████\n████ /         \\ ███  /        \\ ████\n         \\____ /            \\____ /\n\n\n______________________________________________________________\n     \n      (\\__/) \n      (•ㅅ•)    (x)\n 　＿ノ ヽ ノ＼ __   \n /　`/ ⌒Ｙ⌒ Ｙ　ヽ     \n( 　(三ヽ人　 /　　 |     \n|　ﾉ⌒＼ ￣￣ヽ　 ノ    \nヽ＿＿＿＞､＿＿_／ \n　　 ｜( 王 ﾉ〈 (\\__/) \n　　 /ﾐ`ー―彡\\  (•ㅅ•) (y)\n\n______________________________________________________________\n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿／\n￣￣￣￣￣￣￣\n\n　　　 ∧_∧　 (x)\n　　 (　･ω･)   \n　 ＿|　⊃／(＿＿_  \n／　└-(＿＿＿_／ \n￣￣￣￣￣￣￣    \n\n ＜⌒／ヽ-､_＿_\n／＜_/＿＿＿＿\n\n______________________________________________________________\n\n┏┓  \n┃┃╱╲ in \n┃╱╱╲╲ this  \n╱╱╭╮╲╲  house\n▔▏┗┛▕▔   we\n╱▔▔▔▔▔▔▔▔▔▔╲  \n        (x)\n╱╱┏┳┓╭╮┏┳┓ ╲╲  \n▔▏┗┻┛┃┃┗┻┛▕▔\n\n______________________________________________________________\n \n  buying (x)                     buying (y)                        \n                         \n    \\😃/                              ☹️\n    | |                             /| |\\\n   /   \\                            /   \\\n______________________________________________________________\n\nmight fuck (or mess) around and \n  |   👀   |\n  \\       /\n ____| |_____\n/        ✊__/\n\\_✊\n     do (x)\n\n______________________________________________________________\n\n(x)!\n\n     ⌒╭╮⌒╭╮\n╭ ◠             ╮\n(    ┃😴▄▄▄    )\n(    ┣━━━━┓  )\n ⌣(            ◡\n      ⌣╰╯◡ ⌣\n            ｡  ᴼ\n      😐   🖥️\n    ║[]╯━━\n    ╚╤ ╮\n        ┻\n______________________________________________________________\n\n|￣￣￣￣￣￣|\n|  (X)     | \n|          |  \n|          |\n|＿＿＿＿＿__|  \n(\\__/) ||  \n(•ㅅ•) ||  \n/ 　 づ\n\n______________________________________________________________\n\nwell would you look at the time...\n\n            12\n      11    ^     1\n  10        |         2      it’s (x)\n9           ⊙———>   o’clock\n   8                   4     \n       7          5           \n             6\n______________________________________________________________\n\n(x)\n ○ \nく|)へ\n    〉               (y)\n ￣￣┗┓            \n 　 　   ┗┓       ヾ○ｼ\n  　　      ┗┓   ヘ/ 　 　 \n 　           ┗┓ノ \n　 　 　 　 　    ┗┓\n\n______________________________________________________________\n\n┓┏┓┏┓┃ \n┛┗┛┗┛┃＼○／ \n┓┏┓┏┓┃  /   (x)\n┛┗┛┗┛┃ノ) \n┓┏┓┏┓┃         \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┛┗┛┗┛┃  \n┓┏┓┏┓┃          \n┃┃┃┃┃┃ \n┻┻┻┻┻┻\n______________________________________________________________\n\n(x)\n.       😎\n        |\\👐\n       / \\\n━━━━━┓ ＼＼\n┓┓┓┓┓┃\n┓┓┓┓┓┃ ヽ😩ノ (y)\n┓┓┓┓┓┃ 　/　\n┓┓┓┓┓┃ ノ)　\n┓┓┓┓┓┃\n______________________________________________________________\n\n┳┻| \n┳┻| \n┻┳|\n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┻┳| \n┳┻| \n┳┻| \n┻┳| \n┳┻| \n┻┳| \n┳┻| _ \n┻┳|•.•) (x)\n┳┻|⊂ﾉ    \n┻┳|\n______________________________________________________________\n\n╭ ◜◝ ͡ ◜◝ ͡  ◜◝ ͡ ◜◝ ͡  ◜◝ ╮ \n♡         (x)        ♡\n  ♡                 ♡\n╰ ◟◞ ͜  ◟ ͜   ◟◞ ͜  ◟ ͜   ◟◞ ╯\n           O\n             ° \n〃∩　∧＿∧\n⊂⌒（ ´・ω・）\n    ヽ_っ＿/￣￣￣/\n　 　   ＼/＿＿＿/\n\n______________________________________________________________\n\ni am a:\n⚪️ male\n⚪️ female\n🔘 (x)\n\ninterested in:\n⚪️ male\n⚪️ female\n🔘 (y) \n\n______________________________________________________________\n\n\nrelationship status: \n⚪️ single\n⚪️ taken\n⚪️ it’s complicated \n🔘 (x)\n\n______________________________________________________________\n\n📍 (a)\n  |\n  | _ _ _ _ _ _ _ _ _ __ __ \n                           |\n📍 (x)                     |\n                           |\n   _ _ _ _ _ _ _ _ _ _ __ _|\n  | \n📍(b)\n\n______________________________________________________________\n\nThis is \n↓      ↓← ← ← ←   ←\n↓      ↓               ↑\n↓      ↓               ↑\n→ → → → → → →  my brain\n         ↓\n         ↓\n         ↓\n                  After (x)\n\n______________________________________________________________\n\ncan (x) do (y)\n           _____|_____\n          |           |\n         yes         no\n          |           |\n          x           y\n\n______________________________________________________________\n\nme talking to (a):\n▶ 🔘─────── 00:07\n\nme talking to (b):\n▶ 🔘─────── 00:69\n\nme talking to (c)\n▶ 🔘──────── 4:20:00\n\n______________________________________________________________\n\n          x song 🅴\n         (y artist)\n         ◄◄⠀▐▐ ⠀►►\n     🔈─────────⚪️🔊\n\n______________________________________________________________\n\nTwitter:\n_________________________\n|          (x)           |\n|________________________|\n   X🔄             Y❤️\n\n[7 hours later]\n\n_________________________\n|         (x)            |\n|________________________|\n   69k🔄        420k❤️\n\n______________________________________________________________\n\nnormal heart rate:\n\n⠀   /\\⠀ ⠀ ⠀ ⠀.    /\\    \n__ /   \\   __/\\__ /  \\  _\n        \\/⠀ ⠀ ⠀ ⠀  \\/\n\nheart rate after (x):\n                            \n________________\n                     \nOR\n\nnormal heart rate:\n⠀   /\\⠀ ⠀ ⠀ ⠀     /\\    \n__ /   \\  __/\\__ /   \\   _\n        \\/⠀ ⠀ ⠀ ⠀     \\/\n\nheart rate after (x):            \n\n ⠀/\\       /\\⠀       /\\\n_/  \\  /\\_/  \\   /\\_/  \\  /\\____\n⠀    \\/⠀⠀     \\/⠀⠀     \\/\n\n______________________________________________________________\n\ndoing (x)\n▶  🔘─────── 3:19\n\ndoing (y)\n▶  🔘─────── 3:24:45\n\n______________________________________________________________\n\n╭━━━━━━━━━━━━╮\n┃   🌔 CO — STAR      ┃\n┃ 𝗬𝗼𝘂𝗿 𝗱𝗮𝘆 𝗮𝘁 𝗮 𝗴𝗹𝗮𝗻𝗰𝗲   ┃\n┃      (x)            ┃\n┃                     ┃\n╰━━━━━━━━━━━━╯\n\n______________________________________________________________\n\nhow much     |       ___/\n(x)          |      /\n             |  ___/\n             |/_______________\n     \n               how much (y)\n\n______________________________________________________________\n\ndoing             doing \n(x)                (y)\n\n           🤝\n\n (something they both do)\n\n______________________________________________________________\n\n.    *     *    .🌙   *    .  *  ☄️.\n  * .  🌍  *     .    *   💫  *    \n .  *        time to (x)   * .   \n     *        and       *\n .    *        (y).            * . \n  .    .  *   ✨  .  *    .   *     *\n     *   .     .        .  *    🌕   .\n *   🌕   .    .   * ⭐️    *   . *\n\n______________________________________________________________\n\nsummoning circle: \n\n        ❤️      ❤️\n                       ❤️\n  ❤️\n           (x)           ❤️     \n❤️                                   \n                  \n  ❤️                    ❤️\n\n        ❤️        ❤️       \n\n\n\n______________________________________________________________\n\n“(x)” ★☆☆☆☆ \n\n“(y) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\n\n______________________________________________________________\n\n⭐️⭐️⭐️⭐️⭐️\n\n(x)\n\n[Review updated]\n\n⭐️ ☆ ☆ ☆ ☆\n\n(y)\n\n______________________________________________________________\n\nmy DNA results are in:\n\nA         A\n  B      B\n      C\n  A      A\nB          B\n  C      C\n      A\n  B      B\nC          C\n  A     A\n      B\n  C      C\nA          A\n   B     B\n       C  \n   A     A\nB           B\n   C     C\n       A\n   B     B\nC           C\n\n(fill in with what you're made of)\n\n______________________________________________________________\n\nretweet if you\n really\n   really\n     really\n       really\n       really\n      really\n    really\n  really\nreally\nreally\n really\n really\n  really\n   really\n     really\n       really\n       really\n      really\n    really\n   really\n really \n(x)\n\n______________________________________________________________\n\nme: can i (x)\n\nthem: sorry no\n\nme: \n\n    N\n　   O\n　　　 O\n　　　　 o\n　　　　　o\n　　　　　 o\n　　　　　o\n　　　　 。\n　　　 。\n　　　.\n　　　.\n　　　 .\n　　　　.\n                  .\n\n______________________________________________________________\n\nno (x) has all five:\n\n1. (a)\n2. (b)\n3. (c)\n4. (d)\n5. (e)\n\n______________________________________________________________\n\nthem: i want you to hurt me\n\nme: (x) \n\nthem: please stop\n\nme: (y)\n\n______________________________________________________________\n\nthings that aren’t personality traits:\n\n• \n• \n• \n\nthings that are personality traits:\n\n• \n• \n• \n\n______________________________________________________________\n\nbop it: bop it!\n\nme: *bops it*\n\nbop it: twist it!\n\nme: *twists it*\n\nbop it: (x)\n\nme: what\n\nbop it: pull it!\n\n______________________________________________________________\n\nranking (x):\n\n1. you\n2. can’t\n3. rank\n4. (x)\n5. because\n6. they\n7. are\n8. all\n9. worthy \n10. of\n11. love\n12. (y)\n______________________________________________________________\n\nnobody: \nliterally no one: \nnot a single person in the world:\nme: (x)\n______________________________________________________________\n\nme: *thinks about (x)*\n\nmy brain: \ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\ndon’t say it\nme: (y)\n______________________________________________________________\n\noh, you like (x)? name every (x)\n\n______________________________________________________________\n\nI              took \n       just          a\n\n     D\n           N\n                 A\n\n        T    e    S    t\n\n  t u r n s      o u t\n\n          i'm\n\n           100%\n                 \n     (x)\n______________________________________________________________\n\nget you a (x) who can do both\n\n______________________________________________________________\n\n(x) and chill\n\n______________________________________________________________\n\nnoOo don’t (x) you’re so sexy lol\n\n______________________________________________________________\n\nYou do (x), i do (y), we are not the same\n\n______________________________________________________________\n\nlets get this (x)\n\n______________________________________________________________\n\nya’ll mind if i (x)?\n\n______________________________________________________________\n\nnot a phone in sight, just vibes | or (x)\n______________________________________________________________\n\n```\n\n**People with good hearts listen up!!!!.... we can't save everybody. I'll be your mirror anytime.**\n", "timestamp": 1618515043, "digest": "r6g6-QeFBFCZgsFERlI_mVEvgxsyN1R6jQXVLlaUFEA", "contributor": "0x2f9B473d4B9f95A5E55F205Be1a003B27D24Df76"}
{"id": "sF6CdXxrBiGM8z5fym3iUF2mKgmpG8Nm6vod7Aa7_IU", "title": "Yupdate 4/13/21: 🏄 New Features Incoming 🏄", "body": "## Hey Yupster,\n\nThis week we're highlighting our new [Search Results page](http://app.yup.io/?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJAeXVwLmlvIn0%3D), [Analytics page](http://app.yup.io/analytics/onemorejoexx?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJAeXVwLmlvIn0%3D), and our new Collections feature coming soon. This is a big one, let's get right into it 💪.\n\n### Search Results Page\n\nBrowse through Yup with ease with our new search results page 🌈. Look up any subject, post, or feed and scroll through all the relevant content.\n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/fa760c4c-866f-4670-98c2-9203a93e3499.gif)\n\n### Analytics\n\nThe Analytics page on profiles keeps you informed about your activity and earnings on Yup. Track your progress from account creation to present day and see which platforms you gravitate to most. Time to optimize your Yup experience and rewards 🤑.\n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/41cfb697-1f5b-47d1-81b0-f3b1541a761a.gif)\n\n### Landing Site\n\nYup is getting prettier by the week 🌸. In our last newsletter we rolled out our new logo, and in this one we're highlighting our landing site's makeover. Our site now has easy-to-read fonts, as well as a message that lives up to our ambitions: welcome to the social network for curators.\n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/e6a59ce9-607d-4a88-87c2-fee1373f0daa.gif)\n\n### Coming Soon: Collections\n\nCollections allow you to curate content by a topic of your choice and showcase it in your Yup profile. Think of public Spotify playlists or Pinterest profiles, but for any piece of content across the web. Curation will never be the same ✨.\n\n## Content:\n\nHere are the top NFTs of the week according to Yup feeds. If you like the content you see, click here to [subscribe](http://yupio.typeform.com/to/XFUH2bDC?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJAeXVwLmlvIn0%3D#email=xxxxx) to our weekly NFT newsletter 🙂.\n\n![](https://f8n-ipfs-production.imgix.net/QmX4uumw183BEyTvUMRGVYpFNmMgCigEFJWpfnE2HCBjS7/nft.png)\n\n❤️  86   🌸     🦄  29\n\n[](https://f8n-ipfs-production.imgix.net/QmdWaKwky8Lf8JsfepJQ8TN1GRLKVezxE3raiSeG3rHyUY/nft.mp4)\n\n❤️  68   🌸  36   🦄  20\n\n![](https://ipfs.pixura.io/ipfs/QmWdJpimYrXWiy1Kd8BKqfaxRSU8QFFxLNusNMXf8BPpYw/adstill.jpg)\n\nThanks for tuning into another Yupdate. See you all in the next one ✌️!", "timestamp": 1618523568, "digest": "TM1S4EaRs3toNlJNm25yf3YLrLRWLDbkeSfwdYpArAg", "contributor": "0x30E838D51c61811d382962B4e0699715462DcdE1"}
