{"id": "yElmqDOvEUvZrEGuzY_pxi4NXpQ-pnJFSmI-yPGEnuo", "title": "The Krause House Flightpaper", "body": "## Empowering fans to purchase & operate an NBA Team\n\n[Krausehouse.club](https://t.co/SK0oiCRzhh?amp=1) September 3, 2021\n\nAuthor: [@GladRobot](https://twitter.com/gladrobot)\n\nContributors: [@thycommodore](https://twitter.com/thycommodore), karnie6#6303, [@benschecter](https://twitter.com/benschecter), silkeyj#6827\n\n# INTRO\n\nOwners, media, players, and fans each play critical roles to make the business of professional sports go and flourish. While fans are arguably the single most indispensable party to this equation, they are the lowest on the totem pole when it comes to ownership by an order of magnitude or higher. We define ownership both as equity (participation in the upside of the business) and influence (having a say in strategy).\n\nHistorically, the reason for this disparity is that there hadn’t been ways for fans to coordinate or communicate at scale. Technology has begun to disrupt this model by giving fans a common voice, first through talk radio in the 90s, online forums in 00s and more recently through social media. Fans now have more influence than ever before - but it’s still lacking. This is because without ownership, fans are seen as just a noisy consumer who has to be appeased without a real seat at the table.\n\nWeb3 changes all that by consumerizing ownership. With web3, consumers finally have the capability to collectively own and coordinate at scale. This changes the game. In this document, we will share our vision for fan ownership in professional sports, explore the various approaches available to accomplish this, outline key risks and offer our recommendation on next steps.\n\n### Vision\n\nOur long-term vision is to empower fans of every professional franchise to collectively have real ownership of the organization. To us, this means both: 1) equity (e.g. own X% of shares), and 2) influence in governance - not just one or the other.\n\nWe understand the reader’s first instinct may be to scoff at this and say owners will never let this happen. It’s important to understand that there was a time not too long ago where players were at the same place on the totem pole where fans are today. Through the use of technology, savvy, and understanding how critical they are to the business, the ownership by players (both tangible and unrealized) has grown immensely within the last 10 years. There’s no reason fans can’t do the same if organized correctly.\n\n### Approaches:\n\n### 1. Majority Decentralized Ownership (DAO)\n\nIn this model, fans would organize themselves as a Decentralized Autonomous Organization (DAO) whose ownership rights, funding, and governance would all live “on chain” (on the blockchain) and purchase the majority rights (50%+) to a franchise.\n\nGiven a majority stake, we would strive to have DAO members vote on as many parts of the team’s strategy + execution as possible.\n\nWe believe the fan community would provide the most value-add by having final say in the following areas:\n\n* Ownership decisions (e.g. buying or selling additional equity, allowing other investors + new valuation, etc)\n* Team Location\n* Approval of Key Executive Hires (GM/VP Ops/Head Coach/etc)\n* Marketing + Events (team uniform, player events, etc)\n\nWe do not believe the DAO will provide value-add by participating in these areas:\n\n* Player personnel decisions\n* Contract decisions\n* Assistant coaching/training staff\n\n### 2. Minority Decentralized Ownership (DAO)\n\n* This model would be organized identically to #1 but the DAO would own a minority stake of the team. Given our goals on both ownership + influence, this model only makes sense if the DAO retains final say but in a more restrictive set of areas than model #1. These would include:\n* Team Location\n* Marketing + Events\n* At least partial say in key executive hiring decisions\n\n### 3. Minority Decentralized Ownership (Social Tokens)\n\nThis model is where the team will create social tokens for fans to hold. These tokens will likely provide holders with benefits via digital goods (NFTs), special player + event access, and more. We anticipate that big market teams will not extend ownership or revenue sharing (see [Royal](https://royal.io/) for what 3LAU is doing in music), whereas small market teams may innovate more here to collect a digital + worldwide fanbase. In this model, it is unlikely fans will have any governance on team operations + strategy.\n\n### Recommendation\n\nWe believe #3 will be the end-game for every sports franchise as web3 grows. KH’s responsibility is to not settle for this, and use technology + enthusiasm to think bigger.\n\nOur recommendation is to go with approach #2 as we anticipate the NBA will not be favorable to giving majority ownership to any faceless DAO/corporation in the near or medium term regardless of $$ offer. We believe small market teams that have been bottom dwellers and who struggle for fan enthusiasm, specifically Memphis, NOLA, Minnesota, Sacramento, and others, are ones who should be targeted.\n\nOur approach should be to accentuate the franchise as the NBA’s first metaverse native team. It’ll be the team of the internet, NFT & memes galores, token drops, discord rooms, community managers, etc - the best that web3 + the metaverse to offer.\n\n# WHY NOW\n\nBlockchain technology unlocks new types of ownership, specifically decentralized ownership. This technology is a prerequisite for fans to own their favorite team & we’ve finally built out enough of the infrastructure to apply this to sport ownership.\n\nIt’s not just blockchain technology that makes this timing finally here. Team ownership requires coordinating large groups of anonymous people in an efficient manner. The technology & the platforms to do this are finally here.\n\nThis is our moment.\n\nWe are entering a new age of ownership & governance. In today’s ownership economy, attention is dominated by where we put our dollars. Teams that are able to drive the largest share of attention, drive the largest shares of valuations. Teams that embrace decentralized ownership tap into a previously untapped source of new attention — and subsequently an untapped source of driving up the value of the team.\n\nBut would the NBA allow something like this?\n\n10 years ago? Probably not — but today’s NBA is changing. Recently, the NBA has made the first step to embrace ownership by granting institutional investors the right to purchase minority equity stakes in teams. Dyal Capital, through the HomeCourt Fund, is the first of several financial offerings which serve as a vehicle for regular public investors to purchase shares in a team. In the summer of 2021, [Dyal closed a 5% acquisition of the Phoenix Suns](https://pitchbook.com/news/articles/dyal-capital-phoenix-suns-private-equity) and plans on capturing additional shares in other teams. By design, financial products are driven to be operationally lean and prefer not to take on any team governance as that would be management overhead.\n\nKrause House changes this.\n\nKrause House’s vision is to enable fans to become owners with governance to give them a seat at the table on team decisions. By unifying the Krause House under a social token, members can be sure that the team is in fact, their team. When passion is tightly coupled with property, the league will unlock true prosperity.\n\nOur idea is inevitable. A professional sport team will be owned by a decentralized organization in the next 10 years. We believe it will be Krause House.\n\nTime is of the essence. The first sport and team to move into this white space will reap first mover advantages by unlocking network effects through social ownership. The compounding effects of social ownership create a path to capture the maximum value available in the market. Other teams may continue their traditional approach to governance but with each action they take some fans will be unhappy and eventually they may feel disenfranchised and leave. DAOs provide an alternative that welcomes all fan voices to be heard and elevates the best ideas to action.\n\n![](https://images.mirror-media.xyz/publication-images/81e83229-a45e-469f-939c-1a86fb750356.png?height=851&width=1447)\n\n# DAOs\n\nA ‘Decentralized Autonomous Organization’, better known as a DAO, self organizes to accomplish a grand mission. Members of the DAO collectively decide on what they’ll do and how to get there. In contrast to traditionally geographically concentrated groups of individuals, anyone with an internet connection can contribute to a DAO. This approach grants a huge improvement in collective resources. The Krause House will leverage blockchain coordination to transparently manage the objectives of the ownership pool, enabling collective decision making in place of a single owner (or small ownership group).\n\nIn order for an action to be made, some form of majority or reputation would need to vote in its favor. All votes would be held on an open ledger so that members can have confidence that the will of the majority is always carried forward. The DAO will benefit from [Liquid Democracy](https://en.wikipedia.org/wiki/Liquid_democracy) vote delegation where a member can assign their votes to other members. In this case, votes are transitive so if A assigns B and B assigns C then C determines A and B’s vote. This method allows owners to delegate certain governance decisions to specialists who hold domain knowledge about a particular topic such as scouting or community relations.\n\n# GOVERNANCE\n\nWhile institutional funds look to avoid team governance, a DAO excels at making governance efficient. The Krause House has the self awareness to recognize that massive collective ownership expands a team’s fanbase. In an NBA where revenue potential is dictated by geographic regions, a small market (sub 2 million residents) struggles to compete with a large market team with a population of 7 to 20 million. Imagine if ‘small market team X’ could quadruple its fanbase by offering fractions of ownership through a global DAO. While the original owner has reduced their stake in the team, the newly realized fanbase expands the market and brand value leading to the creation of a much more valuable asset. Simply stated, DAOs expand the size of the pie far beyond any dilution which occurred.\n\nAs existing ownership stands to greatly profit by working with a DAO, the value exchange must be fair. The Krause House will never act as a silent partner. As shareholders, we expect a vote in all affairs that matter from a fan’s perspective. It’d be currently infeasible to orchestrate individual roster moves but voting on a General Manager and defining principles or strategies for success is feasible. Weighing in on large decisions like extending a max contract extensions are opportunities for direct democratic input.\n\nIn a traditional organization, decisions are made in a top down fashion and occasionally a small sample set of customers are surveyed to see how the product is resonating (a slow and imperfect process). In a DAO, the customers are empowered owners that deliver the product they want. This is instant product-market fit and a primary reason why DAOs are today’s [fastest growing companies](https://open-orgs.info/). By opening up governance, a team will access a wider knowledge base and ultimately reach the best solution.\n\nThroughout the NBA, owners are known as hyper competitive in the game of business. But making decisions can come at the cost of alienating or destroying a portion of their market. The owner who leans into decentralized governance will operate with a new found confidence that they are now always aligned with fans. The reward for this new efficient business model is unlocked when they activate a new massive global market.\n\n# TEAM REVENUE POTENTIAL\n\nTeams activating fractional ownership stand to benefit in three ways:\n\n1. Market Expansion: An expanded fanbase will drive demand for existing products and services.\n2. Revenue Diversification: The new fanbase will be interested in new Web 3 product offerings like NFTs and virtual experiences.\n3. Valuation: As revenues rise and team tokens are traded, the franchise valuation should increase faster than any other team in the Association.\n\nThe following graphic illustrates the opportunity for small markets to merge with a DAO\n\n![](https://lh4.googleusercontent.com/v-_8O6jGhJ0IrYPDAP6WLJiOcyD6P6qkf5I2pFZXD3GlSN9uRqw4SaFooiXO0zbNytE6uZ2sWoJeUEItjk5HbfKPAHp1C8HWllBf1UAbD9J2Q084zlha1AHqxXkMy0-OGoXd9tlw=s0)\n\n# INVESTOR ALPHA\n\nAn NBA team is a value investment with characteristics of an exceptional store of value:\n\n### Durability:\n\nTeams have retained value over decades.\n\n### Scarcity:\n\nThe Association controls supply by preventing issuance of new teams unless it is to the benefit of all incumbents. There’s a zero percent chance that more teams are created to the detriment of league-wide valuations.\n\n### Value Retention:\n\nTeam prices have appreciated faster than inflation.\n\n### Upside Potential:\n\nOver the past 30 years, team valuations have performed better than the Dow and are comparable to high growth tech companies.\n\n### Legacy:\n\nAs a parent looking to pass on wealth, rather than saving into a 401(k), purchasing gold or an expensive watch, one could purchase shares in a team with the intention of keeping it in the family for future generations.\n\n### Community:\n\nTeams are cultural epicenters that you can experience collectively and form lifelong relationships around.\n\nWhile NBA teams are a strong store of value, they offer an additional benefit to investors. As team prices are not correlated to any traditional investment, they are an ideal hedge against downward market forces. As cryptocurrency investments are exposed to extreme volatility, holding an asset in crypto that is as uncorrelated as possible to the market is a perfect asset to diversify one’s portfolio.\n\n# REGULATORY PATH\n\nKrause House intends to offer various products with the ultimate goal of acquiring ownership of an NBA franchise. Some products will pass the [Howey Test](https://www.manhattanstreetcapital.com/faq/for-fundraisers/how-determine-if-token-security-howey-test) and others will fail. As a result, Krause House will have numerous regulatory efforts but the net result is what we desire.\n\nKrause House will issue $KRAUSE Tokens and launch projects and/or services like NFTs to support the DAO. All capital assets will be held in treasury and uses of the fund will require a winning vote by the DAO. All financial actions here will pass the Howey test as tokens compel the DAO members into action.\n\n![](https://images.mirror-media.xyz/publication-images/860f61fb-41f4-42ff-ad6c-f49cdbc92521.png?height=879&width=1916)\n\nBeyond the DAO, Krause House will create a second holding company where the future NBA minority stake will be housed. This entity will hold a Security Token Offering (STO) which allows for raising funds and blockchain verification of ownership. This funding model requires extensive SEC regulation oversight.\n\nThe cleanest option to acquire an NBA team stake with the intention of distributing fractional shares is to start a SPAC. SPACs are Special Purpose Acquisition Companies that are created to raise capital through an IPO to acquire shares of private companies, taking them public through a merger.\n\nSPACs usually raise the initial funds from Sponsors who are institutional investors (SEC Regulation D filing). At this point, the stock value is based on cash-on-hand and belief in the management team. The SPAC then merges with the acquisition target and the stock price adjusts upwards with a real business to value the offering with.\n\nDepending on negotiations with the NBA and team owners, a SPAC sponsor may not be required. A team could approve of the minority sale event and access liquidity directly from individuals. As the funding event doesn’t require institutional capital and sponsors to backstop the deal, we could offer team shares to the public without market makers or costly promoters.\n\nShares will be listed on over the counter (OTC) exchanges that support blockchain tokens. Team tokens will not be distributed on NYSE or NASDAQ as those platforms do not support tokens with governance rights for on-chain voting and permissions. OTCs are growing in popularity with exchanges such as Coinbase, FTX, Uniswap, Kraken and countless others.\n\n### Here’s One Path to Acquire a Minority Team Stake\n\n1. Register a C corp in Delaware and house the Krause House DAO inside\n2. Offer NFTs and sell $KRAUSE tokens for the treasury\n3. Form a SPAC, file an S-1 with the SEC\n4. Find an NBA asset to acquire and present it to the DAO\n5. Launch a Security Token Offering\n6. De-SPAC and merge with the acquired NBA entity\n7. List the minority team stake as it’s own company across OTC exchanges\n\n# CONCLUSION\n\nFan ownership & governance powered by Web 3 is the future. The financial benefits are positive for all parties but more importantly, an NBA team will benefit from the participation of the fan owner to deliver the perfect product desired by the market.\n\nAs the NBA has begun allowing traditional investment firms to purchase shares it’s important that the Association isn’t trapped under old structures. To bring the game to the globe and maximize the potential for basketball to bring the world together, there is no better partner than a DAO.", "timestamp": 1630676243, "digest": "uLSxAa96TUOzcGo4JKh3sK-tR6y1cLEN6R4iWPuL7P4", "contributor": "0x6B6AdA1452e22BBd5764eFA67A105Cc20Ae875D2"}
{"id": "tFa1twBvSheQIXQb8g_UHyiJm6cdYGNjFpGbXMI_Wpg", "title": "I'm Quitting Web2 (And So Should You)", "body": "## Something important is happening: The birth of a new economy\n\n[https://twitter.com/rafathebuilder/status/1433708946196418593?s=20](https://twitter.com/rafathebuilder/status/1433708946196418593?s=20)\n\nMy personal journey over the last year has led me through the artisan landscape of Puerto Rico, nascent online organizations on Discord, and through this unlikely intersection, to the [future of work](https://gnosisguild.mirror.xyz/t4F5rItMw4-mlpLZf5JQhElbDfQ2JRVKAzEpanyxW1Q).\n\nBarely a month after publishing my [first article](https://creators.mirror.xyz/862A5rBtKX3BC8eEircDnGwPIJJTJ33hn-MvnukByPc) on web3, I realize that my employer is not prepared to prevent the upcoming wave of [resignations](https://www.wired.co.uk/article/great-resignation-quit-job).\n\nThe competing backdrop is bullying its way to the forefront with a monumental offer: inspiration, a pathway to philanthropy, and [real ownership of work](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/). And the company's counteroffer? Predictability at the expense of my individual production [scale](https://store.legal.thomsonreuters.com/law-products/news-views/corporate-counsel/employer-and-employee-ownership-of-intellectual-property-not-as-easy-as-you-think), time with family, and creativity. Hmmm.\n\n👀 🚨 C*ollect your “I QUIT ~~WEB2~~” NFT at the bottom of the page* 🚨 *👀*\n\n[https://twitter.com/rafathebuilder/status/1399383928880963584?s=20](https://twitter.com/rafathebuilder/status/1399383928880963584?s=20)\n\n\n---\n\n## a BIG MOOD\n\nIt turns out many of us are having doubts about work. Is it the pandemic? The endless months in hibernation and [dangerous introspection](https://time.com/5925218/covid-19-pandemic-life-decisions/)? Or maybe the realization that once the noise of the office dies down, what's left is rise and grind? Either way, this feeling of dissatisfaction with the current working environments is rampant.\n\n\n***\n\n> *In a report called The Next Great Disruption Is Hybrid Work – [Are We Ready?](https://www.microsoft.com/en-us/worklab/work-trend-index), Microsoft found that as much as 54% of Generation Z workers and 41% of the entire global workforce could be considering handing in their resignation.*\n>\n> *Similarly, a UK and Ireland survey found that [38%](https://hr.personio.de/hubfs/EN_Downloads/202104_HRStudy_UKI.pdf) of employees were planning to leave their jobs in the next six months to a year, while a US survey reported that [42%](https://news.prudential.com/presskits/pulse-american-worker-survey-is-this-working.htm) of employees would quit if their company didn’t offer remote working options long term.*\n>\n> Source: World Economic Forum\n\n[https://twitter.com/rafathebuilder/status/1433501296422801411?s=20](https://twitter.com/rafathebuilder/status/1433501296422801411?s=20)\n\n\n---\n\nI was too embarrassed to tell my manager I was going into [web3](https://ethereum.org/en/developers/docs/web2-vs-web3/) directly when I spoke with them.\n\nI told them a half-truth instead: \"This is not the right role for me. I think the team needs folks who want to manage tech-support tickets and enjoy catering to customers on a daily basis. You need a team that feels challenged managing accounts...”\n\n***The better and more important half of the story has two parts:***\n\n1. The company is building technology for an age that is coming to an end, and\n2. I am no longer OK selling my personal work to any company, stealing my ability to scale expertise and wealth.\n\n[https://twitter.com/agorismlabs/status/1427009765075570696?s=20](https://twitter.com/agorismlabs/status/1427009765075570696?s=20)\n\n\n---\n\n## Note 1: Hear thee, yo, the hype is fr. Your tech is for the yesteryears.\n\nI joined this job last year. It was very near my dream job: tech startup, employee #22, remote, in an industry that I'm passionate about, and with cutting-edge API-first technology for its industry.\n\nAnd yet, I have quit for the uncertainty of web3 a bare 9 months later. Or might I say, I have succumbed to the certainty of participating in something bigger, more important, at a pivotal point in our collective history.\n\n![It's about to get weird. (Source: waitbutwhy.com)](https://images.mirror-media.xyz/publication-images/c9fa7760-4700-42b6-b6fe-65fce6ff6fc5.png?height=900&width=1265)\n\n\n---\n\nSpending any amount of time on[ crypto twitter](https://twitter.com/search?q=web3&src=typed_query) (CT) will, at first glance, suggest that there are many people overhyping the tech. It's cultish, weird, and colorful. But as you dig deeper, into the Discord servers of [avatar-specific](https://boredapeyachtclub.com/#/) communities for example, you'll find that the hype is real.\n\nBy real, I mean millions upon millions of dollars of investment by [top VC firms](https://a16z.com/crypto/) and personal wealth into tight-knit [pseudonymous](https://thehub.ca/in-the-know/2021-06-10/what-is-the-pseudonymous-economy-balaji-srinivasan/) communities, [fun](https://rainbow.me/) technology, and [micro-economies](https://coopahtroopa.mirror.xyz/gWY6Kfebs9wHdfoZZswfiLTBVzfKiyFaIwNf2q8JpgI). The folks working in this space have glassy eyes, looking beyond the horizon to something larger than themselves.\n\n![A new \"American West\" (Source: https://www.americanwest.amdigital.co.uk/)](https://images.mirror-media.xyz/publication-images/f637a315-997b-4b2a-a878-732235dd596d.png?height=362&width=980)\n\n[https://twitter.com/rafathebuilder/status/1424458503922536455?s=20](https://twitter.com/rafathebuilder/status/1424458503922536455?s=20)\n\n\n---\n\nAs I became enveloped in this new ecosystem (shoutout to[ @creatorcabins](https://twitter.com/creatorcabins) and [@forefront__](https://twitter.com/forefront__)), it became increasingly clear that the technology my company is building is outdated. Specifically, the company is automating outdated enterprise operations.\n\n> *\"Am I going to spend my time, energy, focus, and life building something for outdated methods of collaboration?\"*\n\nThe company will no doubt be very successful: they will disrupt the current market and become an enterprise leader. However, it is focusing on dominating an industry from a previous generation.\n\n[https://twitter.com/stefdelev/status/1431870223305658368?s=21](https://twitter.com/stefdelev/status/1431870223305658368?s=21)\n\nOnce I became aware of this, it became impossible to sit by the sidelines. New [digital-native organizations](https://www.notboring.co/p/the-dao-of-daos) are forming, maturing, and growing — and this is where the future of the global economy is being defined.\n\nMy enthusiasm can’t be contained any longer. If you’re a bit of an internet nerd like me, here are [some](https://sotonye.substack.com/p/if-einstein-had-the-internet-an-interview) [excellent](https://otherinter.net/squad-wealth/) [articles](https://ath.mirror.xyz/mDu_nGsWpjvF-KaPLADwxeAMfze3UJOtTAQi2CwPwWc) that might inspire you.\n\n\n---\n\n## Note 2: From employee to free agent\n\nHype aside, there is a larger second reason I am quitting [web2](https://dev.to/dabit3/the-new-creator-economy-daos-community-ownership-and-cryptoeconomics-lnl).\n\nTraditional organizations offer a trade-off for employees: You get paid a fixed capped amount (hourly, salary, bonus, equity), and the company retains your [intellectual property in perpetuity](https://www.uschamber.com/co/start/strategy/can-employees-own-intellectual-property#:\\~:text=If%20that%20worker%20is%20directly,or%20product%20for%20the%20business.). A fair exchange?\n\nPrior to the web, [I strongly believed this was a good bargain](https://en.wikipedia.org/wiki/The_Nature_of_the_Firm) due to transaction costs. Corporations and businesses paid you (on average) more than your ability to market and scale work across your lifespan. In other words, the payment was worth it. If you tried to create, market, sell, and scale individually, it would be too expensive (and you'd likely fail).\n\nNow, as with all things, the internet has [changed the trade-off](https://passion.io/blog/passion-economy-future-of-work#:\\~:text=The%20Passion%20Economy%20is%20a,exponentially%20and%20earn%20passive%20income.&text=The%20gig%20economy%20demands%20participants,horizon%20for%20their%20next%20one.) dynamics. Individuals will slowly, and then suddenly, realize that their knowledge, craft, passion has accessible, monetizable niches. Companies are struggling to internalize this and, as a result, will have a great wave of [resignations](https://twitter.com/JoshuaOgundu/status/1429959048024125484?s=20) just like mine.\n\nMany companies think that increasing salaries or giving out larger bonuses will fix this, but it won't. Why? Because it is a question about ownership, [belonging](https://www.notboring.co/p/the-cooperation-economy-), and self-worth. It is not a question about take-home cash. The next-generation organizations understand this intuitively and emerge accordingly.\n\n[https://twitter.com/rafathebuilder/status/1421909057053597698?s=20](https://twitter.com/rafathebuilder/status/1421909057053597698?s=20)\n\n\n---\n\nTo better visualize the impact on organization dynamics, consider this 2x2 grid. On one axis, we have transaction costs (x-axis), and on the other we have organization group size (y-axis).\n\n![A 2x2, because I'm a consultant. (Source: @rafathebuilder)](https://images.mirror-media.xyz/publication-images/5b4dbddd-8fe7-4337-9e6f-6f8499ca492b.png?height=1174&width=1968)\n\nIn short: As transaction costs decrease (e.g. access to information, raw material for production, coordination and communication), the less need for central oversight and control (e.g. structured corporate entities). New organisms emerge, and participation pathways become possible.\n\nIn a traditional setting, you would need an interview and then a defined role to offset the cost of onboarding and coordination.\n\nBut now, I can write a single article as part of CabinDAO with no permission, get people to consent to the publication, and publish in a matter of days. No one requested this work, but these new organizations provided the space for me to express my creativity and passion. And beyond, the organization rewarded me with connections, work opportunities, and compensation. \\\\n\n\n[https://twitter.com/rafathebuilder/status/1422216770400751627?s=20](https://twitter.com/rafathebuilder/status/1422216770400751627?s=20)\n\n\n---\n\n## A digital artisan emerges\n\nOver the next year(s), I'll likely transform from a career professional into a pseudonymous agent across a variety of projects.\n\nTo start, I've joined [Forefront](http://forefront.news) in the Writers Guild, am supporting local creators at [CabinDAO](https://www.creatorcabins.com/), and have begun working as a freelancer on digital-native organization design (send me a message on Twitter [@rafathebuilder](https://twitter.com/rafathebuilder) if you’d like to speak).\n\nMost importantly, I'll continue my soul's passion: documenting the oral history of[ 100 local artisans of Puerto Rico](https://www.obrasdelpais.com/) and exploring a new, emerging generation of digital workers. I invite you to follow our journey at[ folklore.mirror.xyz](http://folklore.mirror.xyz) and support the mission.\n\nI'm not sure how this journey into web3 will turn out. However, I am sure that the exposure to this new economy will help me understand the future of work better. With some time, I might even reach the goal of becoming something more than a contributor: **A Digital Artisan.**\n\n![Personal vibe ambitions: Don Rafa, Puerto Rico Artisan (Source: obrasdelpais.com)](https://images.mirror-media.xyz/publication-images/0525b0c1-e503-40d4-8025-b14eb7bc5a1f.jpg?height=4000&width=6000)\n\n\n---\n\n## Finding your craft\n\nIf you're curious about the space and inspired, I'd recommend dipping a toe (or a leg) into the strange new organizations that are emerging today.\n\n**First off, sign up to the [Forefront newsletter](https://forefront.news/newsletter) and start learning about the space.**\n\nSecond, start building out your digital identity:\n\n1. Get some magic internet money into a wallet ([Rainbow.me](https://rainbow.me/), [Metamask](https://metamask.io/), or [others](https://ethereum.org/en/wallets/))\n2. Earn your first coins by completing quests on [rabbithole](https://rabbithole.gg/) ([More bounties here](https://www.coinvise.co/))\n3. Find your online squad by joining a DAO ([what is a DAO?](https://pet3rpan.medium.com/an-introduction-to-daos-782e3817e2cd)) ([Here is a list](https://forefront.market/market))\n4. Embrace the pseudonymous economy and buy your first Profile Picture NFT ([what is an NFT?](https://www.notion.so/cab150b9cbcc4b7fb6090fc77881a95d)) (Here is an example[ marketplace](https://opensea.io/))\n\nAnd lastly… and watch out for [gas fees](https://medium.com/geekculture/what-is-gwei-ethereum-gas-explained-c766330c2250)\n\n\n---\n\n***All funds from this NFT are in support of local Puerto Rico artisans through the [non-profit Obras del País](http://obrasdelpais.com). 100% of the proceeds will be used to promote their works online and build a digital gallery of their stories and artisanal techniques.***\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=238](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=238)\n\n", "timestamp": 1630675743, "digest": "bZ8GAWV25WkuRwe1Tftqgy0xV-7Y7VHeRUWbDcpuQVo", "contributor": "0xe62d071Ea99A63798Fec7222c483c53e87F2A32E"}
{"id": "qu4_0H3QZVdaGs8LCt799qHz_MpHIkMyAEAmhhHJd6w", "title": "The Krause House Flightpaper", "body": "## Empowering fans to purchase & operate an NBA Team\n\n[Krausehouse.club](https://t.co/SK0oiCRzhh?amp=1) September 2, 2021\n\nAuthor: [@GladRobot](https://twitter.com/gladrobot)\n\nContributors: [@thycommodore](https://twitter.com/thycommodore), karnie6#6303, [@benschecter](https://twitter.com/benschecter), silkeyj#6827\n\n# INTRO\n\nOwners, media, players, and fans each play critical roles to make the business of professional sports go and flourish. While fans are arguably the single most indispensable party to this equation, they are the lowest on the totem pole when it comes to ownership by an order of magnitude or higher. We define ownership both as equity (participation in the upside of the business) and influence (having a say in strategy).\n\nHistorically, the reason for this disparity is that there hadn’t been ways for fans to coordinate or communicate at scale. Technology has begun to disrupt this model by giving fans a common voice, first through talk radio in the 90s, online forums in 00s and more recently through social media. Fans now have more influence than ever before - but it’s still lacking. This is because without ownership, fans are seen as just a noisy consumer who has to be appeased without a real seat at the table.\n\nWeb3 changes all that by consumerizing ownership. With web3, consumers finally have the capability to collectively own and coordinate at scale. This changes the game. In this document, we will share our vision for fan ownership in professional sports, explore the various approaches available to accomplish this, outline key risks and offer our recommendation on next steps.\n\n### Vision\n\nOur long-term vision is to empower fans of every professional franchise to collectively have real ownership of the organization. To us, this means both: 1) equity (e.g. own X% of shares), and 2) influence in governance - not just one or the other.\n\nWe understand the reader’s first instinct may be to scoff at this and say owners will never let this happen. It’s important to understand that there was a time not too long ago where players were at the same place on the totem pole where fans are today. Through the use of technology, savvy, and understanding how critical they are to the business, the ownership by players (both tangible and unrealized) has grown immensely within the last 10 years. There’s no reason fans can’t do the same if organized correctly.\n\n### Approaches:\n\n### 1. Majority Decentralized Ownership (DAO) \n\nIn this model, fans would organize themselves as a Decentralized Autonomous Organization (DAO) whose ownership rights, funding, and governance would all live “on chain” (on the blockchain) and purchase the majority rights (50%+) to a franchise.\n\nGiven a majority stake, we would strive to have DAO members vote on as many parts of the team’s strategy + execution as possible.\n\nWe believe the fan community would provide the most value-add by having final say in the following areas:\n\n* Ownership decisions (e.g. buying or selling additional equity, allowing other investors + new valuation, etc)\n* Team Location\n* Approval of Key Executive Hires (GM/VP Ops/Head Coach/etc)\n* Marketing + Events (team uniform, player events, etc)\n\nWe do not believe the DAO will provide value-add by participating in these areas:\n\n* Player personnel decisions\n* Contract decisions\n* Assistant coaching/training staff\n\n### 2. Minority Decentralized Ownership (DAO)\n\n* This model would be organized identically to #1 but the DAO would own a minority stake of the team. Given our goals on both ownership + influence, this model only makes sense if the DAO retains final say but in a more restrictive set of areas than model #1. These would include:\n\n\n* Team Location\n* Marketing + Events\n* At least partial say in key executive hiring decisions\n\n### 3. Minority Decentralized Ownership (Social Tokens)\n\nThis model is where the team will create social tokens for fans to hold. These tokens will likely provide holders with benefits via digital goods (NFTs), special player + event access, and more. We anticipate that big market teams will not extend ownership or revenue sharing (see [Royal](https://royal.io/) for what 3LAU is doing in music), whereas small market teams may innovate more here to collect a digital + worldwide fanbase. In this model, it is unlikely fans will have any governance on team operations + strategy.\n\n### Recommendation\n\nWe believe #3 will be the end-game for every sports franchise as web3 grows. KH’s responsibility is to not settle for this, and use technology + enthusiasm to think bigger.\n\nOur recommendation is to go with approach #2 as we anticipate the NBA will not be favorable to giving majority ownership to any faceless DAO/corporation in the near or medium term regardless of $$ offer. We believe small market teams that have been bottom dwellers and who struggle for fan enthusiasm, specifically Memphis, NOLA, Minnesota, Sacramento, and others, are ones who should be targeted.\n\nOur approach should be to accentuate the franchise as the NBA’s first metaverse native team. It’ll be the team of the internet, NFT & memes galores, token drops, discord rooms, community managers, etc - the best that web3 + the metaverse to offer.\n\n# WHY NOW\n\nBlockchain technology unlocks new types of ownership, specifically decentralized ownership. This technology is a prerequisite for fans to own their favorite team & we’ve finally built out enough of the infrastructure to apply this to sport ownership.\n\nIt’s not just blockchain technology that makes this timing finally here. Team ownership requires coordinating large groups of anonymous people in an efficient manner. The technology & the platforms to do this are finally here.\n\nThis is our moment.\n\nWe are entering a new age of ownership & governance. In today’s ownership economy, attention is dominated by where we put our dollars. Teams that are able to drive the largest share of attention, drive the largest shares of valuations. Teams that embrace decentralized ownership tap into a previously untapped source of new attention — and subsequently an untapped source of driving up the value of the team.\n\nBut would the NBA allow something like this?\n\n10 years ago? Probably not — but today’s NBA is changing. Recently, the NBA has made the first step to embrace ownership by granting institutional investors the right to purchase minority equity stakes in teams. Dyal Capital, through the HomeCourt Fund, is the first of several financial offerings which serve as a vehicle for regular public investors to purchase shares in a team. In the summer of 2021, [Dyal closed a 5% acquisition of the Phoenix Suns](https://pitchbook.com/news/articles/dyal-capital-phoenix-suns-private-equity) and plans on capturing additional shares in other teams. By design, financial products are driven to be operationally lean and prefer not to take on any team governance as that would be management overhead.\n\nKrause House changes this.\n\nKrause House’s vision is to enable fans to become owners with governance to give them a seat at the table on team decisions. By unifying the Krause House under a social token, members can be sure that the team is in fact, their team. When passion is tightly coupled with property, the league will unlock true prosperity.\n\nOur idea is inevitable. A professional sport team will be owned by a decentralized organization in the next 10 years. We believe it will be Krause House.\n\nTime is of the essence. The first sport and team to move into this white space will reap first mover advantages by unlocking network effects through social ownership. The compounding effects of social ownership create a path to capture the maximum value available in the market. Other teams may continue their traditional approach to governance but with each action they take some fans will be unhappy and eventually they may feel disenfranchised and leave. DAOs provide an alternative that welcomes all fan voices to be heard and elevates the best ideas to action.\n\n![](https://images.mirror-media.xyz/publication-images/81e83229-a45e-469f-939c-1a86fb750356.png?height=851&width=1447)\n\n# DAOs\n\nA ‘Decentralized Autonomous Organization’, better known as a DAO, self organizes to accomplish a grand mission. Members of the DAO collectively decide on what they’ll do and how to get there. In contrast to traditionally geographically concentrated groups of individuals, anyone with an internet connection can contribute to a DAO. This approach grants a huge improvement in collective resources. The Krause House will leverage blockchain coordination to transparently manage the objectives of the ownership pool, enabling collective decision making in place of a single owner (or small ownership group).\n\nIn order for an action to be made, some form of majority or reputation would need to vote in its favor. All votes would be held on an open ledger so that members can have confidence that the will of the majority is always carried forward. The DAO will benefit from [Liquid Democracy](https://en.wikipedia.org/wiki/Liquid_democracy) vote delegation where a member can assign their votes to other members. In this case, votes are transitive so if A assigns B and B assigns C then C determines A and B’s vote. This method allows owners to delegate certain governance decisions to specialists who hold domain knowledge about a particular topic such as scouting or community relations.\n\n# GOVERNANCE\n\nWhile institutional funds look to avoid team governance, a DAO excels at making governance efficient. The Krause House has the self awareness to recognize that massive collective ownership expands a team’s fanbase. In an NBA where revenue potential is dictated by geographic regions, a small market (sub 2 million residents) struggles to compete with a large market team with a population of 7 to 20 million. Imagine if ‘small market team X’ could quadruple its fanbase by offering fractions of ownership through a global DAO. While the original owner has reduced their stake in the team, the newly realized fanbase expands the market and brand value leading to the creation of a much more valuable asset. Simply stated, DAOs expand the size of the pie far beyond any dilution which occurred.\n\nAs existing ownership stands to greatly profit by working with a DAO, the value exchange must be fair. The Krause House will never act as a silent partner. As shareholders, we expect a vote in all affairs that matter from a fan’s perspective. It’d be currently infeasible to orchestrate individual roster moves but voting on a General Manager and defining principles or strategies for success is feasible. Weighing in on large decisions like extending a max contract extensions are opportunities for direct democratic input.\n\nIn a traditional organization, decisions are made in a top down fashion and occasionally a small sample set of customers are surveyed to see how the product is resonating (a slow and imperfect process). In a DAO, the customers are empowered owners that deliver the product they want. This is instant product-market fit and a primary reason why DAOs are today’s [fastest growing companies](https://open-orgs.info/). By opening up governance, a team will access a wider knowledge base and ultimately reach the best solution.\n\nThroughout the NBA, owners are known as hyper competitive in the game of business. But making decisions can come at the cost of alienating or destroying a portion of their market. The owner who leans into decentralized governance will operate with a new found confidence that they are now always aligned with fans. The reward for this new efficient business model is unlocked when they activate a new massive global market.\n\n# TEAM REVENUE POTENTIAL\n\nTeams activating fractional ownership stand to benefit in three ways:\n\n1. Market Expansion: An expanded fanbase will drive demand for existing products and services.\n2. Revenue Diversification: The new fanbase will be interested in new Web 3 product offerings like NFTs and virtual experiences.\n3. Valuation: As revenues rise and team tokens are traded, the franchise valuation should increase faster than any other team in the Association.\n\nThe following graphic illustrates the opportunity for small markets to merge with a DAO\n\n![](https://lh4.googleusercontent.com/v-_8O6jGhJ0IrYPDAP6WLJiOcyD6P6qkf5I2pFZXD3GlSN9uRqw4SaFooiXO0zbNytE6uZ2sWoJeUEItjk5HbfKPAHp1C8HWllBf1UAbD9J2Q084zlha1AHqxXkMy0-OGoXd9tlw=s0)\n\n# INVESTOR ALPHA\n\nAn NBA team is a value investment with characteristics of an exceptional store of value:\n\n### Durability:\n\nTeams have retained value over decades.\n\n### Scarcity:\n\nThe Association controls supply by preventing issuance of new teams unless it is to the benefit of all incumbents. There’s a zero percent chance that more teams are created to the detriment of league-wide valuations.\n\n### Value Retention:\n\nTeam prices have appreciated faster than inflation.\n\n### Upside Potential:\n\nOver the past 30 years, team valuations have performed better than the Dow and are comparable to high growth tech companies.\n\n### Legacy:\n\nAs a parent looking to pass on wealth, rather than saving into a 401(k), purchasing gold or an expensive watch, one could purchase shares in a team with the intention of keeping it in the family for future generations.\n\n### Community:\n\nTeams are cultural epicenters that you can experience collectively and form lifelong relationships around.\n\nWhile NBA teams are a strong store of value, they offer an additional benefit to investors. As team prices are not correlated to any traditional investment, they are an ideal hedge against downward market forces. As cryptocurrency investments are exposed to extreme volatility, holding an asset in crypto that is as uncorrelated as possible to the market is a perfect asset to diversify one’s portfolio.\n\n# REGULATORY PATH\n\nKrause House intends to offer various products with the ultimate goal of acquiring ownership of an NBA franchise. Some products will pass the [Howey Test](https://www.manhattanstreetcapital.com/faq/for-fundraisers/how-determine-if-token-security-howey-test) and others will fail. As a result, Krause House will have numerous regulatory efforts but the net result is what we desire.\n\nKrause House will issue $KRAUSE Tokens and launch projects and/or services like NFTs to support the DAO. All capital assets will be held in treasury and uses of the fund will require a winning vote by the DAO. All financial actions here will pass the Howey test as tokens compel the DAO members into action.\n\n![](https://images.mirror-media.xyz/publication-images/860f61fb-41f4-42ff-ad6c-f49cdbc92521.png?height=879&width=1916)\n\nBeyond the DAO, Krause House will create a second holding company where the future NBA minority stake will be housed. This entity will hold a Security Token Offering (STO) which allows for raising funds and blockchain verification of ownership. This funding model requires extensive SEC regulation oversight.\n\nThe cleanest option to acquire an NBA team stake with the intention of distributing fractional shares is to start a SPAC. SPACs are Special Purpose Acquisition Companies that are created to raise capital through an IPO to acquire shares of private companies, taking them public through a merger.\n\nSPACs usually raise the initial funds from Sponsors who are institutional investors (SEC Regulation D filing). At this point, the stock value is based on cash-on-hand and belief in the management team. The SPAC then merges with the acquisition target and the stock price adjusts upwards with a real business to value the offering with.\n\nDepending on negotiations with the NBA and team owners, a SPAC sponsor may not be required. A team could approve of the minority sale event and access liquidity directly from individuals. As the funding event doesn’t require institutional capital and sponsors to backstop the deal, we could offer team shares to the public without market makers or costly promoters.\n\nShares will be listed on over the counter (OTC) exchanges that support blockchain tokens. Team tokens will not be distributed on NYSE or NASDAQ as those platforms do not support tokens with governance rights for on-chain voting and permissions. OTCs are growing in popularity with exchanges such as Coinbase, FTX, Uniswap, Kraken and countless others.\n\n### Here’s One Path to Acquire a Minority Team Stake\n\n1. Register a C corp in Delaware and house the Krause House DAO inside\n2. Offer NFTs and sell $KRAUSE tokens for the treasury\n3. Form a SPAC, file an S-1 with the SEC\n4. Find an NBA asset to acquire and present it to the DAO\n5. Launch a Security Token Offering\n6. De-SPAC and merge with the acquired NBA entity\n7. List the minority team stake as it’s own company across OTC exchanges\n\n# CONCLUSION\n\nFan ownership & governance powered by Web 3 is the future. The financial benefits are positive for all parties but more importantly, an NBA team will benefit from the participation of the fan owner to deliver the perfect product desired by the market.\n\nAs the NBA has begun allowing traditional investment firms to purchase shares it’s important that the Association isn’t trapped under old structures. To bring the game to the globe and maximize the potential for basketball to bring the world together, there is no better partner than a DAO.", "timestamp": 1630675979, "digest": "uLSxAa96TUOzcGo4JKh3sK-tR6y1cLEN6R4iWPuL7P4", "contributor": "0x6B6AdA1452e22BBd5764eFA67A105Cc20Ae875D2"}
{"id": "2E6H6jywKh81Xzeo4_zdelsWmtnMIEqN5ql8Z-qCYfA", "title": "Start Here", "body": "Welcome 👋\n\nMy name is Patrick Rivera and I'm a software engineer, writer, and investor. I currently work at [Mirror](https://mirror.xyz), a crypto protocol helping creators and communities build businesses. It's like if Kickstarter, Patreon, and Substack had a crypto baby. That's Mirror.\n\nOver the past few months, we've shipped:\n\n* [A decentralized publishing protocol](https://dev.mirror.xyz/J1RD6UQQbdmpCoXvWnuGIfe7WmrbVRdff5EqegO1RjI)\n* [Tokenized crowdfunding](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n* [NFT auctions](https://dev.mirror.xyz/_OstP6dwYsX-0YsIaGDw-W4fs3VzESC_QpxrhiyM_Bg)\n* [NFT editions](https://dev.mirror.xyz/AOoIsKPfZvf8LACKWp7gj_mg1ICCDOfPnVBOsDQoXo8)\n* [On-chain revenue splits](https://dev.mirror.xyz/V_7Jp1hy_g8bz-J1B4Wb5KYSmj5Lt4W7q7cw0noxJsU)\n* [A tokenized referral program](https://mirror.xyz/race)\n\nWe've worked with [filmmakers](https://ethereumfilm.mirror.xyz/3SV8gLXHIW8Ot45h3RL7aOgDINxN2hjLfFVOvyatB2A), [writers](writers.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg), [open source projects](https://stateful.mirror.xyz/rsUhYxXARr7j2iDjqJeelY7nc6CN_Y-MilVDP1S5voA), [musicians](https://songcamp.mirror.xyz/mkb-m9GWUCLByETAvCigJ0JIpz4XH8bwNDBtUJBPeFc), [e-sports teams](https://blvkhvnd.mirror.xyz/crowdfunds/0x320d83769Eb64096Ea74B686Eb586E197997f930), [grant giving DAOs](https://club.mirror.xyz/dnN3Dwe-iD6jBpzkase4YLHTxYtnuFnmUbSoOfPEkjI), [party DAOs](https://d.mirror.xyz/FLqkPA3iN4x-p97UhfhWwaCx8rBmVo-1yttY20oaob4), and more.\n\nPreviously, I was a growth engineer at [Instacart](https://instacart.com) and a lead growth engineer at a DeFi startup called [Dharma](https://dharma.io).\n\nIn my free time, I write about the intersection of crypto, creators, and communities.\n\nHere are some of my most popular posts:\n\n* [A Presentation on Crypto Fundamentals and NFTs](https://docs.google.com/presentation/d/1sUpk0gbvRQelH0MUIOqjNeGe8nwRH4mhrhDHmI6qh4M/edit?usp=sharing)\n* [Come for the Creator, Stay for the Economy](https://p.mirror.xyz/1EpvJwUpx_KlRcHOKLNqADEkwHL_Z1ZYKobF2uLwgBg)\n* [Community DAOs](https://p.mirror.xyz/cVN3KOss0uqpZwxHQKtC4Syvn1RfXaxofFKHJuKLWS4)\n* [Designing Internet-Native Economies: A Guide to Crypto Tokens](https://future.a16z.com/a-taxonomy-of-tokens-distinctions-with-a-difference/) (A16Z Future)\n* [Tips for Creators Getting Into Crypto](https://p.mirror.xyz/WQQywdjjfnksMRPMaNKBMxPBqfE5k8nL6pCLe1roGyw)\n* [Crypto-native Newsletter Businesses](https://p.mirror.xyz/CQnk9PLrBAUskCTCHiA5fA9SBDFZGEfCitVH343FWkY)\n* [The Emerging Internet Renaissance](https://pwa.mirror.xyz/BoEyMiW_B2DoUZlFNKdfXRn59goHfrsPwvdM8KiLhb4) (an interview done by a friend)\n* [Internet Renaissance Vibez](https://p.mirror.xyz/pl07RMWdJZktHUAn8hZ02YlO35-Ju49orPrhaRnn4Vo)\n\nI'm also a member of a few DAOs like [FingerprintsDAO](https://twitter.com/FingerprintsDAO), [Seed Club](https://twitter.com/seedclubhq), and [Friends With Benefits](https://twitter.com/FWBtweets), among others.\n\nThese DAOs focus on things like helping creators and communities launch social tokens, collect rare NFTs of on-chain generative art, build custom smart contracts and tools for artists, and more.\n\nI think DAOs like these are going to become some of the most influential online communities over the next decade as they amass billion dollar treasuries / market caps and serve as incubators for the best engineers, artists, and builders in the space. I wrote about this [here](https://p.mirror.xyz/cVN3KOss0uqpZwxHQKtC4Syvn1RfXaxofFKHJuKLWS4).\n\nIf you want to get in touch, say hi on [Twitter](https://twitter.com/patrickxrivera) or email me at patrick.x.rivera@gmail.com.\n\nI publish a deep dive essay every now and then so subscribe below to get it right in your inbox.\n\nThanks for reading :\\~)\n\nOther links:\n\n* [NFT collection](https://gallery.so/patrickxrivera)\n* [IG](https://instagram.com/patrickxrivera)", "timestamp": 1630681332, "digest": "aKg6UJL7ngyKbmScJ4YbV4bYzjsrWJxLODyU9Rfr0g0", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "_H6PRGqHJqQxeL0LqCy4ivG5-vtaQ1xiDvjKotUuBxI", "title": "Tutorial: How to Purchase an NFT on OpenSea", "body": "Today, we’re teaching you how to participate in one of the most fun + important areas of crypto culture: **purchasing a non-fungible token (NFT) on [Opensea](https://opensea.io/)**.\n\nGet rewarded for researching and buying an NFT. Sounds like a win-win.\n\n## What you will need for this Quest:\n\n* ETH to purchase the NFT and cover gas fees\n* MetaMask wallet (or another web3 wallet)\n\nThis guide assumes you understand how to use a MetaMask wallet. If not, you should watch [this video](https://youtu.be/Af_lQ1zUnoM), set up your MetaMask wallet, and add funds to your wallet before moving forward.\n\n## What is OpenSea?\n\n![OpenSea Homepage](https://images.mirror-media.xyz/publication-images/561a8c7a-a2e9-40e6-9fd8-7733f70a3a58.png?height=612&width=1370)\n\n[OpenSea](https://opensea.io/) is a peer-to-peer marketplace for NFTs – showcasing everything from digital collectibles and art to virtual land and utility tokens.\n\nThink of OpenSea as the eBay of NFTs, where you can bid on an NFT auction, mint and sell your own NFT, or explore the wild west of non-fungibles. OpenSea is where most NFT collectors go to discover and invest in almost any project.\n\n## How to Purchase an NFT on Opensea\n\n### Step 1: Choose your NFT on OpenSea.\n\nGo to [OpenSea](https://opensea.io/) and choose which NFT you want to buy. It’s probably smart to do some research on what NFT you want to buy beforehand.\n\nFor the purposes of this tutorial, simply **choose an NFT on OpenSea that you love** and would be happy holding on to for the long term (>1 year).\n\n***Note***\\*: you may need to pay additional gas fees if it’s your first time purchasing an NFT on OpenSea.\\*\n\n### Step 2: Click “Buy Now” or “Place Bid”\n\n![](https://images.mirror-media.xyz/publication-images/51eadec6-49cc-43f6-b5e2-e9f098b62fce.png?height=145&width=586)\n\nSome NFTs are on auction while others can be bought right away. For this tutorial, we will buy an NFT that is ready for immediate purchase.\n\nClick “**Buy Now**” and agree to OpenSea’s Terms of Service.\n\n### Step 3: Agree to OpenSea’s Terms of Service and Checkout.\n\n![](https://images.mirror-media.xyz/publication-images/e4b65df0-0778-4bbb-ae5d-4bb536d52701.png?height=146&width=502)\n\nOnce you check the box, and click “Checkout\", you will be prompted to pay ETH gas fees for your NFT (**tip**: buy NFTs on weekend nights for more affordable gas prices and use this [gas tracker](https://ethgasstation.info/)). Set the gas fee, and confirm your NFT purchase.\n\n### Step 4: Wait for confirmation.\n\nNow you wait for the transaction to confirm! Depending how much gas you used, it could take up to 30 minutes or longer for the payment to confirm.\n\nOnce confirmed, your NFT will show up in your wallet and displayed on your OpenSea profile for the world to see.\n\n### That’s all you need!\n\nCongratulations on buying an NFT on OpenSea!\n\nPlease let me ([@JonahBaer](https://twitter.com/JonahBaer)) know if this tutorial was helpful or if you have any questions whatsoever on Twitter.", "timestamp": 1630730870, "digest": "dfa2UZuSHQTuhU9fX6ISd9kexLWb1yLYviLr3bAwCXk", "contributor": "0xF69EFCc2dECE59Fbc75B23aE75f51DD7Be3bb1E1"}
{"id": "ukIOXnQRjivhFIjVafmH2K-zTdcRVHf6p-ptkxRIjrs", "title": "Tutorial: How to Purchase an NFT on OpenSea", "body": "Today, we’re teaching you how to participate in one of the most fun + important areas of crypto culture: **purchasing a non-fungible token (NFT) on [Opensea](https://opensea.io/)**.\n\nGet rewarded for researching and buying an NFT. Sounds like a win-win.\n\n## What you will need for this Quest:\n\n* ETH to purchase the NFT and cover gas fees\n* MetaMask wallet (or another web3 wallet)\n\nThis guide assumes you understand how to use a MetaMask wallet. If not, you should watch [this video](https://youtu.be/Af_lQ1zUnoM), set up your MetaMask wallet, and add funds to your wallet before moving forward.\n\n## What is OpenSea?\n\n![OpenSea Homepage](https://images.mirror-media.xyz/publication-images/561a8c7a-a2e9-40e6-9fd8-7733f70a3a58.png?height=612&width=1370)\n\n[OpenSea](https://opensea.io/) is a peer-to-peer marketplace for NFTs – showcasing everything from digital collectibles and art to virtual land and utility tokens.\n\nThink of OpenSea as the eBay of NFTs, where you can bid on an NFT auction, mint and sell your own NFT, or explore the wild west of non-fungibles. OpenSea is where most NFT collectors go to discover and invest in almost any project.\n\n## How to Purchase an NFT on Opensea\n\n### Step 1: Choose your NFT on OpenSea.\n\nGo to [OpenSea](https://opensea.io/) and choose which NFT you want to buy. It’s probably smart to do some research on what NFT you want to buy beforehand.\n\nFor the purposes of this tutorial, simply **choose an NFT on OpenSea that you love** and would be happy holding on to for the long term (>1 year).\n\n***Note***\\*: you may need to pay additional gas fees if it’s your first time purchasing an NFT on OpenSea.\\*\n\n### Step 2: Click “Buy Now” or “Place Bid”\n\n![](https://images.mirror-media.xyz/publication-images/51eadec6-49cc-43f6-b5e2-e9f098b62fce.png?height=145&width=586)\n\nSome NFTs are on auction while others can be bought right away. For this tutorial, we will buy an NFT that is ready for immediate purchase.\n\nClick “**Buy Now**” and agree to OpenSea’s Terms of Service.\n\n### Step 3: Agree to OpenSea’s Terms of Service and Checkout.\n\n![](https://images.mirror-media.xyz/publication-images/e4b65df0-0778-4bbb-ae5d-4bb536d52701.png?height=146&width=502)\n\nOnce you check the box, and click “Checkout\", you will be prompted to pay ETH gas fees for your NFT (**tip**: buy NFTs on weekend nights for more affordable gas prices and use this [gas tracker](https://ethgasstation.info/)). Set the gas fee, and confirm your NFT purchase.\n\n### Step 4: Wait for confirmation.\n\nNow you wait for the transaction to confirm! Depending how much gas you used, it could take up to 30 minutes or longer for the payment to confirm.\n\nOnce confirmed, your NFT will show up in your wallet and displayed on your OpenSea profile for the world to see.\n\n### That’s all you need!\n\nCongratulations on buying an NFT on OpenSea!\n\nPlease let me ([@JonahBaer](https://twitter.com/JonahBaer)) know if this tutorial was helpful or if you have any questions whatsoever on Twitter.", "timestamp": 1630730858, "digest": "dfa2UZuSHQTuhU9fX6ISd9kexLWb1yLYviLr3bAwCXk", "contributor": "0xF69EFCc2dECE59Fbc75B23aE75f51DD7Be3bb1E1"}
