{"id": "ZR5Rq1pV_lBmsdRD8VLkCPUGQXWUL3iz-2wHfHwWH4w", "title": "The Sheep Gave Birth and Other News from the Farm", "body": "There is often more power in “knowing how” rather than “knowing that.” The markers used to navigate a river are indeterminate in order to be practical. … The aim is to offer not solutions, but rather mechanisms for generating solutions.\n\nGood art should elicit the response of “Huh?” and then “Wow!” As opposed to “Wow!” And then “Huh?” Whenever I feel an instant “Wow!” I always question when the “Huh?” is going to come. I always think this is a good tool to use when I’m trying to digest something new.\n\n[Testing link](https://jktest.mirror.new/B32AHYVIlCf20jjOc7ebm3dv1W7KIBjdw9JB93z3gKY)\n\nA little more text.\n\n[NFT](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)", "timestamp": 1613603106, "digest": "15fxkJ1z0Xm-juCU8llFrTIr430-E7ekcx9Ya0L6Irs", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "pSnXa5C6gHLHG0iYL3tdrPt0wgMjcl06eHjZ7lcyzcQ", "title": "Flashbots: Frontrunning the MEV Crisis", "body": "Flashbots is a research and development organization formed to mitigate the negative externalities and existential risks posed by miner-extractable value (MEV) to smart-contract blockchains. We propose a permissionless, transparent, and fair ecosystem for MEV extraction to reinforce the Ethereum ideals.\n\n> In this article, we cover the context and motivation for this project. Technical details of our proposed solution can be found on the [ETHResearch forum](https://ethresear.ch/t/flashbots-frontrunning-the-mev-crisis/8251).\n\n![](https://images.mirror-media.xyz/publication-images/eb469f15-3031-4af2-b9aa-9d364a6fb3d3.jpeg?height=1040&width=2084)\n\n## What is MEV\n[Miner extractable value (MEV)](https://arxiv.org/abs/1904.05234) is a measure devised to study consensus security by modeling the profit a miner (or validator, sequencer, or other privileged protocol actor) can make through their ability to arbitrarily include, exclude, or re-order transactions from the blocks they produce. MEV includes both 'conventional' profits from transaction fees and block rewards, and 'unconventional' profits from transaction reordering, transaction insertion, and transaction censorship within the block a miner is producing.\n\nThe term MEV can be misleading as one would assume it is miners who are extracting this value. In reality, the MEV present on Ethereum today is predominantly captured by DeFi traders through structural arbitrage trading strategies; miners indirectly profit from these traders' transaction fees. One example of such structural arbitrage opportunities are Uniswap price arbitrage trades: when a Uniswap pool's assets become mispriced, a profit opportunity is created to arbitrage the Uniswap pool back to parity with other trading venues. Of course, rather than letting the trader pay them a transaction fee for the privilege of collecting the arb profit, a miner could simply decide to run this strategy themselves.\n\n## The MEV Crisis\nTransactors on Ethereum express their willingness to pay for inclusion in a block through their transaction's gas price, and therefore through the transaction fee they indicate they are willing to pay miners. Miners, as economically rational actors, pick the transactions with the highest gas price and order them by gas spend in the block they are producing. The financial system being built on Ethereum creates many 'pure' profit opportunities such as liquidations and arbitrages of many kinds. However, these opportunities are finite and episodic, and as such, traders compete to claim them. Right now, this competition is primarily expressed either via frontrunning, or via backrunning:\n\n> Frontrunning (also known as [Priority Gas Auctions](https://arxiv.org/pdf/1904.05234.pdf) (PGAs)): Transaction A is broadcasted with a **higher** gas price than an already pending transaction B so that A gets mined **before** B. (eg. to snatch a Uniswap price arbitrage trade to rebalance a pool).\n\n> [Backrunning](https://github.com/ethereum/go-ethereum/issues/21350): Transaction A is broadcasted with a **slightly lower** gas price than already pending transaction B so that A gets mined **right after** B in the same block. (eg. to execute a DyDx liquidation after a price oracle update that triggers a DyDx loan to go under the required collateralization ratio).\n\nUnfortunately, both frontrunning and backrunning are inefficient and lead to negative externalities such as network congestion (i.e. p2p network load) and chain congestion (i.e. blockspace usage). In addition, this competition for MEV opportunities leads to Ethereum consensus security instability due to the creation of incentives for [time-bandit attacks](https://arxiv.org/pdf/1904.05234.pdf) and permissioned communication infrastructure between traders and miners. Such an infrastructure erodes the neutrality, transparency, decentralization, and permissionlessness of Ethereum today.\n\nWhile none of these existential risks and negative externalities are new, we find ourselves at a critical junction between alternative futures for Ethereum. A series of events in the past 6 months have lead usage of the network to reach a tipping point:\n- **Steadily increasing contract interactions** (ie. there are more complex transactions on Ethereum than before which increases the absolute amount of MEV up for grabs.)\n- **Token market cap exceeding ETH market cap** (ie. MEV revenue in ERC-20 tokens is starting to compete with regular transaction fees paid in ETH.)\n- **Transaction fees exceeding block rewards** (ie. transaction fees have reached unprecedented levels partly due to traders pushing the gas prices up when competing for trading opportunities. It is a clue that MEV-related revenue may surpass block reward for miners.)\n- **Adoption of generalized frontrunners** (ie. an indicator of increased sophistication in MEV extraction.)\n- **Adoption of permissioned mempools** (ie. another indicator of such sophistication)\n\nThese events indicate an accelerating trend towards the foretold existential risks and negative externalities.\n\n## Frontrunning the MEV crisis\n> Enter Flashbots\n\nFlashbots is a research and development organization formed to mitigate the negative externalities and existential risks posed by MEV to smart-contract blockchains. We propose a permissionless, transparent, and fair ecosystem for MEV extraction to preserve the ideals of Ethereum.\n\nOur approach to mitigating the MEV crisis can be broken down into three parts: Illuminate the Dark Forest, Democratize Extraction, and Distribute Benefits. We believe each part is necessary for Flashbots to succeed.\n\n### Illuminate the [Dark Forest](https://medium.com/@danrobinson/ethereum-is-a-dark-forest-ecc5f0505dff)\nMEV is currently opaque to users of Ethereum. It requires significant data analysis and in-depth knowledge of smart contracts to understand as it involves transactions with complex, sometimes obfuscated, logic and adversarial games played on several meta-levels (users, traders, generalized frontrunners, miners).\n\nAs more and more security-critical infrastructure moves off-chain, and as chain state and size grows, this problem will only get worse and it will become increasingly difficult to leverage one of the original promises of cryptocurrency: transparency. By Illuminating the Dark Forest, we aim to preserve this original promise. More practically, we aim to allow for the objective assessment of the negative externalities of the MEV crisis and the impact of Flashbots technologies, and for the quantification of user harm caused by MEV extraction in order to provide tooling for builders to reduce their dApp's surface for MEV extraction.\n\n> Our first step to Illuminate the Dark Forest is quantifying its impact. We've built MEV-Inspect for this purpose. It scans Ethereum blocks and enables visualization of MEV metrics over time. We use it to better understand the MEV ecosystem and provide it to the community in an attempt to annihilate information asymmetry.\n\n### Democratize Extraction\nMEV Extraction could likely go in a direction where it is centralized to a few players, for instance by being limited to permissioned dark transaction pools that have access to significant hashrate, or through unilateral off-chain deals between large traders and miners.\n\nThis power and capital centralization is a key point of security weakness, and erodes core properties of Ethereum: namely permissionlessness and decentralization. We believe that without the adoption of neutral, public, open-source infrastructure for permissionless MEV extraction, MEV risks becoming an insiders' game. By Democratizing MEV Extraction, we aim to ensure both small and large participants have equal access to low-level financial primitives and that core Ethereum properties are preserved.\n\n> MEV-Geth is our initial effort to Democratize Extraction. It is an upgrade to the go-ethereum client to enable a sealed-bid block space auction mechanism for communicating transaction order preference. Fundamentally, MEV-Geth creates a more efficient communication channel for miners and traders bidding for inclusion of their transactions. While the proof of concept of MEV-Geth has incomplete trust guarantees, we believe it is a significant improvement over the status quo. The adoption of MEV-Geth should relieve a lot of the network and chain congestion caused by frontrunning and backrunning bots.\n\n### Distribute Benefits\nMEV involves the entire Ethereum ecosystem, from miners, traders, DeFi developers, and, most importantly, Ethereum users. Our preliminary research shows MEV extraction currently disproportionately benefits traders and miners. As MEV extraction continues to grow in scale, we anticipate there will be a need for ~some~ value redistribution towards users and towards system stability.\n\nWe believe it is essential for Flashbots and the community working alongside us to be thoughtful and deliberate about value redistribution in order to maximize social good. This is particularly true given the aforementioned dangerous economic incentives inherent to MEV which cause existential risks. Not only do we want to mitigate such risks, but also believe it is our responsibility to replace them with virtuous economic cycles that will reinforce Ethereum's core value proposal by aligning incentives around MEV for all system participants.\n\n## Our Public Commitments\nFlashbots arose from the MEV Pi-Rate Ship, a neutral, chain-agnostic, interdisciplinary research collective that supports MEV-related theoretical and empirical research. As an open research organization, we commit today and in the future, to:\n- Preserving the core values of Ethereum in what we create, i.e. openness, permisionlessness, decentralization, against the coming MEV crisis.\n- Making our research and core Flashbots infrastructure code open source for any community member to contribute to and benefit from.\n- Creating sustainable alignment across key actors of the ecosystem by taking into account the needs of users, miners, developers, node operators, public infrastructure operators and developers, contract/dapp devs, and ecosystem researchers.\n- Contributing to open-ended ethical research questions in the MEV space, 100% in the public domain.\n\nIt is our deeply held belief as both an organization and as the individuals involved that decentralized finance is at a critical crossroads. The substantial amount of value on the table from manipulating user transactions could serve as a centralizing force, damaging to consensus stability, and harmful to users of any system where such manipulation is valuable. MEV could grow to benefit a few at the expense of many, at the expense of the value of cryptocurrency itself.\n\nOr, this value could stand to benefit all users, enhancing the security of a new generation of financial infrastructure that avoids the mistakes of its structurally unfair predecessors. By bringing MEV extraction and tooling into the open, by funding public research to answer open questions around MEV, and by using our organizational capital to align the incentives of all ecosystem participants, it is this new generation of fair infrastructure we aim to lay the foundations for.\n\nThis is a call to action. We can't wait to have you join us.\n\n\n---\n\n## Learn more\n> **Review our technical proposal on ETHResearch.**\n> We discuss the details of the Flashbots organization, our research roadmap, and the technical details of the initial projects, MEV-Inspect and MEV-Geth on the [ETHResearch forum](https://ethresear.ch/t/flashbots-frontrunning-the-mev-crisis/8251).\n\n> **Subscribe to the MEV Ship Calendar.**\n> You can follow the latest Flashbots updates and events by subscribing to our [MEV Ship Calendar](https://calendar.google.com/calendar/u/0/embed?src=c_7lurqn12ecl64li0ms3kse5vok@group.calendar.google.com): join us on our semi-monthly community call \"MEV Ship Treasure Map Roast\", semi-weekly core dev call, for our weekly research workshop, and for the upcoming unconference: MEV.wtf\n\n> **Engage with us.**\n> Join the Flashbots community on [Discord](https://discord.gg/7hvTycdNcK) or contact us at info@flashbots.net\n\nFlashbots is stewarded by Scott Bigelow, Phil Daian, Stephane Gosselin, Alex Obadia, and Tina Zhen. We exist thanks to the continued support of members of the MEV Pi-Rate Ship and Paradigm.\n\nSpecial thanks to Andrei Anisimov, Ivan Bogatyy, Vaibhav Chellani, Brock Elmore, Georgios Konstantopoulos, Jason Paryani, Alejo Salles, samczsun, Austin Williams for their contributions on MEV-Geth and MEV-Inspect, and Sunny Aggarwal, Surya Bakshi, Phillippe Castonguay, Tarun Chitra, Dan Elitzer, Lev Livnev, Charlie Noyes, Dev Ojha, Dan Robinson, Mark Tyneway, and Micah Zoltu for their feedback on MEV-research.", "timestamp": 1613603468, "digest": "pPlG0MkbNx-rZhNlAhCf8v52jTRlJNupE3w_JKOd0ec", "contributor": "0x777B0884f97Fd361c55e472530272Be61cEb87c8"}
{"id": "TsiVsS_FlFyFBYK3kFSKQvXZp9jD9MFNHOXTf4ggfE0", "title": "Formatting Design", "body": "[Crowdfund](crowdfund://0x517bab7661C315C63C6465EEd1b4248e6f7FE183)\n\nMirror has the ambitious vision of redefining publishing online by empowering writers with the tools offered by crypto. We are delighted to share that we've officially closed our first full-stack engineering sprint: the MVP of the Mirror blogging platform. This will allow us to onboard our first writers and serve as the foundation for all the functionality in the future.\n\n[Mirror’s first Tweet](https://twitter.com/viamirror/status/1325856116748726273)\n\n[a16z](https://a16z.com/)\n\nWe have a lot to figure out over the next few months and years—from discovering new crypto-native business models for creators to supporting basic things like embedding NFTs—but we knew that the starting point for the project was supporting a basic publishing experience—the ability to post text and share it with the world. \n\nThis post details our journey so far.\n\n![Season’s Greetings!](https://images.mirror-media.xyz/publication-images/bb9a61e1-f524-4135-bae5-91ddf7f0a1e9.jpeg?width=2560&height=1440)\n\n## The Starting Line\n\nOur first commit to the backend API was 29 days ago, on December 7, 2020 — my (Graeme's) first official day at Mirror. Denis had been speaking with [Trent](https://stateful.mirror.xyz/) about announcing his book on Mirror, and working with Jon-Kyle on designs and UI. We set an ambitious goal to have everything working for Trent by Christmas time — our gift to the world! 🎁 \n\n[Steve Reich, Come Out to Show Them](https://www.youtube.com/watch?v=ouYiTiiY3vg)\n\nTo ship the MVP, we needed to make crucial early technical decisions. Most importantly, how to create a world-class writing tool with a native web3 and crypto foundation.\n\n## How to Construct a Web3-Native Writing Platform\n\nOne of the first challenges was thinking through building the platform from a web3 perspective. Here are rules of the web3 game (*via negativa* style):\n\n1. Post content shall not be centralized\n2. The reading experience should not require trust in Mirror\n3. Mirror shall not own a writer's domain\n4. Writers do not need to connect their wallets and sign everything they write\n5. Mirror shall not attempt to store Ethereum private keys in the browser!\n6. Writing shall not be excessively expensive (for Mirror or writers)\n7. Bonus: No using email-password signup!\n\nThe architecture we came up with looks something like this:\n\n![](https://images.mirror-media.xyz/publication-images/4ad92c52-5226-40c1-b654-4bbfe905c278.jpeg)\n\nI will now briefly break down how we solved each of these problems.\n\n### 1. Post content shall not be centralized\n\nWe decided to use the **Arweave** data storage protocol to store user content. Arweave provides permanent storage of data for a one-time cost at upload time. The data posted to Arweave includes all of the information required to *retrieve* all entries for a publication (including any changes made), and to *verify* authorship authenticity. (We have plans to publish the protocol specification along with an open-source tool that can assist with this retrieval and verification process, so that it would be trivial to migrate off of Mirror if the time ever comes for that.)\n\n### 2. The reading experience should not require trust in Mirror\n\nAll entries are signed by a user's *signing key* (this is a non-Ethereum keypair that does not contain any direct economic value. I'll explain more on this later). The signature is then published to Arweave, along with the digest that was signed, and with the content that went into the digest. The *signing key* itself is put into a message that asserts authorship rights, which is then signed by the writer's Ethereum address. All of this information is stored on Arweave, along with the entry's content — for every entry and update. Therefore, it's possible (and fairly easy) for anyone to verify whether an entry was authored by a given Ethereum account.\n\nWe're still iterating on this model, and it's obviously very early. Consider us in the \"testnet\" phase of this (along with everything else you read in this post).\n\n### 3. Mirror shall not own a writer's domain\n\nWe use ENS to provide domain ownership to the writer, who claims this ownership by burning an invite token (called $WRITE; expect more information on this soon) during onboarding. The process involves interacting with the $WRITE ERC20 token contract, which grants approval to an ENS registrar contract to burn the token just before registering the ENS label.\n\n### 4. Writers do not need to connect their wallets and sign everything they write\n\nWe didn't want to make it cumbersome to have to write an Entry on Mirror — for example, needing to sign everything with their Ledger wallet (or Metamask). Particularly, because we imagine allowing users to take smaller and more frequent actions, too, like commenting on or liking someone else's entry. We still want to have superb security, but we deemed it to be dissuading if writers required their hardware wallet for writing.\n\n### 5. Mirror shall not attempt to store Ethereum private keys in the browser!\n\nIt's considered heresy to store a user's Ethereum private keys directly in the browser, and I would typically agree with that. It's not strictly true that you *couldn't* build a useful webapp this way (Dharma did it for a while), but the security burden will compound over time. This is mainly because there is no way to make and store a non-extractable Ethereum private key using the native web-crypto library; it doesn't support the same ECDSA curve. I don't know how this will play out in the future, but for now, I would say that this is something to avoid.\n\nWe avoid this security burden in two ways: \n\n1. By using a different signature scheme from the Ethereum implementation (we're using the NIST curve *P-256*), therefore making it impossible for the key to \"hold economic value\" at all, and sidestepping a major issue altogether. The worst case scenario, under the most severe threat model (e.g. a stolen computer), would be fraudulent authorship.\n2. By generating the key using the non-extractable property, and storing it in IndexDB. This means that there's no way to export the private key at all — the private key can only be used to sign content on the webpage in which it is loaded, and IndexDB prevents it from being loaded on any website outside of mirror.xyz.\n\nI invite criticism on this approach. I am not a cryptography expert, and we're just trying to make an honest effort at a secure and usable platform that lives outside of the conventional standards of web2 that have been failing us. If you want a more detailed explanation of the approach, you can refer to an [internal RFC](https://eng.mirror.xyz/1cywoB2BSXKRdJPA26NmH26AvuIbTJ0p8rYf7KaKktc) about this topic, which has now been posted on Mirror.\n\n### 6. Writing shall not be excessively expensive (for Mirror or writers)\n\nSolved by using Arweave! 🎉 Very cheap (at the moment?) — it's costing us about 0.00005 AR per blog post, which amounts to about $0.00015, at the current exchange rate.\n\n### 7. Bonus: No using email-password signup!\n\nSince we have signing keys and a signature-based authenticity model, we don't need to have login sessions, and we don't have anything to recover via email. In the future, it may be useful to allow for email notifications and email digests, but for now, it's interesting that there is no email confirmation required to use Mirror. This is the crypto-native way used by apps like Zerion and Zapper, and is the future of authentication on the web.\n\n(We make up for this lack of friction by adding a transaction confirmation in onboarding! 😂 But even that, we will smooth out over time.)\n\n## Pre-Mainnet Testing\n\nMirror is still in its early stages, and we are using the Ethereum testnet infrastructure to explore our ideas. This allows us to run through complex protocol flows (like burning tokens, deploying contract, and registering ENS domains) very cheaply and with fast confirmation times. In particular, we're still exploring what the *mechanics* of our economic, naming and ownership protocol will be, as demand grows for a more sophisticated system. We're hoping to deploy to mainnet as soon as we know that migrating our early writers to this better protocol will be feasible and easy.\n\n## Building a Backend API as a \"Protocol Gateway\"\n\nIn order to facilitate a good reading and writing experience, we decided to build a backend API that can act as a *gateway* between client and protocol. This allows us to do things like signature verification before publishing to Arweave, or to pay for the Arweave publication ourselves and cache the entry content for extremely fast response-times. This allows us to have a world-class writing and reading experience, while still achieving all of our goals of content decentralization.\n\nIn terms of building this backend API in 2021, there were probably 10+ viable options for where to deploy code and just as many promising languages for its development. Picking early tools can be difficult! I ended up choosing something that was strongly within my realm of competency, and would also be easy for new engineers on our team to learn. I also chose what I believe to be the path of greatest extensibility and flexibility into the future, which for us meant building our backend in **NodeJS on AWS infrastructure**. The decision was not obvious, however, and I wanted to take into account the competencies we would be building as an engineering order in time to come.\n\nSetting up web applications on AWS is much more time consuming than using an abstracted service like Heroku or Vercel. Things like environments, databases, security groups, and deployments all have to be configured up individually. In the long-run, though, it grants more control, and this can be helpful for crypto applications that sometimes had non-standard concerns. It took me about 2 days to set up this infrastructure — including security groups, IAM accounts, databases, staging and production environments, etc. But from here, I know that I have the world's best infrastructure behind us, without the platform risk of newer, less fully-featured services.\n\nWe use **Postgres via AWS's RDS service**, and VPC and security groups for communicating between **ElasticBeanstalk** and RDS. We used **GraphQL with Apollo** for our API endpoints.\n\nI'll note here that, for a while before committing to this path, I considered using writing the backend in Golang or Rust, and protobufs, since cryptographic signatures require strict typing for correct validation across platforms. But I know that development would have been *a lot slower* if we had gone this path. On the other hand, building a competency in Rust from the start would have allowed us to track the growing number of interesting layer-2 integrations (which seems promising).\n\nOur deployments are handled through **Github workflows**, such that every push to our *staging* or *main* triggers an action on Github that deploys the application. To be clear, there is a *lot* that still needs to be improved here — including blocking deploys on test suites passing, and measuring test coverage. We don't have full integration tests, e.g. against a built docker contains with exposed GraphQL endpoints.\n\n![The genesis entry](https://images.mirror-media.xyz/publication-images/7c3c118d-8dda-4f5d-9e80-6df764fd403c.jpeg)\n\n## Building a Frontend for Blogging\n\nWe decided to use Vercel and NextJS on the frontend, which has wildcard subdomain support, as well as support for statically rendered content. This has been great so far, because we get fast-loading, well-cached content that can be read easily by machines like social media platforms and search engines. It's also generally a fantastic product for managing staging environments, deployments, etc.\n\n## What went well?\n\nWe were able to get an MVP out *really* really quickly — we made a goal to ship before Christmas, and only started building the backend some ways into December. So overall, it took us mere weeks to build a novel CMS that uses public-private key signatures to verify content, stores data in Postgres, stores data on Arweave, burns a token on Ethereum to claim ownership of an ENS label, validates ownership of that label, iterations on our signing model, and so on. \n\nHere's a few specific examples of these things:\n\n1. The first blog post by Trent: [https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525)\n2. A transaction that burns a $WRITE token and claims an ENS domain: [https://rinkeby.etherscan.io/tx/0x29b9d13187a2db64b7d85f4ff5be739729b07404fd1f5fce79b3bba13da7530b](https://rinkeby.etherscan.io/tx/0x29b9d13187a2db64b7d85f4ff5be739729b07404fd1f5fce79b3bba13da7530b)\n3. An Arweave transaction that stores Linda's [post](https://linda.mirror.xyz/df649d61efb92c910464a4e74ae213c4cab150b9cbcc4b7fb6090fc77881a95d) forever, along with signatures that prove authorship: [https://viewblock.io/arweave/tx/WvwsHyKCjfkLoKNbNSGfoV-vaWrJa2PMYB_c3wucXUA](https://viewblock.io/arweave/tx/WvwsHyKCjfkLoKNbNSGfoV-vaWrJa2PMYB_c3wucXUA)\n\nIt's exhausting even to think back through the past month and everything we've been able to build out! And the fact that this is *basically working* is very fun and exciting. I'm glad that we also did a fair amount of this \"in public\" and have screen recording our on-boarding sessions.\n\n## What went wrong?\n\nBy tackling so many challenges at once, it sometimes felt like there were an overwhelming number of important issues that urgently needed to be patched. Sometimes, that made it difficult for me to communicate priorities in linear way, so that we were all on the same page and rationally working together on the same thing. Given that that team hadn't worked together before this project, and are just learning about each of our distinct work and communication styles, there was considerable \"under-communication\" that we need to improve on.\n\nThe fast pace also created some disorder. For example, late one Thursday I was configuring the Github Workflows to deploy our AWS EB environment, and it was working well in staging. We didn't deploy to production over the weekend, and during that time I updated production to a whole new AWS EB environment. Our first deploy on Monday shipped to the *outdated* environment, and a bug manifested right before an [onboarding session](https://www.youtube.com/watch?v=8e9Fcf0DiOE)! We had to roll-back to prevent live-streaming a failed onboarding, and it was very confusing! We wrote our first post-mortem for this.\n\n## What lessons were learned?\n\nWe learned that we can really push hard and work quickly to make an ambitious goal a reality within a short timeframe. I think we proved that by hitting the December 25th deadline.\n\nWe also learned a lot about each each and our competencies (there's only three of us), and how we need to communicate with each other to build more trust and confidence in how things are going. That includes over-communicating more about expectations and responsibilities over the codebase and product, outstanding issues, priorities, and individual goals for any given sprint.\n\nExpect more information on $WRITE soon.\n\nIn the meantime, you can read the first entries published on Mirror over the past few weeks:\n\n- [https://stateful.mirror.xyz/](https://stateful.mirror.xyz/) by [@trent_vanepps](https://twitter.com/trent_vanepps)\n- [http://amorfati.mirror.xyz/](http://amorfati.mirror.xyz/) by [@apruden08](https://twitter.com/apruden08)\n- [https://joonian.mirror.xyz/](https://joonian.mirror.xyz/) by [@joonian](https://twitter.com/joonian)\n- [https://helloshreyas.mirror.xyz/](https://helloshreyas.mirror.xyz/) by [@HelloShreyas](https://twitter.com/HelloShreyas)\n- [https://g.mirror.xyz/](https://g.mirror.xyz/) by [@strangechances](https://twitter.com/strangechances)\n- [https://d.mirror.xyz/](https://d.mirror.xyz/) by [@Iiterature](https://twitter.com/Iiterature)", "timestamp": 1613609535, "digest": "B32AHYVIlCf20jjOc7ebm3dv1W7KIBjdw9JB93z3gKY", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "eyO8Pz76xHA04MgSjqmpejUbfMjlQdSO-iNxmeutv_M", "title": "Crowdfund test", "body": "[Cooper](crowdfund://0x77b18B0a6D55562b604258c17E67ca533B3E928d?softCap=1&endsAt=1613754064?&network=rinkeby)", "timestamp": 1613610148, "digest": "3ryMikJGp_bz5WjvjscuXOnCShTKY3k0gnQKvCJ7PmA", "contributor": "0xc46004492f3C10B6E9211D60A7f261E72Cc03a8e"}
{"id": "KULq60nH2NMJAHUZDqtQQyGULJqFusxVtxfRRv8hFCQ", "title": "Crowdfund test", "body": "[Cooper](crowdfund://0x77b18B0a6D55562b604258c17E67ca533B3E928d?softCap=1&endsAt=1613754064&network=rinkeby)", "timestamp": 1613612388, "digest": "3ryMikJGp_bz5WjvjscuXOnCShTKY3k0gnQKvCJ7PmA", "contributor": "0xc46004492f3C10B6E9211D60A7f261E72Cc03a8e"}
{"id": "K59bvDhJNcOY2vJTbuXHJAtnxDyw6BMl0BU5m2AW8zY", "title": "Crowdfund test", "body": "[Cooper](crowdfund://0xee08d956890718411227c07CF3E7015769478EAb?softCap=1&endsAt=1613754064&network=rinkeby)", "timestamp": 1613618281, "digest": "3ryMikJGp_bz5WjvjscuXOnCShTKY3k0gnQKvCJ7PmA", "contributor": "0xc46004492f3C10B6E9211D60A7f261E72Cc03a8e"}
{"id": "pACKZNN_kiMYbKfLXY1daH38hymzUKNIsAwBP_J8XWI", "title": "Crowdfund test", "body": "[Cooper](crowdfund://0x28110139244431b43845f84C556c9978daA3bA09?softCap=1&endsAt=1613754064&network=rinkeby)", "timestamp": 1613620463, "digest": "3ryMikJGp_bz5WjvjscuXOnCShTKY3k0gnQKvCJ7PmA", "contributor": "0xc46004492f3C10B6E9211D60A7f261E72Cc03a8e"}
{"id": "Yl-fqPZMnPXui1wMGNp_ifJFJyrSSY5r4Rl6F5a9X6o", "title": "Crowdfund test", "body": "[Cooper](crowdfund://0xee08d956890718411227c07CF3E7015769478EAb?softCap=1&endsAt=1613754064&network=rinkeby)", "timestamp": 1613622078, "digest": "3ryMikJGp_bz5WjvjscuXOnCShTKY3k0gnQKvCJ7PmA", "contributor": "0xc46004492f3C10B6E9211D60A7f261E72Cc03a8e"}
{"id": "-Fs7lNWboFOA16B0P2_woGh8sEBUJo8QdhotuOGwodw", "title": "NFT Value Capture Equation", "body": "THIS IS A PLACEHOLDER FOR THE FUTURE 'NFT VALUE CAPTURE EQUATION' POST", "timestamp": 1613675100, "digest": "A16NP2XXi9RdHptfdF9WHR0Xq_E1XDmUgMwPmJYOG7w", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "JiSNDfUplBOFXIMNMiuWeYs6CiE9aN3P8E7E5bfz3aI", "title": "NFT Value Capture Equation", "body": "THIS IS A PLACEHOLDER FOR THE FUTURE 'NFT VALUE CAPTURE EQUATION' POST\n\n![](https://images.mirror-media.xyz/publication-images/200437f2-b74a-4267-87de-a0722c315e58.jpeg?height=1440&width=2560)", "timestamp": 1613675795, "digest": "A16NP2XXi9RdHptfdF9WHR0Xq_E1XDmUgMwPmJYOG7w", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "vOwBe5qXsNX8oug2DNpZ-OX4PNoVqssD-cUwKc_cGqM", "title": "$VALUE - My First NFT Crowdfund", "body": "NFTs. \n\nYou've heard of them. You've seen them. You can't escape them.\n\nWhile the movement continues to grow, there are open questions around **how to value them**.\n\nMore importantly, **which layers of the stack will capture that value**, and **which players are leading that charge today**.\n\n![Design by Carlos Gomes](https://images.mirror-media.xyz/publication-images/040b3645-22f4-42a5-a259-ac2b62e523e0.jpeg?height=1440&width=2560)\n\nTo showcase the power of web3, I'm excited to debut my first NFT - using a Mirror Crowdfund to allow backers to become collective owners of this future article in the form of $VALUE tokens.\n\n[](crowdfund://0xec7b4c86659Fe529C1DBc79df0aaeEAf1c642006?softCap=1&endAt=1613676708)\n\nThis post was incubated in partnership with [Variant](https://variant.fund/) and includes allocations to [MintFund](https://variant.fund/) and [Friends With Benefits](https://fwb.help/).\n\n## What's To Know?\n\n$VALUE tokens represent fractional ownership of my future blog post - **NFT Value Capture**\n\nKey details of $VALUE:\n\n* Contract Address: 0xec7b4c86659Fe529C1DBc79df0aaeEAf1c642006\n* Target: 1 ETH\n* Hard Cap: 2 ETH\n* Max Contribution: 0.25 ETH\n* Exchange Rate: 1 ETH = 1000 VALUE\n\nPledging ETH returns fractional ownership in the form of $VALUE tokens. These tokens can be redeemed for a pro-rata portion of future sales.\n\n13.37% of the ETH raised in this crowdfund will be donated to [MintFund](https://mint.af/) - helping creators launch their first NFT by covering gas and operational costs.\n\nI will retain 25% of VALUE as the author, and will distribute a portion of my tokens to contributors, the Friends with Benefits DAO and other communities of my choosing. \n\n**Backers will share the remaining 75% of $VALUE.**\n\nAll secondary sales will have a 10% creator share. This means every time the zNFT trades on the secondary market, 10% will flow back to contract and can be redeemed by $VALUE holders.\n\n![Breakdown of the crowdfund flow](https://i.imgur.com/rXZgN5M.png)\n\nThe goal of $VALUE is to crowdfund in order to allocate significant time and energy into researching and writing the article, while leaving ample room for the $VALUE zNFT to (hopefully) sell for more on the primary market than what was crowdfunded at inception.\n\n## What To Expect\n\nThis post will be published within two weeks and serve as a resource for investors, collectors and creators to think about how to allocate capital to the NFT ecosystem, and what I expect to perform best over the next 3-5 years.\n\nIt will be published to the draft attached below, and be updated with the full article at the time of public release.\n\n[NFT Value Capture Equation Draft](https://coopahtroopa.mirror.xyz/A16NP2XXi9RdHptfdF9WHR0Xq_E1XDmUgMwPmJYOG7w)\n\nWhen it is publicly released, the $VALUE zNFT will be listed on Zora and start accepting bids. I will choose the winning bid (in WETH) 48 hours after its release, and $VALUE owners will be able to redeem tokens for a pro-rata portion of that WETH.\n\n## Why Back This Post?\n\nThis post is the first experiment around my evolving web3 strategy. My strengths lie in storytelling, education and community. I want to use this post to show other writers that written content has value, and that NFTs are a way to capture it.\n\nIf successful, I plan to use this strategy for future releases, with the potential for tokenholders to receive exclusive access to communities I'm a part of like Friends With Benefits.\n\nFor more background on myself, check out [my Twitter](https://twitter.com/Cooopahtroopa) or ask someone about my work. I'm hopeful that their response will speak for itself.\n\nSpecial thanks to Variant for incubating this idea, the Mirror team for the support and all the backers for believing in me and my work.\n\n$VALUE coming SoonTM.", "timestamp": 1613676953, "digest": "b3_zJsOv8vvvJsaOKyCM-KcCeA_zEbn6K1yrmnRSK8Q", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "22h-rkJuuG5oA-pzqG6g_AX1OFFz2VJap_ov3TRwo2U", "title": "NFT Value Capture Equation", "body": "THIS IS A PLACEHOLDER FOR THE FUTURE 'NFT VALUE CAPTURE EQUATION' POST\n\n![](https://images.mirror-media.xyz/publication-images/200437f2-b74a-4267-87de-a0722c315e58.jpeg?height=1440&width=2560)\n\n[NFT](ethereum://0xabefbc9fd2f806065b4f3c237d4b59d9a97bcac7/662)", "timestamp": 1613678324, "digest": "A16NP2XXi9RdHptfdF9WHR0Xq_E1XDmUgMwPmJYOG7w", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "xH9sm4vkS6VfEpBI_BUAMyzDxelv6zwAsFxIaKncYbQ", "title": "$VALUE - My First NFT Crowdfund", "body": "NFTs. \n\nYou've heard of them. You've seen them. You can't escape them.\n\nWhile the movement continues to grow, there are open questions around **how to value them**.\n\nMore importantly, **which layers of the stack will capture that value**, and **which players are leading that charge today**.\n\n![Design by Carlos Gomes](https://images.mirror-media.xyz/publication-images/040b3645-22f4-42a5-a259-ac2b62e523e0.jpeg?height=1440&width=2560)\n\nTo showcase the power of web3, I'm excited to debut my first NFT - using a Mirror Crowdfund to allow backers to become collective owners of this future article in the form of $VALUE tokens.\n\n[](crowdfund://0xec7b4c86659Fe529C1DBc79df0aaeEAf1c642006?softCap=1&endAt=1613676708)\n\nThis post was incubated in partnership with [Variant](https://variant.fund/) and includes allocations to [MintFund](https://variant.fund/) and [Friends With Benefits](https://fwb.help/).\n\n## What's To Know?\n\n$VALUE tokens represent fractional ownership of my future blog post - **NFT Value Capture**\n\nKey details of $VALUE:\n\n* Contract Address: 0xec7b4c86659Fe529C1DBc79df0aaeEAf1c642006\n* Target: 1 ETH\n* Hard Cap: 2 ETH\n* Max Contribution: 0.25 ETH\n* Exchange Rate: 1 ETH = 1000 VALUE\n\nPledging ETH returns fractional ownership in the form of $VALUE tokens. These tokens can be redeemed for a pro-rata portion of future sales.\n\n13.37% of the ETH raised in this crowdfund will be donated to [MintFund](https://mint.af/) - helping creators launch their first NFT by covering gas and operational costs.\n\nI will retain 25% of VALUE as the author, and will distribute a portion of my tokens to contributors, the Friends with Benefits DAO and other communities of my choosing. \n\n**Backers will share the remaining 75% of $VALUE.**\n\nAll secondary sales will have a 10% creator share. This means every time the zNFT trades on the secondary market, 10% will flow back to contract and can be redeemed by $VALUE holders.\n\n![Breakdown of the crowdfund flow](https://i.imgur.com/rXZgN5M.png)\n\nThe goal of $VALUE is to crowdfund in order to allocate significant time and energy into researching and writing the article, while leaving ample room for the $VALUE zNFT to (hopefully) sell for more on the primary market than what was crowdfunded at inception.\n\n## What To Expect\n\nThis post will be published within two weeks and serve as a resource for investors, collectors and creators to think about how to allocate capital to the NFT ecosystem, and what I expect to perform best over the next 3-5 years.\n\nIt will be published to the draft attached below, and be updated with the full article at the time of public release.\n\n[NFT Value Capture Equation Draft](https://coopahtroopa.mirror.xyz/A16NP2XXi9RdHptfdF9WHR0Xq_E1XDmUgMwPmJYOG7w?2)\n\nWhen it is publicly released, the $VALUE zNFT will be listed on Zora and start accepting bids. I will choose the winning bid (in WETH) 48 hours after its release, and $VALUE owners will be able to redeem tokens for a pro-rata portion of that WETH.\n\n## Why Back This Post?\n\nThis post is the first experiment around my evolving web3 strategy. My strengths lie in storytelling, education and community. I want to use this post to show other writers that written content has value, and that NFTs are a way to capture it.\n\nIf successful, I plan to use this strategy for future releases, with the potential for tokenholders to receive exclusive access to communities I'm a part of like Friends With Benefits.\n\nFor more background on myself, check out [my Twitter](https://twitter.com/Cooopahtroopa) or ask someone about my work. I'm hopeful that their response will speak for itself.\n\nSpecial thanks to Variant for incubating this idea, the Mirror team for the support and all the backers for believing in me and my work.\n\n$VALUE coming SoonTM.", "timestamp": 1613681077, "digest": "b3_zJsOv8vvvJsaOKyCM-KcCeA_zEbn6K1yrmnRSK8Q", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "XZR5xFhCp8_cB9O79nMy4Fisk0AgXDyHoT6bb3jx4ws", "title": "NFT Value Capture Equation", "body": "THIS IS A PLACEHOLDER FOR THE FUTURE 'NFT VALUE CAPTURE EQUATION' POST\n\n![](https://images.mirror-media.xyz/publication-images/200437f2-b74a-4267-87de-a0722c315e58.jpeg?height=1440&width=2560)\n\nThe link below shows where the $VALUE NFT lives on Zora. Bids can be placed at any time, but will only be accepted 72 hours after the publishing of the post.\n\nPlease only bid in WETH as to ensure backers can redeem their $VALUE!\n\n[NFT](ethereum://0xabefbc9fd2f806065b4f3c237d4b59d9a97bcac7/662)", "timestamp": 1613682061, "digest": "A16NP2XXi9RdHptfdF9WHR0Xq_E1XDmUgMwPmJYOG7w", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "CJXcfLRrmAAsOasJi9EmQLQ9xT5YvrF-Kj1jztM3EsU", "title": "NFT Value Capture Equation", "body": "THIS IS A PLACEHOLDER FOR THE FUTURE 'NFT VALUE CAPTURE EQUATION' POST\n\n![](https://images.mirror-media.xyz/publication-images/200437f2-b74a-4267-87de-a0722c315e58.jpeg?height=1440&width=2560)\n\nThe link below shows where the NFT lives on Zora. Bids can be placed at any time, but will only be accepted 72 hours after the publishing of the post.\n\nPlease only bid in WETH as to ensure backers can redeem their $VALUE!\n\n[NFT](ethereum://0xabefbc9fd2f806065b4f3c237d4b59d9a97bcac7/662)", "timestamp": 1613682027, "digest": "A16NP2XXi9RdHptfdF9WHR0Xq_E1XDmUgMwPmJYOG7w", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
