{"id": "ue-5g80-9Zv5zRSJbBdU0EO7Xs5ctFKvZw-2otUjNSc", "title": "Imagination Figment #6", "body": "[NFT](ethereum://0x61357d3225d9735260e985154f024cc04dc8896f/10003)\n\n*Imagination Figment #6* is a manipulated image, composed of several photographs that I shot on my iPhone 11 Pro, smashed together. The photographs have nothing in common. One is the remnants of some balsamic vinegar on a plate from long ago. And the other is a snapshot of the frontier of where the wall meets the ceiling -- in other words, the *ennui* -- of an apartment I tend to occupy. \n\nBut it is in the act of smashing them that we create fusion and start to get at cosmic truths.\n\nThe image's neat geometry compartmentalizes the whirling complexity of the balsamic realm and its formations of stars, galaxies, and planets. Every smudge, imperfection, and dust speck is the basis of the universal chaotic process (and thus creation itself); meanwhile, the color scheme are for the buyer and their Schelling points.\n\nSomeone rude once sent me a color wheel in the hope of educating the universe to be more orderly, but qualia are not easily tamed. That's why this work is a figment of the imagination.\n", "timestamp": 1617574404, "digest": "oA8UXV-yPhtpamURTIT_FL3-gBm4JsqHUtp3sbspNdg", "contributor": "0x68F9D801C96aC6ccf562f3600Cef77c4504449b6"}
{"id": "OiaHopFzgPogXyrGIgjts-0_Iqu9wBiBmy_9T5wxEMA", "title": "Imagination Figment #6", "body": "[NFT](ethereum://0x61357d3225d9735260e985154f024cc04dc8896f/10003)\n\n- [Imagination Figment #6](https://rarible.com/token/0x61357d3225d9735260e985154f024cc04dc8896f:10003:0x68f9d801c96ac6ccf562f3600cef77c4504449b6) on [Rarible](https://rarible.com)\n- [Imagination Figments Series](https://rarible.com/figments)\n\n*Imagination Figment #6* is a manipulated image, composed of several photographs that I shot on my iPhone 11 Pro, smashed together. The photographs have nothing in common. One is the remnants of some balsamic vinegar on a plate from long ago. And the other is a snapshot of the frontier of where the wall meets the ceiling -- in other words, the *ennui* -- of an apartment I tend to occupy. \n\nBut it is in the act of smashing them that we create fusion and start to get at cosmic truths.\n\nThe image's neat geometry compartmentalizes the whirling complexity of the balsamic realm and its formations of stars, galaxies, and planets. Every smudge, imperfection, and dust speck is the basis of the universal chaotic process (and thus creation itself); meanwhile, the color scheme are for the buyer and their Schelling points.\n\nSomeone rude once sent me a color wheel in the hope of educating the universe to be more orderly, but qualia are not easily tamed. That's why this work is a figment of the imagination.\n", "timestamp": 1617574634, "digest": "oA8UXV-yPhtpamURTIT_FL3-gBm4JsqHUtp3sbspNdg", "contributor": "0x68F9D801C96aC6ccf562f3600Cef77c4504449b6"}
{"id": "cb0tL-UP8qkcsGln8bT4mfLNobZXSB-iHwHqejlOvI8", "title": "Hubspot", "body": "I do a lot of “bulk emailing” but I hate sending bulk emails. I prefer to personalize emails and send them one by one so that the recipient understands that the email came from me.\n\nWhat that has meant is that I take google sheets full of email addresses and I cut and paste a message into my gmail for each and every email address. That is incredibly slow, dull, repetitive, and painful.\n\nAbout a year ago, we started using [Hubspot](https://www.hubspot.com/) for our family’s philanthropic efforts and it was a revelation to me. Hubspot connects to my gmail account and the emails I send from it appear to the recipient like I sent them personally from my gmail.\n\nBut behind the scenes, I can collaborate with my colleagues on templates and lists for various bulk emails that I need to send. When it is time for me to send the emails, I simply work my way through the list, selecting a new name, adding the template, making any little changes to personalize the message, and then I hit send.\n\nIt is still a fair bit of work to do that for twenty or thirty or forty names, but I can do it in ten to twenty minutes and the recipient gets a personalized email from me which as we all know increases the open and reply rate by orders of magnitude.\n\nIf you are looking for a great way to do bulk emailing, I highly recommend Hubspot.\n", "timestamp": 1617619752, "digest": "mpoHlDVCZjPsUCZ0cQ8Rc4R72LxnkndEEYe2UY3XPYo", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "6xcAGruOcNglqtNorEEOaGbM-rPqQ7zTsPPmZMMgD90", "title": "Yupdate 4/2/21: Rebrand, Web App updates, and NFTs!", "body": "\n\nHey Yupster, \n-------------\n\nThis week we're showcasing our new logo, updates to [Web App feeds and UI](http://app.yup.io?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJrYWJlc3NhQGdtYWlsLmNvbSJ9), and a new way of highlighting NFTs. Let's dive right in 🏊. \n\nProduct Updates:\n----------------\n\n### Yup Rebrand \n\nWe're thrilled to announce the new face of Yup 😁. Many expressions and colors, one collective. Keep an eye out for this one; you'll see it all over the place in the next few days 👀. \n\n![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/9c7f6d3d-568a-430c-af6e-c15ea630945a.png)\n\nWeb App Updates:\n----------------\n\n### Feeds\n\nWe've updated our Web App feeds to balance recent and influential content more dynamically ⚖️. The result is fresher and higher quality feeds. Search through them to find NFTs, tweets, articles, etc., blowing up in the last day or hour. \n\n### Cleaner and Leaner\n\nThe new sidebar and content cards make it easier to browse through posts and navigate our Web App features 🏄‍♂️. Through fancy styling techniques, posts are more clearly demarcated and \"pop\" a bit more, and the sidebar aggregates the features of the Web App all in one place. \n\n [![](https://d3k81ch9hvuctc.cloudfront.net/company/UwKVeP/images/34ac957b-e132-47bc-bdff-5d3458849a0b.gif)](http://app.yup.io?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJrYWJlc3NhQGdtYWlsLmNvbSJ9) \n\nContent:\n--------\n\nThe community does such a good job of curating content, our job is to just get out of the way. With that in mind, here are the top NFTs of the week according to Yup feeds. If you like the content you see, click here to [subscribe](http://yupio.typeform.com/to/XFUH2bDC?_ke=eyJrbF9jb21wYW55X2lkIjogIlV3S1ZlUCIsICJrbF9lbWFpbCI6ICJuaXJrYWJlc3NhQGdtYWlsLmNvbSJ9#email=xxxxx) to our weekly NFT newsletter 🙂.\n\n[NFT](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/15590)\n\n❤️  99   🌸  99   🦄  99\n\n\n[NFT](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/14165)\n\n❤️  99   🌸  99   🦄  99\n\n[NFT](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/21478)\n\n❤️  99   🌸  99   🦄  99\n\n\n\nThanks for tuning into another Yupdate. See you all in the next one ✌️!\n\n", "timestamp": 1617636353, "digest": "JLa8msbKeAn25o08fM5D3V4RENLn5rdJfOx-S3wGRz4", "contributor": "0x30E838D51c61811d382962B4e0699715462DcdE1"}
{"id": "8SsMICK-jmOEVyP1vBpYyNPgV9hulHHGw2ar-DQbDVg", "title": "How to Structure a Protocol's Treasury", "body": "How should a protocol like Uniswap or Compound structure its treasury? This post covers the principles of protocol treasury management, fiscal policy, asset allocation, ways to diversify the treasury, and responsibilities of a treasury committee.\n\n![Credit: [DeviantArt](https://co.pinterest.com/pin/799740846299206540/)](https://images.mirror-media.xyz/publication-images/228a01c0-ce77-46dc-bb9b-2a558277f00b.jpeg?height=680&width=1024)\n\n**Principles of treasury management**\n\nInfinite time horizon\n\n- The treasury should be structured to exist in perpetuity.\n- There should be no time preference, i.e. no preference given to funding present projects over future ones.\n\nInflows should exceed outflows\n\n- Over the long-run, the returns of the treasury (inflows) should be greater than the spending rate (expenses/value of treasury) + inflation rate.\n- The treasury’s purchasing power should be maintained or grown after accounting for expenses.\n\nDiversified asset allocation\n\n- The assets in the treasury should be diversified and aligned with the goals of the community.\n- Besides the protocol's governance token, there should be a portion of the treasury in liquid blue chip assets (e.g. ETH, BTC), stablecoins (e.g. DAI, USDC), and other assets.\n\n\nA protocol treasury could have a different approach: be dissolved after a certain number of years like the [Gates Foundation](https://www.gatesfoundation.org/Who-We-Are/General-Information/Financials/Foundation-Trust). Arguably, dissolving a treasury is a sign of even greater decentralization than having a community treasury. It means that the protocol is self-sustaining and does not depend on a single treasury.\n\nBut having a diversified treasury that exists in perpetuity can be effective, especially in bear markets. If markets are down 40% but you still need to solve an important technical problem, a diversified treasury can fund that without relying on broader public goods funding. I lean towards structuring a treasury with an infinite time horizon.\n\n**Fiscal policy**\n\nThe annual budget for a treasury should be decided based on the protocol’s needs and its treasury size. Ideally, a protocol’s annual budget should be less than its expected revenue (e.g. Uniswap fee revenue) and treasury investment income.\n\nOne of the most valuable things a protocol can fund is [ecosystem development](https://ls.mirror.xyz/v_AK57oyXtp8hLmtq7p7R8ZkMrqxXmtFQkaQjz_5xg4), which can eventually serve as a competitive edge. Pilot programs by [Uniswap](https://gov.uniswap.org/t/rfc-uniswap-grants-program-v0-1/9081) and [Compound](https://www.comp.xyz/t/compound-grants-program/1292) have proposed $750,000 per quarter in grants that might be reduced or expanded based on their effectiveness.\n\nAs the recent Compound proposal states, the main needs of a protocol are:\n- Protocol and parameter development\n- Code audits\n- Business development and integrations\n- Advertising and sponsorships\n- Hackathons\n- Bounties\n- Miscellaneous improvements\n\n**Asset allocation**\n\nIt is risky for protocols to only have their own governance tokens in their treasury. If Uniswap has only UNI in its treasury and the token price falls by 40%, its balance sheet would also shrink by 40%. This is dangerous because it occurs at a time when the protocol needs to ramp up spending, whether it is LP subsidies, token buybacks, or core development. This could lead to a further downward spiral for the token.\n\nA protocol's treasury should be diversified over time. Diversification should be planned based on the treasury’s expected annual outflows, liquidity needs, and risk-return of assets.\n\nHere is a sample allocation (without knowing the numbers above):\n- Protocol’s token\n- Stablecoins (DAI, USDC, etc.), a portion of which earn yield. Stablecoin allocation depends on the liquidity needs and treasury budget.\n- Blue chip crypto assets (BTC, ETH)\n- DeFi index (DPI)\n- Early-stage token investments and M&A that improve the protocol's competitive positioning. The [discussion](https://twitter.com/mhluongo/status/1368963503663513606?s=19) between Keep and NuCyphur is an example of what an on-chain merger could look like.\n- Insurance cover and options. [Example](https://twitter.com/sanlsrni/status/1367724652970221569): rolling buys of smart contract cover or short-dated puts on the protocol’s tokens. This could benefit the protocol during Black Swan events like contract hacks, economic exploits, and market drawdowns.\n\nProtocols can also allocate a portion of the treasury for token buybacks when the token is highly undervalued and there aren't other effective ways to deploy capital.\n\nThere can be ways to diversify a treasury that are trust-minimized and does not require a group of people to have multisig access. Protocols can leverage the existing on-chain asset management stack:\n- [TokenSets](https://www.tokensets.com/) for customized index-like ERC20 portfolios\n- [Enzyme](https://enzyme.finance/) and [dHedge](https://www.dhedge.org/) for on-chain funds\n- [Potion Labs](https://potion.fi/#/) for risk management architecture\n- [Yearn](https://yearn.finance/) for yield optimization\n\n**How can protocols diversify their treasuries?**\n\nThe simplest method to diversify is to sell some of the protocol's tokens to buy other assets (e.g. ETH, DAI, etc.). Treasuries can’t be diversified overnight. But plans can be made to reach a steady-state allocation over several years.\n\nThere is currently a negative perception associated with selling the  protocol's token because it could signal that the treasury has lost confidence in the protocol. This has a short-term impact on price. Selling large amounts of the protocol’s tokens would involve slippage, especially if it’s not done thoughtfully. However, this can be avoided if the treasury has a stated target policy allocation and dollar cost averages into other assets over several months or years.\n\nThe treasury could also receive other crypto assets as inflows. Few methods include:\n- Earn fee revenue in other assets that accrues to the treasury.\n- Earn other tokens in exchange for value added by the protocol in other cryptonetworks.\n- Set up yield delegation vaults: i.e. pay the protocol’s tokens (e.g. UNI) to Yearn users for them to delegate a portion of their yield in ETH and stablecoins to the protocol treasury. Rally [experimented](https://medium.com/rallynetwork/introducing-yield-delegating-vaults-f861a11afb0b) with yield delegation vaults.\n- Invest in early-stage projects or do M&A that improves the protocol’s competitive positioning.\n\nIndex Coop is a good case study. They recently published a thoughtful treasury [report](https://gov.indexcoop.com/t/index-coop-financial-reporting/939) and made a [proposal](https://gov.indexcoop.com/t/iip-16-smart-treasury/935) to purchase ETH with INDEX and DPI in its treasury. Index aims to implement a smart treasury at Balancer with INDEX / ETH at 80/20.\n\n**Treasury committee**\n\nProtocols should set up a 5-7 member treasury management committee, which will work on the following:\n- Propose treasury budget to discuss and vote on\n- Define liquidity requirements based on budget\n- Decide asset allocation policy and review this policy allocation every month\n- Define policy for liquidity mining, token buybacks, salaries and vesting schedule of core contributors\n- Publish monthly / quarterly financial statements\n- Publish monthly / quarterly reports on how treasury is spent\n\nThe treasury committee can be voted on and removed by token holders.\n\nWe will increasingly see specialization emerge for protocols. Token holders will approve big decisions and elect or nominate managerial stakeholders with expertise (individuals, DAOs). Managerial stakeholders will make smaller, more frequent decisions and be held accountable by token holders.\n\nWe will have several experiments to figure out the right balance between managerial effectiveness and community control. In both cases, clear processes and useful transparency is critical.\n\n**Conclusion**\n\nProtocol treasuries need to be structured with an infinite time horizon. This requires thinking effectively about: \n- Fiscal policy: how much to spend and what to spend on\n- Asset allocation: how the treasury should be diversified to fund key protocol development irrespective of the market environment\n- Reporting: financial statements of the treasury and summary of key transactions\n\n\n\n\n\n\n\n", "timestamp": 1617638027, "digest": "H-Rd34MLFO6hrcIAsy17PlvLVlswTgfn7ifj90Mht9Y", "contributor": "0x10D6d2e343281D388291A3e02f3293AaEdA67178"}
{"id": "6FX01QWyADEgnRIs3hrcHAGvaoUGaW1VpZT_9nDf3FQ", "title": "Give a split", "body": "# Give a split\n\nBefore getting into it, I want to express that all the ideas below are 100% mine. Entirely original. No external sources inspired any of this thought. I am the definitive sole author, and all credit should reflect that. No one before me provided any insight or shared any knowledge relating to what *I’m* about to share.\n\nIdeas are entangled things. Epiphanies are not our own, but the sum of everything around us, connecting in what feels like a single moment. Authors are portrayed as singular figures, when beneath the surface a complex history exists.\n\nOne of these ideas the Mirror team has been kicking around is *the split*; a way of not only attributing sources of inspiration and collaboration, but also directing economic value to them. This is a quick series of overlapping (and optimistic) ideas centered on the split. I’ll leave drawing the connections and the resulting epiphany up to you.\n\n---\n\n[Split Tweet](https://twitter.com/jondashkyle/status/1377076060873838592)\n\n---\n\n[UbuWeb](https://ubu.com) is one of my long time favorite sources of inspiration—a collection of experimental art spanning all forms of media and collected by the poet Kenneth Goldsmith. It’s been a big influence on digital archival practice, and if you haven’t yet found yourself several hours deep in an Ubu-hole, I suggest diving in.\n\n![](https://images.mirror-media.xyz/publication-images/c257aee1-f197-47f5-8fde-4b68e8c0abf1.jpeg?height=1440&width=2560&size=medium)\n\nGoldsmith taught a course called “*Uncreative Writing*”, where his students were penalized for any originality and “creativity,” and rewarded for plagiarism, repurposing, sampling, and stealing. This led to a subsequent [book of the same name](http://cup.columbia.edu/book/uncreative-writing/9780231149907). It’s a manifesto of sorts, describing a new form of authorship unlocked by the internet and instantaneous access to everything ever created all the time.\n\n> In 1969 the conceptual artist Douglas Huebler wrote, ‘The world is full of objects, more or less interesting; I do not wish to add any more.’ I’ve come to embrace Huebler’s ideas, though it might be retooled as ‘The world is full of texts, more or less interesting; I do not wish to add any more.’ It seems an appropriate response to a new condition in writing today: faced with an unprecedented amount of available text, the problem is not needing to write more of it; instead, we must learn to negotiate the vast quantity that exists. How I make my way through the thicket of information — how I manage it, how I parse it, how I organize and distribute it — is what distinguishes my writing from yours.\n\nIt’s a compelling provocation, and extends beyond textual writing. Yes, there are poetics and optimism involved, but the notion expands on familiar ideas of the reblog and retweet; this being the remix, or the recontextualizion. What form could a tool take if it were *uncreative* natively? Built on web3, could it be possible by default to assign attribution and route economic value to these sources?\n\n---\n\nLook, I listened to a lot of Bieber in 2020. No shame. It’s good to lead a balanced life. Soon after the release of *Changes* an exchange played out over an afternoon on Twitter. An artist accused Bieber of directly lifting a hook from his record. It was beyond similar; it was identical. Listen to [Bieber’s track](https://www.youtube.com/watch?v=Pf0B9v9lDYU&ab_channel=JustinBieber) and then [the original](https://www.youtube.com/watch?v=wtX4CmURvKE&ab_channel=AsherMonroe-Topic). An uncleared and uncredited sample. A Twitter mob began accusing Justin of stealing from another—less recognized—artist.\n\nThat’s when this producer jumped into the fold with the receipts:\n\n[Laxcity Twitter Credit](https://twitter.com/laxcitymusic/status/1228487508314423296)\n\nNeither artists had created the hook! Credit goes to [Laxcity](https://soundcloud.com/laxcitymusic), a relative unknown who released it as a sample pack available for any one to use through [Splice](https://splice.com/), a sample subscription service.\n\n[Splice mentions in a comment to the Verge](https://www.theverge.com/2020/2/17/21140838/justin-bieber-changes-running-over-asher-monroe-synergy-splice-sample-melody) that “Laxcity made an amazing sample, and we’re glad he’s getting well-deserved recognition.” While recognition is better than nothing, it alone can not sustain a creative practice. We should do better.\n\nSplice does a good job at discovery and distribution, but the flat rate subscription licensing deal leaves artists out of possible upside, like with Laxcity. When musicians list their samples (or ideas) as up for remix, you could imagine a *split* is created when dropping a Splice sample into a track. For Laxcity, who’s sample runs the full duration of the track and forms its foundation, the *split* could be generous. It should feel less like a pure expenditure, and more like extending gratitude by saying “if this happens, and we get lucky, we get lucky together.”\n\n---\n\nIt should be as easy to create a split as it is to tag someone in a photo on Instagram. Or adding an editor on Google Docs. There are many open questions, like… Should it be possible to tag someone in a work without assigning a split? *Split by default*?\n\nMy role at Mirror is to create interfaces for ideas like this, and distill somewhat complex mechanisms into useful and understandable patterns and tools. They must be both understandable *and* lead to a deeper knowledge of what crypto unlocks. Web3 and cyrpto’s economic and attribution layers could provide the basis of what a successful uncreative ecosystem could need.\n\n![](https://images.mirror-media.xyz/publication-images/583755b9-e077-4141-995f-9b94fdef7bab.jpeg?height=1620&width=2880&size=large)\n\nWhen I think about *splits*, I think about questions of interface and defaults. Laxcity was excited for the attention, but is that only in absence of creative tools which include him in the flow of value *by default*? Bieber and his producers were being *uncreative* by using that sample. What if they had been using an *uncreative* interface in an *uncreative* ecosystem?\n\nIn the Twitter video response Laxcity says “Here it is, I wrote this MIDI.” This is beautiful phrasing. MIDI is a communication protocol for musical instruments introduced in 1981. *1981*. This may seem long ago, but relative [all of music history](https://www.youtube.com/watch?v=8fHi36dvTdE&ab_channel=cagin), it barely registers as a blip. But for a new generation of producers, music and MIDI are one and the same. Protocols become the defaults, and the defaults become how we think.\n\nThere is so much work to do.\n\n---\n\nIf it were possible to assign a series of splits for this entry, it would look similar to this:\n\n- `10%` Kennith Goldsmith for being the source of *Uncreative Writing*.\n- `10%` The Mirror team for collaboratively generating many of the ideas around *splits*. This split would behave as though directed at a DAO.\n- `5%` Laxcity for providing an insight about remixes and sampling.\n- `2.5%` [Brainpickings](https://www.brainpickings.org/), as I stole and slightly modified a paragraph (or two) from them when searching Goldsmith.\n\n---\n\n## Elsewhere\n\n- I remixed a [search result about Uncreative Writing](https://www.brainpickings.org/2013/02/13/uncreative-writing-kenneth-goldsmith/) as part of this entry.\n- [Recreativity and Remix Culture](https://slate.com/culture/2012/10/against-recreativity-critics-and-artists-are-obsessed-with-remix-culture.html)\n- [Nothing New Needs to be Created](https://monoskop.org/images/1/1e/Sollfrank_Cornelia_2015_Nothing_New_Needs_to_be_Created_Kenneth_Goldsmiths_Claim_to_Uncreativity.pdf)\n- [It’s Not Plagiarism. In the Digital Age, It’s ‘Repurposing.’](https://www.chronicle.com/article/its-not-plagiarism-in-the-digital-age-its-repurposing/)\n\n\n", "timestamp": 1617640732, "digest": "ppRJ1E3Fv2X5LWKLSHdTJ7C2B9N2JIS-GXCLYA3LC0c", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "2Gxb-HGqTnd1mMrv-JshXPeeWI5KHXDzT2_awKpFRN0", "title": "Give a split", "body": "Before getting into it, I want to express that all the ideas below are 100% mine. Entirely original. No external sources inspired any of this thought. I am the definitive sole author, and all credit should reflect that. No one before me provided any insight or shared any knowledge relating to what *I’m* about to share.\n\nIdeas are entangled things. Epiphanies are not our own, but the sum of everything around us, connecting in what feels like a single moment. Authors are portrayed as singular figures, when beneath the surface a complex history exists.\n\nOne of these ideas the Mirror team has been kicking around is *the split*; a way of not only attributing sources of inspiration and collaboration, but also directing economic value to them. This is a quick series of overlapping (and optimistic) ideas centered on the split. I’ll leave drawing the connections and the resulting epiphany up to you.\n\n---\n\n[Split Tweet](https://twitter.com/jondashkyle/status/1377076060873838592)\n\n---\n\n[UbuWeb](https://ubu.com) is one of my long time favorite sources of inspiration—a collection of experimental art spanning all forms of media and collected by the poet Kenneth Goldsmith. It’s been a big influence on digital archival practice, and if you haven’t yet found yourself several hours deep in an Ubu-hole, I suggest diving in.\n\n![](https://images.mirror-media.xyz/publication-images/c257aee1-f197-47f5-8fde-4b68e8c0abf1.jpeg?height=1440&width=2560&size=medium)\n\nGoldsmith taught a course called “*Uncreative Writing*”, where his students were penalized for any originality and “creativity,” and rewarded for plagiarism, repurposing, sampling, and stealing. This led to a subsequent [book of the same name](http://cup.columbia.edu/book/uncreative-writing/9780231149907). It’s a manifesto of sorts, describing a new form of authorship unlocked by the internet and instantaneous access to everything ever created all the time.\n\n> In 1969 the conceptual artist Douglas Huebler wrote, ‘The world is full of objects, more or less interesting; I do not wish to add any more.’ I’ve come to embrace Huebler’s ideas, though it might be retooled as ‘The world is full of texts, more or less interesting; I do not wish to add any more.’ It seems an appropriate response to a new condition in writing today: faced with an unprecedented amount of available text, the problem is not needing to write more of it; instead, we must learn to negotiate the vast quantity that exists. How I make my way through the thicket of information — how I manage it, how I parse it, how I organize and distribute it — is what distinguishes my writing from yours.\n\nIt’s a compelling provocation, and extends beyond textual writing. Yes, there are poetics and optimism involved, but the notion expands on familiar ideas of the reblog and retweet; this being the remix, or the recontextualizion. What form could a tool take if it were *uncreative* natively? Built on web3, could it be possible by default to assign attribution and route economic value to these sources?\n\n---\n\nLook, I listened to a lot of Bieber in 2020. No shame. It’s good to lead a balanced life. Soon after the release of *Changes* an exchange played out over an afternoon on Twitter. An artist accused Bieber of directly lifting a hook from his record. It was beyond similar; it was identical. Listen to [Bieber’s track](https://www.youtube.com/watch?v=Pf0B9v9lDYU&ab_channel=JustinBieber) and then [the original](https://www.youtube.com/watch?v=wtX4CmURvKE&ab_channel=AsherMonroe-Topic). An uncleared and uncredited sample. A Twitter mob began accusing Justin of stealing from another—less recognized—artist.\n\nThat’s when this producer jumped into the fold with the receipts:\n\n[Laxcity Twitter Credit](https://twitter.com/laxcitymusic/status/1228487508314423296)\n\nNeither artists had created the hook! Credit goes to [Laxcity](https://soundcloud.com/laxcitymusic), a relative unknown who released it as a sample pack available for any one to use through [Splice](https://splice.com/), a sample subscription service.\n\n[Splice mentions in a comment to the Verge](https://www.theverge.com/2020/2/17/21140838/justin-bieber-changes-running-over-asher-monroe-synergy-splice-sample-melody) that “Laxcity made an amazing sample, and we’re glad he’s getting well-deserved recognition.” While recognition is better than nothing, it alone can not sustain a creative practice. We should do better.\n\nSplice does a good job at discovery and distribution, but the flat rate subscription licensing deal leaves artists out of possible upside, like with Laxcity. When musicians list their samples (or ideas) as up for remix, you could imagine a *split* is created when dropping a Splice sample into a track. For Laxcity, who’s sample runs the full duration of the track and forms its foundation, the *split* could be generous. It should feel less like a pure expenditure, and more like extending gratitude by saying “if this happens, and we get lucky, we get lucky together.”\n\n---\n\nIt should be as easy to create a split as it is to tag someone in a photo on Instagram. Or adding an editor on Google Docs. There are many open questions, like… Should it be possible to tag someone in a work without assigning a split? *Split by default*?\n\nMy role at Mirror is to create interfaces for ideas like this, and distill somewhat complex mechanisms into useful and understandable patterns and tools. They must be both understandable *and* lead to a deeper knowledge of what crypto unlocks. Web3 and cyrpto’s economic and attribution layers could provide the basis of what a successful uncreative ecosystem could need.\n\n![](https://images.mirror-media.xyz/publication-images/583755b9-e077-4141-995f-9b94fdef7bab.jpeg?height=1620&width=2880&size=large)\n\nWhen I think about *splits*, I think about questions of interface and defaults. Laxcity was excited for the attention, but is that only in absence of creative tools which include him in the flow of value *by default*? Bieber and his producers were being *uncreative* by using that sample. What if they had been using an *uncreative* interface in an *uncreative* ecosystem?\n\nIn the Twitter video response Laxcity says “Here it is, I wrote this MIDI.” This is beautiful phrasing. MIDI is a communication protocol for musical instruments introduced in 1981. *1981*. This may seem long ago, but relative [all of music history](https://www.youtube.com/watch?v=8fHi36dvTdE&ab_channel=cagin), it barely registers as a blip. But for a new generation of producers, music and MIDI are one and the same. Protocols become the defaults, and the defaults become how we think.\n\nThere is so much work to do.\n\n---\n\nIf it were possible to assign a series of splits for this entry, it would look similar to this:\n\n- `10%` Kennith Goldsmith for being the source of *Uncreative Writing*.\n- `10%` The Mirror team for collaboratively generating many of the ideas around *splits*. This split would behave as though directed at a DAO.\n- `5%` Laxcity for providing an insight about remixes and sampling.\n- `2.5%` [Brainpickings](https://www.brainpickings.org/), as I stole and slightly modified a paragraph (or two) from them when searching Goldsmith.\n\n---\n\n## Elsewhere\n\n- I remixed a [search result about Uncreative Writing](https://www.brainpickings.org/2013/02/13/uncreative-writing-kenneth-goldsmith/) as part of this entry.\n- [Recreativity and Remix Culture](https://slate.com/culture/2012/10/against-recreativity-critics-and-artists-are-obsessed-with-remix-culture.html)\n- [Nothing New Needs to be Created](https://monoskop.org/images/1/1e/Sollfrank_Cornelia_2015_Nothing_New_Needs_to_be_Created_Kenneth_Goldsmiths_Claim_to_Uncreativity.pdf)\n- [It’s Not Plagiarism. In the Digital Age, It’s ‘Repurposing.’](https://www.chronicle.com/article/its-not-plagiarism-in-the-digital-age-its-repurposing/)\n\n\n", "timestamp": 1617640994, "digest": "ppRJ1E3Fv2X5LWKLSHdTJ7C2B9N2JIS-GXCLYA3LC0c", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
