{"id": "IvEFqg06e1ZUWAUPzgYFlKEk6mveDk83mP2yk1F5Qjk", "title": "Introducing Editions", "body": "### Mirror is excited to introduce Editions to our suite of crypto-native creator tools.\n\nEditions are a way for creators to mint a limited supply of identical NFTs at a fixed price. If a 1/1 NFT is a Picasso at Sotheby's, Editions are like the thousands of first-edition holographic Charizards released. As a stupidly obvious sidenote, a cool thing about NFTs is that they’ll never get scuffed, scratched or bent :)\n\n![](https://images.mirror-media.xyz/publication-images/095c8b28-b76a-4aef-938e-4188f322a782.jpeg?height=1138&width=2024)\n\n\n\nTo put Editions in context, they have a clear predecessor: the NFT auction. When NFTs took off this year, they gave creators a new way to prove scarcity around digital artworks. For digital artists, that was huge. They could finally unlock the latent value in their work that was traditionally reserved for physical mediums. They also adopted the fine art characteristic that works are one-of-a-kind, known as the 1/1 NFT. That successfully gave these assets a flair of distinction and collectors all the more incentive to raise their bid. Reserve NFT auctions became the most common and successful market mechanism for creating demand around the works (Mirror added reserve auction support earlier this year). The public nature of auctions met with a ticking clock has really turned out to be a viral mechanism.\n\nWhile there's an undeniable sense of play, competition and victory that we love, there are also characteristics of 1/1 NFT auctions that are a little antithetical to crypto’s emphasis on community. For instance, there’s only one winner, despite however much support the artist received from other bidders. It’s sort of like going to a concert and only one person gets to walk away with the signed vinyl from the merch table. Bidders are also incentivized to conceal their interest in a piece until an auction ends, discouraging them from drawing attention to the auction. The strategy might work out for them, but it isn’t ideal for the artist. Finally, a lot of people simply can’t afford to participate in competitive auctions, no matter how supportive they might be of the artist. It’s never fun to alienate your fanbase.\n\nAt the end of the day, as far as 1/1 NFT sales go, it often matters more how much it sold for than who it sold to.\n\nWe love auctions, but it’s just one way to play. Editions are our proposed alternative. We’ve outlined a few advantages we imagine Editions will present to creators:\n- Multiple patrons can own an Edition since they come in a large quantity.\n- Since early editions are considered more valuable than later editions, patrons are incentivized to participate in a sale immediately. They also benefit from publicizing their participation, drawing more interest around the collection and bumping up its value.\n- A creator can price the NFTs in different tiers, to reward their superfans for showing up first. For example, there can be a 3/3 edition for 1 ETH, a 20/20 edition for 0.2 ETH, and a 100/100 edition for 0.05 ETH. Patrons can walk away with something cool at any price point.\n- Editions use lazy-minting, which means that all of the NFTs are set up cheaply and efficiently, but no NFTs are minted until they are bought. Additionally, when these NFTs are minted, it is typically much cheaper (sometimes by as much as 5 times) than on other NFT platforms.\n\nWe imagine Editions coming in handy for both crowdfunding projects, representing membership in a community, and as a crypto-native business model for digital media. Imagine Kickstarter’s crowdfund tiers, but instead of getting a signed poster for backing a project, you receive a digital collectible (editions within crowdfunds will be available on Mirror soon).\n\nWe’re really excited to get Editions out to our community. We’ve seen so many interesting things done with NFTs and reserve auctions, and believe this feature will help evolve that.\n\nTo see Editions in action, check out Forefront's latest [drop](https://ff.mirror.xyz/OYyqJ5rlRkQz0d8YgBFCHRnnCYXGLL9DJ8zNsCcHkBA):\n\n[Genesis Access](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=5)", "timestamp": 1624044384, "digest": "AOoIsKPfZvf8LACKWp7gj_mg1ICCDOfPnVBOsDQoXo8", "contributor": "0x9651B2a7Aa9ed9635cE896a1Af1a7d6294d5e902"}
{"id": "QS6RwjHOhgqYCWIbvE4tFvTe_p1lyUICAZjCvWGuAjo", "title": "Eating the Dog's Food", "body": "Today the priorities were to publish our first dev blog post ([The MVP before Christmas](https://dev.mirror.xyz/J1RD6UQQbdmpCoXvWnuGIfe7WmrbVRdff5EqegO1RjI)), and then to plan our next sprint.\n\nI'm very happy with the way that the blog post turned out. I wrote most of it near midnight the night before, and then our team came together and helped to polish it in the morning. While reviewing the entry, we also took the opportunity to make many design improvements to the Mirror reading experience, which shows the value of using our own product to raise the quality for everybody. This is typically called \"dogfooding\" your product -- \"eating your own dogfood\". I once worked with a Spanish-speaking engineer from Chile who was very confused by this expression, and asked another engineer, in Spanish, why everyone was talking about \"eating the dog's food\"!\n\nMeetings, again, were more meandering today than they ought to have been. I think think we could do better by structuring our internal meeting times more--having really clear outcomes for our meetings, time-boxing them, and knowing when we've \"won\" the meeting.\n\nAnother thing that's on my mind is how to be great at product idea exploration. It's clear that it's part *generative* and part *pruning*, and if we're pruning too early, we stifle potential ideas that sound bad at first, but could flourish into something good. At the same time, some people in the room may have enough experience simply to know a dead-end when they see one. Balancing the rapid generation of ideas while quickly pruning bad ones is an art; a valuable art for any startup to be able to perform.\n\nCan your team generate beautiful, unique, eccentric ideas, without wasting time out in an isolated idea maze?", "timestamp": 1624067281, "digest": "ZeFBhb2yp7B2xAVnFRZd66Kn_o1EVOU1BVoxiFR0lZY", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "C2WZrECvavNHcWI059Ql8pkieSVlZDnVERJ0Toa1KJw", "title": "Understanding Primitives", "body": "\n> You must concentrate on the fundamentals, at least what *you think* at the time are fundamentals...\n*Richard W. Hamming, The Art of Doing Science and Engineering*\n\n---\n\nIn any area of expertise, it's really the primitives that unlock creativity and higher performance. This is true whether it's mastering the deadlift for functional movement disciplines, [Salt, Fat, Acid and Heat](https://www.saltfatacidheat.com/) for cooking, or something like zero-knowledge-proof verification in crypto. Mastering the fundamentals enable masterful art to happen.\n\n> As you discover the secrets of *Salt*, *Fat*, *Acid* and *Heat*, you'll find yourself improvising more and more in the kitchen. Liberated from recipes and precise shopping lists...you can make anything taste good.\n*Samin Nosrat, Salt Fat Acid Heat*\n\nMy own experience has been that the most valuable time spent learning is to study the core primitives in depth. I'll give some examples to motivate this, using features we built this year for Mirror.\n\n## Exhibit A - $WRITE Race\n\n[$WRITE Race](https://mirror.xyz/race) has been successful. But how did it come about? In a discussion that [Denis](https://d.mirror.xyz/) and I had about onboarding new users, while I was on a vacation in Eagle Lake, CA., we articulated a clear problem: we wanted to have the best users join, but we didn't want to be responsible to choose those people ourselves. We wanted the community to develop organically - almost like a living organism.\n\nI first joined crypto through some time spent at a friend's company, [Numerai](https://numer.ai/), where I learned about staking using tokens on Ethereum. There is overlap between staking and $WRITE Race, because both are trying to solve the problem of generating high-quality suggestions from a group of people. Both products losely solve that problem by constraining submission via a token, and promising a reward in exchange.\n\nHere, understanding the problem-solution relationship for staking on Etheruem was key to unlocking the mechanism of $WRITE Race. Even if we didn't directly use staking, it was familiarity with that paradigm that unlocked our creativity.\n\n![@strollinghome thinking deeply about crypto primitives in the morning at Eagle Lake](https://images.mirror-media.xyz/publication-images/40276c11-2d98-44b4-8b37-80b1f8ac6367.jpeg?height=1200&width=1600)\n        \n## Exhibit B - Splits\n\nMany protocols have attempted ways to split funds among a group of accounts. I've seen a dozen of these contracts, and most of them can't scale beyond a dozen recipients because they don't have the right primitive to unlock scalability.\n\nOur solution with [Splits](https://dev.mirror.xyz/mQ03-JXlfdoBnRrZisC5X3kM9nBkOILlHwxbdq382Gw) was to use Merkle Proofs to allow unlimited split allocations, which proved to be popular. I was familiar with Merkle Proofs from having read deeply through the Uniswap Merkle Distributor.\n\nJust being familiar with Merkle Proofs unlocked a whole new feature, when the problem was presented.\n  \n[](https://twitter.com/viamirror/status/1389627591120785411?s=20)\n\n## Exhibit C - Crowdfunds and Scaling Crowdfunds\n\nMirror Crowdfunds have been very successful. We've managed to raise hundreds of thousands of dollars for an incredibly diverse set of projects - from [Essays](https://j.mirror.xyz/uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0) to [Novels](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg) to [Products](https://d.mirror.xyz/FLqkPA3iN4x-p97UhfhWwaCx8rBmVo-1yttY20oaob4).\n\nBehind the success of Crowdfunds is a deep understanding simple primitive - minting and burning ERC20 tokens. We mint an ERC20 token when someone contributes to the project, and we burn it when they want to claim the underlying ETH. If you aren't deeply familiar with this mechanism, it might not occur to you as the way to approach the Crowdfunding problem, and you might opt instead for a generic data structure to hold the allocations. I've seen a few implementations like this, and they're just inherently very limited. ERC20s unlock so much more.\n\nMore sophisticated is the scaling of Crowdfunds. We scale Crowdfunds by deploying a single logic contract, and then [delegating to that contract](https://github.com/mirror-xyz/crowdfund/tree/main/contracts) from each individual crowdfund. This is the proxy pattern that is popular in the Ethereum space. But it really takes being familiar with the pattern to know how to apply this well.\n\n## Exhibit D - Signing\nOutside of Ethereum, we use a few primitives for cryptographically signing content. In fact, we use this for all verification on the Mirror platform, and have no login sessions. This will allow us to prove that the content comes from the author, regardless of whether we have an API running or not. This will be critical for our decentralization plans.\n\nThe signing keys are also not the same as the user's Ethereum public key. This is important, because it allows users to interact on the platform — writing, commenting (soonish), etc — without needing to take our an Ethereum wallet that might have funds on it just to sign a blog post entry.\n\nUnderstanding how to do this (quickly) meant having deep familiarity with the types of cryptographic signatures that are supported on Ethereum, the browser, and how to string them together to make something that is a good product experience.\n\n---\n\nI hope I've motivated the case to learn the primitives. I believe this holds true for any endeavor. Feel free to connect with me [on Twitter](https://twitter.com/strangechances) to discuss primitives and crypto more.", "timestamp": 1624067362, "digest": "ZjAdY-tN25li2hpz5VqhlJLpDTu82WWCRKbz3bObfWo", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "N_pH_vpDKE1t9GpSZynoN2a1SKbTV3x1Gq91ABfevYE", "title": "Understanding Primitives", "body": "\n> You must concentrate on the fundamentals, at least what *you think* at the time are fundamentals...\n*Richard W. Hamming, The Art of Doing Science and Engineering*\n\nIn any area of expertise, it's really the primitives that unlock creativity and higher performance. This is true whether it's mastering the deadlift for functional movement disciplines, [Salt, Fat, Acid and Heat](https://www.saltfatacidheat.com/) for cooking, or something like zero-knowledge-proof verification in crypto.\n\n> As you discover the secrets of *Salt*, *Fat*, *Acid* and *Heat*, you'll find yourself improvising more and more in the kitchen. Liberated from recipes and precise shopping lists...you can make anything taste good.\n*Samin Nosrat, Salt Fat Acid Heat*\n\nMy own experience has been that the most valuable time spent learning is to study the core primitives in depth. I'll give some examples to motivate this, using features we built this year for Mirror.\n\n## Exhibit A - $WRITE Race\n\n[$WRITE Race](https://mirror.xyz/race) has been successful. But how did it come about? In a discussion that [Denis](https://d.mirror.xyz/) and I had about onboarding new users, while I was on a vacation in Eagle Lake, CA., we articulated a clear problem: we wanted to have the best users join, but we didn't want to be responsible to choose those people ourselves. We wanted the community to develop organically - almost like a living organism.\n\nI first joined crypto through some time spent at a friend's company, [Numerai](https://numer.ai/), where I learned about staking using tokens on Ethereum. There is overlap between staking and $WRITE Race, because both are trying to solve the problem of generating high-quality suggestions from a group of people. Both products losely solve that problem by constraining submission via a token, and promising a reward in exchange.\n\nHere, understanding the problem-solution relationship for staking on Etheruem was key to unlocking the mechanism of $WRITE Race. Even if we didn't directly use staking, it was familiarity with that paradigm that unlocked our creativity.\n\n![@strollinghome thinking deeply about crypto primitives in the morning at Eagle Lake](https://images.mirror-media.xyz/publication-images/40276c11-2d98-44b4-8b37-80b1f8ac6367.jpeg?height=1200&width=1600)\n        \n## Exhibit B - Splits\n\nMany protocols have attempted ways to split funds among a group of accounts. I've seen a dozen of these contracts, and most of them can't scale beyond a dozen recipients because they don't have the right primitive to unlock scalability.\n\nOur solution with [Splits](https://dev.mirror.xyz/mQ03-JXlfdoBnRrZisC5X3kM9nBkOILlHwxbdq382Gw) was to use Merkle Proofs to allow unlimited split allocations, which proved to be popular. I was familiar with Merkle Proofs from having read deeply through the Uniswap Merkle Distributor.\n\nJust being familiar with Merkle Proofs unlocked a whole new feature, when the problem was presented.\n  \n[](https://twitter.com/viamirror/status/1389627591120785411?s=20)\n\n## Exhibit C - Crowdfunds and Scaling Crowdfunds\n\nMirror Crowdfunds have been very successful. We've managed to raise hundreds of thousands of dollars for an incredibly diverse set of projects - from [Essays](https://j.mirror.xyz/uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0) to [Novels](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg) to [Products](https://d.mirror.xyz/FLqkPA3iN4x-p97UhfhWwaCx8rBmVo-1yttY20oaob4).\n\nBehind the success of Crowdfunds is a deep understanding simple primitive - minting and burning ERC20 tokens. We mint an ERC20 token when someone contributes to the project, and we burn it when they want to claim the underlying ETH. If you aren't deeply familiar with this mechanism, it might not occur to you as the way to approach the Crowdfunding problem, and you might opt instead for a generic data structure to hold the allocations. I've seen a few implementations like this, and they're just inherently very limited. ERC20s unlock so much more.\n\nMore sophisticated is the scaling of Crowdfunds. We scale Crowdfunds by deploying a single logic contract, and then [delegating to that contract](https://github.com/mirror-xyz/crowdfund/tree/main/contracts) from each individual crowdfund. This is the proxy pattern that is popular in the Ethereum space. But it really takes being familiar with the pattern to know how to apply this well.\n\n## Exhibit D - Signing\nOutside of Ethereum, we use a few primitives for cryptographically signing content. In fact, we use this for all verification on the Mirror platform, and have no login sessions. This will allow us to prove that the content comes from the author, regardless of whether we have an API running or not. This will be critical for our decentralization plans.\n\nThe signing keys are also not the same as the user's Ethereum public key. This is important, because it allows users to interact on the platform — writing, commenting (soonish), etc — without needing to take our an Ethereum wallet that might have funds on it just to sign a blog post entry.\n\nUnderstanding how to do this (quickly) meant having deep familiarity with the types of cryptographic signatures that are supported on Ethereum, the browser, and how to string them together to make something that is a good product experience.\n\n---\n\nI hope I've motivated the case to learn the primitives. I believe this holds true for any endeavor. Feel free to connect with me [on Twitter](https://twitter.com/strangechances) to discuss primitives and crypto more.", "timestamp": 1624067432, "digest": "ZjAdY-tN25li2hpz5VqhlJLpDTu82WWCRKbz3bObfWo", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "XqrHendyjMqF9IsBXqJzTkMvKCp75wwb-BvLhcRx_Q0", "title": "A Lover of Horizons", "body": "> And the world again\n> suddenly worth risking\n> worth seeing,\n> worth innocence\n> worth everything.\n\nMy writing dried up recently - except, see: [Engineering Splits](https://dev.mirror.xyz/V_7Jp1hy_g8bz-J1B4Wb5KYSmj5Lt4W7q7cw0noxJsU) - and I'm here to explain why. I had health complications. A hernia that I probably attained from CrossFit workouts. I got fevers. I lost 15lbs. I took antibiotics twice, and had invasive procedures to diagnose the issue. It took a few months to figure it all out.\n\nMy much idealized girlfriend broke up with me during one of those fevers - before I really understood what was happening. My temperature was 104° F as she said the words, \"I'm not excited about our future.\"\n\n> Perfection is a fragile, ice-thin ground\n> that barely holds our human weight,\n> one false step and everything cracks\n\nDuring this time, it felt like foundations of my life's landscape were suddenly shifting.\n\n> being left with the dread of sadness and the hollow feeling of unwanted new beginnings\n\nOver the years, I've found resilience through a spiritual practice of letting go. I believe that a paradox of letting someone go healthfully is that the need for them decreases while, simultaneously, love for them increases - love actually being orthogonal to desire. This is true as well for friends.\n\n> make deep connections, not deep attachments\n\nIt took a while to process everything. But it's not *time* that heals wounds, it's the courage to move inwards and fully experience the reality. And then to move outwards and join the world again.\n\n> Put down the weight of your aloneness and easy into the conversation\n\nI'm happy to say that I'm now in good health. It was depressing to discover though that I may need to stop weightlifting, which I've been doing for a decade, and CrossFit, which has been vital for me the last two years. I need to shed a part of my identity, but this is a good thing - a wise person sheds willingly. I'll just need to find new ways to feel strong.\n\nAll of this is part of change, which is life. In the future, CRISPR-based gene-editing will prevent the type of herniation I experienced. We'll be less vulnerable to nature in the short-term, but we ultimately still belong entirely to her. Vulnerability, injury, breakups, breakdowns are all a part of this game we're playing.\n\n> Whatever one's theory of the universe, this must be established first of all: I am a part of the Whole which is governed by Nature.\n\n\n> how many times has everything\n> come crashing down and left you feeling\n> as though the world was over?\n> \n> now,\n> how many times\n> after grieving\n> \n> have you gotten back up,\n> embraced the power of your determination\n> and moved forward into a new life?\n\n*Quotes are from David White (RIP) and Yung Pueblo.*", "timestamp": 1624067615, "digest": "Dhi3o5ryjy8K7xM_gnPWbQFHpV-pR-7cwKzsnoiLSwA", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "tqmvcBoddqtgf-E81QFrlJp2PnU3cbxQ50EHtGiWaHM", "title": "NFTs and the Destruction of the Authority of Art", "body": "![*Single Mona Lisa by George Pusenkoff*](https://images.mirror-media.xyz/publication-images/16d8c5cc-1781-4421-9dd5-4be33df2e852.jpeg?height=628&width=640)\n\nWhen an image is presented as art, the way we see it is affected by culturally learned assumptions about beauty, form, status, taste, etc. Many these learnings stem from an \"authority on art\" - institutions (many of them public) that legitimize art versus entertainment. Many of these learnings are been incongruous with a modern, digital world.\n\nThe legacy of the \"authority on art\" originates before the camera, when the same painting could never been seen in two places at once and ownership was power. But when digitalization destroyed the uniqueness of images, power was ascertained through authority on authenticity. When an image is reproduced through digitization, its meaning forks into many meanings, and the meaning of the original will lie in its relation to its reproductions, instead of in relation to other images. The meaning changes from what the work *says*, to *what it uniquely is*. Its value depends upon its rarity as a specific artifact — as a relic.\n\n![*After the Mona Lisa 8, 2010 - Devorah Sperber*](https://images.mirror-media.xyz/publication-images/3bdd9bf0-1523-419f-ac7f-1496382e7e1c.jpeg?height=640&width=434)\n\nFor the most part, the value of these physical relics has been perpetuated through a sophisticated culture of experts that spend years cataloging and verifying who commissioned the work, who owned it, its likely date, etc. This elaborate system creates an authority on authenticity and therefore of value, which serves to perpetuate the status of the ruling class it belongs to.\n\nBlockchains change this, because they precisely handle matters of authenticity for all digital media. Since the majority of art is now digital, there is much less for this old system to claim to do, and the mysterious aura surrounding the world of art over past centuries will likely dissipate. This demise will likely invite greater democratic participation. Pop works such as *Nyan Cat* fetch for high prices, and authenticity is in theory guaranteed and accessible forever.", "timestamp": 1624068075, "digest": "DUgAxMzRwjuNv-LYiklnesTgYQ1IDqwX-hPksJb87yQ", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "EP--9lC0625sbabxQaoIuQbGKROPSiKppKHblcVZ6gQ", "title": "Just a Warmup for L2", "body": "Things are going to be wild on L2. Much faster, much cheaper — it's like the speed of light will have increased and everything will grow so much faster. Very exciting.\n\nBut for the time being, it often feels like we're in a holding pattern until the L2 solutions actually come out.\n\nWe'll say, \"this is an awesome feature, but it won't work when gas prices are really high. Would be amazing on L2.\" And it turns out to be true for most features.\n\nThere are many things about the L2 world that we really don't know. Some applications might, not work ideally on L2 — like those that really need integration with other protocols.\n\nMirror features will work really well on L2. Why? Because we have a lot of control over the user experience, and we can abstract some of that UX. \n\nThe main problem to solve will be onboarding people into the L2 that we choose to use. That's why it's really important that we pick the best L2 solution for our intended users and use-case.\n\nChoosing an L2 solution is more complicated than it seems. If we do a lot of NFT work on L2, then we probably don't want a large delay when exiting to L1 - because there isn't a fancy way to speed that up using finance bridging like you can with fungible tokens. \n\nWe're also very likely to continue to be creative and innovate on the protocol, so we want something that's very expressive.\n\nThe problem when trying to make this decision at the moment is that nobody has really shipped yet. zkSync promises something really amazing, but hasn't shipped. Immutable X seems cool, built on Starkware, but isn't out of private beta yet. Optimism and Arbitrum are on the cusp of rolling out, but just haven't yet...\n\nWe could deal with this by getting more involved with those projects — having meetings, reviewing code and APIs — and we've done this. But at the end of the day, we don't have complete information until they're on mainnet and people are using them.\n\nSo we're in a bit of a holding pattern, waiting to see what makes the most sense for us. And that's weird headspace. We're able to the future, but can't play with it yet.\n\nSome protocols have deployed to Polygon's Matic. That doesn't seem like a good long-term strategy for us, given that we expect many more options are going to exist in a few weeks, and Matic isn't considered the \"strong-tech\" option.\n\nSo anyway. We research and learn and wait, patiently.", "timestamp": 1624067882, "digest": "eQNO9u2dE9etftXDYRP5_RLU9j2SF6L7qY8aAACKYss", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "UsmZn0oFFYu3AaOhS4aC9Ei2qxtbV35c5nG7snUOQ4g", "title": "A Lover of Horizons", "body": "> And the world again\n> suddenly worth risking\n> worth seeing,\n> worth innocence\n> worth everything.\n\nMy writing dried up recently - except, see: [Engineering Splits](https://dev.mirror.xyz/V_7Jp1hy_g8bz-J1B4Wb5KYSmj5Lt4W7q7cw0noxJsU) - and I'm here to explain why. I had health complications. A hernia that I probably attained from CrossFit workouts. I got fevers. I lost 15lbs. I took antibiotics twice, and had invasive procedures to diagnose the issue. It took a few months to figure it all out.\n\nMy much idealized girlfriend broke up with me during one of those fevers - before I really understood what was happening. My temperature was 104° F as she said the words, \"I'm not excited about our future.\"\n\n> Perfection is a fragile, ice-thin ground\n> that barely holds our human weight,\n> one false step and everything cracks\n\nDuring this time, it felt like foundations of my life's landscape were suddenly shifting.\n\n> being left with the dread of sadness and the hollow feeling of unwanted new beginnings\n\nOver the years, I've found resilience through a spiritual practice of letting go. I believe that a paradox of letting someone go healthfully is that the need for them decreases while, simultaneously, love for them increases - love actually being orthogonal to desire. This is true as well for friends.\n\n> make deep connections, not deep attachments\n\nIt took a while to process everything. But it's not *time* that heals wounds, it's the courage to move inwards and fully experience the reality. And then to move outwards and join the world again.\n\n> Put down the weight of your aloneness and easy into the conversation\n\nI'm happy to say that I'm now in good health. It was depressing to discover though that I may need to stop weightlifting, which I've been doing for a decade, and CrossFit, which has been vital for me the last two years. I need to shed a part of my identity, but this is a good thing - a wise person sheds willingly. I'll just need to find new ways to feel strong.\n\nAll of this is part of change, which is life. In the future, CRISPR-based gene-editing will prevent the type of herniation I experienced. We'll be less vulnerable to nature in the short-term, but we ultimately still belong entirely to her. Vulnerability, injury, breakups, breakdowns are all a part of this game we're playing.\n\n> Whatever one's theory of the universe, this must be established first of all: I am a part of the Whole which is governed by Nature.\n\nIt's time to see new horizons.\n\n> how many times has everything\n> come crashing down and left you feeling\n> as though the world was over?\n> \n> now,\n> how many times\n> after grieving\n> \n> have you gotten back up,\n> embraced the power of your determination\n> and moved forward into a new life?\n\n* Quotes are from David White, Aurelius, and Yung Pueblo", "timestamp": 1624067699, "digest": "Dhi3o5ryjy8K7xM_gnPWbQFHpV-pR-7cwKzsnoiLSwA", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "9eUor3ljnMiWCAz5HpB_UfdqYI8I2T-bU_Evj0Z89So", "title": "NFTs and the Authority on Art", "body": "![*Single Mona Lisa by George Pusenkoff*](https://images.mirror-media.xyz/publication-images/16d8c5cc-1781-4421-9dd5-4be33df2e852.jpeg?height=628&width=640)\n\nWhen an image is presented as art, the way we see it is affected by our learned assumptions about beauty, form, status, and taste. \n\nIn the United States, many of these learnings stem from a cultural \"authority on art\" that began in the 1850s in Boston (by those known as the \"Boston Brahmins\"). These institutions have aimed to legitimize art versus entertainment and \"sacralize\" special works as \"high art\". \n\nMany of these learnings, however, are incongruous with a modern, digital world.\n\nThe legacy of the \"authority on art\" originates before the camera, when the same painting could never been seen in two places at once and ownership was power. But when digitalization destroyed the uniqueness of images, power was ascertained through authority on authenticity. When an image is reproduced through digitization, its meaning forks into many meanings, and the meaning of the original will lie in its relation to its reproductions, instead of in relation to other images. The meaning changes from what the work *says*, to *what it uniquely is*. Its value depends upon its rarity as a specific artifact — as a relic.\n\n![*After the Mona Lisa 8, 2010 - Devorah Sperber*](https://images.mirror-media.xyz/publication-images/3bdd9bf0-1523-419f-ac7f-1496382e7e1c.jpeg?height=640&width=434)\n\nFor the most part, the value of these physical relics has been perpetuated through a sophisticated culture of experts that spend years cataloging and verifying who commissioned the work, who owned it, its likely date, etc. This elaborate system creates an authority on authenticity and therefore of value, which serves to perpetuate the status of the ruling class it belongs to.\n\nBlockchains change this, because they precisely handle matters of authenticity for all digital media. Since the majority of art is now digital, there is much less for this old system to claim to do, and the mysterious aura surrounding the world of art over past centuries will likely dissipate. This demise will likely invite greater democratic participation. Pop works such as *Nyan Cat* fetch for high prices, and authenticity is in theory guaranteed and accessible forever.", "timestamp": 1624068440, "digest": "DUgAxMzRwjuNv-LYiklnesTgYQ1IDqwX-hPksJb87yQ", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "yKZPKWa0JdXJjWaiSkkEjVpdL16n4VjwGuVPoKT4VI8", "title": "NFTs Burn the Authority on Art", "body": "![*Single Mona Lisa by George Pusenkoff*](https://images.mirror-media.xyz/publication-images/16d8c5cc-1781-4421-9dd5-4be33df2e852.jpeg?height=628&width=640)\n\nWhen an image is presented as art, the way we see it is affected by our learned assumptions about beauty, form, status, and taste. \n\nIn the United States, many of these learnings stem from a cultural \"authority on art\" that began in the 1850s in Boston (by those known as the \"Boston Brahmins\"). These institutions have aimed to legitimize art versus entertainment and \"sacralize\" special works as \"high art\". \n\nMany of these learnings, however, are incongruous with a modern, digital world.\n\nThe legacy of the \"authority on art\" originates before the camera, when the same painting could never been seen in two places at once and ownership was power. But when digitalization destroyed the uniqueness of images, power was ascertained through authority on authenticity. \n\nWhen an image is reproduced through digitization, its meaning forks into many meanings, and the meaning of the original will lie in its relation to its reproductions, instead of in relation to other images. The meaning changes from what the work *says*, to *what it uniquely is*. Its value depends upon its rarity as a specific artifact — as a relic.\n\n![*After the Mona Lisa 8, 2010 - Devorah Sperber*](https://images.mirror-media.xyz/publication-images/3bdd9bf0-1523-419f-ac7f-1496382e7e1c.jpeg?height=640&width=434)\n\nFor the most part, the value of these physical relics has been perpetuated through a sophisticated culture of experts that spend years cataloging and verifying who commissioned the work, who owned it, its likely date, etc. This elaborate system creates an authority on authenticity and therefore of value, which serves to perpetuate the status of the ruling class it belongs to.\n\nBlockchains change this, because they precisely handle matters of authenticity for all digital media. Since the majority of art is now digital, there is much less for this old system to claim to do, and the mysterious aura surrounding the world of art over past centuries will likely dissipate. This demise will likely invite greater democratic participation. Pop works such as *Nyan Cat* fetch for high prices, and authenticity is in theory guaranteed and accessible forever.", "timestamp": 1624068583, "digest": "DUgAxMzRwjuNv-LYiklnesTgYQ1IDqwX-hPksJb87yQ", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "GhiIIr6yBrfQdenSZdGKloVplY5YSPByyo_Y5hIdoRU", "title": "NFTs Burn the Authority on Art", "body": "![*Single Mona Lisa by George Pusenkoff*](https://images.mirror-media.xyz/publication-images/16d8c5cc-1781-4421-9dd5-4be33df2e852.jpeg?height=628&width=640)\n\nWhen an image is presented as art, the way we see it is affected by our learned assumptions about beauty, form, status, and taste. \n\nIn the United States, many of these learnings stem from a cultural \"authority on art\" that began in the 1850s in Boston (by those known as the \"Boston Brahmins\"). These institutions have aimed to legitimize art versus entertainment and \"sacralize\" special works as \"high art\". \n\nMany of these learnings, however, are incongruous with a modern, digital world.\n\nThe legacy of the \"authority on art\" originates before the camera, when the same painting could never been seen in two places at once and ownership was power. But when digitalization destroyed the uniqueness of images, power was ascertained through authority on authenticity. When an image is reproduced through digitization, its meaning forks into many meanings, and the meaning of the original will lie in its relation to its reproductions (i.e. as \"the first of x reproductions\"), more than its relation to other images (\"the first painting that used linear perspective). \n\nThrough digitization, the meaning changes from what the work *says*, to *what it uniquely is*. Its value depends upon its rarity as a specific artifact — i.e. as a relic.\n\n![*After the Mona Lisa 8, 2010 - Devorah Sperber*](https://images.mirror-media.xyz/publication-images/3bdd9bf0-1523-419f-ac7f-1496382e7e1c.jpeg?height=640&width=434)\n\nFor the most part, the value of these physical relics has been perpetuated through a sophisticated culture of experts that spend years cataloging and verifying who commissioned the work, who owned it, its likely date, etc. This elaborate system creates an authority on authenticity and therefore of value, which serves to perpetuate the status of the ruling class it belongs to.\n\nBlockchains change this, because they precisely handle matters of authenticity for all digital media. \n\nSince the majority of art is now digital, there is much less for this old system to claim to do, and the mysterious aura surrounding the world of art over past centuries will likely dissipate. This demise will likely invite greater democratic participation. Pop works such as *Nyan Cat* fetch for high prices, and authenticity is in theory guaranteed and accessible forever.", "timestamp": 1624068774, "digest": "DUgAxMzRwjuNv-LYiklnesTgYQ1IDqwX-hPksJb87yQ", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "LOirAGLmjFnYw0yzMFJqZ-_s5UVLG45z6HGOAFykyso", "title": "NFTs Burn the Authority on Art", "body": "![*Single Mona Lisa by George Pusenkoff*](https://images.mirror-media.xyz/publication-images/16d8c5cc-1781-4421-9dd5-4be33df2e852.jpeg?height=628&width=640)\n\nWhen an image is presented as art, the way we see it is affected by our learned assumptions about beauty, form, status, and taste. \n\nIn the United States, many of these learnings stem from a cultural \"authority on art\" that began in the 1850s in Boston (by those known as the \"Boston Brahmins\"). These institutions have aimed to legitimize art versus entertainment and \"sacralize\" special works as \"high art\". \n\nMany of these learnings, however, are incongruous with a modern, digital world.\n\nThe legacy of the \"authority on art\" originates before the camera, when the same painting could never been seen in two places at once and ownership was power. But when digitalization destroyed the uniqueness of images, power was ascertained through authority on authenticity. When an image is reproduced through digitization, its meaning forks into many meanings, and the meaning of the original will lie in its relation to its reproductions (i.e. as \"the first of x reproductions\"), more than its relation to other images (\"the first painting that used linear perspective). \n\nThrough digitization, the meaning changes from what the work *says*, to *what it uniquely is*. Its value depends upon its rarity as a specific artifact — i.e. as a relic.\n\n![*After the Mona Lisa 8, 2010 - Devorah Sperber*](https://images.mirror-media.xyz/publication-images/3bdd9bf0-1523-419f-ac7f-1496382e7e1c.jpeg?height=640&width=434)\n\nFor the most part, the value of these physical relics has been perpetuated through a sophisticated culture of experts that spend years cataloging and verifying who commissioned the work, who owned it, its likely date, etc. This elaborate system creates an authority on authenticity and therefore of value, which serves to perpetuate the status of the ruling class it belongs to.\n\nBlockchains change this, because they precisely handle matters of authenticity for all digital media. Since the majority of art is now digital, there is much less for this old system to claim to do, and the mysterious aura surrounding the world of art over past centuries will likely dissipate. This demise will likely invite greater democratic participation. Pop works such as *Nyan Cat* fetch for high prices, and authenticity is in theory guaranteed and accessible forever.", "timestamp": 1624068716, "digest": "DUgAxMzRwjuNv-LYiklnesTgYQ1IDqwX-hPksJb87yQ", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "RTlSzVdkw9alRIpRIxmp-Tal_sAuuYUSioVUO8LhMeI", "title": "Should Protocol Contracts be Upgradable?", "body": "There are some specific cases where contracts should be upgradable. However, I think that for the most part, it's much better, and aligned with the ideals of the space, for contracts not to be upgradable.\n\nThe founding myth of Ethereum is that Vitalik was frustrated that a video game he way playing could change its rules. He had been leveling up some character, when the game manufacturer decided to change the way it allocates skills. And so he built Ethereum, where you can't change the rules of the game.\n\nObviously that's a myth and not the \"real story\" of why Ethereum exists, but I think that foundation myths are really important. As I tried to explain in my post about Facebook and the movie *The Social Network,* foundation myths illustrate what's psychologically for us to understand about platform, and can be powerful.\n\nIn Ethereum, the psychologically essential narrative is that there are games here where the rules can't change on you by some centralized party.\n\nI think that protocols that abide by this will do well. Uniswap is a good example of a protocol that roles out in versions that don't upgrade. ENS is another example of this. Early Compound also couldn't upgrade, as well as many other great protocols.\n\nUpgradability is essentially hack that comes from being able to delegate calls to an address saved in storage — where the storage is mutable. \n\nIt makes things very complicated, both for the end users and for the organization (company, DAO, etc.) that tries to organize upgrades.\n\nThere are some instances where it would be very difficult to move users or assets to a new version. Examples of this include smart contract wallet platforms like Dharma and Argent. Another example might be Compound, where improvements can be made to the cTokens, but we don't actually want to move our cTokens to new versions, because it might have tax implications or be otherwise troublesome.\n\nSo, clearly there are these cases where upgradability makes sense, in which we should think about the parts that are upgradable as versioned modules. Argent's style of having modules that are swappable makes sense to me.\n\nI'm sad when I see a protocol like [Foundation only provide a proxy](https://etherscan.io/address/0xcDA72070E455bb31C7690a170224Ce43623d0B6f#code) that covers some mysterious upgradable black box. That seems the opposite of what we're trying to build in Ethereum in general. It means that you don't understand what's happening under the hood, and that whatever those rules are, they could just change on you.\n\n![The Foundation protocol is just obscured by an upgradability proxy, and the implementation is not available. What's being communicated is that Foundation is a black box where the rules are arbitrary. This is not the point of Web3.](https://images.mirror-media.xyz/publication-images/43d7afa5-750f-48d6-a3e6-2e75c95cb7ef.png?height=1126&width=1540)\n\nI'm definitely a bit conservative here, and I'll continue to wish for more versions and fewer upgradable protocols. Versions are simpler for everyone, and it's actually more aligned with the core narrative of what web3 and Ethereum is about. I think we should strive to be less upgradable.", "timestamp": 1624068924, "digest": "ruHxedLZQODoc4lO3UBLXhI7dEbpGoJciqalArjvC0o", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "uA6MdQY9ZGP8bvs-DY0zN7w1PoAdHH6SBEldjr4YYVA", "title": "Forefront x Occulted - Genesis NFT Drop", "body": "Forefront is excited to announce its first NFT Drop collab with Mintfunds uprising artist Ikaro Cavalcante (Occulted).\n\nOcculted is a transdisciplinary Brazilian artist working with 3D and sounds that reconstruct common spaces with their affective memory, be they virtual, such as games, or physical, such as internet cafes. Their most recent work \"Perennial Links\" was featured on [Sotheby’s Natively Digital NFT Auction](https://www.sothebys.com/en/buy/auction/2021/natively-digital-a-curated-nft-sale-2/perennial-links).  \n\nThe drop features two limited edition NFTs, entitled \"Genesis Connect\" and \"Genesis Access\", auctioned off as 1/1 and multiple editions, with a portion of the proceeds going to Mint Fund to further support crypto creators on their NFT journey\n\nThe artwork comprises FF metaverse \"like\" vibes in a completely open and experimental artistic playground while capturing the community essence, its value and evolving culture.\n\n## Genesis Connect\n\nThe first piece “Genesis Connect” is being auctioned off as a 1 of 1 NFT Drop. 60% of the proceeds of this auction will go to the artist, 30% to Forefront and the remaining 10% to Mint Fund.\n\n\"Genesis Connect\" NFT auction is live at [Forefront Auction House](https://forefront.auction).\n\n[](https://forefront.auction)\n\nIn addition to the 1/1 Original NFT, the The top bidder will also receive:\n\n- Lifetime access to Forefront exclusive content and future drops;\n- A limited-edition Forefront \"Genesis Drop Sweatshirt\";\n- Recognition of being an early Forefront supporter;\n- A ticket to redeem the NFT for 1 edition sponsorship on our weekly newsletter;\n- Our many thanks and appreciation.\n\n## Genesis Access\n\nThe second piece entitled \"Genesis Access\" is an edition of 100, available first come first serve, never to be minted again. Supporters will receive the original NFT, immediate access to our discord community role (Join our discord and type !join and connect the wallet holding the NFT), a reward of 200 $FF and our lifetime of gratitude for being an early Forefront supporter. \n\nHolding \"Genesis Access\" will also give you access to all FF & partners token gated content and future drops.\n\n[Genesis Access](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=5)\n\nBuyers of this edition will also enter our raffle where 2 lucky winners will receive our limited-edition Forefront \"Genesis Drop\" Sweatshirt.\n\n*This NFT is a ticket to our future endeavour on the metaverse, the master key if you will.*\n\n\nProceeds of multiple editions sale will go towards funding Forefront Content engine, including our weekly curated newsletter and our self hosted publication.\n\n***\n\n![](https://images.mirror-media.xyz/publication-images/6d8c03a0-1e44-4995-893b-e31a9db16451.gif?height=370&width=800)\n\n***\n\n## About Forefront\n\nForefront is the leading insight aggregator across the social token landscape. It’s the home of exclusive content on creator economy, a weekly newsletter and profiles for 23+ projects and counting.\n\n***\n\n## About Ikaro Cavalcante (Occulted)\n\nIkaro Cavalcante (Occulted) (1995, São Paulo - SP) works with 3D and sounds that reconstruct common spaces with their affective memory, be they virtual, such as games, or physical, such as internet cafes. \n\nOcculted produces attempts to take back themself and their experiences in subjectivity, trying to build a place for the plenitude of existence, since they are not allowed such a place in the construction of their own world until then. For this reason, the Brazilian artist creates unruly images and sounds in a place of disobedience and makes their works a counter-hegemonic fissure, liberating themself in subjectivities.\n\nFind them on [Twitter](https://twitter.com/occult3d), [Foundation](https://foundation.app/@occulted) or [Instagram](https://www.instagram.com/occulted/).\n\n***\n\n## About MintFund\n\nMintFund is a community project created with the sole purpose to build a support network for artists interested in bringing their art into the world of NFTs/cryptomedia. MintFund provides artists with the funds to mint NFTs (known as gas costs), and offers guidance, mentorship and advice for the growing community of cryptomedia artists. MintFund is accessible to all artists and we prioritize BIPOC and LGTBQIA+ artists, especially outside of North America and the European Union.", "timestamp": 1624090802, "digest": "OYyqJ5rlRkQz0d8YgBFCHRnnCYXGLL9DJ8zNsCcHkBA", "contributor": "0xaBaF40768e575bEb3244df2853A0505Cb2D2e4bB"}
{"id": "1TTNPwWvRrSFNuzXtZSnSjEdnC31xkDLtanpL0YNAMY", "title": "Test entry NFT minting", "body": "hai v2\n\n[test](crowdfund://0xb32Da0C1264922E232a07CcC0546809fF5A90028?version=tiered_1)", "timestamp": 1624117967, "digest": "vbA1StwywLtO7kFhbcZ0gO_EURYJBupVqBg5sYEdlac", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0x84fbcbb2bccfe2f94e4f1031b5eeaadf3ba7a088fe33278160f006aa4ae9048c\"}"}
{"id": "gvhPIJl1s84josTUb_NPbiufyCsBPxe7vlnyRsGyMbA", "title": "Generalized Auction Test", "body": "[Vanilla Crowdfund](crowdfund://0x5966C61D952D0C9e08C5dC349481Da1945455661?version=3)", "timestamp": 1624118036, "digest": "62UREF0LFWyPbDQvc1637Auxyt5z2EPGz-bmK4Syg7o", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "opaEIpXRb3SgFUzh-0F0kwcRAns0QT0SCSJEN2Lsd7U", "title": "Generalized Auction Test", "body": "[Vanilla Crowdfund](crowdfund://0x5966C61D952D0C9e08C5dC349481Da1945455661?version=3)", "timestamp": 1624118034, "digest": "62UREF0LFWyPbDQvc1637Auxyt5z2EPGz-bmK4Syg7o", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "XpnsWYw2JgavZ6XL5mRxNUynmDkchzy7RsjoG5xYtWU", "title": "Test entry NFT minting", "body": "hai v2\n\n[test](crowdfund://0xcfe85AB4384a1982E4D93a57E81221EcD7a19Fc9?version=tiered_1)", "timestamp": 1624121159, "digest": "vbA1StwywLtO7kFhbcZ0gO_EURYJBupVqBg5sYEdlac", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0x84fbcbb2bccfe2f94e4f1031b5eeaadf3ba7a088fe33278160f006aa4ae9048c\"}"}
{"id": "g78SO-NvlCj8XI8H7mWG7XHGpFFL52JNP3NZEhKtvEA", "title": "Generalized Auction Test", "body": "[Vanilla Crowdfund](crowdfund://0x5966C61D952D0C9e08C5dC349481Da1945455661?version=3&network=rinkeby)", "timestamp": 1624121789, "digest": "62UREF0LFWyPbDQvc1637Auxyt5z2EPGz-bmK4Syg7o", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "66kSOL8gMdCnIuxs-tvKUC0Ke20l0e8yGJOfdM6JOxk", "title": "Tiered Crowdfund", "body": "hai v2\n\n[test](crowdfund://0xcfe85AB4384a1982E4D93a57E81221EcD7a19Fc9?version=tiered_1)", "timestamp": 1624123306, "digest": "vbA1StwywLtO7kFhbcZ0gO_EURYJBupVqBg5sYEdlac", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0x84fbcbb2bccfe2f94e4f1031b5eeaadf3ba7a088fe33278160f006aa4ae9048c\"}"}
{"id": "tF1-LNmCJNCEEbh8-SN5nNAGWxAThwd1huXUMaYNp_8", "title": "Vanilla Crowdfund", "body": "[Vanilla Crowdfund](crowdfund://0x5966C61D952D0C9e08C5dC349481Da1945455661?version=3&network=rinkeby)", "timestamp": 1624123295, "digest": "62UREF0LFWyPbDQvc1637Auxyt5z2EPGz-bmK4Syg7o", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "WC39PynXCW-p9eGdlo2U1vx4C58wrfw4-nxl02RJI_k", "title": "Tiered Crowdfund", "body": "Demo\n\n[Tiered Crowdfund](crowdfund://0x49239aC2578cB21b1257AB1516df9b48Ecb52432?version=tiered_1&network=rinkeby)", "timestamp": 1624123755, "digest": "xlkvfclWdLxai5s58tbxjY9Tlsq_CJnXhQnYUuXZBQg", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "qMZIKt6jBQ_KCJD7x78GQUaU_aEMcNkKYNp7ZUNmAZM", "title": "Death to “Meal, Copy and Credit” — The Rise of the Crypto Filmmakers", "body": "## **The Crypto Skeptic: Where I dismissed the NFT craze**\n\n[Crypto Skeptic](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=14)\n\nEver since Bitcoin came onto the scene in 2009, I have been generally skeptical of crypto currencies. While I tend to be an early adopter of new technologies, I was not the type to build a computer to mine the early Bitcoins. Later as it gained real value, it got swarmed by speculators and flippers attracting the *Wall Street Bro* types who became *Crypto Bros*. Bitcoin went from the digital equivalent of gold mining cultural, to the crypto version of stock exchange speculating and gambling, and neither interested me.\n\nWhen “Everydays: The First 5,000 Days” by Mike Winkelmann (the artist known as Beeple) sold as a Non-Fungible-Token (NFT) on March 11th, 2021 for over sixty-nine million dollars in a Christie’s auction, I also didn’t get sucked into the hype. The art world might have been outraged, but it didn’t seem anymore ridiculous than the sales of Jeff Koons’ or David Hockney’s non-digital art work for upwards of ninety million dollars. After a number of articles kept popping up, I finally clicked through to read about NFTs — blockchain signatures that authenticate a piece of digital art, or any digital data, to the creator or single owner. Also not that different from what Christie’s or museums do to authenticate IRL art, so still not that interesting…Moving on.\n\nThe article that finally caught my eye was *NFTs Need and Audience* by Jarrod Dicker, Jonathan Glick, and Tal Shachar. It came in a mediaREDEF newsletter as I worked on my second installment of an essay on Audience Engagement. Now NFTs were crossing with my interests of audience engagement and UX design. I followed the rabbit hole.\n\n> T<!-- -->his can change the way media companies and platforms structure their relationships with both creators and consumers under the value proposition of “ownership.” They can be groups of fans, buying clubs and collectives, perhaps formalized in a DAO structure. (Jarrod Dicker, Jonathan Glick, and Tal Shachar, *NFTs Need an Audience*)\n\n## **The Crypto Curious: Where I go down the rabbit hole**\n\n![](https://miro.medium.com/max/3840/1\\*ChbePy7Qf3MsU0yo2xe9dg.jpeg)\n\nClicking through the links of the article was the equivalent of walking through a forest and turning over a log to find the underside teeming with organisms, a whole ecosystem beneath the forest floor. Detritivores working tirelessly and quietly, feeding on the decomposing bodies of NFT speculators, to create the organic material layer that will fertilize the future growth of the forest.\n\nWhat I had missed in all the NFT hype and controversy about whether owning a piece of digital art meant anything, is that the NFT system resides on a different blockchain system than Bitcoin called Ethereum.\n\nEthereum started as a white paper published in 2013 by Vitalik Buterin, the founder of Ethereum, before the project’s launch in 2015. While Ethereum has it’s own currency commonly referred to as ETH, the novelty comes from it’s ability to be a foundation for other protocols that can create seemingly endless variations of social tokens and smart contracts. Everything being built in this space has come to be referred to as *web3*, while the rest of us still exist in *web2*. I suddenly realized that web3 will be the future we all live in, with crypto wallets to sign, verify, and track all forms of digital ownership.\n\nAn evangelical groups of creators, writers, and thinkers in the web3 space, who have a center of gravity in a private Discord called Friends With Benefits (FWB) and on this newly formed publishing platform, [Mirror.xyz](http://mirror.xyz/), see the opportunity to create new ownership economies between creators and their communities without the centralized middleman, third party of Facebook/Instagram, Substack, Medium, Twitter, Paetreon, inserted between the creator-fan relationship.\n\n> N<!-- -->FT creators in the future will have two paths: independent or collective. As an independent, creators can realize the full upside of their NFT creations and earn built-in royalties. But the collective model is an entirely new way to build distribution. Because the NFTs are programmable, the royalties can be broken down further into fractional shares. Instead of a creator earning their full share of royalties on share, they can distribute royalties to agents or collectives, who can help the creator gain distribution opportunities for the NFT. (Jarrod Dicker, *A New Media Structure: The Ownership Economy*)\n\nThe history and modern practice of royalty payments has been used in the music, film & publishing since the U.S. federal copyright law of 1790. The proposition for creators is that their creation can keep monetizing for them and supporting them while they going through the gestation and process of creation for the next piece. Artist have traditionally subsisted by having patrons or royalties.\n\nThe new form of NFT in combination with auctions and smart contracts seems to promise the ability to create a mixed portfolio for creators of royalties and committed patrons. Then comes the fractionalized NFT that can allow splits to let creators share the royalties with a collective, agents or committed patrons. When the associated NFT gets sold, the smart contract executes, and everyone holding a share gets paid.\n\nThe challenge with traditional royalties has been that it requires a large studio corporation and/or union with teams of lawyers and accountants to track and calculate royalty payouts. An independent creator would never be able to take advantage of this model. Here blockchain takes the place of all the lawyers, sales agents, accountants and payroll involved in sending out residual checks. Add some more careers to the digitization death list — go sign up for the new career paths of Blockchain Auditor, NFT Marketplace Manager, Smart Contract Designer.\n\n## **The Crypto Convert: Where I crypto-invest in a $NOVEL**\n\nFor independent filmmakers the model of NFT splits can also replace a funding platform which quickly became tiresome — Kickstarter. With splits you can also spell death to “Meal, Copy & Credit.” The now ironic pitch thrown around to young filmmakers asking them to come work on a short or indie film in exchange for getting fed on set, be given a copy of the film, and get a credit (aka experience and a resume bullet or reel clip). Now copy means being given a split of ownership, and their work on set can be compensated by the future sales and monetization.\n\n![](https://miro.medium.com/max/3840/1\\*B6gz\\_2MYf4lZDIqejfrWfw.jpeg)\n\nTo prove that any of this can work and take hold, the crew behind [Mirror.xyz](http://mirror.xyz/) has helped some of their early adopters setup auction and splits of tokenized NFTs seen with [$ESSAY](https://j.mirror.xyz/uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0), [$GENERALIST](https://generalist.mirror.xyz/1T0h7VGDcECJuifK4TPDfRoUQ3zaO_tPwdZV-dtnNqw), and [Power to the Person](https://notboring.mirror.xyz/SPV\\_-bchriVn_ncDj8OgnLccSb5qAsU0sXNpg9y_UTk).\n\nNow I was convinced that having a crypto wallet is the way of the future and used the [NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide) as a starting point to setup a Metamask wallet and buy $50 USD worth of ETH. I set this up just in time to catch Emily Segal’s experiment to crowdfund her next novel with an auction of the token [$NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg). At the time of the auction, I purchased a share of the token for $20. Now in addition get thanked in the acknowledgements, I will also get a split when she mints and sells Act I of the book, and then again when she sells the first edition of the final book as an NFT.\n\nThe true potential of this whole scheme exceeds the ability to just raise funds from a pool of people with crypto wallets and ETH. A dynamic begins to form where a creator can reward their most diehard fans and supporters with stake in the creation of the next piece of art or media. Those people will then have a true investment in sharing and promoting that final piece when it comes time to monetize thus amplifying the word-of-mouth marketing.\n\n## Next time…\n\nThe NFT crazy has not been lost on filmmakers from [Trevor Hawkins](https://independent-magazine.org/2021/04/01/independent-film-lotawana-becomes-first-movie-to-be-sold-as-nft/#:\\~:text=Independent%20filmmaker%20Trevor%20Hawkins'%20Lotawana,sailboat%20on%20Missouri's%20Lake%20Lotawana.) to [Kevin Smith](https://deadline.com/2021/04/kevin-smith-killroy-was-here-nft-sale-jay-and-silent-bob-crypto-studio-1234733439/) to Anonymous Content and Permanent Content tackling [NFT-inspired IP](https://www.hollywoodreporter.com/news/nft-ip-first-non-fungible-character-optioned-for-tv-and-film). These early forays are claiming “firsts,” but do not actually leverage the true power of Ethereum for independent film funding and community building. Let’s start developing more creative ways to support up-and-coming creators outside the system, both auteurs and collectives that want to tell more original stories.\n\n\nFollow the rabbit hole:\n[NFTs Need an Audience](https://tals.substack.com/p/nfts-need-an-audience?utm_campaign=post&utm_medium=web&utm_source=copy)\n[A New Media Structure: The Ownership Economy](https://darkstar.mirror.xyz/srmoGiN_1pg_toQGzCupkjWFOaf8xi0mM60zYpn_pwI)\n[The fractionalization of NFTs will lead to better social tokens](https://jammsession.mirror.xyz/-xYcfFRlhDdLDSUgRMTYJAaRJBs2VG4LP34DnOV84mI)\n[NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide/)\n[Crowdfund a $NOVEL: Burn Alpha](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg)\n[Crowdfunding Writing with NFTs](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n", "timestamp": 1624130913, "digest": "vZhl4M8FUbpnnwvUsfy5Sh4Y8dMOg46l5HjHufDXbDc", "contributor": "0x445d959751d21b6A460B30D0cD0c88CE63B01847"}
{"id": "7Otz1cfAl69X0wSP666lt5Ghhwq46h4bCUkjL2BwXxs", "title": "Death to “Meal, Copy and Credit” — The Rise of the Crypto Filmmakers", "body": "## **The Crypto Skeptic: Where I dismissed the NFT craze**\n\n[Crypto Skeptic](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=14)\n\nEver since Bitcoin came onto the scene in 2009, I have been generally skeptical of crypto currencies. While I tend to be an early adopter of new technologies, I was not the type to build a computer to mine the early Bitcoins. Later as it gained real value, it got swarmed by speculators and flippers attracting the *Wall Street Bro* types who became *Crypto Bros*. Bitcoin went from the digital equivalent of gold mining cultural, to the crypto version of stock exchange speculating and gambling, and neither interested me.\n\nWhen “Everydays: The First 5,000 Days” by Mike Winkelmann (the artist known as Beeple) sold as a Non-Fungible-Token (NFT) on March 11th, 2021 for over sixty-nine million dollars in a Christie’s auction, I also didn’t get sucked into the hype. The art world might have been outraged, but it didn’t seem anymore ridiculous than the sales of Jeff Koons’ or David Hockney’s non-digital art work for upwards of ninety million dollars. After a number of articles kept popping up, I finally clicked through to read about NFTs — blockchain signatures that authenticate a piece of digital art, or any digital data, to the creator or single owner. Also not that different from what Christie’s or museums do to authenticate IRL art, so still not that interesting…Moving on.\n\nThe article that finally caught my eye was *NFTs Need and Audience* by Jarrod Dicker, Jonathan Glick, and Tal Shachar. It came in a mediaREDEF newsletter as I worked on my second installment of an essay on Audience Engagement. Now NFTs were crossing with my interests of audience engagement and UX design. I followed the rabbit hole.\n\n> T<!-- -->his can change the way media companies and platforms structure their relationships with both creators and consumers under the value proposition of “ownership.” They can be groups of fans, buying clubs and collectives, perhaps formalized in a DAO structure. (Jarrod Dicker, Jonathan Glick, and Tal Shachar, *NFTs Need an Audience*)\n\n## **The Crypto Curious: Where I go down the rabbit hole**\n\n[Crypto Curious](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=16)\n\nClicking through the links of the article was the equivalent of walking through a forest and turning over a log to find the underside teeming with organisms, a whole ecosystem beneath the forest floor. Detritivores working tirelessly and quietly, feeding on the decomposing bodies of NFT speculators, to create the organic material layer that will fertilize the future growth of the forest.\n\nWhat I had missed in all the NFT hype and controversy about whether owning a piece of digital art meant anything, is that the NFT system resides on a different blockchain system than Bitcoin called Ethereum.\n\nEthereum started as a white paper published in 2013 by Vitalik Buterin, the founder of Ethereum, before the project’s launch in 2015. While Ethereum has it’s own currency commonly referred to as ETH, the novelty comes from it’s ability to be a foundation for other protocols that can create seemingly endless variations of social tokens and smart contracts. Everything being built in this space has come to be referred to as *web3*, while the rest of us still exist in *web2*. I suddenly realized that web3 will be the future we all live in, with crypto wallets to sign, verify, and track all forms of digital ownership.\n\nAn evangelical groups of creators, writers, and thinkers in the web3 space, who have a center of gravity in a private Discord called Friends With Benefits (FWB) and on this newly formed publishing platform, [Mirror.xyz](http://mirror.xyz/), see the opportunity to create new ownership economies between creators and their communities without the centralized middleman, third party of Facebook/Instagram, Substack, Medium, Twitter, Paetreon, inserted between the creator-fan relationship.\n\n> N<!-- -->FT creators in the future will have two paths: independent or collective. As an independent, creators can realize the full upside of their NFT creations and earn built-in royalties. But the collective model is an entirely new way to build distribution. Because the NFTs are programmable, the royalties can be broken down further into fractional shares. Instead of a creator earning their full share of royalties on share, they can distribute royalties to agents or collectives, who can help the creator gain distribution opportunities for the NFT. (Jarrod Dicker, *A New Media Structure: The Ownership Economy*)\n\nThe history and modern practice of royalty payments has been used in the music, film & publishing since the U.S. federal copyright law of 1790. The proposition for creators is that their creation can keep monetizing for them and supporting them while they going through the gestation and process of creation for the next piece. Artist have traditionally subsisted by having patrons or royalties.\n\nThe new form of NFT in combination with auctions and smart contracts seems to promise the ability to create a mixed portfolio for creators of royalties and committed patrons. Then comes the fractionalized NFT that can allow splits to let creators share the royalties with a collective, agents or committed patrons. When the associated NFT gets sold, the smart contract executes, and everyone holding a share gets paid.\n\nThe challenge with traditional royalties has been that it requires a large studio corporation and/or union with teams of lawyers and accountants to track and calculate royalty payouts. An independent creator would never be able to take advantage of this model. Here blockchain takes the place of all the lawyers, sales agents, accountants and payroll involved in sending out residual checks. Add some more careers to the digitization death list — go sign up for the new career paths of Blockchain Auditor, NFT Marketplace Manager, Smart Contract Designer.\n\n## **The Crypto Convert: Where I crypto-invest in a $NOVEL**\n\nFor independent filmmakers the model of NFT splits can also replace a funding platform which quickly became tiresome — Kickstarter. With splits you can also spell death to “Meal, Copy & Credit.” The now ironic pitch thrown around to young filmmakers asking them to come work on a short or indie film in exchange for getting fed on set, be given a copy of the film, and get a credit (aka experience and a resume bullet or reel clip). Now copy means being given a split of ownership, and their work on set can be compensated by the future sales and monetization.\n\n[Crypto Convert](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=15)\n\nTo prove that any of this can work and take hold, the crew behind [Mirror.xyz](http://mirror.xyz/) has helped some of their early adopters setup auction and splits of tokenized NFTs seen with [$ESSAY](https://j.mirror.xyz/uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0), [$GENERALIST](https://generalist.mirror.xyz/1T0h7VGDcECJuifK4TPDfRoUQ3zaO_tPwdZV-dtnNqw), and [Power to the Person](https://notboring.mirror.xyz/SPV\\_-bchriVn_ncDj8OgnLccSb5qAsU0sXNpg9y_UTk).\n\nNow I was convinced that having a crypto wallet is the way of the future and used the [NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide) as a starting point to setup a Metamask wallet and buy $50 USD worth of ETH. I set this up just in time to catch Emily Segal’s experiment to crowdfund her next novel with an auction of the token [$NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg). At the time of the auction, I purchased a share of the token for $20. Now in addition get thanked in the acknowledgements, I will also get a split when she mints and sells Act I of the book, and then again when she sells the first edition of the final book as an NFT.\n\nThe true potential of this whole scheme exceeds the ability to just raise funds from a pool of people with crypto wallets and ETH. A dynamic begins to form where a creator can reward their most diehard fans and supporters with stake in the creation of the next piece of art or media. Those people will then have a true investment in sharing and promoting that final piece when it comes time to monetize thus amplifying the word-of-mouth marketing.\n\n## Next time…\n\nThe NFT crazy has not been lost on filmmakers from [Trevor Hawkins](https://independent-magazine.org/2021/04/01/independent-film-lotawana-becomes-first-movie-to-be-sold-as-nft/#:\\~:text=Independent%20filmmaker%20Trevor%20Hawkins'%20Lotawana,sailboat%20on%20Missouri's%20Lake%20Lotawana.) to [Kevin Smith](https://deadline.com/2021/04/kevin-smith-killroy-was-here-nft-sale-jay-and-silent-bob-crypto-studio-1234733439/) to Anonymous Content and Permanent Content tackling [NFT-inspired IP](https://www.hollywoodreporter.com/news/nft-ip-first-non-fungible-character-optioned-for-tv-and-film). These early forays are claiming “firsts,” but do not actually leverage the true power of Ethereum for independent film funding and community building. Let’s start developing more creative ways to support up-and-coming creators outside the system, both auteurs and collectives that want to tell more original stories.\n\n\nFollow the rabbit hole:\n[NFTs Need an Audience](https://tals.substack.com/p/nfts-need-an-audience?utm_campaign=post&utm_medium=web&utm_source=copy)\n[A New Media Structure: The Ownership Economy](https://darkstar.mirror.xyz/srmoGiN_1pg_toQGzCupkjWFOaf8xi0mM60zYpn_pwI)\n[The fractionalization of NFTs will lead to better social tokens](https://jammsession.mirror.xyz/-xYcfFRlhDdLDSUgRMTYJAaRJBs2VG4LP34DnOV84mI)\n[NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide/)\n[Crowdfund a $NOVEL: Burn Alpha](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg)\n[Crowdfunding Writing with NFTs](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n", "timestamp": 1624131594, "digest": "vZhl4M8FUbpnnwvUsfy5Sh4Y8dMOg46l5HjHufDXbDc", "contributor": "0x445d959751d21b6A460B30D0cD0c88CE63B01847"}
{"id": "Hbo0NCU7XzpZWvpFtaiLdPUA2_kVdbQSsWVrj6YFENg", "title": "Death to “Meal, Copy and Credit” — The Rise of the Crypto Filmmakers", "body": "## **The Crypto Skeptic: Where I dismissed the NFT craze**\n\n[Crypto Skeptic](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=14)\n\nEver since Bitcoin came onto the scene in 2009, I have been generally skeptical of crypto currencies. While I tend to be an early adopter of new technologies, I was not the type to build a computer to mine the early Bitcoins. Later as it gained real value, it got swarmed by speculators and flippers attracting the *Wall Street Bro* types who became *Crypto Bros*. Bitcoin went from the digital equivalent of gold mining cultural, to the crypto version of stock exchange speculating and gambling, and neither interested me.\n\nWhen “Everydays: The First 5,000 Days” by Mike Winkelmann (the artist known as Beeple) sold as a Non-Fungible-Token (NFT) on March 11th, 2021 for over sixty-nine million dollars in a Christie’s auction, I also didn’t get sucked into the hype. The art world might have been outraged, but it didn’t seem anymore ridiculous than the sales of Jeff Koons’ or David Hockney’s non-digital art work for upwards of ninety million dollars. After a number of articles kept popping up, I finally clicked through to read about NFTs — blockchain signatures that authenticate a piece of digital art, or any digital data, to the creator or single owner. Also not that different from what Christie’s or museums do to authenticate IRL art, so still not that interesting…Moving on.\n\nThe article that finally caught my eye was *NFTs Need and Audience* by Jarrod Dicker, Jonathan Glick, and Tal Shachar. It came in a mediaREDEF newsletter as I worked on my second installment of an essay on Audience Engagement. Now NFTs were crossing with my interests of audience engagement and UX design. I followed the rabbit hole.\n\n> T<!-- -->his can change the way media companies and platforms structure their relationships with both creators and consumers under the value proposition of “ownership.” They can be groups of fans, buying clubs and collectives, perhaps formalized in a DAO structure. (Jarrod Dicker, Jonathan Glick, and Tal Shachar, *NFTs Need an Audience*)\n\n## **The Crypto Curious: Where I go down the rabbit hole**\n\n![](https://miro.medium.com/max/3840/1\\*ChbePy7Qf3MsU0yo2xe9dg.jpeg)\n\nClicking through the links of the article was the equivalent of walking through a forest and turning over a log to find the underside teeming with organisms, a whole ecosystem beneath the forest floor. Detritivores working tirelessly and quietly, feeding on the decomposing bodies of NFT speculators, to create the organic material layer that will fertilize the future growth of the forest.\n\nWhat I had missed in all the NFT hype and controversy about whether owning a piece of digital art meant anything, is that the NFT system resides on a different blockchain system than Bitcoin called Ethereum.\n\nEthereum started as a white paper published in 2013 by Vitalik Buterin, the founder of Ethereum, before the project’s launch in 2015. While Ethereum has it’s own currency commonly referred to as ETH, the novelty comes from it’s ability to be a foundation for other protocols that can create seemingly endless variations of social tokens and smart contracts. Everything being built in this space has come to be referred to as *web3*, while the rest of us still exist in *web2*. I suddenly realized that web3 will be the future we all live in, with crypto wallets to sign, verify, and track all forms of digital ownership.\n\nAn evangelical groups of creators, writers, and thinkers in the web3 space, who have a center of gravity in a private Discord called Friends With Benefits (FWB) and on this newly formed publishing platform, [Mirror.xyz](http://mirror.xyz/), see the opportunity to create new ownership economies between creators and their communities without the centralized middleman, third party of Facebook/Instagram, Substack, Medium, Twitter, Paetreon, inserted between the creator-fan relationship.\n\n> N<!-- -->FT creators in the future will have two paths: independent or collective. As an independent, creators can realize the full upside of their NFT creations and earn built-in royalties. But the collective model is an entirely new way to build distribution. Because the NFTs are programmable, the royalties can be broken down further into fractional shares. Instead of a creator earning their full share of royalties on share, they can distribute royalties to agents or collectives, who can help the creator gain distribution opportunities for the NFT. (Jarrod Dicker, *A New Media Structure: The Ownership Economy*)\n\nThe history and modern practice of royalty payments has been used in the music, film & publishing since the U.S. federal copyright law of 1790. The proposition for creators is that their creation can keep monetizing for them and supporting them while they going through the gestation and process of creation for the next piece. Artist have traditionally subsisted by having patrons or royalties.\n\nThe new form of NFT in combination with auctions and smart contracts seems to promise the ability to create a mixed portfolio for creators of royalties and committed patrons. Then comes the fractionalized NFT that can allow splits to let creators share the royalties with a collective, agents or committed patrons. When the associated NFT gets sold, the smart contract executes, and everyone holding a share gets paid.\n\nThe challenge with traditional royalties has been that it requires a large studio corporation and/or union with teams of lawyers and accountants to track and calculate royalty payouts. An independent creator would never be able to take advantage of this model. Here blockchain takes the place of all the lawyers, sales agents, accountants and payroll involved in sending out residual checks. Add some more careers to the digitization death list — go sign up for the new career paths of Blockchain Auditor, NFT Marketplace Manager, Smart Contract Designer.\n\n## **The Crypto Convert: Where I crypto-invest in a $NOVEL**\n\nFor independent filmmakers the model of NFT splits can also replace a funding platform which quickly became tiresome — Kickstarter. With splits you can also spell death to “Meal, Copy & Credit.” The now ironic pitch thrown around to young filmmakers asking them to come work on a short or indie film in exchange for getting fed on set, be given a copy of the film, and get a credit (aka experience and a resume bullet or reel clip). Now copy means being given a split of ownership, and their work on set can be compensated by the future sales and monetization.\n\n[Crypto Convert](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=15)\n\nTo prove that any of this can work and take hold, the crew behind [Mirror.xyz](http://mirror.xyz/) has helped some of their early adopters setup auction and splits of tokenized NFTs seen with [$ESSAY](https://j.mirror.xyz/uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0), [$GENERALIST](https://generalist.mirror.xyz/1T0h7VGDcECJuifK4TPDfRoUQ3zaO_tPwdZV-dtnNqw), and [Power to the Person](https://notboring.mirror.xyz/SPV\\_-bchriVn_ncDj8OgnLccSb5qAsU0sXNpg9y_UTk).\n\nNow I was convinced that having a crypto wallet is the way of the future and used the [NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide) as a starting point to setup a Metamask wallet and buy $50 USD worth of ETH. I set this up just in time to catch Emily Segal’s experiment to crowdfund her next novel with an auction of the token [$NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg). At the time of the auction, I purchased a share of the token for $20. Now in addition get thanked in the acknowledgements, I will also get a split when she mints and sells Act I of the book, and then again when she sells the first edition of the final book as an NFT.\n\nThe true potential of this whole scheme exceeds the ability to just raise funds from a pool of people with crypto wallets and ETH. A dynamic begins to form where a creator can reward their most diehard fans and supporters with stake in the creation of the next piece of art or media. Those people will then have a true investment in sharing and promoting that final piece when it comes time to monetize thus amplifying the word-of-mouth marketing.\n\n## Next time…\n\nThe NFT crazy has not been lost on filmmakers from [Trevor Hawkins](https://independent-magazine.org/2021/04/01/independent-film-lotawana-becomes-first-movie-to-be-sold-as-nft/#:\\~:text=Independent%20filmmaker%20Trevor%20Hawkins'%20Lotawana,sailboat%20on%20Missouri's%20Lake%20Lotawana.) to [Kevin Smith](https://deadline.com/2021/04/kevin-smith-killroy-was-here-nft-sale-jay-and-silent-bob-crypto-studio-1234733439/) to Anonymous Content and Permanent Content tackling [NFT-inspired IP](https://www.hollywoodreporter.com/news/nft-ip-first-non-fungible-character-optioned-for-tv-and-film). These early forays are claiming “firsts,” but do not actually leverage the true power of Ethereum for independent film funding and community building. Let’s start developing more creative ways to support up-and-coming creators outside the system, both auteurs and collectives that want to tell more original stories.\n\n\nFollow the rabbit hole:\n[NFTs Need an Audience](https://tals.substack.com/p/nfts-need-an-audience?utm_campaign=post&utm_medium=web&utm_source=copy)\n[A New Media Structure: The Ownership Economy](https://darkstar.mirror.xyz/srmoGiN_1pg_toQGzCupkjWFOaf8xi0mM60zYpn_pwI)\n[The fractionalization of NFTs will lead to better social tokens](https://jammsession.mirror.xyz/-xYcfFRlhDdLDSUgRMTYJAaRJBs2VG4LP34DnOV84mI)\n[NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide/)\n[Crowdfund a $NOVEL: Burn Alpha](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg)\n[Crowdfunding Writing with NFTs](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n", "timestamp": 1624131402, "digest": "vZhl4M8FUbpnnwvUsfy5Sh4Y8dMOg46l5HjHufDXbDc", "contributor": "0x445d959751d21b6A460B30D0cD0c88CE63B01847"}
{"id": "TuIoAnAPgQArBNf8dJG59Ti2YbGsC_iyOyphRupRsDw", "title": "Death to “Meal, Copy and Credit” — The Rise of the Crypto Filmmakers", "body": "## **The Crypto Skeptic: Where I dismissed the NFT craze**\n\n[Crypto Skeptic](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=14)\n(Original Artwork by Cody Gallo)\n\n**Ever since Bitcoin came onto the scene in 2009**, I have been generally skeptical of crypto currencies. While I tend to be an early adopter of new technologies, I was not the type to build a computer to mine the early Bitcoins. Later as it gained real value, it got swarmed by speculators and flippers attracting the *Wall Street Bro* types who became *Crypto Bros*. Bitcoin went from the digital equivalent of gold mining cultural, to the crypto version of stock exchange speculating and gambling, and neither interested me.\n\nWhen “Everydays: The First 5,000 Days” by Mike Winkelmann (the artist known as Beeple) sold as a Non-Fungible-Token (NFT) on March 11th, 2021 for over sixty-nine million dollars in a Christie’s auction, I also didn’t get sucked into the hype. The art world might have been outraged, but it didn’t seem anymore ridiculous than the sales of Jeff Koons’ or David Hockney’s non-digital art work for upwards of ninety million dollars. After a number of articles kept popping up, I finally clicked through to read about NFTs — blockchain signatures that authenticate a piece of digital art, or any digital data, to the creator or single owner. Also not that different from what Christie’s or museums do to authenticate IRL art, so still not that interesting…Moving on.\n\nThe article that finally caught my eye was *NFTs Need and Audience* by Jarrod Dicker, Jonathan Glick, and Tal Shachar. It came in a mediaREDEF newsletter as I worked on my second installment of an essay on Audience Engagement. Now NFTs were crossing with my interests of audience engagement and UX design. I followed the rabbit hole.\n\n> T<!-- -->his can change the way media companies and platforms structure their relationships with both creators and consumers under the value proposition of “ownership.” They can be groups of fans, buying clubs and collectives, perhaps formalized in a DAO structure. (Jarrod Dicker, Jonathan Glick, and Tal Shachar, *NFTs Need an Audience*)\n\n## **The Crypto Curious: Where I go down the rabbit hole**\n\n[Crypto Curious](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=16)\n\nClicking through the links of the article was the equivalent of walking through a forest and turning over a log to find the underside teeming with organisms, a whole ecosystem beneath the forest floor. Detritivores working tirelessly and quietly, feeding on the decomposing bodies of NFT speculators, to create the organic material layer that will fertilize the future growth of the forest.\n\nWhat I had missed in all the NFT hype and controversy about whether owning a piece of digital art meant anything, is that the NFT system resides on a different blockchain system than Bitcoin called Ethereum.\n\nEthereum started as a white paper published in 2013 by Vitalik Buterin, the founder of Ethereum, before the project’s launch in 2015. While Ethereum has it’s own currency commonly referred to as ETH, the novelty comes from it’s ability to be a foundation for other protocols that can create seemingly endless variations of social tokens and smart contracts. Everything being built in this space has come to be referred to as *web3*, while the rest of us still exist in *web2*. I suddenly realized that web3 will be the future we all live in, with crypto wallets to sign, verify, and track all forms of digital ownership.\n\nAn evangelical groups of creators, writers, and thinkers in the web3 space, who have a center of gravity in a private Discord called Friends With Benefits (FWB) and on this newly formed publishing platform, [Mirror.xyz](http://mirror.xyz/), see the opportunity to create new ownership economies between creators and their communities without the centralized middleman, third party of Facebook/Instagram, Substack, Medium, Twitter, Paetreon, inserted between the creator-fan relationship.\n\n> N<!-- -->FT creators in the future will have two paths: independent or collective. As an independent, creators can realize the full upside of their NFT creations and earn built-in royalties. But the collective model is an entirely new way to build distribution. Because the NFTs are programmable, the royalties can be broken down further into fractional shares. Instead of a creator earning their full share of royalties on share, they can distribute royalties to agents or collectives, who can help the creator gain distribution opportunities for the NFT. (Jarrod Dicker, *A New Media Structure: The Ownership Economy*)\n\nThe history and modern practice of royalty payments has been used in the music, film & publishing since the U.S. federal copyright law of 1790. The proposition for creators is that their creation can keep monetizing for them and supporting them while they going through the gestation and process of creation for the next piece. Artist have traditionally subsisted by having patrons or royalties.\n\nThe new form of NFT in combination with auctions and smart contracts seems to promise the ability to create a mixed portfolio for creators of royalties and committed patrons. Then comes the fractionalized NFT that can allow splits to let creators share the royalties with a collective, agents or committed patrons. When the associated NFT gets sold, the smart contract executes, and everyone holding a share gets paid.\n\nThe challenge with traditional royalties has been that it requires a large studio corporation and/or union with teams of lawyers and accountants to track and calculate royalty payouts. An independent creator would never be able to take advantage of this model. Here blockchain takes the place of all the lawyers, sales agents, accountants and payroll involved in sending out residual checks. Add some more careers to the digitization death list — go sign up for the new career paths of Blockchain Auditor, NFT Marketplace Manager, Smart Contract Designer.\n\n## **The Crypto Convert: Where I crypto-invest in a $NOVEL**\n\nFor independent filmmakers the model of NFT splits can also replace a funding platform which quickly became tiresome — Kickstarter. With splits you can also spell death to “Meal, Copy & Credit.” The now ironic pitch thrown around to young filmmakers asking them to come work on a short or indie film in exchange for getting fed on set, be given a copy of the film, and get a credit (aka experience and a resume bullet or reel clip). Now copy means being given a split of ownership, and their work on set can be compensated by the future sales and monetization.\n\n[Crypto Convert](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=15)\n\nTo prove that any of this can work and take hold, the crew behind [Mirror.xyz](http://mirror.xyz/) has helped some of their early adopters setup auction and splits of tokenized NFTs seen with [$ESSAY](https://j.mirror.xyz/uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0), [$GENERALIST](https://generalist.mirror.xyz/1T0h7VGDcECJuifK4TPDfRoUQ3zaO_tPwdZV-dtnNqw), and [Power to the Person](https://notboring.mirror.xyz/SPV\\_-bchriVn_ncDj8OgnLccSb5qAsU0sXNpg9y_UTk).\n\nNow I was convinced that having a crypto wallet is the way of the future and used the [NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide) as a starting point to setup a Metamask wallet and buy $50 USD worth of ETH. I set this up just in time to catch Emily Segal’s experiment to crowdfund her next novel with an auction of the token [$NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg). At the time of the auction, I purchased a share of the token for $20. Now in addition get thanked in the acknowledgements, I will also get a split when she mints and sells Act I of the book, and then again when she sells the first edition of the final book as an NFT.\n\nThe true potential of this whole scheme exceeds the ability to just raise funds from a pool of people with crypto wallets and ETH. A dynamic begins to form where a creator can reward their most diehard fans and supporters with stake in the creation of the next piece of art or media. Those people will then have a true investment in sharing and promoting that final piece when it comes time to monetize thus amplifying the word-of-mouth marketing.\n\n## Next time…\n\nThe NFT crazy has not been lost on filmmakers from [Trevor Hawkins](https://independent-magazine.org/2021/04/01/independent-film-lotawana-becomes-first-movie-to-be-sold-as-nft/#:\\~:text=Independent%20filmmaker%20Trevor%20Hawkins'%20Lotawana,sailboat%20on%20Missouri's%20Lake%20Lotawana.) to [Kevin Smith](https://deadline.com/2021/04/kevin-smith-killroy-was-here-nft-sale-jay-and-silent-bob-crypto-studio-1234733439/) to Anonymous Content and Permanent Content tackling [NFT-inspired IP](https://www.hollywoodreporter.com/news/nft-ip-first-non-fungible-character-optioned-for-tv-and-film). These early forays are claiming “firsts,” but do not actually leverage the true power of Ethereum for independent film funding and community building. Let’s start developing more creative ways to support up-and-coming creators outside the system, both auteurs and collectives that want to tell more original stories.\n\n\nFollow the rabbit hole:\n[NFTs Need an Audience](https://tals.substack.com/p/nfts-need-an-audience?utm_campaign=post&utm_medium=web&utm_source=copy)\n[A New Media Structure: The Ownership Economy](https://darkstar.mirror.xyz/srmoGiN_1pg_toQGzCupkjWFOaf8xi0mM60zYpn_pwI)\n[The fractionalization of NFTs will lead to better social tokens](https://jammsession.mirror.xyz/-xYcfFRlhDdLDSUgRMTYJAaRJBs2VG4LP34DnOV84mI)\n[NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide/)\n[Crowdfund a $NOVEL: Burn Alpha](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg)\n[Crowdfunding Writing with NFTs](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n", "timestamp": 1624131689, "digest": "vZhl4M8FUbpnnwvUsfy5Sh4Y8dMOg46l5HjHufDXbDc", "contributor": "0x445d959751d21b6A460B30D0cD0c88CE63B01847"}
{"id": "HWQQH9EN4HIK-nymttrrrJoFgKA0YbwoDWWSMeGGDho", "title": "The Rise of the Crypto Filmmakers — Death to “Meal, Copy and Credit” ", "body": "## **The Crypto Skeptic: Where I dismissed the NFT craze**\n\n[Crypto Skeptic](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=14)\n\n> Original artwork created for the article by [@codygallo](https://twitter.com/codygallo)\n\n**Ever since Bitcoin came onto the scene in 2009**, I have been generally skeptical of crypto currencies. While I tend to be an early adopter of new technologies, I was not the type to build a computer to mine the early Bitcoins. Later as it gained real value, it got swarmed by speculators and flippers attracting the *Wall Street Bro* types who became *Crypto Bros*. Bitcoin went from the digital equivalent of gold mining cultural, to the crypto version of stock exchange speculating and gambling, and neither interested me.\n\nWhen “Everydays: The First 5,000 Days” by Mike Winkelmann (the artist known as Beeple) sold as a Non-Fungible-Token (NFT) on March 11th, 2021 for over sixty-nine million dollars in a Christie’s auction, I also didn’t get sucked into the hype. The art world might have been outraged, but it didn’t seem anymore ridiculous than the sales of Jeff Koons’ or David Hockney’s non-digital art work for upwards of ninety million dollars. After a number of articles kept popping up, I finally clicked through to read about NFTs — blockchain signatures that authenticate a piece of digital art, or any digital data, to the creator or single owner. Also not that different from what Christie’s or museums do to authenticate IRL art, so still not that interesting…Moving on.\n\nThe article that finally caught my eye was *NFTs Need and Audience* by Jarrod Dicker, Jonathan Glick, and Tal Shachar. It came in a mediaREDEF newsletter as I worked on my second installment of an essay on Audience Engagement. Now NFTs were crossing with my interests of audience engagement and UX design. I followed the rabbit hole.\n\n> T<!-- -->his can change the way media companies and platforms structure their relationships with both creators and consumers under the value proposition of “ownership.” They can be groups of fans, buying clubs and collectives, perhaps formalized in a DAO structure. (Jarrod Dicker, Jonathan Glick, and Tal Shachar, *NFTs Need an Audience*)\n\n## **The Crypto Curious: Where I go down the rabbit hole**\n\n[Crypto Curious](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=16)\n\nClicking through the links of the article was the equivalent of walking through a forest and turning over a log to find the underside teeming with organisms, a whole ecosystem beneath the forest floor. Detritivores working tirelessly and quietly, feeding on the decomposing bodies of NFT speculators, to create the organic material layer that will fertilize the future growth of the forest.\n\nWhat I had missed in all the NFT hype and controversy about whether owning a piece of digital art meant anything, is that the NFT system resides on a different blockchain system than Bitcoin called Ethereum.\n\nEthereum started as a white paper published in 2013 by Vitalik Buterin, the founder of Ethereum, before the project’s launch in 2015. While Ethereum has it’s own currency commonly referred to as ETH, the novelty comes from it’s ability to be a foundation for other protocols that can create seemingly endless variations of social tokens and smart contracts. Everything being built in this space has come to be referred to as *web3*, while the rest of us still exist in *web2*. I suddenly realized that web3 will be the future we all live in, with crypto wallets to sign, verify, and track all forms of digital ownership.\n\nAn evangelical groups of creators, writers, and thinkers in the web3 space, who have a center of gravity in a private Discord called Friends With Benefits (FWB) and on this newly formed publishing platform, [Mirror.xyz](http://mirror.xyz/), see the opportunity to create new ownership economies between creators and their communities without the centralized middleman, third party of Facebook/Instagram, Substack, Medium, Twitter, Paetreon, inserted between the creator-fan relationship.\n\n> N<!-- -->FT creators in the future will have two paths: independent or collective. As an independent, creators can realize the full upside of their NFT creations and earn built-in royalties. But the collective model is an entirely new way to build distribution. Because the NFTs are programmable, the royalties can be broken down further into fractional shares. Instead of a creator earning their full share of royalties on share, they can distribute royalties to agents or collectives, who can help the creator gain distribution opportunities for the NFT. (Jarrod Dicker, *A New Media Structure: The Ownership Economy*)\n\nThe history and modern practice of royalty payments has been used in the music, film & publishing since the U.S. federal copyright law of 1790. The proposition for creators is that their creation can keep monetizing for them and supporting them while they going through the gestation and process of creation for the next piece. Artist have traditionally subsisted by having patrons or royalties.\n\nThe new form of NFT in combination with auctions and smart contracts seems to promise the ability to create a mixed portfolio for creators of royalties and committed patrons. Then comes the fractionalized NFT that can allow splits to let creators share the royalties with a collective, agents or committed patrons. When the associated NFT gets sold, the smart contract executes, and everyone holding a share gets paid.\n\nThe challenge with traditional royalties has been that it requires a large studio corporation and/or union with teams of lawyers and accountants to track and calculate royalty payouts. An independent creator would never be able to take advantage of this model. Here blockchain takes the place of all the lawyers, sales agents, accountants and payroll involved in sending out residual checks. Add some more careers to the digitization death list — go sign up for the new career paths of Blockchain Auditor, NFT Marketplace Manager, Smart Contract Designer.\n\n## **The Crypto Convert: Where I crypto-invest in a $NOVEL**\n\nFor independent filmmakers the model of NFT splits can also replace a funding platform which quickly became tiresome — Kickstarter. With splits you can also spell death to “Meal, Copy & Credit.” The now ironic pitch thrown around to young filmmakers asking them to come work on a short or indie film in exchange for getting fed on set, be given a copy of the film, and get a credit (aka experience and a resume bullet or reel clip). Now copy means being given a split of ownership, and their work on set can be compensated by the future sales and monetization.\n\n[Crypto Convert](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=15)\n\nTo prove that any of this can work and take hold, the crew behind [Mirror.xyz](http://mirror.xyz/) has helped some of their early adopters setup auction and splits of tokenized NFTs seen with [$ESSAY](https://j.mirror.xyz/uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0), [$GENERALIST](https://generalist.mirror.xyz/1T0h7VGDcECJuifK4TPDfRoUQ3zaO_tPwdZV-dtnNqw), and [Power to the Person](https://notboring.mirror.xyz/SPV\\_-bchriVn_ncDj8OgnLccSb5qAsU0sXNpg9y_UTk).\n\nNow I was convinced that having a crypto wallet is the way of the future and used the [NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide) as a starting point to setup a Metamask wallet and buy $50 USD worth of ETH. I set this up just in time to catch Emily Segal’s experiment to crowdfund her next novel with an auction of the token [$NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg). At the time of the auction, I purchased a share of the token for $20. Now in addition get thanked in the acknowledgements, I will also get a split when she mints and sells Act I of the book, and then again when she sells the first edition of the final book as an NFT.\n\nThe true potential of this whole scheme exceeds the ability to just raise funds from a pool of people with crypto wallets and ETH. A dynamic begins to form where a creator can reward their most diehard fans and supporters with stake in the creation of the next piece of art or media. Those people will then have a true investment in sharing and promoting that final piece when it comes time to monetize thus amplifying the word-of-mouth marketing.\n\n## Next time…\n\nThe NFT crazy has not been lost on filmmakers from [Trevor Hawkins](https://independent-magazine.org/2021/04/01/independent-film-lotawana-becomes-first-movie-to-be-sold-as-nft/#:\\~:text=Independent%20filmmaker%20Trevor%20Hawkins'%20Lotawana,sailboat%20on%20Missouri's%20Lake%20Lotawana.) to [Kevin Smith](https://deadline.com/2021/04/kevin-smith-killroy-was-here-nft-sale-jay-and-silent-bob-crypto-studio-1234733439/) to Anonymous Content and Permanent Content tackling [NFT-inspired IP](https://www.hollywoodreporter.com/news/nft-ip-first-non-fungible-character-optioned-for-tv-and-film). These early forays are claiming “firsts,” but do not actually leverage the true power of Ethereum for independent film funding and community building. Let’s start developing more creative ways to support up-and-coming creators outside the system, both auteurs and collectives that want to tell more original stories.\n\n\nFollow the rabbit hole:\n[NFTs Need an Audience](https://tals.substack.com/p/nfts-need-an-audience?utm_campaign=post&utm_medium=web&utm_source=copy)\n[A New Media Structure: The Ownership Economy](https://darkstar.mirror.xyz/srmoGiN_1pg_toQGzCupkjWFOaf8xi0mM60zYpn_pwI)\n[The fractionalization of NFTs will lead to better social tokens](https://jammsession.mirror.xyz/-xYcfFRlhDdLDSUgRMTYJAaRJBs2VG4LP34DnOV84mI)\n[NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide/)\n[Crowdfund a $NOVEL: Burn Alpha](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg)\n[Crowdfunding Writing with NFTs](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n", "timestamp": 1624132329, "digest": "vZhl4M8FUbpnnwvUsfy5Sh4Y8dMOg46l5HjHufDXbDc", "contributor": "0x445d959751d21b6A460B30D0cD0c88CE63B01847"}
{"id": "huse-p83Cy9W0eB6jxw9RBEaJ6uQiB10PJWqHw-B3rc", "title": "The Rise of the Crypto Filmmakers — Death to “Meal, Copy and Credit” ", "body": "## **The Crypto Skeptic: Where I dismissed the NFT craze**\n\n**Ever since Bitcoin came onto the scene in 2009**, I have been generally skeptical of crypto currencies. While I tend to be an early adopter of new technologies, I was not the type to build a computer to mine the early Bitcoins. Later as it gained real value, it got swarmed by speculators and flippers attracting the *Wall Street Bro* types who became *Crypto Bros*. Bitcoin went from the digital equivalent of gold mining cultural, to the crypto version of stock exchange speculating and gambling, and neither interested me.\n\n[Crypto Skeptic](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=14)\n\n> All of the original artwork created for this article can now be collected!\n\nWhen “Everydays: The First 5,000 Days” by Mike Winkelmann (the artist known as Beeple) sold as a Non-Fungible-Token (NFT) on March 11th, 2021 for over sixty-nine million dollars in a Christie’s auction, I also didn’t get sucked into the hype. The art world might have been outraged, but it didn’t seem anymore ridiculous than the sales of Jeff Koons’ or David Hockney’s non-digital art work for upwards of ninety million dollars. After a number of articles kept popping up, I finally clicked through to read about NFTs — blockchain signatures that authenticate a piece of digital art, or any digital data, to the creator or single owner. Also not that different from what Christie’s or museums do to authenticate IRL art, so still not that interesting…Moving on.\n\nThe article that finally caught my eye was *NFTs Need and Audience* by Jarrod Dicker, Jonathan Glick, and Tal Shachar. It came in a mediaREDEF newsletter as I worked on my second installment of an essay on Audience Engagement. Now NFTs were crossing with my interests of audience engagement and UX design. I followed the rabbit hole.\n\n> T<!-- -->his can change the way media companies and platforms structure their relationships with both creators and consumers under the value proposition of “ownership.” They can be groups of fans, buying clubs and collectives, perhaps formalized in a DAO structure. (Jarrod Dicker, Jonathan Glick, and Tal Shachar, *NFTs Need an Audience*)\n\n## **The Crypto Curious: Where I go down the rabbit hole**\n\n[Crypto Curious](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=16)\n\nClicking through the links of the article, [*NFTs Need an Audience*](https://tals.substack.com/p/nfts-need-an-audience?utm_campaign=post&utm_medium=web&utm_source=copy), was the equivalent of walking through a forest and turning over a log to find the underside teeming with organisms, a whole ecosystem beneath the forest floor. Detritivores working tirelessly and quietly, feeding on the decomposing bodies of NFT speculators, to create the organic material layer that will fertilize the future growth of the forest.\n\nWhat I had missed in all the NFT hype and controversy about whether owning a piece of digital art meant anything, is that the NFT system resides on a different blockchain system than Bitcoin called Ethereum.\n\nEthereum started as a white paper published in 2013 by Vitalik Buterin, the founder of Ethereum, before the project’s launch in 2015. While Ethereum has it’s own currency commonly referred to as ETH, the novelty comes from it’s ability to be a foundation for other protocols that can create seemingly endless variations of social tokens and smart contracts. Everything being built in this space has come to be referred to as *web3*, while the rest of us still exist in *web2*. I suddenly realized that web3 will be the future we all live in, with crypto wallets to sign, verify, and track all forms of digital ownership.\n\nAn evangelical groups of creators, writers, and thinkers in the web3 space, who have a center of gravity in a private Discord called Friends With Benefits (FWB) and on this newly formed publishing platform, [Mirror.xyz](http://mirror.xyz/), see the opportunity to create new ownership economies between creators and their communities without the centralized middleman, third party of Facebook/Instagram, Substack, Medium, Twitter, Paetreon, inserted between the creator-fan relationship.\n\n> N<!-- -->FT creators in the future will have two paths: independent or collective. As an independent, creators can realize the full upside of their NFT creations and earn built-in royalties. But the collective model is an entirely new way to build distribution. Because the NFTs are programmable, the royalties can be broken down further into fractional shares. Instead of a creator earning their full share of royalties on share, they can distribute royalties to agents or collectives, who can help the creator gain distribution opportunities for the NFT. (Jarrod Dicker, *A New Media Structure: The Ownership Economy*)\n\nThe history and modern practice of royalty payments has been used in the music, film & publishing since the U.S. federal copyright law of 1790. The proposition for creators is that their creation can keep monetizing for them and supporting them while they going through the gestation and process of creation for the next piece. Artist have traditionally subsisted by having patrons or royalties.\n\nThe new form of NFT in combination with auctions and smart contracts seems to promise the ability to create a mixed portfolio for creators of royalties and committed patrons. Then comes the fractionalized NFT that can allow splits to let creators share the royalties with a collective, agents or committed patrons. When the associated NFT gets sold, the smart contract executes, and everyone holding a share gets paid.\n\nThe challenge with traditional royalties has been that it requires a large studio corporation and/or union with teams of lawyers and accountants to track and calculate royalty payouts. An independent creator would never be able to take advantage of this model. Here blockchain takes the place of all the lawyers, sales agents, accountants and payroll involved in sending out residual checks. Add some more careers to the digitization death list — go sign up for the new career paths of Blockchain Auditor, NFT Marketplace Manager, Smart Contract Designer.\n\n## **The Crypto Convert: Where I crypto-invest in a $NOVEL**\n\nFor independent filmmakers the model of NFT splits can also replace a funding platform which quickly became tiresome — Kickstarter. With splits you can also spell death to “Meal, Copy & Credit.” The now ironic pitch thrown around to young filmmakers asking them to come work on a short or indie film in exchange for getting fed on set, be given a copy of the film, and get a credit (aka experience and a resume bullet or reel clip). Now copy means being given a split of ownership, and their work on set can be compensated by the future sales and monetization.\n\n[Crypto Convert](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=15)\n\nTo prove that any of this can work and take hold, the crew behind [Mirror.xyz](http://mirror.xyz/) has helped some of their early adopters setup auction and splits of tokenized NFTs seen with [$ESSAY](https://j.mirror.xyz/uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0), [$GENERALIST](https://generalist.mirror.xyz/1T0h7VGDcECJuifK4TPDfRoUQ3zaO_tPwdZV-dtnNqw), and [Power to the Person](https://notboring.mirror.xyz/SPV\\_-bchriVn_ncDj8OgnLccSb5qAsU0sXNpg9y_UTk).\n\nNow I was convinced that having a crypto wallet is the way of the future and used the [NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide) as a starting point to setup a Metamask wallet and buy $50 USD worth of ETH. I set this up just in time to catch Emily Segal’s experiment to crowdfund her next novel with an auction of the token [$NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg). At the time of the auction, I purchased a share of the token for $20. Now in addition get thanked in the acknowledgements, I will also get a split when she mints and sells Act I of the book, and then again when she sells the first edition of the final book as an NFT.\n\nThe true potential of this whole scheme exceeds the ability to just raise funds from a pool of people with crypto wallets and ETH. A dynamic begins to form where a creator can reward their most diehard fans and supporters with stake in the creation of the next piece of art or media. Those people will then have a true investment in sharing and promoting that final piece when it comes time to monetize thus amplifying the word-of-mouth marketing.\n\n## Next time…\n\nThe NFT crazy has not been lost on filmmakers from [Trevor Hawkins](https://independent-magazine.org/2021/04/01/independent-film-lotawana-becomes-first-movie-to-be-sold-as-nft/#:\\~:text=Independent%20filmmaker%20Trevor%20Hawkins'%20Lotawana,sailboat%20on%20Missouri's%20Lake%20Lotawana.) to [Kevin Smith](https://deadline.com/2021/04/kevin-smith-killroy-was-here-nft-sale-jay-and-silent-bob-crypto-studio-1234733439/) to Anonymous Content and Permanent Content tackling [NFT-inspired IP](https://www.hollywoodreporter.com/news/nft-ip-first-non-fungible-character-optioned-for-tv-and-film). These early forays are claiming “firsts,” but do not actually leverage the true power of Ethereum for independent film funding and community building. Let’s start developing more creative ways to support up-and-coming creators outside the system, both auteurs and collectives that want to tell more original stories.\n\n\nFollow the rabbit hole:\n[NFTs Need an Audience](https://tals.substack.com/p/nfts-need-an-audience?utm_campaign=post&utm_medium=web&utm_source=copy)\n[A New Media Structure: The Ownership Economy](https://darkstar.mirror.xyz/srmoGiN_1pg_toQGzCupkjWFOaf8xi0mM60zYpn_pwI)\n[The fractionalization of NFTs will lead to better social tokens](https://jammsession.mirror.xyz/-xYcfFRlhDdLDSUgRMTYJAaRJBs2VG4LP34DnOV84mI)\n[NFT Skeptics Guide](https://justincone.com/posts/nft-skeptics-guide/)\n[Crowdfund a $NOVEL: Burn Alpha](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg)\n[Crowdfunding Writing with NFTs](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n", "timestamp": 1624132603, "digest": "vZhl4M8FUbpnnwvUsfy5Sh4Y8dMOg46l5HjHufDXbDc", "contributor": "0x445d959751d21b6A460B30D0cD0c88CE63B01847"}
