{"id": "qiK6HoKv2nMthA9hhjdjL8yXjZxAT7orBQMmCGDANeI", "title": "Announcing the Beacon Book Community Giveaways", "body": "## *Own a piece of Ethereum history*\n\n![](https://images.mirror-media.xyz/publication-images/46169c44-c5e0-4ed8-bb5d-9545ad212336.png?height=844&width=1500)\n\nAs promised in our [December announcement post](https://stateful.mirror.xyz/a151ee1decb2028a8bb48277f6928c6f38319c32601dc1da1ee82acfcad2e525), Stateful Works has partnered with a bunch of amazing Ethereum community orgs to help launch the Beacon Book. \n\nIf you're just learning about this project, it's a collection of perspectives from 46 Beacon Chain researchers and implementers, wrapped in delightful graphics. **We're giving away seven physical copies** ahead of the main auction happening in a few weeks: one for each of their respective communities. They will decide how to give them away - we're looking forward to the novel mechanisms they will each use!\n\n**Read on for more info on how and where to win a copy!**\n\nIf you're a winner, a transaction hash of your own choosing (eg. your first tx, registering your ENS name, etc) will be written along with the name of the awarding community org. This adds a small proof of authenticity, making the book undeniably yours!\n\nIf you do win, please note that we will require a physical address to mail it to you. Limit one giveaway per identity.\n\n![](https://images.mirror-media.xyz/publication-images/7b143777-65e8-4c7f-9ba7-e44f856367b8.png?height=2448&width=3264)\n\n### Bankless\n\n→ [Join the movement](https://www.bankless.community/)\n→ [Congrats to the winner!](https://twitter.com/StatefulWorks/status/1408514803841253391?s=20) - we'll be reaching out shortly1\n\nA longtime group reporting on this new frontier's social, political and economic implications, as well as topical current events. This mandate was most recently bolstered by the birth of the [BanklessDAO](https://www.bankless.community/). Their output is an amazing reference point for the rest of community.\n\n### ETHFinance\n\n→ [Join the community](https://www.reddit.com/r/ethfinance/)\n→ Congrats to the raffle winner [0x47dF...4d66](https://etherscan.io/address/0x47df75f37f8c90c847df8401cdd12d33b46e4d66) - we'll be reaching out for your information!\n\nIf you are an Etherean that frequents Reddit, you know ETHFinance has one of the strongest communities there. Commentary, memes, and deep discussion throughout bear or bull.\n\n### ETHMemes\n\n→ [Follow](https://twitter.com/EthereumMemes)\n→ This giveaway has been awarded! [See the winning submission here!](https://twitter.com/EthereumMemes/status/1407023004823949314?s=20)\n\nTwitter would be infinitely less enjoyable without this account bringing humor into our feed. It's been built up over the years into a formidable powerhouse of Ethereum humor, including [our personal favorite](https://www.youtube.com/watch?v=5nz5PdYbSzU). Stateful Works thanks you for your tireless memeing!\n\n### ETHStaker\n\n→ [Join the community](https://www.reddit.com/r/ethstaker/)\n→ [A winner has been chosen!](https://www.reddit.com/r/ethfinance/comments/o7rr8z/we_have_a_winner_for_the_beacon_book_ethfinance/)\n\nThis crew plays a key role in the future of the protocol and they take this very seriously. From organizing learning cohorts to helping troubleshoot staking issues, they've been a wonderful community asset - the Beacon Chain would be lesser without their tireless work.\n\n### Gitcoin\n\n→ [Learn More](https://gitcoin.co/)\n→ [Meme contest live now!](https://twitter.com/gitcoin/status/1408140416176754689)\n\nPublic Goods are Good. This team has been relentlessly building a vision of the future where builders are paid and infrastructure is maintained. From each round of Gitcoin Grants to [GitcoinDAO](https://twitter.com/GitcoinDAO), they continue to push the envelope on what participatory funding looks like. \n\n### POAP\n\n→ [Learn more](https://www.poap.xyz/) \n→ Giveaway info added soon!\n\nThe first and last name in event NFTs. POAP has been an amazing NFT evangelist over the years for both physical and virtual Ethereum events. With recent products like [POAP.fun](https://poap.fun/) and collaborative artworks, it's clear they aren't resting on their laurels - we can't wait to see what they cook up next!\n\n### The Daily Gwei\n\n→ [Subscribe here](https://thedailygwei.substack.com/) \n→ Winner has been chosen, will be announced soon!\n→ POAP to be distributed via DM\n\nQuality, consistency and thoughtfulness wrapped in a delightful Aussie accent. TDG is an amazing Ethereum resource that breaks down complex topics into accessible language, so anyone can understand the latest news for applications and protocol development. We're proud to share the final Beacon Book with Anthony.\n\n---------------------------------------------------------\n\nSee a small taste of what to expect in the book below. Remember - even if you don't win any of the giveaways, we will be auctioning up to 100 Genesis Edition copies once the Community Parters have given theirs away! Join our Discord or follow Stateful Works on Twitter to know exactly when we launch the auction.\n\n![](https://images.mirror-media.xyz/publication-images/597b64f5-faa0-41cd-bea1-bfe5d3f01ffd.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/a52eccce-a44a-4536-abfa-623deccaff8e.png?height=750&width=1000)\n\n![](https://images.mirror-media.xyz/publication-images/c7011a0f-bdaf-447d-8ee3-b6d797a5d462.png?height=750&width=1000)\n\n... and of course, GOOD LUCK!", "timestamp": 1625063294, "digest": "vIxmsyBIm--ZFs_xQFLIrjpfi4hAfuBfWTjQbivWMzI", "contributor": "0xc57c5aE582708e619Ec1BA7513480b2e7540935f"}
{"id": "rJx55618uxV9mSBKNKgOzTdZcYg3M_NAU7t1VdNIBBg", "title": "Syndicate Raises $800K from 100 Community Members", "body": "![](https://images.mirror-media.xyz/publication-images/f3064bf8-bbcb-4e88-9f27-e7fe38cb6c0b.png?height=506&width=1012)\n\nToday, we are proud to announce that [Syndicate](https://www.syndicateprotocol.org) has raised $800K from 100 early users, partners, and friends in its community (full list below). Syndicate’s community raise is an important first step in democratizing our own platform and making Syndicate community-owned.\n\nOur community raise was completed in less than a week via Syndicate itself: 100 early community members invested in Syndicate via an SPV-like Syndicate DAO launched on our platform and protocol.\n\n**DAO-powered Special Purpose Vehicles (SPVs)** are just one of many applications ([Community DAOs](https://syndicate.mirror.xyz/7FkGP8wL9RtVGXV1MDr_WbAbUIVm159XArAjsNF9cQY), [Ecosystem Funds](https://syndicate.mirror.xyz/0CCSHG5PQtjuqsChrsIxFS2nwFJsbCIzOb7uQT9shpw), [NFT Funds](https://syndicate.mirror.xyz/P7NfgxOF8bwvU6UOIjXU66ruR0lEy7n3hGm0mP2Gei8), [Economic Empowerment DAOs](https://syndicate.mirror.xyz/xeRR8PJUnGr-mUlwLJppFHe65WPpyyULFBiz89K1qfI)) for Syndicate that are rolling out now and in the weeks ahead.\n\n\n## Progressively Decentralizing to Our Community\nIf Syndicate’s aim is to [democratize investing](https://twitter.com/SyndicateDAO/status/1372196063822508034?s=20), it’s important that we live by our values and—as best we can—take the steps needed to democratize and decentralize Syndicate itself. The Community Raise is just the first step of many we will be taking to both grow and democratize the platform over time.\n\nThe 100 community members who are now early investors in Syndicate include:\n- Early contributors\n- Early users\n- Current and future partners\n- Current and future collaborators\n- [Syndicate NFT owners](https://zora.co/syndicate)\n\nWe’re excited to continue growing our community in the months and years ahead.\n\n\n## Join the Revolution\nWe are starting a movement to change investing for the better, for everyone. We’ve launched the [IDEO Founder Collective](https://www.syndicateprotocol.org/syndicate/ideo_fc), [Terra Ecosystem Incubator](https://www.syndicateprotocol.org/syndicate/terra_incubator), [Delphi INFINFT](https://www.syndicateprotocol.org/syndicate/delphi_infinft), [Komorebi Collective](https://www.syndicateprotocol.org/syndicate/komorebi_collective), [Fiat Lux DAO](https://twitter.com/FiatLuxDAO), and [Audacity](https://www.syndicateprotocol.org/syndicate/audacity)—and we’re getting ready to roll out our private beta in stages soon.\n\n- [Follow us on Twitter](https://twitter.com/SyndicateDAO)\n- [Sign up for the Private Beta](https://syndicateprotocol.org)\n- [Apply to our job openings](https://www.notion.so/Careers-at-Syndicate-1ded759492c04f93837837634df35432)\n- [Subscribe to our newsletter for official updates](https://syndicateprotocol.substack.com/subscribe)\n\n\n## Community Raise Participants\nAlana Podrx, CEO, Eve Wealth\nAlex Masmej, CEO, Showtime\nAlexis Gauba, Co-Founder, Opyn\nAmeer Suhayb Carter, Mint Fund\nAnastasia Andrianova, CEO, Akropolis\nAndrew Steinwold, Managing Partner, Sfermion\nAya Kantorovich, FalconX\nBaek Kim, Hashed\nBalaji Srinivasan, ex Coinbase, ex Earn, ex a16z\nBeryl Li, Co-Founder, Yield Guild\nBlake West, Co-Founder, Goldfinch\nBo Shao, Co-Founder, Evolve\nBobby Ong, Co-Founder, CoinGecko\nBrian Flynn, CEO, Rabbithole\nCalvin Liu, Compound, Divergence\nCarlos Gomes, Forefront, Mint Fund\nChristy Choi, ex Binance\nColleen Sullivan, CEO, CMT Digital \nCooper Turley, Audius, Variant\nCourtney Chow, Battery, ex IDEO CoLab\nCuy Sheffield, Visa\nDave Kim, Program Officer, Bill & Melinda Gates Foundation\nDerek Hsue, Co-Founder, Reverie\nDo Kwon, Founder, Terra\nDriss\nErik Syvertsen, GC, AngelList\nErikan Obotetukudo, Founder, Audacity\nGabby Dizon, Co-Founder, Yield Guild\nGeorge Lambeth, Divergence, Balancer\nIllia Polosukhin, Co-Founder, NEAR\nJacob Horne, Founder, Zora\nJake Chervinsky, GC, Compound, Variant\nJames Foley, Co-Founder, Cowri\nJames Young, CEO, Abridged, Collab.Land\nJason Choi, Spartan Group, Blockcrunch\nJazear Brooks, Co-Founder, Sifchain\nJean-Cedric\nJeff Garzik, Co-Founder, Vesper\nJeff Morris Jr., Chapter One, ex Tinder\nJeremy Allaire, CEO, Circle\nJess Sloss, SeedClub\nJoon Ian Wong, ex CoinDesk\nJoris Delanoue, Co-Founder, Fairmint\nJoyce Yang, Founder, Global Coin Ventures\nJulia Lipton, Founder, Awesome People Ventures\nJustin Ridgely, BlockFi\nJustine Humenansky, Playground, Fiat Lux DAO\nKaito, Bspeak!\nKazufumi\nKenny White, Founder, Cowri\nKevin Chou, Founder, Rally, Forte, Kabam, Gen.G\nKevin Nielsen, CEO, Boardroom\n“Fully Allocated”, Default\nKieran Warwick, Founder, Illuvium\nKinsa Durst, Republic\nKristie Huang, Komorebi, she256\nLarry Sukernik, Co-Founder, Reverie\nLeighton Cusack, Co-Founder, PoolTogether, PleasrDAO\nLi Jin, Founder, Atelier Ventures\nLuis Cuende, Co-Founder, Aragon\nMark Roszak, Founder, 1121 Law\nMatthew Roszak, Co-Founder, Vesper\nMeltem Demirors, Chief Strategy Officer, CoinShares\nMicah Johnson, Creator, Aku\nMike Sall, CEO, Goldfinch\nMike Zajko, CoinList, Free Company\nMildred Idada, Founder, Open Web Collective\nMin Teo, Ethereal Ventures, ConsenSys Mesh\nMorgan Beller, NFX, ex Libra, ex a16z\nNathalie McGrath, ex Coinbase\nNathan McCauley, CEO, Anchorage\nNathaniel Whittemore\nNitya Subramanian, Celo\nNoah Jessop, Co-Founder, Nine Realms\nPatrick Chang, Founder, Dispersion\nPrabhakar Reddy, Co-Founder, FalconX, ex Accel\nRahul Vohra, CEO, Superhuman\nRaj Gokal, COO, Solana\nRamon Recuero, Founder, Babylon\nRegan Bozman, Dove Mountain Partners, ex-Coinlist\nRene Reinsberg, Celo\nRobbie Bent, Ethereum Foundation\nRyan Selkis, CEO, Messari\nSasha (Aliaksandr) Hudzilin, NEAR\nScott Moore, Co-Founder, Gitcoin\nSebastian Delgado, Co-Founder, Fei\nSina Habibian, Ethereum Foundation\nSriram Krishnan, Advisor, Calm, ex Tinder, ex Spotify\nStani Kulechov, CEO, Aave\nSteve Blank, Professor, Stanford University\nSteve Weinstein, Professor, Stanford University\nThibauld Favre, CEO, Fairmint\nTodd Goldberg\nTom Bedecarre, Stanford University, ex AKQA\nTyler Ward, Co-Founder, Barnbridge\nVanessa Slavich, Celo\nwsbmod, Wall Street Bets\nXochitl Cazador, Celo, she256\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/3837)\n\n\n", "timestamp": 1625070153, "digest": "_dIadEYTjam8Z8DGq2ezTBsYuf-bfSRoKFhNYZYJFk8", "contributor": "0x66B340673fcE10bd3bFbbe59997Ae188a16b6710"}
{"id": "G5EShEeR2H91-3Zx53XXcJHqHa7AxXEJWozWN7M0LmQ", "title": "Welcome to the Creator DAO Revolution", "body": "As we move from Web2 to Web3, we’ll see a shift toward a more creator-centric economy. In this ecosystem, creators will no longer sit at the bottom of the totem pole picking up scraps leftover by corporate giants but will instead be able to earn in full and instantaneously for their work. \n\nThe convergence of the creator economy and DAOs is where the magic happens. The decentralized, non-hierarchical structure of DAOs serves as a turbo boost to propel the creator economy (which is mostly theoretical right now) into reality.\n\n## The problem with the current (lack of) creator economy\n\nAfter I quit my job as an attorney to travel the world in 2017, I became a travel blogger and Instagram influencer to pay the bills while not having a “real” job. I got a nice camera, leveled up my photography skills, spent hours each day trying to build my social media following, and learned the latest marketing strategies for building an online following.\n\nI was creating content regularly, posting daily on social media and multiple times per week on my blog. I grew my following to over 15,000 monthly views on my blog and 20,000 Instagram followers, but it wasn’t enough. There were other travel bloggers and Instagram influencers with larger followings, and I wasn’t able to secure the largest brand deals because I didn’t have the largest following.\n\nDespite the struggle to monetize my content, I had a loyal and active audience. I received messages regularly from inspired fans and noticed a group of followers commenting on all of my posts.\n\nSo why did I have to rely on Instagram and other centralized platforms to decide whether my content was valuable when I already received validation that it is from my audience?\n\n## The creator economy of Web3\n\nThe creator economy of Web3 will revolutionize the way artists, musicians, and content creators have been monetizing their work for decades. Rather than relying on centralized platforms to pay them a fraction of what consumers are willing to pay, creators will get paid directly by their fans. That means creators will receive the full amount that consumers are willing to pay because intermediaries will no longer exist to take a cut of their profits.\n\nThis doesn’t mean that all of a sudden, creators will all become millionaires. On the contrary, competition will only become stiffer as more people discover the freedom that comes with being a creator. That’s why it’s important for creators to not only have opportunities to create for themselves and for their followers but also for decentralized projects and protocols that have larger and more reliable funding engines.\n\n## Creator economy, meet DAOs\n\nThis is where DAOs come in. A DAO, or Decentralized Autonomous Organization, is a group of people who have a common mission and are governed by rules coded into a smart contract on the blockchain that all members of the DAO agree to. The founding members of a DAO decide on a set of rules to code into the smart contract that will govern the DAO, and anyone who joins the DAO after that agrees to abide by that set of rules. \n\nEach DAO is formed with a specific mission in mind, and that mission can vary widely. A DAO can be set up to fund proposals ([Moloch DAO](https://twitter.com/MolochDAO)), buy NFTs ([pleasrDAO](https://twitter.com/PleasrDAO)), support communities ([Panvala](https://twitter.com/PanvalaHQ)), or just for fun ([pizzaDAO](https://twitter.com/pizza_dao)).\n\nOne type of DAO that hasn’t made a noticeable impact yet is the creator DAO. The intersection of the creator economy and DAOs has always felt natural and inevitable. DAOs democratize access to resources, pulling them away from the top of hierarchical structures and redistributing them amongst creators. Instead of the traditional model of \n\n> Stack resume with top credentials → Get a job/income → Contribute \n\nwhere most people can’t make it past the first step, DAOs allow creators to at least have some skin in the game by shifting the model to\n\n> Contribute → Make money → Contribute more → Make more money\n\nCompetition amongst creators will remain strong, but this model at least gives creators an opportunity to compete - not just amongst themselves but against larger, more established entities. Creators will find more opportunities to work on interesting projects that were traditionally outsourced to agencies or built in house with full time staff. \n\n## Renaissance Creator DAO\n\nThis shared mission to help Web2 creators make money in Web3 is what brought [Alex Yao](https://twitter.com/TheAlexYao) and I together during our time in the Gitcoin [KERNEL](https://twitter.com/KERNEL0x) fellowship. Together with a group of several others and led by Alex, we formed Renaissance Creator DAO, a community for content creators to learn about creating content for Web3 projects and, in turn, earn money (crypto) for their contributions.\n\nWe believe having a community like Renaissance DAO is important because each creator has a unique voice that will bring new audiences and perspectives to Web3. It also enables creators to work together, which allows them to do more than they could individually - and have more fun doing it.\n\nOur goal is to help solve for some of the common problems creators face in today’s economy, including:\n\n- The desire to do what they love but the inability to monetize their work\n- The procurement of a dedicated following but the inability to monetize that following\n- The need for freedom but the inability to earn a consistent income\n\nAs a member of Renaissance DAO, you will:\n\n- Learn how to create content in Web3\n- Match with Web3 projects and protocols to collaborate on paid work\n- Be part of a community of other Web3 creators\n- Earn tokens in proportion to the amount of content you create\n- Get access to exclusive community-only talks and events\n\nI’m excited to share more details about what we’ve been working on with you shortly, and we’re launching a formal cohort-based application process soon, but in the meantime, feel free to [join our discord group](https://discord.gg/6r8aEPtRty) and say hi, or tweet any questions you have to me at [@ddwchen](twitter.com/ddwchen). \n", "timestamp": 1625070653, "digest": "Y19OlShAGp8nf6t_Rngj9SuISGBIWfzHfa7j2_dWdF8", "contributor": "0xcEd09CCFc82b091195bdE04E6Cd65374518E7b95"}
{"id": "zoiQ2Gujl-owCzU9x1fEFJWkaaHSh_Paj5BReFIW5jM", "title": "Long-term Alignment in Cryptonetworks & DAOs", "body": "*Felix Machart on strategies to ensure cryptonetworks/DAOs reap the rewards of long term thinking*\n\nWe’re excited to release another long-form piece on the Boardroom Mirror page! \n\nLast week, we published Nick Naraghi’s deep dive on why people build DAOs. Previously, we published James Duncan’s framework to analyze decentralization and autonomy in DAOs.  \n\nThis week, Felix Machart of Greenfield One introduces and makes the case for different strategies cryptonetworks and DAOs can implement to encourage long-term thinking, which he argues is crucial to their success.\n\nFelix begins his essay by making the case for long-term thinking. Data shows that for-profit companies that orient to the long term are more successful financially (higher revenue and market capitalization over time) and socially (more job creation). Short-term optimization, influenced by the emphasis on quarterly earning reports by equity investors, on the other hand, has proven detrimental. \n\nCryptonetworks introduce an entirely new paradigm for investors and stakeholders, who can “view and verify metrics like earnings, transactions, risk, and solvency in real-time.”\n\nFelix asks: \n\n> If quarterly reporting has led traditional firms (and their activist investors) to excessive short-term orientation … where will real-time accounting lead us?\n\nAlong with thoroughly examining the different stakeholders within a cryptonetwork and how DAOs structures differ from traditional organizations, Felix offers a variety of solutions for cryptonetworks to incentivize long term thinking via their governance. \n\nSpecifically, Felix focuses on time-commitment-based distribution of governance power and rewards. \n\nTo accomplish this, cryptonetworks and DAOs can make a few design decisions highlighted by Felix, including:\n\n- Linear vs. progressive increase in governance power and rewards\n- Types of rewards that are boosted through lock-up (e.g. protocol fee distributions, LP rewards)\n- Minimum and maximum length of token lock-ups\n- Early exit fees\n- Whitelisted smart contracts to participate in governance (and policy on how to whitelist)\n- Social norms around slashing for actors that attempt workarounds\n\nIn its entirety, Felix’s post is a great deep dive on a topic that will increasingly come into focus as cryptonetworks and DAOs mature, that of long term orientation and ensuring organizational sustainability over time.  \n\nFor those interested in an even deeper dive, linked within the Mirror post is a version of the essay with specific case studies within DeFi. \n\nWe encourage all Stateless readers to check it out: ", "timestamp": 1625075714, "digest": "icPsjRu0Cr6baVDuVY2DiWm2Qb7tvnqYvXCbZtZzg6Y", "contributor": "0xb1676B5Ab63F01F154bb9938F5e8999d9Da5444B"}
{"id": "p-hY9SayH2WcpFRB_A0qrWVF6Y2is-hedWG_awdTWic", "title": "Testing", "body": "Another test", "timestamp": 1625100185, "digest": "R6mTXoxmW2NS62JWzIjMfJu-9TB05Vh2KQrlE4L7Rjg", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "0hqMrUGS5h_T4hwrrMlL3Ib5NX805WnVIu2Sg1E1qp4", "title": "Test Entry Edition", "body": "Test", "timestamp": 1625100587, "digest": "RHlIWjIjiKLOJBAZXCHlMH2Tr1QZqSS9-sppRsgtFpw", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "tEkcEpjmkCFdTBR1vdiShkaOj2MTee1qi01J7fPMQWQ", "title": "Test Entry Update", "body": "update", "timestamp": 1625104150, "digest": "310pDF3eWfZljkrKkaRk0YC97zDItvA5N6RA7iR_rnk", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "ZAkRKsFlQoD1G_jgTMTn9B_HUQPVRVVH5U4KYA_GpJs", "title": "Test Entry Edition v2", "body": "Test", "timestamp": 1625103945, "digest": "RHlIWjIjiKLOJBAZXCHlMH2Tr1QZqSS9-sppRsgtFpw", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "8dKkQt3PjzWvhla22Un7htUi-Qn2TKYzUdxvwkkXWlY", "title": "Test Entry Update", "body": "derp derp", "timestamp": 1625105060, "digest": "310pDF3eWfZljkrKkaRk0YC97zDItvA5N6RA7iR_rnk", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "C0G5Fi3y1NLqmIvonp76UAaCqyaCKlQLOjwMIRRzQy4", "title": "Test Entry Update", "body": "derp derp", "timestamp": 1625104652, "digest": "310pDF3eWfZljkrKkaRk0YC97zDItvA5N6RA7iR_rnk", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "aPnQFz_DUcsleFuLSnI3zty2vhZ6ZmqnM49uEES09vc", "title": "Test Entry Update", "body": "derp derp derp", "timestamp": 1625105430, "digest": "310pDF3eWfZljkrKkaRk0YC97zDItvA5N6RA7iR_rnk", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "RnomYlbQ4mz1TMdZMKcyEIozVA8EqU-8z4He6hl4ryc", "title": "Test Entry Update", "body": "derp derp derp\n\n[Songcamp](edition://0x62BC88d480Bf8b85962C9Ebbd028fCC9C624946d?editionId=59)", "timestamp": 1625106820, "digest": "310pDF3eWfZljkrKkaRk0YC97zDItvA5N6RA7iR_rnk", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "IGoEcZlPVoomExVHTq8i-fovorEJSGIL2O1arvDUQPU", "title": "Is This Public? (or...Why I’m leaving TradFi for Crypto) ", "body": "\n### It’s All Stocks\nA portfolio manager I used to work with once remarked that if you stay in finance for long enough, you begin to see everything as a stock. When I first heard this, as an intern at an investment firm in 2017, it seemed like one of those Wall Street neologisms that sound true, but don’t **feel** true until you’ve lived them firsthand (other neologisms that fall under this category: “Don’t short on valuation”, “Don’t short on competition”, and my personal favorite: “Don’t try to predict the future. Try to describe the present”). This particular piece of wisdom was palpable almost immediately: in August of 2017, I drove to the Hamptons with some friends and realized that the PM who said that everything looked like a stock had a long or short position in half of the retailers occupying the strip malls along the Southhampton Bypass. In finance, even a trip to the beach is a quest for alpha. \n\nThe 2017 internship turned into a job offer, which turned into a full time position in 2018 after I graduated from college. I felt luckier than a lot of my peers who spent senior year either cramming for McKinsey case studies or lamenting because they doubted they had the quantitative skills to even attempt one. Before the summer of 2017, I probably would’ve put myself in the latter camp: a history major who only did theater, film, and journalism in college. But the internship taught me that you can learn any quantitative skill on the job, by sheer force of attrition. Someone will ask you for the diluted share count of an upcoming IPO, or to input a company’s EBITDA into an earnings model (which raises other questions, like what is depreciation and amortization, and how do you use Excel?), or might say to you “yes, gross margins are 50% ***right now***, but what happens when GMs reach 65%, and S&M spend falls to 30% of revenue, and Trump manages to pass corporate tax cuts? How much are they earning ***then***?” Early on in my internship, it might take me an hour to figure out what question I was even being asked, and another few hours to answer it. But over time -- through attrition -- the concepts fall into place. And then you begin to start seeing everything as a stock. \n\nIn the initial phase, “seeing stocks'' might just mean the sudden realization that the vast majority of items and systems you interact with on a daily basis are actually public companies. This understanding gets augmented even further when the above concepts (diluted shares, EBITDA, tax cuts) get layered in, and you begin to think of companies as their own little organisms: sentient income statements with hopes and dreams that evolve with every quarter. Then, the companies begin to talk to each other: you have a laser component company over here, and a global OEM powerhouse over there, and a Chinese phone manufacturer somewhere else, and a smorgasbord of social camera apps, and with all of that information you might ask yourself something like: where is the 3D imaging industry heading? If you were to peer inside the brain of a truly great portfolio manager it would look a bit like a timelapse of a rapidly industrializing metropolis. A single question about the destiny of 3D imaging would be the launching pad for a mental model around the P+L of dozens of companies, implications for global supply chains, and assumptions around how consumer behavior will continue to evolve. Change one input, and the other variables will instantly recalibrate. \n\nThe most exciting thing about investing (or learning something new in general) are the moments where your own brain surprises you. A few weeks into the internship, I pitched my first stock. A couple days later, I was writing up earnings calls. Even though I definitely didn’t understand everything I was hearing, I realized that writing was a great way to interrogate where the gaps in my knowledge actually were: moments where the logic didn’t compute or my ideas failed to flow seamlessly into the next were clearly places where I needed to do more research. In a short amount of time, no one needs to ask you “What happens when GMs reach 65%?” because the question automatically populates itself in your brain (and then you want to know what happens when gross margins reach 70%, 80% and 85%), and you can pipe over to Excel, change some cells, and figure out the answer. The truly great moments are when you preempt a question even before the smart people you work for ask it.  \n\nIn this way, seeing things as stocks becomes its own network effect: everyone in the in-group is inculcated with a similar (though -- it should be emphasized -- not identical) set of priorities and platonic ideals to seek out in the investment process. In doing this, you learn to think not only on behalf of yourself, but on behalf of other investors, and the meta-game is the process of trying to parse the blind spots of the players around you. Yes, this can result in a lot of group-think (and sometimes compounds into a bubble) but the combination of being right, being wrong, being wrong about others being right, and being right about others being wrong (and vice versa) is a kind of palliative against things getting too out of hand. Generally, the people who make the most amount of money are optimists with a streak of paranoia: PMs whose heads are in the clouds, with eyes that glance constantly over their shoulders. \n\nToward the end of the summer, I knew I wanted a job offer. The desire went beyond my aversion to McKinsey case studies (after what I’d learned through attrition, I had more confidence in my ability to tackle one) and had more to do with the fact that I loved the job. I began to think of it as a privatized form of journalism or history scholarship: you speak to experts, read primary and secondary research, scrutinize transcripts, and try to form a narrative that never existed before (with the added component, of course, of being sensitive to what other investors are thinking). So when I got an offer, near the end of August, I accepted immediately on the spot. \n\nBut now onto other things that were happening around the same time. \n\n### You Either Grok It Or You Don’t\nThe period of 2017-2018 also happened to coincide with the third wave of crypto hype -- the runup of Bitcoin from $1,500 to $19,000, and Ethereum to $200 to $1,200 (and back down again). I wish I could say that the combination of a job offer, a light course load, and the relative abandon of senior year created the ideal environment for me to start picking up white papers and getting into crypto. But quite the opposite: getting TradFi-pilled made me dubious of anything that threatened to disrupt the cushy world I had just entered. During senior year, I’d sometimes visit my colleagues at the office, where we’d spot the occasional appearance of an ICO promoter or Winklevoss twin on the CNBC-designated flatscreen TV in our trading room. We’d gaze in silent, baffled horror, like we were observing a natural disaster in a foreign country. \n\nWhen my colleagues and I did discuss crypto, it was mostly in an orthogonal (and subtly pessimistic) way: what would happen to the price of AMD and Nvidia stock when crypto ultimately crashed and demand for GPUs would plummet? Should we be shorting the public companies which were opportunistically appending “blockchain” to their name and business plans, but clearly had no prior bonafides in crypto (in retrospect, probably yes). Even among the TradFi people who bought Bitcoin and Ethereum, there was a degree of calculating opportunism -- the bubble would pop eventually, and the key was to sell before the crowd. \n\nWe didn’t grok. \n\nBut crypto wasn’t completely alien to me either. In June of 2017, right around the time I started my internship, I began getting a Ethereum-focused newsletter from my friend [Teo](https://twitter.com/teo_leibowitz) (who now works at Uniswap). I can’t recall exactly how I ended up on his mailing list -- I must’ve run into him on Columbia’s campus or at a nearby bar and expressed interest, but anyway, I do know that I got the first issue, sent out on Saturday, Jun 24, 2017 at 1:52 PM. The subject header: *Crypto Chat #1: Flash Crash, Visa, China, ICOs*. It began:\n\n> *Hello - hope this finds you well.*\n> *As I've become more and more involved in discussions around Ethereum (ETH) in past months, several of you have mentioned interest in some kind of regular newsletter sharing a roundup of thoughts/news, so here goes - please find attached.*\n\nWithin the newsletter was a breathtaking roundup of recent crypto news: the [GDAX flash crash](https://www.cnbc.com/2017/06/22/ethereum-price-crash-10-cents-gdax-exchange-after-multimillion-dollar-trade.html#:~:text=Ethereum%20briefly%20suffered%20a%20flash,The%20cryptocurrency%20later%20rebounded.), a Visa job posting for Ethereum developers, [the staggering 65 million dollar Status ICO](https://www.coindesk.com/ico-blues-status-raises-58-million-leaves-buyers-waiting). Recall, I was still learning how exactly an IPO works (plus how to judge and value one), so the new mechanics of the crypto economy were a bit too much for me to wrap my head around.  I opened Teo’s newsletters most weeks (they arrived at a steady near-weekly pace until October of 2018), but at best I skimmed them and at worst I raised my eyebrows and said to myself dubiously “well that shit’s crazy.”\n\nI had other opportunities to grok, and flubbed those too. Fall semester of senior year I went on a few dates with a Turkish grad student with a mining rig set up in his Morningside Heights apartment. The way he talked about Bitcoin and Ethereum was completely different from how I heard the media describe what was going on. He came from a country with a debased currency, an untrustworthy government, and ungreased payment rails. He had grown up on the internet, and foresaw an interlinked, nationless society governed by the will of networked users and executed by code. The way he talked about it sounded exciting -- the kind of thing some of my SaaS-happy colleagues would’ve been into. The only problem was that...well the place I’d just accepted a job offer from only invested in enterprises that were public companies. Bitcoin and Ethereum were just ideas, and their most prominent manifestations were failed ICOs that were beginning to attract the wrath of the SEC. \n\nBy the time I graduated in May 2018, both Bitcoin and Ethereum had fallen below the high prices that attracted snarky clickbait pieces from the New York Times. Which meant that I pretty much stopped wondering about cryptocurrency and what all the hype was about. And then I stepped into full-time TradFi, which is an animal of its own. \n\n### The Social Network\nOne thing I was never told about Wall Street is that it’s one giant social network. From the outside it looks like numbers, lines, and glittering abstraction, but from the inside it’s essentially a high school cafeteria. Reputations are brokered and leveraged for allocations in an IPO, lavish, well-attended lunches are sponsored by investment banks, and the myth of the anonymous whale are overblown: your traders can call up pretty much any other desk in the industry and figure out who just made a block trade in a stock you’re jockeying to buy. You will attend dinners, and have the opportunity to rub shoulders with management teams. Names of prolific or disgraced traders who pop up in Bloomberg and the Financial Times are usually one degree of separation away. No one is incognito, even if the charts make it look that way. \n\nThis is a digression, but a private theory I have about the wave of SPACs in 2020 is that they had less to do with macroeconomic trends (COVID, low interest rates) or microeconomic trends (investment banks who wanted to earn a nice fee) than they did with the simple compulsion to sustain the social network. People were bored at home, and wanted to feel important. So they all did SPACs. \n\nStock investors aren’t even the most aggressively social creatures; our bond-trading counterparts are even more outgoing. About a year into my job, in April of 2019, I looked at the IPO of TradeWeb, a digital trading network for fixed-income assets. I was shocked to discover that just 20% of bonds, treasuries, swaps, and derivatives are traded electronically. The remaining 80% are done on the phone, over fax, or during lunch and golf. This is partially due to the fact that many fixed income assets have shallow liquidity pools or trade infrequently. But there’s another reason too: the social network keeps people locked into the old way of doing things. \n\nAnother thing you begin to notice as a stock investor is that some of the companies you’re evaluating -- the VC-annointed, so-called disruptors who are changing the world and giving the incumbents a million reasons to be fearful at night -- are not actually that innovative. They’ve just figured out one bit of arbitrage (better advertising, better branding, more money from VCs, clever financial engineering) to realize staggering growth, with punt-the-proverbial-can-down-the-road promises about future profitability. \n\nThis is especially true in the fintech space, where you might see, for example, a digital lender sell off consolidated loans in the form a variable interest entity, thus sacrificing the cash flows from those loans--and thus, the long-term upside (and so, the very “innovative” digital lender will be stuck losing money until the FDIC throws it a bone and lets it get a banking license...but by then the marketing dollars will have dried up so the growth will have slowed, and the earnings multiple will compress). Or you might see other forms of arbitrage, like an insure-tech company that gets its customer foothold in low-competition fields like renter’s insurance...but is forced to fight against high churn and low retention (which is why there’s so little competition in those fields -- you probably don’t want that customer to begin with). Or a home iBuyer that promises faster selling times...all in exchange for commission fees that are roughly double the industry average (and in a home-buying environment where homes sell at a staggering velocity without the need for an iBuyer to begin with). Just fun, late-stage growth stuff. \n\nNow to be clear, I’m not saying that new public companies aren’t doing exciting and innovative things -- there are plenty of companies in biotechnology, data warehousing, web security, eCommerce, and retail that are delighting their customers and doing wildly great things. And even those fintechs have better customer service, and sometimes better APYs and lending rates than their more established rivals. But at the end of the day, everyone is subservient to the same master business model, and a lot of things that look like real change are just shiny skin-grafts atop the old way of doing things.  \n\nUnderstanding this was one part of why finance began to feel a little ridiculous to me. And the understanding was by no means instantaneous; it took me a little over a year and a half before I started recognizing the skin-graft business model. But once you see it, you can’t unsee it: you’ll look deep in the unconsolidated section of a company’s balance sheet, or maybe just glance at the sales and marketing expenses (if this product is really better, why do they need to spend 90% of revenue on S+M?) and begin to question whether what you’re being pitched is actually all that world-changing, or if you’ve just been seduced by the accoutrements of Wall Street life (nice lunches, smooth-talking management teams, brassy salespeople etc.). Of course, there are plenty of people who see all of this and love Wall Street for other reasons: the constant challenge and sense that you’re learning something every moment, being surrounded by brilliant people, the game of it all, and yes, the money. And of course, I enjoyed all of this...but I still couldn’t get beyond the skin-grafting.   \n\nAt the beginning of 2020, I had a number of ideas that I wanted to try after TradFi. Most of the things on my list involved more creativity than being a stock analyst: I was weighing the idea of either returning to my film roots and working in production, or doing a bunch of coding bootcamps and trying to work in game design. I played a ton of games as a kid (Maplestory, The Sims, Runescape, and Civilization were some of my favorites), and my job had given me a fresh pair of eyes through which to view the various incentives and nuances at play when you orient people around mercenary goals. Between my love for devising narratives and the quantitative bent I’d picked up over the past few years, I thought that it might be worth trying out game development. In the time since graduation, I’d taught myself some coding basics but never sat down to undergo the requisite brain-attrition necessary to actually be proficient. Anyway, at the beginning of 2020, I had tentative plans to leave my job by the summer of 2020 -- exactly three years since the start of my 2017 internship -- and try something new. \n\nAnd then a pandemic happened.\n\n### It’s All A Game \nSo, March 2020. COVID-19 is officially a national crisis. In the realm of finance, the Dow plunged 26%, the Vix spiked all the way up to 83, and in a panic I withdrew 50% of my stock portfolio from the market. On March 16th, 2020 my entire team called in for our first work-from-home 9am call, and spent about half the time speculating about when New York would reach herd immunity and the other half discussing what stocks we should buy when the pandemic ended (perhaps a testament to our enduring optimism). Stocks continued to plummet through the end of March, and then began their staggering, unprecedented recovery (thank you, Federal Reserve).\n\nUnbeknownst to me, similar stress tests were unfolding in crypto: Bitcoin fell 50%, and the crash of Ethereum set off a chain reaction of pricing oracle lags, surging gas prices, [decentralized exchange liquidations](https://medium.com/aave/crypto-black-thursday-the-good-the-bad-and-the-ugly-7f2acebf2b83), and [the Maker debt auction](https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-tuesday-march-17-9am-pst-4-00-pm-utc/1630/7) (on the bright side, Hayden Adams popped onto Twitter [to chirpily inform people](https://twitter.com/haydenzadams/status/1238457224214786048) that Uniswap achieved a then-record amount of volume). Months later, when I finally started seriously getting into crypto (and to be honest, specifically Ethereum), I spent hours reading Medium posts, Twitter threads, and forums, unearthing lore across the ecosystem, and reliving not only the drama of March 2020, but sagas from the past decade. This is another instance where having majored in history really helped me: it’s just that my sources expanded beyond library archives and into stuff like blogs, DAO forums, Discord servers, and Etherscan transactions. \n\nAnyway, back to Spring 2020. If Wall Street felt like a game before, this sense got further compounded when the sexiness and thrill of conferences and hand-shaking were stripped away, and all we were left with were Bloomberg terminal windows and Zoom meetings. In other words, the skin-graft of Wall Street itself was lifted. While the actual content of work was certainly getting more interesting -- markets and the narratives that animated them were being rewritten on a daily basis --- the substance of everyday life was, perhaps unsurprisingly, quite banal. Everything was unfolding on the interface-layer, on the screen, like a videogame. \n\nI still remember why and when I started reading about crypto again. Every Sunday, I’d send out an email to my colleagues with a roundup of news related to stocks and trade ideas we’ve been discussing. On May 31st, 2020, I included [a link to a New York Times article](https://www.nytimes.com/2020/05/24/business/media/new-model-celebrity.html) about Cameo, Patreon, and Substack -- one of the first mainstream pieces I’d read codifying the “creator economy” as a real force in the market. The Times also linked to a bunch of articles -- including [a few](https://a16z.com/2020/02/06/100-true-fans/) [by Li Jin](https://a16z.com/2019/10/08/passion-economy/), which brought me to the a16z website, which (after the relentless hyperlink-clicking that I tend to do) [landed me on a podcast](https://a16z.com/2020/05/26/a16z-podcast-new-fan-engagement-models-for-athletes-and-influencers/) with Jeff Jordan, Jesse Walden, Zoran Basich and the NBA player Spencer Dinwiddie. Spencer, a point guard with the Brooklyn Nets, was planning on tokenizing a portion of his three-year contract with the team, in an effort to receive more of his income upfront. What struck me about the podcast was the way Spencer articulated crypto as a unique enabler of an internet of value -- a way to create liquidity in an idiosyncratic pool of assets underpinned both by monetary worth and personal affinity. For the first time, crypto started to make sense, despite his occasional drops of industry lingo (Eth2, Polkadot, Tezos) that I still wasn’t totally familiar with. \n\nFrom the podcast, I clicked on [Jesse Walden’s](https://a16z.com/author/jesse-walden/) name, which led me to his author page where I landed on his (then) most recent article: [“Crypto’s Business Model is Familiar. What Isn’t is Who Benefits.”](https://a16z.com/2020/04/08/crypto-network-effects/) This piece was another crucial unlock for me. In it, Jesse described a system I was much more familiar with: network effects. But Jesse wasn’t just talking about the networked models I had grown familiar with as a stock analyst (Uber, Facebook/Instagram, Twilio, Wall Street life itself, etc.), but actually drawing analogies between Web 2.0 companies and their crypto counterparts. I hadn’t yet heard of Compound or Uniswap, but I knew about LendingClub and Coinbase, and what Jesse was describing seemed to be a far fairer model for organizing a business and aligning incentives. As Jesse writes in the piece: “[t]he principal innovation of crypto networks is their ability to grow network effects by enabling users to share in the value they create.” \n\nTo those already in the crypto space, this might seem like the most obvious observation in the world. ***Of course*** web3 protocols need users, and of course those users are attracted to networks with the deepest liquidity pools and most attractive incentives. But for someone who, up until that point, didn’t really grasp that actual businesses were being built on top of decentralized blockchains like Ethereum, this was an absolute revelation. The way I’d seen crypto written about by mainstream media tended to focus on cryptocurrencies as assets and investments -- but Jesse’s piece went a layer deeper and looked at crypto at the layer of ERC-20 tokens and business models. \n\nThat was a major turning point for me. Starting in June 2020, I began to follow the space a bit more closely. I began checking Coindesk and other crypto-focused news sites, and tracked the wave of token drops and liquidity-mining incentives that were picking up momentum. Admittedly, the significance of DeFi Summer ([the launch of the Compound](https://www.coindesk.com/compounds-comp-token-price-doubles-amid-defi-mania) and [Balancer](https://www.coindesk.com/defi-platform-balancer-bal-token-distribution-compound-comp) tokens, rampant yield farming, and [TVL reaching nearly $8 billion by the end of August](https://news.bitcoin.com/total-value-locked-in-defi-jumped-83-in-august-8-billion-in-assets-held/)) was actually a little lost on me. I assumed that everything that was going on was simply a continuation from the 2017-2018 hype cycle, rather than (as it now seems) a genuine shift forward in the energy and momentum of the industry. Still, I felt like things were different than they were two years prior. By the time the UNI token dropped in September 2020, I was beginning to develop a suspicion that tokens might one day shift the nature of traditional capital markets as well. \n\nIf users are given tokens, early investors are offered liquidity faster, and outsiders are given the opportunity to buy-in, is there a future where the need for traditional capital markets is reduced or rendered obsolete completely? Clearly, we’re still in a very early phase of this (and a large number of tokens dropped today have nebulous utility), but it does seem possible that with everything shifting upstream in the realm of finance (DeFi, token drops, faster and more-efficient asset trading), everything downstream will begin to adjust as well. The model of Uniswap loomed in my head when the Coinbase S1 dropped in February of this year. A decentralized exchange is running head-to-head in daily volume and revenue with a centralized leviathan valued at several magnitudes more -- and that leviathan has over a thousand employees, and likely lower margins (note: this should not be read as a knock against Coinbase which has a much more diverse business: an institutional segment, [a nascent debit card](https://www.coinbase.com/card) and [high-yield interest account](https://www.coinbase.com/lend), a much larger compliance/legal team, an investing arm, a strategic affiliation with USDC, a much more diverse balance sheet, etc...but still, the rise of Uniswap is truly staggering). It raises the question: how many more industries can crypto disrupt, when decentralized protocols replace employees and overhead costs, and value can instead be shared with users and stakeholders? \n\nBut I’m getting ahead of myself. In October of 2020, my friend [Nikita](https://twitter.com/singareddynm) invited me and a bunch of mutual friends to spend the month in a house in Maine. While there, I met [Reggie](https://twitter.com/HipCityReg), who was getting even deeper into crypto than I was. I had only been reading the articles and token drop announcements -- Reggie was investing, reading white papers, swapping tokens, yield farming, and just generally ***living*** in it (in addition to all of that, he’s also the CEO of an avatar social network company called Eternal). Anyway, the trip was the extra push I needed to begin seriously thinking about leaving my current job (I’d put that plan on temporary hiatus because of the pandemic). I was surrounded by people in various stages of mid-20’s self-discovery: everyone was either accepting a new position, about to quit a job, applying to grad school, launching an angel fund, raising money for a startup, working in VC, [or working](https://twitter.com/_TamaraWinter) [for Stripe](https://twitter.com/orbuch). As a stock analyst I didn’t quite feel like a vampire squid, but I did feel a little like a barnacle -- hanging on the outer rim of life but not really participating in it substantially. The trip truly changed my life in a lot of ways -- I met people who loved their work, were optimistic about tech, and felt a clear sense of responsibility about the direction of the industry. \n\nWhen I got back from the trip, I started really diving into crypto. I read the Ethereum White Paper for the first time (I know, I know, it took me awhile!). I discovered MEV; in fact, when I read the paper [“Flash Boys 2.0: Frontrunning, Transaction Reordering, and Consensus Instability in Decentralized Exchanges\"](https://arxiv.org/pdf/1904.05234.pdf), it was the first time I felt like I really understood how smart contracts work and orders are processed on the blockchain (what that paper does really well is highlight how the Ethereum network functions by exposing points of arbitrage). I started doing research and buying currencies and tokens -- trying to assess their businesses the way I evaluate a stock (once you start seeing things as stocks, anything is up for fair valuation). I [discovered NFTs that I love](https://twitter.com/VirtualElena/status/1389377447402033155), and met people like [Toby Shorin](https://twitter.com/tobyshorin) and [John Palmer](https://twitter.com/john_c_palmer) who had been doing work in the industry for a few years. \n\nIn late January, I was still at the firm, but had already told my boss I was starting to look for new positions. I was already quietly buzzing with excitement about crypto, and was also jazzed by a few other personal projects I had just worked on (including messing a bit around with Unity and learning a bit of C#). That entire month had a kind of “crossing-the-Rubicon” valence to it. Between finally making it to 2021, the storm on the Capitol, and the promise of vaccines on the horizon, it seemed like the world was reconstituting itself. \n\nStill, like everyone else at my job, in finance, and probably most people in the country, I was completely shocked to watch what happened in the final few weeks of January when Gamestop rose roughly 750% in the span of a few days, invigorated by the forces of Reddit. Among my colleagues, the reaction was a mix of fear, awe, and self-protection. Chief among the concerns: could one of our positions be next (a new neologism: “Don’t short something if r/WallStreetBets is about to send it to the moon. You will get rekt”). Over the next few days, our outlook evolved: by January 28th we had a deeper grasp of the months-long leadup to the saga. RoaringKitty had sowed the seeds for months on YouTube and the idea had been percolating for awhile on Reddit. This realization prompted a more nuanced discussion about the way the average retail investor was a lot more sophisticated than the elite Wall Streeter gives them credit for. \n\nr/WallStreet bets had illuminated something: everyone was now playing the same game, mediated by the same interface. COVID rendered us all crouched, behind screens, contending to steer the same pools of capital in different directions. I think institutional Wall Street is afraid for a reason that’s even more intrinsic than the idea of being liquidated or margin-called. The game that we’d spent decades perfecting and protecting for a select group of insiders was now open to anyone. A great incursion on the social network was unfolding for everyone to witness. The funhouse culmination of Metcalfe’s law. \n\nI believe crypto only intensifies that. Capital can now move at the same pace of online thought. Jesse Walden even hinted at that in the first article of his that I read: “We can now move bits of value in the way we move bits of information: using an open standard, in very granular transmissions, instantly, to anyone, anywhere in the world.” That ability will change everything. \n\n### Describing the Present \nEveryone’s journey down the crypto rabbit-hole is deeply personal to them. Mine is an amalgamation of my work in finance and investing, my private anxieties around whether I gave film enough of a shot (and underpinning that, a desire to make the act of creating art easier and more financially viable for my friends who were brave enough to go all-in), my personal tendencies toward light iconoclasm, my delight in uncertainty, and my desire to make the world a fairer, more economically just place. I think most people in crypto share some array of these traits, and have their own motivations as well. I think the key is finding the unlock for each person, and introducing them to crypto that way.\n\nMy dad began to grasp Ethereum after I suggested he read the white paper; as a lawyer, he immediately grokked the idea of immutable smart contracts. I’ve started a consulting gig with a resale and limited-run goods startup on a social token rewards system, and our conversations have centered around unifying the values of buyers, sellers, and creating relationships that endure beyond a transaction. Given the pace of sell-side notes, investment bank-hosted webinars, and recent high-profile announcements of potential TradFi-DeFi alliances ([Compound Treasury, for example](https://medium.com/compound-finance/announcing-compound-treasury-for-businesses-institutions-83d4484fb82e)) I think Wall Street is beginning to wake up to the indelible momentum of crypto as well.\n \nIn my final weeks as a stock analyst, I pitched Ethereum, Uniswap, and MakerDAO as long positions to my colleagues (though no one bought...yet). We had numerous discussions around the promises of crypto, and what various crypto-native business models might look like. [Marc Rubenstein’s](https://twitter.com/MarcRuby) excellent [Reinventing The Financial System post](https://www.netinterest.co/p/reinventing-the-financial-system) about MakerDAO was the catalyst for a thorough, long-winding conversation about the fractional reserve banking system, and the way loans underpin the financial industry. I think my former teammates were surprised to hear that crypto could be used as a means to issue a dollar-backed stablecoin, and that a blockchain-based issuer could also begin to do work in new segments like [real-world-asset-backed loans](https://forum.makerdao.com/tag/real-world-finance). While MakerDAO’s initial pool of RWA loans is quite small (just under [~4m in total loans outstanding today](https://duneanalytics.com/queries/38282/75752)), it’s easy to see this scaling into a much larger operation (which [could help diversify their collateral base away from USDC](https://daistats.com/)). These are early signs that crypto has the potential to grow to touch more than just value-exchange online. \n\nIt’s still so early for everything. A few nights ago, I went back and re-read some of the first messages I sent with the Turkish grad student from 2017. I wanted to revisit what I was really thinking about cryptocurrencies at the time. Our messages began in September, just a few weeks after my post-internship job offer. This part in particular stuck out to me:\n\n![](https://images.mirror-media.xyz/publication-images/d87d30d1-c279-453e-8e65-d716bd26d23b.jpeg?height=523&width=665)\n\nEssentially, I was asking -- how can Bitcoin (or Ethereum, or any other cryptocurrency) scale without the kind of leverage and rehypothecation that we see in traditional financial markets? In my own words “*Bitcoin (or the blockchain) can’t replicate the international banking system we have where money and ‘value’ is basically manufactured through securitization and other fancy financial instruments.*” Obviously, I was not anticipating DeFi. As I said in the second message “*I’ve noticed that tech people are usually way more imaginative.*” I was right about that. DeFi had a little under $2bn in TVL a year ago and now sits [just above $50bn in TVL today](https://defipulse.com/) (and much more if you include blockchains like Solana and Binance)  -- a staggering amount of growth. \n\nWhile you might argue that DeFi encourages some degree of reckless over-speculation, overleveraged trading, and is artificially inflating the value of certain crypto-assets today, I actually don’t think that matters longer-term. For one, price action in the industry serves as a form of advertising, and an early engine of innovation (Chris Dixon and Eddy Lazzarin [had a good post that examined this phenomenon](https://a16z.com/2020/05/15/the-crypto-price-innovation-cycle/) with respect to the price of Bitcoin, but the same is likely true if you map in assets like Ethereum or Solana). Even if certain assets fluctuate today (and those fluctuations are intensified by leverage), the overall impact of getting more people interested in crypto is a positive counterweight to any near-term mania (though yes, it does suck for the people who lose a lot of money). \n\nAnd even if DeFi and yield farming is creating nearer-term hype, it’s also illuminating out the greater promise of crypto in general: the idea that if you eliminate middlemen and share value with users of a protocol instead, the positive externalities are so great that the crypto can start behaving like a public good. Grants issued by groups like Uniswap and the Ethereum Foundation are an early indication of this. And this isn’t confined to just DeFi; NFT projects allow creators and collectors to share in the value of art created by eliminating (or at the very least, reducing the take rate) of middlemen, while encoding an enduring revenue stream for the originator of a specific work. Hopefully we’ll soon see ways to map this model onto other scalable operations, like music and other forms of entertainment, DAOs that own real estate, and maybe a blockchain-based Uber. \n\n![](https://images.mirror-media.xyz/publication-images/b229174b-6b68-48b8-8a23-7567eb750663.jpeg?height=259&width=460)\n\nThe “seeing things as stocks” mindset that was first inculcated in me four years ago will likely need to be reframed. In the future, public companies may see no separation between users, employees, and shareholders. In fact, “public companies” as we understand them today may not even exist, as they will have issued tokens at an earlier stage, and might not even IPO. While I realize I’m now violating my favorite neologism (“Don’t try to predict the future. Try to describe the present.”), I think we have early signals that this could come to pass. Everything from the increased focus [on DAO treasury management](https://newsletter.banklesshq.com/p/how-daos-should-approach-treasury) to aforementioned efforts to collateralize real-world-assets with DeFi indicate that the need to tap public markets for capital may recede (it’s also quite possible that public markets and TradFi in general are reshaped from within by crypto, in ways that I’m not yet imagining, and they continue to endure in a revitalized form). Of course, there are tons of uncertainties here: the continued pace of user adoption, and regulatory overhangs are two big ones. \n\nMostly, I’m just unabashedly optimistic, for all the reasons I outlined above. In the four years since I first started paying attention to crypto, the industry has transitioned into an instrument of genuine value creation. I’ve met so many people in the past year who have inspired and galvanized me -- and my only hope is that I can contribute to an industry that I believe will revolutionize the way we live, both online and in the physical world. \n\nUsually when I write an essay, I start with the concluding paragraph already written, at least in my head. I tend to begin already knowing what I want the lesson to be. This is one of the few exceptions -- an hour before publishing this, I’m sitting on the couch in my living room, trying to figure out the best way to bring both the past four years of my professional life, and the promise of crypto to some kind of satisfying finale. And I’m realizing that it’s probably an impossible task to achieve in writing. Because with crypto, you just have to live it. So now I’m off to go do that. \n\n*Thanks to early readers of this essay: Andrew, Jeremy, Keeks, Reggie, Tarun, and Toby.* \n\n*Also boundless thanks to the builders, writers, thinkers, tinkerers, and visionaries who have made their work available on everything from Github to blogs to forums to Discord messages. All of your contributions have made me, and numerous others so excited to be a part of this space.*\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n", "timestamp": 1625143937, "digest": "LhhX4X9omlNNhAo5oKT0pmoGTiI3z9VIZ_J3onkmlTo", "contributor": "0x03942174b8E362D168e5C26d9b4339ab36D970b0"}
{"id": "_9DgattvClxDjJppahMI4ZdFIjVAh1V1gQ7wRub4Scc", "title": "Is This Public? (or...Why I’m leaving TradFi for Crypto) ", "body": "\n### It’s All Stocks\nA portfolio manager I used to work with once remarked that if you stay in finance for long enough, you begin to see everything as a stock. When I first heard this, as an intern at an investment firm in 2017, it seemed like one of those Wall Street neologisms that sound true, but don’t **feel** true until you’ve lived them firsthand (other neologisms that fall under this category: “Don’t short on valuation”, “Don’t short on competition”, and my personal favorite: “Don’t try to predict the future. Try to describe the present”). This particular piece of wisdom was palpable almost immediately: in August of 2017, I drove to the Hamptons with some friends and realized that the PM who said that everything looked like a stock had a long or short position in half of the retailers occupying the strip malls along the Southhampton Bypass. In finance, even a trip to the beach is a quest for alpha. \n\nThe 2017 internship turned into a job offer, which turned into a full time position in 2018 after I graduated from college. I felt luckier than a lot of my peers who spent senior year either cramming for McKinsey case studies or lamenting because they doubted they had the quantitative skills to even attempt one. Before the summer of 2017, I probably would’ve put myself in the latter camp: a history major who only did theater, film, and journalism in college. But the internship taught me that you can learn any quantitative skill on the job, by sheer force of attrition. Someone will ask you for the diluted share count of an upcoming IPO, or to input a company’s EBITDA into an earnings model (which raises other questions, like what is depreciation and amortization, and how do you use Excel?), or might say to you “yes, gross margins are 50% ***right now***, but what happens when GMs reach 65%, and S&M spend falls to 30% of revenue, and Trump manages to pass corporate tax cuts? How much are they earning ***then***?” Early on in my internship, it might take me an hour to figure out what question I was even being asked, and another few hours to answer it. But over time -- through attrition -- the concepts fall into place. And then you begin to start seeing everything as a stock. \n\nIn the initial phase, “seeing stocks'' might just mean the sudden realization that the vast majority of items and systems you interact with on a daily basis are actually public companies. This understanding gets augmented even further when the above concepts (diluted shares, EBITDA, tax cuts) get layered in, and you begin to think of companies as their own little organisms: sentient income statements with hopes and dreams that evolve with every quarter. Then, the companies begin to talk to each other: you have a laser component company over here, and a global OEM powerhouse over there, and a Chinese phone manufacturer somewhere else, and a smorgasbord of social camera apps, and with all of that information you might ask yourself something like: where is the 3D imaging industry heading? If you were to peer inside the brain of a truly great portfolio manager it would look a bit like a timelapse of a rapidly industrializing metropolis. A single question about the destiny of 3D imaging would be the launching pad for a mental model around the P+L of dozens of companies, implications for global supply chains, and assumptions around how consumer behavior will continue to evolve. Change one input, and the other variables will instantly recalibrate. \n\nThe most exciting thing about investing (or learning something new in general) are the moments where your own brain surprises you. A few weeks into the internship, I pitched my first stock. A couple days later, I was writing up earnings calls. Even though I definitely didn’t understand everything I was hearing, I realized that writing was a great way to interrogate where the gaps in my knowledge actually were: moments where the logic didn’t compute or my ideas failed to flow seamlessly into the next were clearly places where I needed to do more research. In a short amount of time, no one needs to ask you “What happens when GMs reach 65%?” because the question automatically populates itself in your brain (and then you want to know what happens when gross margins reach 70%, 80% and 85%), and you can pipe over to Excel, change some cells, and figure out the answer. The truly great moments are when you preempt a question even before the smart people you work for ask it.  \n\nIn this way, seeing things as stocks becomes its own network effect: everyone in the in-group is inculcated with a similar (though -- it should be emphasized -- not identical) set of priorities and platonic ideals to seek out in the investment process. In doing this, you learn to think not only on behalf of yourself, but on behalf of other investors, and the meta-game is the process of trying to parse the blind spots of the players around you. Yes, this can result in a lot of group-think (and sometimes compounds into a bubble) but the combination of being right, being wrong, being wrong about others being right, and being right about others being wrong (and vice versa) is a kind of palliative against things getting too out of hand. Generally, the people who make the most amount of money are optimists with a streak of paranoia: PMs whose heads are in the clouds, with eyes that glance constantly over their shoulders. \n\nToward the end of the summer, I knew I wanted a job offer. The desire went beyond my aversion to McKinsey case studies (after what I’d learned through attrition, I had more confidence in my ability to tackle one) and had more to do with the fact that I loved the job. I began to think of it as a privatized form of journalism or history scholarship: you speak to experts, read primary and secondary research, scrutinize transcripts, and try to form a narrative that never existed before (with the added component, of course, of being sensitive to what other investors are thinking). So when I got an offer, near the end of August, I accepted immediately on the spot. \n\nBut now onto other things that were happening around the same time. \n\n### You Either Grok It Or You Don’t\nThe period of 2017-2018 also happened to coincide with the third wave of crypto hype -- the runup of Bitcoin from $1,500 to $19,000, and Ethereum to $200 to $1,200 (and back down again). I wish I could say that the combination of a job offer, a light course load, and the relative abandon of senior year created the ideal environment for me to start picking up white papers and getting into crypto. But quite the opposite: getting TradFi-pilled made me dubious of anything that threatened to disrupt the cushy world I had just entered. During senior year, I’d sometimes visit my colleagues at the office, where we’d spot the occasional appearance of an ICO promoter or Winklevoss twin on the CNBC-designated flatscreen TV in our trading room. We’d gaze in silent, baffled horror, like we were observing a natural disaster in a foreign country. \n\nWhen my colleagues and I did discuss crypto, it was mostly in an orthogonal (and subtly pessimistic) way: what would happen to the price of AMD and Nvidia stock when crypto ultimately crashed and demand for GPUs would plummet? Should we be shorting the public companies which were opportunistically appending “blockchain” to their name and business plans, but clearly had no prior bonafides in crypto (in retrospect, probably yes). Even among the TradFi people who bought Bitcoin and Ethereum, there was a degree of calculating opportunism -- the bubble would pop eventually, and the key was to sell before the crowd. \n\nWe didn’t grok. \n\nBut crypto wasn’t completely alien to me either. In June of 2017, right around the time I started my internship, I began getting a Ethereum-focused newsletter from my friend [Teo](https://twitter.com/teo_leibowitz) (who now works at Uniswap). I can’t recall exactly how I ended up on his mailing list -- I must’ve run into him on Columbia’s campus or at a nearby bar and expressed interest, but anyway, I do know that I got the first issue, sent out on Saturday, Jun 24, 2017 at 1:52 PM. The subject header: *Crypto Chat #1: Flash Crash, Visa, China, ICOs*. It began:\n\n> *Hello - hope this finds you well.*\n> *As I've become more and more involved in discussions around Ethereum (ETH) in past months, several of you have mentioned interest in some kind of regular newsletter sharing a roundup of thoughts/news, so here goes - please find attached.*\n\nWithin the newsletter was a breathtaking roundup of recent crypto news: the [GDAX flash crash](https://www.cnbc.com/2017/06/22/ethereum-price-crash-10-cents-gdax-exchange-after-multimillion-dollar-trade.html#:~:text=Ethereum%20briefly%20suffered%20a%20flash,The%20cryptocurrency%20later%20rebounded.), a Visa job posting for Ethereum developers, [the staggering 65 million dollar Status ICO](https://www.coindesk.com/ico-blues-status-raises-58-million-leaves-buyers-waiting). Recall, I was still learning how exactly an IPO works (plus how to judge and value one), so the new mechanics of the crypto economy were a bit too much for me to wrap my head around.  I opened Teo’s newsletters most weeks (they arrived at a steady near-weekly pace until October of 2018), but at best I skimmed them and at worst I raised my eyebrows and said to myself dubiously “well that shit’s crazy.”\n\nI had other opportunities to grok, and flubbed those too. Fall semester of senior year I went on a few dates with a Turkish grad student with a mining rig set up in his Morningside Heights apartment. The way he talked about Bitcoin and Ethereum was completely different from how I heard the media describe what was going on. He came from a country with a debased currency, an untrustworthy government, and ungreased payment rails. He had grown up on the internet, and foresaw an interlinked, nationless society governed by the will of networked users and executed by code. The way he talked about it sounded exciting -- the kind of thing some of my SaaS-happy colleagues would’ve been into. The only problem was that...well the place I’d just accepted a job offer from only invested in enterprises that were public companies. Bitcoin and Ethereum were just ideas, and their most prominent manifestations were failed ICOs that were beginning to attract the wrath of the SEC. \n\nBy the time I graduated in May 2018, both Bitcoin and Ethereum had fallen below the high prices that attracted snarky clickbait pieces from the New York Times. Which meant that I pretty much stopped wondering about cryptocurrency and what all the hype was about. And then I stepped into full-time TradFi, which is an animal of its own. \n\n### The Social Network\nOne thing I was never told about Wall Street is that it’s one giant social network. From the outside it looks like numbers, lines, and glittering abstraction, but from the inside it’s essentially a high school cafeteria. Reputations are brokered and leveraged for allocations in an IPO, lavish, well-attended lunches are sponsored by investment banks, and the myth of the anonymous whale are overblown: your traders can call up pretty much any other desk in the industry and figure out who just made a block trade in a stock you’re jockeying to buy. You will attend dinners, and have the opportunity to rub shoulders with management teams. Names of prolific or disgraced traders who pop up in Bloomberg and the Financial Times are usually one degree of separation away. No one is incognito, even if the charts make it look that way. \n\nThis is a digression, but a private theory I have about the wave of SPACs in 2020 is that they had less to do with macroeconomic trends (COVID, low interest rates) or microeconomic trends (investment banks who wanted to earn a nice fee) than they did with the simple compulsion to sustain the social network. People were bored at home, and wanted to feel important. So they all did SPACs. \n\nStock investors aren’t even the most aggressively social creatures; our bond-trading counterparts are even more outgoing. About a year into my job, in April of 2019, I looked at the IPO of TradeWeb, a digital trading network for fixed-income assets. I was shocked to discover that just 20% of bonds, treasuries, swaps, and derivatives are traded electronically. The remaining 80% are done on the phone, over fax, or during lunch and golf. This is partially due to the fact that many fixed income assets have shallow liquidity pools or trade infrequently. But there’s another reason too: the social network keeps people locked into the old way of doing things. \n\nAnother thing you begin to notice as a stock investor is that some of the companies you’re evaluating -- the VC-annointed, so-called disruptors who are changing the world and giving the incumbents a million reasons to be fearful at night -- are not actually that innovative. They’ve just figured out one bit of arbitrage (better advertising, better branding, more money from VCs, clever financial engineering) to realize staggering growth, with punt-the-proverbial-can-down-the-road promises about future profitability. \n\nThis is especially true in the fintech space, where you might see, for example, a digital lender sell off consolidated loans in the form a variable interest entity, thus sacrificing the cash flows from those loans--and thus, the long-term upside (and so, the very “innovative” digital lender will be stuck losing money until the FDIC throws it a bone and lets it get a banking license...but by then the marketing dollars will have dried up so the growth will have slowed, and the earnings multiple will compress). Or you might see other forms of arbitrage, like an insure-tech company that gets its customer foothold in low-competition fields like renter’s insurance...but is forced to fight against high churn and low retention (which is why there’s so little competition in those fields -- you probably don’t want that customer to begin with). Or a home iBuyer that promises faster selling times...all in exchange for commission fees that are roughly double the industry average (and in a home-buying environment where homes sell at a staggering velocity without the need for an iBuyer to begin with). Just fun, late-stage growth stuff. \n\nNow to be clear, I’m not saying that new public companies aren’t doing exciting and innovative things -- there are plenty of companies in biotechnology, data warehousing, web security, eCommerce, and retail that are delighting their customers and doing wildly great things. And even those fintechs have better customer service, and sometimes better APYs and lending rates than their more established rivals. But at the end of the day, everyone is subservient to the same master business model, and a lot of things that look like real change are just shiny skin-grafts atop the old way of doing things.  \n\nUnderstanding this was one part of why finance began to feel a little ridiculous to me. And the understanding was by no means instantaneous; it took me a little over a year and a half before I started recognizing the skin-graft business model. But once you see it, you can’t unsee it: you’ll look deep in the unconsolidated section of a company’s balance sheet, or maybe just glance at the sales and marketing expenses (if this product is really better, why do they need to spend 90% of revenue on S+M?) and begin to question whether what you’re being pitched is actually all that world-changing, or if you’ve just been seduced by the accoutrements of Wall Street life (nice lunches, smooth-talking management teams, brassy salespeople etc.). Of course, there are plenty of people who see all of this and love Wall Street for other reasons: the constant challenge and sense that you’re learning something every moment, being surrounded by brilliant people, the game of it all, and yes, the money. And of course, I enjoyed all of this...but I still couldn’t get beyond the skin-grafting.   \n\nAt the beginning of 2020, I had a number of ideas that I wanted to try after TradFi. Most of the things on my list involved more creativity than being a stock analyst: I was weighing the idea of either returning to my film roots and working in production, or doing a bunch of coding bootcamps and trying to work in game design. I played a ton of games as a kid (Maplestory, The Sims, Runescape, and Civilization were some of my favorites), and my job had given me a fresh pair of eyes through which to view the various incentives and nuances at play when you orient people around mercenary goals. Between my love for devising narratives and the quantitative bent I’d picked up over the past few years, I thought that it might be worth trying out game development. In the time since graduation, I’d taught myself some coding basics but never sat down to undergo the requisite brain-attrition necessary to actually be proficient. Anyway, at the beginning of 2020, I had tentative plans to leave my job by the summer of 2020 -- exactly three years since the start of my 2017 internship -- and try something new. \n\nAnd then a pandemic happened.\n\n### It’s All A Game \nSo, March 2020. COVID-19 is officially a national crisis. In the realm of finance, the Dow plunged 26%, the Vix spiked all the way up to 83, and in a panic I withdrew 50% of my stock portfolio from the market. On March 16th, 2020 my entire team called in for our first work-from-home 9am call, and spent about half the time speculating about when New York would reach herd immunity and the other half discussing what stocks we should buy when the pandemic ended (perhaps a testament to our enduring optimism). Stocks continued to plummet through the end of March, and then began their staggering, unprecedented recovery (thank you, Federal Reserve).\n\nUnbeknownst to me, similar stress tests were unfolding in crypto: Bitcoin fell 50%, and the crash of Ethereum set off a chain reaction of pricing oracle lags, surging gas prices, [decentralized exchange liquidations](https://medium.com/aave/crypto-black-thursday-the-good-the-bad-and-the-ugly-7f2acebf2b83), and [the Maker debt auction](https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-tuesday-march-17-9am-pst-4-00-pm-utc/1630/7) (on the bright side, Hayden Adams popped onto Twitter [to chirpily inform people](https://twitter.com/haydenzadams/status/1238457224214786048) that Uniswap achieved a then-record amount of volume). Months later, when I finally started seriously getting into crypto (and to be honest, specifically Ethereum), I spent hours reading Medium posts, Twitter threads, and forums, unearthing lore across the ecosystem, and reliving not only the drama of March 2020, but sagas from the past decade. This is another instance where having majored in history really helped me: it’s just that my sources expanded beyond library archives and into stuff like blogs, DAO forums, Discord servers, and Etherscan transactions. \n\nAnyway, back to Spring 2020. If Wall Street felt like a game before, this sense got further compounded when the sexiness and thrill of conferences and hand-shaking were stripped away, and all we were left with were Bloomberg terminal windows and Zoom meetings. In other words, the skin-graft of Wall Street itself was lifted. While the actual content of work was certainly getting more interesting -- markets and the narratives that animated them were being rewritten on a daily basis --- the substance of everyday life was, perhaps unsurprisingly, quite banal. Everything was unfolding on the interface-layer, on the screen, like a videogame. \n\nI still remember why and when I started reading about crypto again. Every Sunday, I’d send out an email to my colleagues with a roundup of news related to stocks and trade ideas we’ve been discussing. On May 31st, 2020, I included [a link to a New York Times article](https://www.nytimes.com/2020/05/24/business/media/new-model-celebrity.html) about Cameo, Patreon, and Substack -- one of the first mainstream pieces I’d read codifying the “creator economy” as a real force in the market. The Times also linked to a bunch of articles -- including [a few](https://a16z.com/2020/02/06/100-true-fans/) [by Li Jin](https://a16z.com/2019/10/08/passion-economy/), which brought me to the a16z website, which (after the relentless hyperlink-clicking that I tend to do) [landed me on a podcast](https://a16z.com/2020/05/26/a16z-podcast-new-fan-engagement-models-for-athletes-and-influencers/) with Jeff Jordan, Jesse Walden, Zoran Basich and the NBA player Spencer Dinwiddie. Spencer, a point guard with the Brooklyn Nets, was planning on tokenizing a portion of his three-year contract with the team, in an effort to receive more of his income upfront. What struck me about the podcast was the way Spencer articulated crypto as a unique enabler of an internet of value -- a way to create liquidity in an idiosyncratic pool of assets underpinned both by monetary worth and personal affinity. For the first time, crypto started to make sense, despite his occasional drops of industry lingo (Eth2, Polkadot, Tezos) that I still wasn’t totally familiar with. \n\nFrom the podcast, I clicked on [Jesse Walden’s](https://a16z.com/author/jesse-walden/) name, which led me to his author page where I landed on his (then) most recent article: [“Crypto’s Business Model is Familiar. What Isn’t is Who Benefits.”](https://a16z.com/2020/04/08/crypto-network-effects/) This piece was another crucial unlock for me. In it, Jesse described a system I was much more familiar with: network effects. But Jesse wasn’t just talking about the networked models I had grown familiar with as a stock analyst (Uber, Facebook/Instagram, Twilio, Wall Street life itself, etc.), but actually drawing analogies between Web 2.0 companies and their crypto counterparts. I hadn’t yet heard of Compound or Uniswap, but I knew about LendingClub and Coinbase, and what Jesse was describing seemed to be a far fairer model for organizing a business and aligning incentives. As Jesse writes in the piece: “[t]he principal innovation of crypto networks is their ability to grow network effects by enabling users to share in the value they create.” \n\nTo those already in the crypto space, this might seem like the most obvious observation in the world. ***Of course*** web3 protocols need users, and of course those users are attracted to networks with the deepest liquidity pools and most attractive incentives. But for someone who, up until that point, didn’t really grasp that actual businesses were being built on top of decentralized blockchains like Ethereum, this was an absolute revelation. The way I’d seen crypto written about by mainstream media tended to focus on cryptocurrencies as assets and investments -- but Jesse’s piece went a layer deeper and looked at crypto at the layer of ERC-20 tokens and business models. \n\nThat was a major turning point for me. Starting in June 2020, I began to follow the space a bit more closely. I began checking Coindesk and other crypto-focused news sites, and tracked the wave of token drops and liquidity-mining incentives that were picking up momentum. Admittedly, the significance of DeFi Summer ([the launch of the Compound](https://www.coindesk.com/compounds-comp-token-price-doubles-amid-defi-mania) and [Balancer](https://www.coindesk.com/defi-platform-balancer-bal-token-distribution-compound-comp) tokens, rampant yield farming, and [TVL reaching nearly $8 billion by the end of August](https://news.bitcoin.com/total-value-locked-in-defi-jumped-83-in-august-8-billion-in-assets-held/)) was actually a little lost on me. I assumed that everything that was going on was simply a continuation from the 2017-2018 hype cycle, rather than (as it now seems) a genuine shift forward in the energy and momentum of the industry. Still, I felt like things were different than they were two years prior. By the time the UNI token dropped in September 2020, I was beginning to develop a suspicion that tokens might one day shift the nature of traditional capital markets as well. \n\nIf users are given tokens, early investors are offered liquidity faster, and outsiders are given the opportunity to buy-in, is there a future where the need for traditional capital markets is reduced or rendered obsolete completely? Clearly, we’re still in a very early phase of this (and a large number of tokens dropped today have nebulous utility), but it does seem possible that with everything shifting upstream in the realm of finance (DeFi, token drops, faster and more-efficient asset trading), everything downstream will begin to adjust as well. The model of Uniswap loomed in my head when the Coinbase S1 dropped in February of this year. A decentralized exchange is running head-to-head in daily volume and revenue with a centralized leviathan valued at several magnitudes more -- and that leviathan has over a thousand employees, and likely lower margins (note: this should not be read as a knock against Coinbase which has a much more diverse business: an institutional segment, [a nascent debit card](https://www.coinbase.com/card) and [high-yield interest account](https://www.coinbase.com/lend), a much larger compliance/legal team, an investing arm, a strategic affiliation with USDC, a much more diverse balance sheet, etc...but still, the rise of Uniswap is truly staggering). It raises the question: how many more industries can crypto disrupt, when decentralized protocols replace employees and overhead costs, and value can instead be shared with users and stakeholders? \n\nBut I’m getting ahead of myself. In October of 2020, my friend [Nikita](https://twitter.com/singareddynm) invited me and a bunch of mutual friends to spend the month in a house in Maine. While there, I met [Reggie](https://twitter.com/HipCityReg), who was getting even deeper into crypto than I was. I had only been reading the articles and token drop announcements -- Reggie was investing, reading white papers, swapping tokens, yield farming, and just generally ***living*** in it (in addition to all of that, he’s also the CEO of an avatar social network company called Eternal). Anyway, the trip was the extra push I needed to begin seriously thinking about leaving my current job (I’d put that plan on temporary hiatus because of the pandemic). I was surrounded by people in various stages of mid-20’s self-discovery: everyone was either accepting a new position, about to quit a job, applying to grad school, launching an angel fund, raising money for a startup, working in VC, [or working](https://twitter.com/_TamaraWinter) [for Stripe](https://twitter.com/orbuch). As a stock analyst I didn’t quite feel like a vampire squid, but I did feel a little like a barnacle -- hanging on the outer rim of life but not really participating in it substantially. The trip truly changed my life in a lot of ways -- I met people who loved their work, were optimistic about tech, and felt a clear sense of responsibility about the direction of the industry. \n\nWhen I got back from the trip, I started really diving into crypto. I read the Ethereum White Paper for the first time (I know, I know, it took me awhile!). I discovered MEV; in fact, when I read the paper [“Flash Boys 2.0: Frontrunning, Transaction Reordering, and Consensus Instability in Decentralized Exchanges\"](https://arxiv.org/pdf/1904.05234.pdf), it was the first time I felt like I really understood how smart contracts work and orders are processed on the blockchain (what that paper does really well is highlight how the Ethereum network functions by exposing points of arbitrage). I started doing research and buying currencies and tokens -- trying to assess their businesses the way I evaluate a stock (once you start seeing things as stocks, anything is up for fair valuation). I [discovered NFTs that I love](https://twitter.com/VirtualElena/status/1389377447402033155), and met people like [Toby Shorin](https://twitter.com/tobyshorin) and [John Palmer](https://twitter.com/john_c_palmer) who had been doing work in the industry for a few years. \n\nIn late January, I was still at the firm, but had already told my boss I was starting to look for new positions. I was already quietly buzzing with excitement about crypto, and was also jazzed by a few other personal projects I had just worked on (including messing a bit around with Unity and learning a bit of C#). That entire month had a kind of “crossing-the-Rubicon” valence to it. Between finally making it to 2021, the storm on the Capitol, and the promise of vaccines on the horizon, it seemed like the world was reconstituting itself. \n\nStill, like everyone else at my job, in finance, and probably most people in the country, I was completely shocked to watch what happened in the final few weeks of January when Gamestop rose roughly 750% in the span of a few days, invigorated by the forces of Reddit. Among my colleagues, the reaction was a mix of fear, awe, and self-protection. Chief among the concerns: could one of our positions be next (a new neologism: “Don’t short something if r/WallStreetBets is about to send it to the moon. You will get rekt”). Over the next few days, our outlook evolved: by January 28th we had a deeper grasp of the months-long leadup to the saga. RoaringKitty had sowed the seeds for months on YouTube and the idea had been percolating for awhile on Reddit. This realization prompted a more nuanced discussion about the way the average retail investor was a lot more sophisticated than the elite Wall Streeter gives them credit for. \n\nr/WallStreet bets had illuminated something: everyone was now playing the same game, mediated by the same interface. COVID rendered us all crouched, behind screens, contending to steer the same pools of capital in different directions. I think institutional Wall Street is afraid for a reason that’s even more intrinsic than the idea of being liquidated or margin-called. The game that we’d spent decades perfecting and protecting for a select group of insiders was now open to anyone. A great incursion on the social network was unfolding for everyone to witness. The funhouse culmination of Metcalfe’s law. \n\nI believe crypto only intensifies that. Capital can now move at the same pace of online thought. Jesse Walden even hinted at that in the first article of his that I read: “We can now move bits of value in the way we move bits of information: using an open standard, in very granular transmissions, instantly, to anyone, anywhere in the world.” That ability will change everything. \n\n![](https://images.mirror-media.xyz/publication-images/e0065b2b-dd1e-411b-bd11-87a515588576.jpg?height=311&width=577)\n\n### Describing the Present \nEveryone’s journey down the crypto rabbit-hole is deeply personal to them. Mine is an amalgamation of my work in finance and investing, my private anxieties around whether I gave film enough of a shot (and underpinning that, a desire to make the act of creating art easier and more financially viable for my friends who were brave enough to go all-in), my personal tendencies toward light iconoclasm, my delight in uncertainty, and my desire to make the world a fairer, more economically just place. I think most people in crypto share some array of these traits, and have their own motivations as well. I think the key is finding the unlock for each person, and introducing them to crypto that way.\n\nMy dad began to grasp Ethereum after I suggested he read the white paper; as a lawyer, he immediately grokked the idea of immutable smart contracts. I’ve started a consulting gig with a resale and limited-run goods startup on a social token rewards system, and our conversations have centered around unifying the values of buyers, sellers, and creating relationships that endure beyond a transaction. Given the pace of sell-side notes, investment bank-hosted webinars, and recent high-profile announcements of potential TradFi-DeFi alliances ([Compound Treasury, for example](https://medium.com/compound-finance/announcing-compound-treasury-for-businesses-institutions-83d4484fb82e)) I think Wall Street is beginning to wake up to the indelible momentum of crypto as well.\n \nIn my final weeks as a stock analyst, I pitched Ethereum, Uniswap, and MakerDAO as long positions to my colleagues (though no one bought...yet). We had numerous discussions around the promises of crypto, and what various crypto-native business models might look like. [Marc Rubenstein’s](https://twitter.com/MarcRuby) excellent [Reinventing The Financial System post](https://www.netinterest.co/p/reinventing-the-financial-system) about MakerDAO was the catalyst for a thorough, long-winding conversation about the fractional reserve banking system, and the way loans underpin the financial industry. I think my former teammates were surprised to hear that crypto could be used as a means to issue a dollar-backed stablecoin, and that a blockchain-based issuer could also begin to do work in new segments like [real-world-asset-backed loans](https://forum.makerdao.com/tag/real-world-finance). While MakerDAO’s initial pool of RWA loans is quite small (just under [~4m in total loans outstanding today](https://duneanalytics.com/queries/38282/75752)), it’s easy to see this scaling into a much larger operation (which [could help diversify their collateral base away from USDC](https://daistats.com/)). These are early signs that crypto has the potential to grow to touch more than just value-exchange online. \n\nIt’s still so early for everything. A few nights ago, I went back and re-read some of the first messages I sent with the Turkish grad student from 2017. I wanted to revisit what I was really thinking about cryptocurrencies at the time. Our messages began in September, just a few weeks after my post-internship job offer. This part in particular stuck out to me:\n\n![](https://images.mirror-media.xyz/publication-images/d87d30d1-c279-453e-8e65-d716bd26d23b.jpeg?height=523&width=665)\n\nEssentially, I was asking -- how can Bitcoin (or Ethereum, or any other cryptocurrency) scale without the kind of leverage and rehypothecation that we see in traditional financial markets? In my own words “*Bitcoin (or the blockchain) can’t replicate the international banking system we have where money and ‘value’ is basically manufactured through securitization and other fancy financial instruments.*” Obviously, I was not anticipating DeFi. As I said in the second message “*I’ve noticed that tech people are usually way more imaginative.*” I was right about that. DeFi had a little under $2bn in TVL a year ago and now sits [just above $50bn in TVL today](https://defipulse.com/) (and much more if you include blockchains like Solana and Binance)  -- a staggering amount of growth. \n\nWhile you might argue that DeFi encourages some degree of reckless over-speculation, overleveraged trading, and is artificially inflating the value of certain crypto-assets today, I actually don’t think that matters longer-term. For one, price action in the industry serves as a form of advertising, and an early engine of innovation (Chris Dixon and Eddy Lazzarin [had a good post that examined this phenomenon](https://a16z.com/2020/05/15/the-crypto-price-innovation-cycle/) with respect to the price of Bitcoin, but the same is likely true if you map in assets like Ethereum or Solana). Even if certain assets fluctuate today (and those fluctuations are intensified by leverage), the overall impact of getting more people interested in crypto is a positive counterweight to any near-term mania (though yes, it does suck for the people who lose a lot of money). \n\nAnd even if DeFi and yield farming is creating nearer-term hype, it’s also illuminating out the greater promise of crypto in general: the idea that if you eliminate middlemen and share value with users of a protocol instead, the positive externalities are so great that the crypto can start behaving like a public good. Grants issued by groups like Uniswap and the Ethereum Foundation are an early indication of this. And this isn’t confined to just DeFi; NFT projects allow creators and collectors to share in the value of art created by eliminating (or at the very least, reducing the take rate) of middlemen, while encoding an enduring revenue stream for the originator of a specific work. Hopefully we’ll soon see ways to map this model onto other scalable operations, like music and other forms of entertainment, DAOs that own real estate, and maybe a blockchain-based Uber. \n\n![](https://images.mirror-media.xyz/publication-images/b229174b-6b68-48b8-8a23-7567eb750663.jpeg?height=259&width=460)\n\nThe “seeing things as stocks” mindset that was first inculcated in me four years ago will likely need to be reframed. In the future, public companies may see no separation between users, employees, and shareholders. In fact, “public companies” as we understand them today may not even exist, as they will have issued tokens at an earlier stage, and might not even IPO. While I realize I’m now violating my favorite neologism (“Don’t try to predict the future. Try to describe the present.”), I think we have early signals that this could come to pass. Everything from the increased focus [on DAO treasury management](https://newsletter.banklesshq.com/p/how-daos-should-approach-treasury) to aforementioned efforts to collateralize real-world-assets with DeFi indicate that the need to tap public markets for capital may recede (it’s also quite possible that public markets and TradFi in general are reshaped from within by crypto, in ways that I’m not yet imagining, and they continue to endure in a revitalized form). Of course, there are tons of uncertainties here: the continued pace of user adoption, and regulatory overhangs are two big ones. \n\nMostly, I’m just unabashedly optimistic, for all the reasons I outlined above. In the four years since I first started paying attention to crypto, the industry has transitioned into an instrument of genuine value creation. I’ve met so many people in the past year who have inspired and galvanized me -- and my only hope is that I can contribute to an industry that I believe will revolutionize the way we live, both online and in the physical world. \n\nUsually when I write an essay, I start with the concluding paragraph already written, at least in my head. I tend to begin already knowing what I want the lesson to be. This is one of the few exceptions -- an hour before publishing this, I’m sitting on the couch in my living room, trying to figure out the best way to bring both the past four years of my professional life, and the promise of crypto to some kind of satisfying finale. And I’m realizing that it’s probably an impossible task to achieve in writing. Because with crypto, you just have to live it. So now I’m off to go do that. \n\n*Thanks to early readers of this essay: Andrew, Jeremy, Keeks, Reggie, Tarun, and Toby.* \n\n*Also boundless thanks to the builders, writers, thinkers, tinkerers, and visionaries who have made their work available on everything from Github to blogs to forums to Discord messages. All of your contributions have made me, and numerous others so excited to be a part of this space.*\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n", "timestamp": 1625145521, "digest": "LhhX4X9omlNNhAo5oKT0pmoGTiI3z9VIZ_J3onkmlTo", "contributor": "0x03942174b8E362D168e5C26d9b4339ab36D970b0"}
{"id": "_DrCQ0HddwUAQ2vkxI3uFceTpKJlT1kAd0C5eLydD54", "title": "Long-term Alignment in Cryptonetworks & DAOs", "body": "## Special focus: Time-lock weighted token voting\n\nA longer version covering DeFi case studies (Curve & Sovryn) is available [here on Arweave](https://ah2j2zw6xx2tcdhlnb6mkv2f6gdnivjzqol2xhkkstken5vxchvq.arweave.net/AfSdZt699TEM62h8xVdF8YbUVTmDl6udSpTURva3Ees)\n\nOne of the most difficult problems in any organization is how to balance short-term interests and long-term goals.\n\nBoth are necessary for sustainable success in provisioning goods and services, but in traditional finance (TradFi) as well as decentralized finance (DeFi) capital markets there is a growing trend towards focusing on the short-term. In TradFi, figureheads such as Warren Buffet and Jamie Dimon recognize this problem and are publicly advocating for the elimination of the focus on quarterly earnings reports. In DeFi, [liquidity mining](https://medium.com/bollinger-investment-group/liquidity-mining-a-user-centric-token-distribution-strategy-1d05c5174641) has attracted significant mercenary capital that rapidly moves wherever the highest yields are paid in the short-term.\n\n![](https://lh4.googleusercontent.com/AhfAP6M3MgnHs8MwZ5YB0CqFdaEnV6MWgwroxYf2Wsp__7Dg8bfJjRISTgrQm9VKUWVM0ZyYCe8-DhHYDJ5wtvIuxk9KxTHaBBbQrl9W02khy-6sdyr8ZXN1lcxGwbenyV6XzqQg)\n\nThe future will not be reported quarterly?! [Fredrik Haga](https://duneanalytics.com/blog/revolution-not-quarterly) (Dune Analytics) on how blockchain data is open, free and real-time.\n\nOne great quality of blockchains is that they democratize access to data. Anyone can view and verify metrics like earnings, transactions, risk and solvency in real-time. Community analysts can build upon each other's work in open-source collaborations.\n\nHowever, if quarterly reporting has led traditional firms (and their [activist investors](https://www.investopedia.com/terms/a/activist-investor.asp)) to excessive short-term orientation, and leaders have advocated decreasing reporting frequency, where will real-time accounting lead us?\n\nHaving a clearer picture on our circumstances should enable us to make better decisions on resource allocation. On what time-frame though?\n\n### Focusing on the long-term matters\n\nWhen looking at for-profit sector data, we see significantly better business metrics in long-term focused firms than their counterparts (see chart below).\n\n![](https://lh4.googleusercontent.com/ZN9kNqv26Ws6592c9uzIj3-dH1ztPPDNpWDAR5ETkH0OqqKTUuB4-HtufnDJZMbCkceGxl6RogUNldorFWFFO9Bn9EP-gm-c9RdKoabAunDeC_gZirUisjb-mojueh_Wc97bw0vM)\n\nPerformance benchmark of long-term oriented firms vs. others - source: [McKinsey](https://www.mckinsey.com/featured-insights/long-term-capitalism/where-companies-with-a-long-term-view-outperform-their-peers#) global institute [analysis](https://hbr.org/2017/02/finally-proof-that-managing-for-the-long-term-pays-off) of McKinsey/S&P Capital IQ data - 615 large and mid-cap US publicly listed companies from 2001 to 2015 - based on patterns of investment, growth, earnings quality, and earnings management (to separate long-term firms from others and to compare their relative performance, after controlling for industry characteristics and company size); 1 indexed to 2001; Market capitalization of long-term firms grew on average by $7B more\n\nBeyond financial metrics, long-term firms added nearly 12k more jobs on average than other firms from 2001 to 2015, thus contributing more to the ecosystems they operate in through financing the livelihoods of people.\n\nAs innovation is one of the strongest drivers of sustainable success, one likely explanation for the outperformance is significantly higher growth in R&D spending (8.5% vs. 3.7% per annum.).\n\nManagement researcher Jim Collins also shows in \"[Built to Last](https://readingraphics.com/book-summary-built-to-last/#:~:text=In%20%E2%80%9CBuilt%20to%20Last%E2%80%9D%2C,can%20be%20built%20to%20last)\" that long-term oriented companies have outperformed their peers in terms of stock performance. He mainly argues that such visionary companies have cult-like cultures and preserve their core that goes beyond making profits (mission/ideology/values), while at the same time stimulating progress and innovation.\n\nFormer McKinsey boss Dominic Barton and Mark Wiseman (CEO of the Canada Pension Plan Investment Board) make the case that mainly pressure from financial markets led to a detrimental focus on short-term performance. They note that avoiding such pressure is one reason why private equity firms buy publicly traded companies to take them private. The result is that investing in private equity rather than comparable public companies yields long-term annual returns that are 1.5%-2% higher. Reversing this detrimental trend in public markets, they [argue](https://hbr.org/2014/01/focusing-capital-on-the-long-term), depends on the leadership of major asset owners and their active involvement in governance.\n\nIf history in the context of traditional companies has shown that optimizing for the long-run creates more wealth, it is likely that the same holds true for cryptonetworks. One could argue that long-term alignment in cryptonetworks is even more important given that they are meant to  outlast their initial founding teams and communities (even though that is also true for \"visionary\" companies as Jim Collins defines them).\n\nHow do we design incentives for optimizing long-term performance in cryptonetworks?\n-----------------------------------------------------------------------------------\n\nCryptonetworks often issue liquid tokens at inception that allow stakeholders to easily on-board and participate in governance. Traditional tech companies on the other hand deliberately remain private for longer.\n\nWhat if the pressures of a liquid market for governance tokens in cryptonetworks are detrimental to long-term success, such as what has been observed with traditional companies? If so, can we leverage programmable illiquidity (lock-ups) to strategically align long-term incentives?\n\nTo analyze this question we need to first examine the typical stakeholder-relationships and control structures in a cryptonetwork.\n\n### Spectrum of stakeholder-relationships in cryptonetworks/DAOs\n\nIn principle, any organizational structure can be implemented on a blockchain so there is a broad spectrum of what is considered a decentralized (autonomous) organization (DO/DAO, see our prev. [post](https://medium.com/greenfield-one/the-state-of-blockchain-governance-governance-by-and-of-blockchains-f6418c46077) and [paper](https://65eocu3ftlpiygeym3g5kply6zy2dtdjyrhbm4m26cb6bt3msyla.arweave.net/90jhU2Wa3owYmGbN1T149nGhzGnEThZxmvCD4M9slhY)).\n\nIn the idealized form of a cryptonetwork or DAO, stakeholder relationships are more akin to peer-to-peer (p2p) networks or a cooperative, i.e. without any particular person, group or entity in control.  (see the right side of the chart below).\n\nUsually, however, there is a founding team that acts as a de-facto executive body driving development. Though, in many cases founding teams will need to access further funding from a project's treasury by token-holder vote, at which point they might need to compete with alternative teams for resources.\n\nOn the other end of the spectrum is the archetypical traditional corporation in which shareholders elect a board which then appoints management to execute the company's strategy.\n\n![](https://lh6.googleusercontent.com/c3OGEPFYYsDs96nOYwdxExYAqyiCsN2Xdlfu_XhJE-S8u6y-bua9jxSR35bBKinfja-RlD5DEp8CZtf_Eppue5q4e0PluMOaFqB9bHgZJeIgBPYTDyjuury5iyQ5G3O9JLV4QAL5)\n\nSimplified stakeholder relationships cryptonetworks / DAOs (with on-chain governance) vs. corporate governance\n\nIdeally, there is a wide distribution of ownership which is one angle of decentralization (often of native governance tokens). Initially, a core group of founders/developers will gather an early community and, over time, more and more stakeholders join to contribute towards the vision of the project. As a network grows and gets more diverse, so should token [ownership](https://blog.curvelabs.eu/ownership-in-cryptonetworks-96f13f4a113e) (see also [progressive decentralization](https://variant.fund/progressive-decentralization-a-playbook-for-building-crypto-applications/)).\n\nIn cryptonetworks and DAOs, ownership and decision making authority is often distributed more widely and roles overlap to a larger extent than in a corporate governance setting. However, unclear separation of roles can in practice lead to conflict and inefficient use of time/resources.\n\nAs a result, when analyzing incentive and governance structures, one needs to account for the fact that community members and token-holders are both governors ([principals](https://www.investopedia.com/terms/p/principal-agent-problem.asp)) as well as the governed (agents). Increasingly we see representation happening and considered advisable (token-holders often delegate their votes to protocol politicians in a flexible fashion), which again introduces classic principal-agent dynamics.\n\nGoing forward, organization designs in the crypto space might move more towards appointing executives in dedicated areas for set time-frames, which would resemble more classic corporate governance structures (with plenty of room for hybrid, as well as newly imagined, forms).\n\nStill one can separate codified decision-making authority and control over reward functions - the principals - on the one hand and the reward functions that govern the actions of agents on the other hand for analysis. The former are represented for example by native governance tokens that define network ownership, while the latter are for example token incentives for contributors or the distribution of earnings for analysis.\n\n### Control through cryptonetwork ownership\n\nTokenized on-chain governance means holders have voting rights. In order to steer a project's or company's governance towards optimizing for long-term success, tokens (ergo, voting power) must be distributed towards long-term oriented stakeholders.\n\nIt is those who have the strongest attachment to a given system (or [skin in the game](https://medium.com/incerto/what-do-i-mean-by-skin-in-the-game-my-own-version-cc858dc73260)), which are most inclined to responsibly govern it.\n\nStakeholder lock-in is a measure of interest alignment and legitimacy of governance rights (see our [prev. paper](https://medium.com/greenfield-one/the-state-of-blockchain-governance-governance-by-and-of-blockchains-f6418c46077))\n\nA great opportunity with programmable tokens is to design custom vesting structures that model each stakeholders' time horizon of remaining with the protocol.\n\nWe have previously argued that all stakeholders should be represented in governance, which is a difficult, though worthwhile endeavor. One could focus on a broad and balanced distribution of transferable governance tokens amongst stakeholders, or utilize systems that also distribute voting power based on non-transferable reputation scores earned from valuable input to an organization (e.g. labor). Further, non-codified (real-world) reputation can be a strong measure of skin in the game.\n\n\"Community is about ownership --- feeling not just that I am part of something bigger than myself, but that I have some skin in the game. It doesn't matter so much whether that stake is economic or not --- in fact, I think non-economic stake (e.g. reputation) can be a much bigger motivator.\"[  Lane Rettig](https://twitter.com/lrettig/status/1037685148681216000), former Ethereum core dev, currently part of Spacemesh.\n\nAlso, there are many projects where off-chain or informal governance prevails and has significant influence over a system.\n\nThis post further focuses on on-chain governance mechanisms through transferable tokens that represent financial value on secondary markets (financial capital backing a project).\n\nThe mechanisms discussed are however only single pieces in the toolkit among many, which can and will be iterated on (as well as applied in combination). After all, the best mechanisms cannot trump a strong community with cult-like [culture](https://newsletter.banklesshq.com/p/culture-eats-capital-for-breakfast).\n\nSmart contracts allow for measuring and representing long-term commitments\n\nOne can define increases in voting power based on certain measurable commitments in a granularly programmable and easily verifiable fashion (e.g. a lock-up for a certain period of time).\n\n-   Committed long-term capital could have more voting power in order to optimize for long-term goals\n\n-   Profits could be distributed in a higher proportion towards committed long-term capital\n\nLooking towards traditional corporate governance, [tenure](https://a16z.com/2019/08/14/tenure-voting-vs-dual-class-corporate-governance/)  [voting](https://sites.law.berkeley.edu/sustainability-compliance/tenure-based-voting-a-potential-governance-solution-for-corporate-sustainability/) is often [suggested](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2625926) in order to align long-term interests. To a large extent, rigid requirements of traditional large exchanges and regulators concerned about discriminating any class of shareholders over another in the US dominated financial system prevented large-scale adoption (see also [a16z ](https://a16z.com/2019/08/14/tenure-voting-vs-dual-class-corporate-governance/)on that topic).\n\nAs opposed to traditional tenure voting, which is mainly backwards looking in terms of the time a given instrument (such as equity) has been held, crypto protocols specifically utilize forward looking mechanisms. This is a superior fit for optimizing long-term decision-making which by definition is about the future.\n\n### Incentivizing long-term commitment and decision making\n\nOn one hand, distributing control over an organization based on the strength of one's locked capital should (1) attract long-run stakeholders and (2) automatically weight votes based on the strength of long-term alignment.\n\nOn the other hand, the question arises why someone would enter into such a lock-in in the first place, given the opportunity cost associated with giving up their liquidity? Is an increase in voting power reason enough? How should rewards, if any, be structured for stakeholders?\n\nOne interesting approach is to grant additional advantages in the form of boosted token rewards (a multiplier of rewards that are paid to contributors) and to distribute residual profits based on the length of the lock-up. Intuitively this makes sense: Long-term committed capital is more valuable (and on the other side of the coin more costly) than short-term committed capital. In debt markets, there are usually higher yields being paid for longer duration bonds than shorter duration.\n\nToken holders as both principal and agent\n\nAs argued previously, stakeholder relationships and roles in DAOs overlap to a larger extent than in traditional firms. One lens through which to view a DAO is as a worker-owned cooperative (see our prev. governance [paper](https://medium.com/greenfield-one/the-state-of-blockchain-governance-governance-by-and-of-blockchains-f6418c46077) or [leadership in cryptonetworks](https://variant.fund/leadership-in-the-ownership-economy/)). Many DAOs operate to a large extent through directly voting on proposals. Token-holders both have the authority of decision-making over the direction of the whole organization (principal), while finding themselves in more executive roles as developers or other contributors (agents). Monitoring functions are performed to a larger degree in a p2p manner, enabled through a high degree of transparency based on the shared ledger and other commons such as forums and openly accessible community chats (Discord).\n\nIn the context of traditional companies, it has been [found](https://alexedmans.com/blog/executive-pay/long-term-executive-incentives-improve-innovation-and-corporate-responsibility/) that long-term executive incentives indeed have led to improved long-term performance (including improved innovation and social responsibility).\n\nViewing token-holders in their role as directly democratic executive decision-makers, one could argue that they need to be compensated with long-term incentives. One such incentive design can be allocating profits based on the length of a capital lock-up. As a result, even if there is compensation flowing to them at present, a certain level of skin in the game is enforced through the mechanism.\n\nArguably, the structures of DAOs will still evolve and become even more multifaceted than today with increasing representation and to some degree specialized executives (be it protocol politicians with delegated votes or novel structures that allow executive power at the edges of an organization).\n\nThus, there is room for specialized forms of incentive designs for individual functions within an organization. To highlight one interesting mechanism, [KPI options](https://medium.com/uma-project/uma-kpi-options-and-airdrop-bae86be16ce4) allocate rewards based on reaching certain performance metrics - be it as a collective or targeted at individual roles.\n\nThis post continues elaborating on some of the challenges with time-lock weighted token voting, while the longer-form [paper](https://ah2j2zw6xx2tcdhlnb6mkv2f6gdnivjzqol2xhkkstken5vxchvq.arweave.net/AfSdZt699TEM62h8xVdF8YbUVTmDl6udSpTURva3Ees) goes into more detail explaining the mechanisms, looking at case studies of Curve, including its relationship with aggregators such as yearn and Sovryn.\n\nChallenges\n----------\n\n### Hedging exposure can create misaligned incentives\n\nIf stakers of a governance token that receive a boost in both voting power and rewards can hedge their exposure through some mechanism, they could achieve increased influence over a protocol, while not being economically aligned to the full extent of their tokens locked.\n\nTwo mechanisms that achieve this are smart-contracts that allow tokens to be made liquid through tokenization (allowing holders to sell their tokenized position), as well as external lending and derivatives markets.\n\nThe challenges mainly arise in a pseudonymous setting, as is often desired in cryptoeconomic systems and communities in order to promote privacy and resilience.  An identity solution that reliably ties a given on-chain address to a specific user would align that person with the organization quite well. Hedging one's exposure can and is in many cases constrained through traditional natural language contracts, however where not possible or desirable, alternative remedies have to be found.\n\nStaking with smart contracts can create liquidity and vote delegation\n\nAs exemplified by the yearn [yveCRV](https://docs.yearn.finance/resources/guides/how-to-understand-yvecrv) vaults and alternatives (see the full paper for a deep dive), smart contracts that time-lock tokens can, in turn, make the position liquid by tokenizing it, while allowing different classes of stakeholders (CRV holders & LPs) to share in the rewards that otherwise would need to be earned by stakeholders having both CRV and LP positions. In the case of yearn, [StakeDAO](https://stakedao.org/) as well as [convex.finance](https://www.convexfinance.com/), voting power of individual users that use the mechanism is effectively delegated to the aggregator communities as a whole.\n\nThe effects of the delegation depend on the way governance decisions are taken in those particular communities. The relationships could well be symbiotic, allowing all communities to thrive to a greater extent than each of them individually. Alternatively, a community that amasses excessive governance power in another could exploit their power. This highlights the necessity of whitelisting smart contracts in order to control the ability of token holders to behave in undesired ways.\n\nPotentially, certain smart contracts could be whitelisted with a limit on the total number of tokens to be locked, in order to define the maximum influence an external DAO can have on the governance of the project in question.\n\nLending & derivatives markets\n\nExternal lending and derivatives markets allow holders of locked tokens to hedge their exposure by short-selling the token in question. As opposed to smart contracts that make a given position liquid through tokenization, voters can sell a greater amount than 100% of their value locked, which could potentially open the door for malicious governance attacks. In such a scenario, an actor would lock-up his tokens to gain governance power, while entering into a highly leveraged short position on an external market. If the actor has a governance stake significant enough to influence the outcome of particular proposals, he can maliciously try to decrease the value of the network in question and profit through the highly leveraged position in the opposite direction.\n\nHowever, this is not a problem particular to time-commitment scaled voting. On the contrary, such mechanisms alleviate the attack surface due to the fact that, depending on parameters, a short position would need to be upheld for extended periods of time (potentially on the order of years). The longer the time-frame, the longer the expected cost as well as uncertainty of cost and price-movements of the token in question, which in turn makes exploits both less profitable as well as considerably more risky, which should serve as strong deterrents.\n\nA particular subset of this attack utilizes flash-loans in order to exploit a voting mechanism. In such an attack, tokens are lent out, a governance vote is affected and the loan is paid back in the same block (see e.g. a case in [MakerDAO](https://decrypt.co/46575/group-uses-flash-loan-to-game-maker-protocol-governance)). By scaling voting power based on the time-lock, flash-loans would be made maximally ineffective, as the tokens could not be locked for any time-period in order for them to be paid back within a single block.\n\nBeyond malicious behavior, hedging can enable stakeholders to reap the benefits of increased voting power as well as rewards, while being less economically aligned with the success of the project. As a result, they might place less diligence in their governance actions than they would have otherwise. A factor alleviating this is the incentive to time-lock governance tokens in the first place. If staking rewards are high enough, the supply available on lending markets will be very limited, which makes shorting prohibitively expensive to offset exposure over long periods of time. If synthetic derivatives exist, their pricing will likely also be affected by similar dynamics, as longs will take into account the increased rewards they could earn through participating in the staking mechanism, which in turn makes shorts more expensive (in e.g. [perpetual swap contracts](https://research.paradigm.xyz/cartoon-guide-to-perps)).\n\n### Physically exchanging keys to exit positions & early exit fees\n\nEven if time-locking of tokens is properly governed on-chain to avoid undesired work-arounds (e.g. through a well executed smart contract whitelisting policy), the private keys that control access to voting rights can be exchanged physically in pseudonymous systems that do not require identification of users. As a result, a time-commitment can be transferred from one person to another without any strings attached.\n\nThis opens up the question of whether it is important to reward specific personas or ownership positions irrespective of their ultimate beneficial owner with increased voting power and rewards? How would the behavior of a given voter change based on the possibility to trade private keys in a pseudonymous system?\n\nAs exemplified in the case of [Sovryn](https://wiki.sovryn.app/en/governance/about-sovryn-governance) there is the possibility to withdraw time-committed tokens earlier by paying a penalty fee. It is likely that private keys to a given staked position would also trade at a discount, depending on the length of time they are still locked up for, as they lack the optionality of unlocked tokens. However, buyers of such positions might want to stake them anyways in order to enjoy the benefits, which would lead to a lower discount compared to the penalty fee. If the mechanism employed in a community explicitly employs a penalty fee that is re-distributed to loyal stakers, the social contract of such a community would likely deem such behavior as socially harmful and thus undesirable.\n\nThe behavior change of the voter in governance should depend on the expected discount at which she can dispose of the staked position in the short-to-medium term, similar to how a penalty fee would affect such behavior. If staked tokens can be disposed of relatively cheaply (close to their principal value), there is a relatively stronger incentive to boost voting power to drive short-term oriented outcomes, at the detriment of the long-term, to then exit positions before the long-term plays out. With an on-chain mechanism that explicitly defines penalty fees for early exit, the payoff structures of such behavior can be controlled to some extent, while re-distributing some of the gains of short-term activists to long-term stakeholders.\n\nIn order to avoid the work-around through exchanging private keys of staked positions, such behavior should be made as costly and infeasible as possible. Though, it should already be much more difficult and costly to find a willing counterparty for such a trade, as opposed to regular token markets (due to difficulties in execution, potential counterparty risk and much lower frequency of such trades).\n\nA community could leverage social norms to explicitly deem exiting time-committed positions without complying to the penalty fees of the on-chain mechanism as undesirable and define steep slashing penalties for actors that are found to have engaged in such behavior (through majority governance vote). It remains to be seen, however, to what extent such behavior can be observed. At least though, the threat of slashing would make it much more difficult to find willing counterparties, as openly announcing the willingness to trade one's time-locked tokens could be deemed a slashing condition already, which thus makes it much more costly and infeasible to execute.\n\n### Concentration of token holdings through compounding\n\nHeavily rewarding long-term committed token holders could allow the most dedicated ones to accumulate increasing amounts of the total supply, countering the ideals of decentralized ownership and control. Potential remedies include combining token-weighted voting with other measures of skin in the game such as reputation and allowing motivated contributors to earn themselves a meaningful stake. Another potential remedy is to leverage quadratic voting on the basis of identities so that several individuals with a given stake have a higher weight than a single individual as an equalizing force (though this is still a hard problem to solve in a decentralized fashion).\n\nAttracting and maintaining good governors\n\nFinally, the governance outcome of any mechanism heavily depends on the composition of participants. While long-term oriented mechanisms should attract long-term oriented community members, it is not a given that they have the necessary knowledge or skills to responsibly govern a given system.\n\nIn order to be sustainably successful,it is crucial for projects to attract as well as educate the community and team members that are fit for the specific purpose, as well as align them with the organization's core values. As described in the previously mentioned work by [Jim Collins](https://readingraphics.com/book-summary-built-to-last/#:~:text=In%20%E2%80%9CBuilt%20to%20Last%E2%80%9D%2C,can%20be%20built%20to%20last) it is crucial to maintain a cult-like culture that preserves the core of an organization (mission/ideology), while at the same time stimulating progress through ambitious goals, experimentation and continuous improvement. Ideally, members organically grow within the organization/community into roles with increasing responsibility and governance power.\n\nConclusion\n----------\n\nProjects that optimize for the long-term are considerably more successful in the long-run than those that do not. Thus, it is highly desirable to (1) implement governance mechanisms that serve that goal and (2) attract a community of stakeholders that aligns with such goals.\n\nTime-commitment based distribution of governance power as well as rewards can be a powerful mechanism in that regard, due to the following effects:\n\n-   Rewarding long-term oriented over short-term oriented stakeholders should attract the former in the first place, while enticing them to time-commit\n\n-   Long-term alignment due to locked-in governance tokens should make stakeholders consider long-term value creation & accrual in the way they behave and vote\n\n-   Stakeholders that contribute specific types of resources - such as liquidity providers (LPs) who have decided to lock-up tokens in order to enjoy increased rewards - are inclined to make use of those benefits and thus incentivize them to become long-term providers of those resources, which allows for better planning for a given project\n\n-   Dynamic early exit fees can decrease the barrier to lock tokens in the first place and  allow some level of short-term activism while partly re-distributing gains to loyal long-term stakeholders\n\nWhile there are a number of challenges with such mechanisms -  mainly centered around hedging economic alignment as well as applying work-arounds of the on-chain mechanisms -  there are also potential remedies, which have been discussed.\n\nDesign decisions include (but are not limited to):\n\n-   Linear vs. progressive increase in governance power and rewards\n\n-   Types of rewards that are boosted through lock-up (e.g. protocol fee distributions, LP rewards)\n\n-   Minimum and maximum length of the lock-up\n\n-   Early exit fees\n\n-   Whitelisted smart contracts to participate in governance (and policy on how to whitelist)\n\n-   Social norms around slashing for actors that attempt work-arounds\n\nAs the space is still in its nascent stages and the mechanisms are supposed to lead to long-term success, it is too early to judge their effectiveness as of now on an empirical basis. It will be exciting to see further iterations of such approaches and their effectiveness in the wild over time.\n\nIf you are working on similar mechanisms, others that aim at the same goals, or have any feedback I would love to hear from you!\n\n---\n\nMany thanks to Mario Laul, Jack du Rose, Dermot O`Riordan, Pat Rawson, Lito Coen, John Light, Romain Figuereo and Evan Mair as well as my colleagues Jendrik, Georg and Gleb for their valuable feedback and discussions!\n\nDisclosure: This content is for general informational purposes only that expresses our opinion, and it should not be construed as legal, tax, investment, financial, or other advice. Nothing contained here constitutes a solicitation, recommendation, endorsement, or offer by Greenfield One or the author to buy or sell any digital assets or other financial instruments. Greenfield One or the author may hold assets mentioned in the content. All data used is derived from publicly available sources.\n", "timestamp": 1625161735, "digest": "bbsycl6pCNQ4503O8Cqkq7yaI3uJtJ4LhI9zj91-E-M", "contributor": "0xb1676B5Ab63F01F154bb9938F5e8999d9Da5444B"}
{"id": "RMmrMBaDwyHBHajvSpLXOSZgAyl_XjUpNM22WfzOmfk", "title": "Long-term Alignment in Cryptonetworks & DAOs", "body": "## Special focus: Time-lock weighted token voting\n\nA longer version covering DeFi case studies (Curve & Sovryn) is available [here on Arweave](https://ah2j2zw6xx2tcdhlnb6mkv2f6gdnivjzqol2xhkkstken5vxchvq.arweave.net/AfSdZt699TEM62h8xVdF8YbUVTmDl6udSpTURva3Ees)\n\nOne of the most difficult problems in any organization is how to balance short-term interests and long-term goals.\n\nBoth are necessary for sustainable success in provisioning goods and services, but in traditional finance (TradFi) as well as decentralized finance (DeFi) capital markets there is a growing trend towards focusing on the short-term. In TradFi, figureheads such as Warren Buffet and Jamie Dimon recognize this problem and are publicly advocating for the elimination of the focus on quarterly earnings reports. In DeFi, [liquidity mining](https://medium.com/bollinger-investment-group/liquidity-mining-a-user-centric-token-distribution-strategy-1d05c5174641) has attracted significant mercenary capital that rapidly moves wherever the highest yields are paid in the short-term.\n\n![](https://lh4.googleusercontent.com/AhfAP6M3MgnHs8MwZ5YB0CqFdaEnV6MWgwroxYf2Wsp__7Dg8bfJjRISTgrQm9VKUWVM0ZyYCe8-DhHYDJ5wtvIuxk9KxTHaBBbQrl9W02khy-6sdyr8ZXN1lcxGwbenyV6XzqQg)\n\nThe future will not be reported quarterly?! [Fredrik Haga](https://duneanalytics.com/blog/revolution-not-quarterly) (Dune Analytics) on how blockchain data is open, free and real-time.\n\nOne great quality of blockchains is that they democratize access to data. Anyone can view and verify metrics like earnings, transactions, risk and solvency in real-time. Community analysts can build upon each other's work in open-source collaborations.\n\nHowever, if quarterly reporting has led traditional firms (and their [activist investors](https://www.investopedia.com/terms/a/activist-investor.asp)) to excessive short-term orientation, and leaders have advocated decreasing reporting frequency, where will real-time accounting lead us?\n\nHaving a clearer picture on our circumstances should enable us to make better decisions on resource allocation. On what time-frame though?\n\n### Focusing on the long-term matters\n\nWhen looking at for-profit sector data, we see significantly better business metrics in long-term focused firms than their counterparts (see chart below).\n\n![](https://lh4.googleusercontent.com/ZN9kNqv26Ws6592c9uzIj3-dH1ztPPDNpWDAR5ETkH0OqqKTUuB4-HtufnDJZMbCkceGxl6RogUNldorFWFFO9Bn9EP-gm-c9RdKoabAunDeC_gZirUisjb-mojueh_Wc97bw0vM)\n\nPerformance benchmark of long-term oriented firms vs. others - source: [McKinsey](https://www.mckinsey.com/featured-insights/long-term-capitalism/where-companies-with-a-long-term-view-outperform-their-peers#) global institute [analysis](https://hbr.org/2017/02/finally-proof-that-managing-for-the-long-term-pays-off) of McKinsey/S&P Capital IQ data - 615 large and mid-cap US publicly listed companies from 2001 to 2015 - based on patterns of investment, growth, earnings quality, and earnings management (to separate long-term firms from others and to compare their relative performance, after controlling for industry characteristics and company size); 1 indexed to 2001; Market capitalization of long-term firms grew on average by $7B more\n\nBeyond financial metrics, long-term firms added nearly 12k more jobs on average than other firms from 2001 to 2015, thus contributing more to the ecosystems they operate in through financing the livelihoods of people.\n\nAs innovation is one of the strongest drivers of sustainable success, one likely explanation for the outperformance is significantly higher growth in R&D spending (8.5% vs. 3.7% per annum.).\n\nManagement researcher Jim Collins also shows in \"[Built to Last](https://readingraphics.com/book-summary-built-to-last/#:~:text=In%20%E2%80%9CBuilt%20to%20Last%E2%80%9D%2C,can%20be%20built%20to%20last)\" that long-term oriented companies have outperformed their peers in terms of stock performance. He mainly argues that such visionary companies have cult-like cultures and preserve their core that goes beyond making profits (mission/ideology/values), while at the same time stimulating progress and innovation.\n\nFormer McKinsey boss Dominic Barton and Mark Wiseman (CEO of the Canada Pension Plan Investment Board) make the case that mainly pressure from financial markets led to a detrimental focus on short-term performance. They note that avoiding such pressure is one reason why private equity firms buy publicly traded companies to take them private. The result is that investing in private equity rather than comparable public companies yields long-term annual returns that are 1.5%-2% higher. Reversing this detrimental trend in public markets, they [argue](https://hbr.org/2014/01/focusing-capital-on-the-long-term), depends on the leadership of major asset owners and their active involvement in governance.\n\nIf history in the context of traditional companies has shown that optimizing for the long-run creates more wealth, it is likely that the same holds true for cryptonetworks. One could argue that long-term alignment in cryptonetworks is even more important given that they are meant to  outlast their initial founding teams and communities (even though that is also true for \"visionary\" companies as Jim Collins defines them).\n\nHow do we design incentives for optimizing long-term performance in cryptonetworks?\n-----------------------------------------------------------------------------------\n\nCryptonetworks often issue liquid tokens at inception that allow stakeholders to easily on-board and participate in governance. Traditional tech companies on the other hand deliberately remain private for longer.\n\nWhat if the pressures of a liquid market for governance tokens in cryptonetworks are detrimental to long-term success, such as what has been observed with traditional companies? If so, can we leverage programmable illiquidity (lock-ups) to strategically align long-term incentives?\n\nTo analyze this question we need to first examine the typical stakeholder-relationships and control structures in a cryptonetwork.\n\n### Spectrum of stakeholder-relationships in cryptonetworks/DAOs\n\nIn principle, any organizational structure can be implemented on a blockchain so there is a broad spectrum of what is considered a decentralized (autonomous) organization (DO/DAO, see our prev. [post](https://medium.com/greenfield-one/the-state-of-blockchain-governance-governance-by-and-of-blockchains-f6418c46077) and [paper](https://65eocu3ftlpiygeym3g5kply6zy2dtdjyrhbm4m26cb6bt3msyla.arweave.net/90jhU2Wa3owYmGbN1T149nGhzGnEThZxmvCD4M9slhY)).\n\nIn the idealized form of a cryptonetwork or DAO, stakeholder relationships are more akin to peer-to-peer (p2p) networks or a cooperative, i.e. without any particular person, group or entity in control.  (see the right side of the chart below).\n\nUsually, however, there is a founding team that acts as a de-facto executive body driving development. Though, in many cases founding teams will need to access further funding from a project's treasury by token-holder vote, at which point they might need to compete with alternative teams for resources.\n\nOn the other end of the spectrum is the archetypical traditional corporation in which shareholders elect a board which then appoints management to execute the company's strategy.\n\n![](https://lh6.googleusercontent.com/c3OGEPFYYsDs96nOYwdxExYAqyiCsN2Xdlfu_XhJE-S8u6y-bua9jxSR35bBKinfja-RlD5DEp8CZtf_Eppue5q4e0PluMOaFqB9bHgZJeIgBPYTDyjuury5iyQ5G3O9JLV4QAL5)\n\nSimplified stakeholder relationships cryptonetworks / DAOs (with on-chain governance) vs. corporate governance\n\nIdeally, there is a wide distribution of ownership which is one angle of decentralization (often of native governance tokens). Initially, a core group of founders/developers will gather an early community and, over time, more and more stakeholders join to contribute towards the vision of the project. As a network grows and gets more diverse, so should token [ownership](https://blog.curvelabs.eu/ownership-in-cryptonetworks-96f13f4a113e) (see also [progressive decentralization](https://variant.fund/progressive-decentralization-a-playbook-for-building-crypto-applications/)).\n\nIn cryptonetworks and DAOs, ownership and decision making authority is often distributed more widely and roles overlap to a larger extent than in a corporate governance setting. However, unclear separation of roles can in practice lead to conflict and inefficient use of time/resources.\n\nAs a result, when analyzing incentive and governance structures, one needs to account for the fact that community members and token-holders are both governors ([principals](https://www.investopedia.com/terms/p/principal-agent-problem.asp)) as well as the governed (agents). Increasingly we see representation happening and considered advisable (token-holders often delegate their votes to protocol politicians in a flexible fashion), which again introduces classic principal-agent dynamics.\n\nGoing forward, organization designs in the crypto space might move more towards appointing executives in dedicated areas for set time-frames, which would resemble more classic corporate governance structures (with plenty of room for hybrid, as well as newly imagined, forms).\n\nStill one can separate codified decision-making authority and control over reward functions - the principals - on the one hand and the reward functions that govern the actions of agents on the other hand for analysis. The former are represented for example by native governance tokens that define network ownership, while the latter are for example token incentives for contributors or the distribution of earnings for analysis.\n\n### Control through cryptonetwork ownership\n\nTokenized on-chain governance means holders have voting rights. In order to steer a project's or company's governance towards optimizing for long-term success, tokens (ergo, voting power) must be distributed towards long-term-oriented stakeholders.\n\nIt is those who have the strongest attachment to a given system (or [skin in the game](https://medium.com/incerto/what-do-i-mean-by-skin-in-the-game-my-own-version-cc858dc73260)), which are most inclined to responsibly govern it.\n\nStakeholder lock-in is a measure of interest alignment and legitimacy of governance rights (see our [prev. paper](https://medium.com/greenfield-one/the-state-of-blockchain-governance-governance-by-and-of-blockchains-f6418c46077))\n\nA great opportunity with programmable tokens is to design custom vesting structures that model each stakeholders' time horizon of remaining with the protocol.\n\nWe have previously argued that all stakeholders should be represented in governance, which is a difficult, though worthwhile endeavor. One could focus on a broad and balanced distribution of transferable governance tokens amongst stakeholders, or utilize systems that also distribute voting power based on non-transferable reputation scores earned from valuable input to an organization (e.g. labor). Further, non-codified (real-world) reputation can be a strong measure of skin in the game.\n\n\"Community is about ownership --- feeling not just that I am part of something bigger than myself, but that I have some skin in the game. It doesn't matter so much whether that stake is economic or not --- in fact, I think non-economic stake (e.g. reputation) can be a much bigger motivator.\"[  Lane Rettig](https://twitter.com/lrettig/status/1037685148681216000), former Ethereum core dev, currently part of Spacemesh.\n\nAlso, there are many projects where off-chain or informal governance prevails and has significant influence over a system.\n\nThis post further focuses on on-chain governance mechanisms through transferable tokens that represent financial value on secondary markets (financial capital backing a project).\n\nThe mechanisms discussed are however only single pieces in the toolkit among many, which can and will be iterated on (as well as applied in combination). After all, the best mechanisms cannot trump a strong community with cult-like [culture](https://newsletter.banklesshq.com/p/culture-eats-capital-for-breakfast).\n\nSmart contracts allow for measuring and representing long-term commitments\n\nOne can define increases in voting power based on certain measurable commitments in a granularly programmable and easily verifiable fashion (e.g. a lock-up for a certain period of time).\n\n-   Committed long-term capital could have more voting power in order to optimize for long-term goals\n\n-   Profits could be distributed in a higher proportion towards committed long-term capital\n\nLooking towards traditional corporate governance, [tenure](https://a16z.com/2019/08/14/tenure-voting-vs-dual-class-corporate-governance/)  [voting](https://sites.law.berkeley.edu/sustainability-compliance/tenure-based-voting-a-potential-governance-solution-for-corporate-sustainability/) is often [suggested](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2625926) in order to align long-term interests. To a large extent, rigid requirements of traditional large exchanges and regulators concerned about discriminating any class of shareholders over another in the US dominated financial system prevented large-scale adoption (see also [a16z ](https://a16z.com/2019/08/14/tenure-voting-vs-dual-class-corporate-governance/)on that topic).\n\nAs opposed to traditional tenure voting, which is mainly backwards looking in terms of the time a given instrument (such as equity) has been held, crypto protocols specifically utilize forward looking mechanisms. This is a superior fit for optimizing long-term decision-making which by definition is about the future.\n\n### Incentivizing long-term commitment and decision making\n\nOn one hand, distributing control over an organization based on the strength of one's locked capital should (1) attract long-run stakeholders and (2) automatically weight votes based on the strength of long-term alignment.\n\nOn the other hand, the question arises why someone would enter into such a lock-in in the first place, given the opportunity cost associated with giving up their liquidity? Is an increase in voting power reason enough? How should rewards, if any, be structured for stakeholders?\n\nOne interesting approach is to grant additional advantages in the form of boosted token rewards (a multiplier of rewards that are paid to contributors) and to distribute residual profits based on the length of the lock-up. Intuitively this makes sense: Long-term committed capital is more valuable (and on the other side of the coin more costly) than short-term committed capital. In debt markets, there are usually higher yields being paid for longer duration bonds than shorter duration.\n\n#### Token holders as both principal and agent\n\nAs argued previously, stakeholder relationships and roles in DAOs overlap to a larger extent than in traditional firms. One lens through which to view a DAO is as a worker-owned cooperative (see our prev. governance [paper](https://medium.com/greenfield-one/the-state-of-blockchain-governance-governance-by-and-of-blockchains-f6418c46077) or [leadership in cryptonetworks](https://variant.fund/leadership-in-the-ownership-economy/)). Many DAOs operate to a large extent through directly voting on proposals. Token-holders both have the authority of decision-making over the direction of the whole organization (principal), while finding themselves in more executive roles as developers or other contributors (agents). Monitoring functions are performed to a larger degree in a p2p manner, enabled through a high degree of transparency based on the shared ledger and other commons such as forums and openly accessible community chats (Discord).\n\nIn the context of traditional companies, it has been [found](https://alexedmans.com/blog/executive-pay/long-term-executive-incentives-improve-innovation-and-corporate-responsibility/) that long-term executive incentives indeed have led to improved long-term performance (including improved innovation and social responsibility).\n\nViewing token-holders in their role as directly democratic executive decision-makers, one could argue that they need to be compensated with long-term incentives. One such incentive design can be allocating profits based on the length of a capital lock-up. As a result, even if there is compensation flowing to them at present, a certain level of skin in the game is enforced through the mechanism.\n\nArguably, the structures of DAOs will still evolve and become even more multifaceted than today with increasing representation and to some degree specialized executives (be it protocol politicians with delegated votes or novel structures that allow executive power at the edges of an organization).\n\nThus, there is room for specialized forms of incentive designs for individual functions within an organization. To highlight one interesting mechanism, [KPI options](https://medium.com/uma-project/uma-kpi-options-and-airdrop-bae86be16ce4) allocate rewards based on reaching certain performance metrics - be it as a collective or targeted at individual roles.\n\nThis post continues elaborating on some of the challenges with time-lock weighted token voting, while the longer-form [paper](https://ah2j2zw6xx2tcdhlnb6mkv2f6gdnivjzqol2xhkkstken5vxchvq.arweave.net/AfSdZt699TEM62h8xVdF8YbUVTmDl6udSpTURva3Ees) goes into more detail explaining the mechanisms, looking at case studies of Curve, including its relationship with aggregators such as yearn and Sovryn.\n\nChallenges\n----------\n\n### Hedging exposure can create misaligned incentives\n\nIf stakers of a governance token that receive a boost in both voting power and rewards can hedge their exposure through some mechanism, they could achieve increased influence over a protocol, while not being economically aligned to the full extent of their tokens locked.\n\nTwo mechanisms that achieve this are smart-contracts that allow tokens to be made liquid through tokenization (allowing holders to sell their tokenized position), as well as external lending and derivatives markets.\n\nThe challenges mainly arise in a pseudonymous setting, as is often desired in cryptoeconomic systems and communities in order to promote privacy and resilience.  An identity solution that reliably ties a given on-chain address to a specific user would align that person with the organization quite well. Hedging one's exposure can and is in many cases constrained through traditional natural language contracts, however where not possible or desirable, alternative remedies have to be found.\n\n#### Staking with smart contracts can create liquidity and vote delegation\n\nAs exemplified by the yearn [yveCRV](https://docs.yearn.finance/resources/guides/how-to-understand-yvecrv) vaults and alternatives (see the full paper for a deep dive), smart contracts that time-lock tokens can, in turn, make the position liquid by tokenizing it, while allowing different classes of stakeholders (CRV holders & LPs) to share in the rewards that otherwise would need to be earned by stakeholders having both CRV and LP positions. In the case of yearn, [StakeDAO](https://stakedao.org/) as well as [convex.finance](https://www.convexfinance.com/), voting power of individual users that use the mechanism is effectively delegated to the aggregator communities as a whole.\n\nThe effects of the delegation depend on the way governance decisions are taken in those particular communities. The relationships could well be symbiotic, allowing all communities to thrive to a greater extent than each of them individually. Alternatively, a community that amasses excessive governance power in another could exploit their power. This highlights the necessity of whitelisting smart contracts in order to control the ability of token holders to behave in undesired ways.\n\nPotentially, certain smart contracts could be whitelisted with a limit on the total number of tokens to be locked, in order to define the maximum influence an external DAO can have on the governance of the project in question.\n\n#### Lending & derivatives markets\n\nExternal lending and derivatives markets allow holders of locked tokens to hedge their exposure by short-selling the token in question. As opposed to smart contracts that make a given position liquid through tokenization, voters can sell a greater amount than 100% of their value locked, which could potentially open the door for malicious governance attacks. In such a scenario, an actor would lock-up his tokens to gain governance power, while entering into a highly leveraged short position on an external market. If the actor has a governance stake significant enough to influence the outcome of particular proposals, he can maliciously try to decrease the value of the network in question and profit through the highly leveraged position in the opposite direction.\n\nHowever, this is not a problem particular to time-commitment scaled voting. On the contrary, such mechanisms alleviate the attack surface due to the fact that, depending on parameters, a short position would need to be upheld for extended periods of time (potentially on the order of years). The longer the time-frame, the longer the expected cost as well as uncertainty of cost and price-movements of the token in question, which in turn makes exploits both less profitable as well as considerably more risky, which should serve as strong deterrents.\n\nA particular subset of this attack utilizes flash-loans in order to exploit a voting mechanism. In such an attack, tokens are lent out, a governance vote is affected and the loan is paid back in the same block (see e.g. a case in [MakerDAO](https://decrypt.co/46575/group-uses-flash-loan-to-game-maker-protocol-governance)). By scaling voting power based on the time-lock, flash-loans would be made maximally ineffective, as the tokens could not be locked for any time-period in order for them to be paid back within a single block.\n\nBeyond malicious behavior, hedging can enable stakeholders to reap the benefits of increased voting power as well as rewards, while being less economically aligned with the success of the project. As a result, they might place less diligence in their governance actions than they would have otherwise. A factor alleviating this is the incentive to time-lock governance tokens in the first place. If staking rewards are high enough, the supply available on lending markets will be very limited, which makes shorting prohibitively expensive to offset exposure over long periods of time. If synthetic derivatives exist, their pricing will likely also be affected by similar dynamics, as longs will take into account the increased rewards they could earn through participating in the staking mechanism, which in turn makes shorts more expensive (in e.g. [perpetual swap contracts](https://research.paradigm.xyz/cartoon-guide-to-perps)).\n\n### Physically exchanging keys to exit positions & early exit fees\n\nEven if time-locking of tokens is properly governed on-chain to avoid undesired work-arounds (e.g. through a well executed smart contract whitelisting policy), the private keys that control access to voting rights can be exchanged physically in pseudonymous systems that do not require identification of users. As a result, a time-commitment can be transferred from one person to another without any strings attached.\n\nThis opens up the question of whether it is important to reward specific personas or ownership positions irrespective of their ultimate beneficial owner with increased voting power and rewards? How would the behavior of a given voter change based on the possibility to trade private keys in a pseudonymous system?\n\nAs exemplified in the case of [Sovryn](https://wiki.sovryn.app/en/governance/about-sovryn-governance) there is the possibility to withdraw time-committed tokens earlier by paying a penalty fee. It is likely that private keys to a given staked position would also trade at a discount, depending on the length of time they are still locked up for, as they lack the optionality of unlocked tokens. However, buyers of such positions might want to stake them anyways in order to enjoy the benefits, which would lead to a lower discount compared to the penalty fee. If the mechanism employed in a community explicitly employs a penalty fee that is re-distributed to loyal stakers, the social contract of such a community would likely deem such behavior as socially harmful and thus undesirable.\n\nThe behavior change of the voter in governance should depend on the expected discount at which she can dispose of the staked position in the short-to-medium term, similar to how a penalty fee would affect such behavior. If staked tokens can be disposed of relatively cheaply (close to their principal value), there is a relatively stronger incentive to boost voting power to drive short-term oriented outcomes, at the detriment of the long-term, to then exit positions before the long-term plays out. With an on-chain mechanism that explicitly defines penalty fees for early exit, the payoff structures of such behavior can be controlled to some extent, while re-distributing some of the gains of short-term activists to long-term stakeholders.\n\nIn order to avoid the work-around through exchanging private keys of staked positions, such behavior should be made as costly and infeasible as possible. Though, it should already be much more difficult and costly to find a willing counterparty for such a trade, as opposed to regular token markets (due to difficulties in execution, potential counterparty risk and much lower frequency of such trades).\n\nA community could leverage social norms to explicitly deem exiting time-committed positions without complying to the penalty fees of the on-chain mechanism as undesirable and define steep slashing penalties for actors that are found to have engaged in such behavior (through majority governance vote). It remains to be seen, however, to what extent such behavior can be observed. At least though, the threat of slashing would make it much more difficult to find willing counterparties, as openly announcing the willingness to trade one's time-locked tokens could be deemed a slashing condition already, which thus makes it much more costly and infeasible to execute.\n\n### Concentration of token holdings through compounding\n\nHeavily rewarding long-term committed token holders could allow the most dedicated ones to accumulate increasing amounts of the total supply, countering the ideals of decentralized ownership and control. Potential remedies include combining token-weighted voting with other measures of skin in the game such as reputation and allowing motivated contributors to earn themselves a meaningful stake. Another potential remedy is to leverage quadratic voting on the basis of identities so that several individuals with a given stake have a higher weight than a single individual as an equalizing force (though this is still a hard problem to solve in a decentralized fashion).\n\n#### Attracting and maintaining good governors\n\nFinally, the governance outcome of any mechanism heavily depends on the composition of participants. While long-term oriented mechanisms should attract long-term oriented community members, it is not a given that they have the necessary knowledge or skills to responsibly govern a given system.\n\nIn order to be sustainably successful,it is crucial for projects to attract as well as educate the community and team members that are fit for the specific purpose, as well as align them with the organization's core values. As described in the previously mentioned work by [Jim Collins](https://readingraphics.com/book-summary-built-to-last/#:~:text=In%20%E2%80%9CBuilt%20to%20Last%E2%80%9D%2C,can%20be%20built%20to%20last) it is crucial to maintain a cult-like culture that preserves the core of an organization (mission/ideology), while at the same time stimulating progress through ambitious goals, experimentation and continuous improvement. Ideally, members organically grow within the organization/community into roles with increasing responsibility and governance power.\n\nConclusion\n----------\n\nProjects that optimize for the long-term are considerably more successful in the long-run than those that do not. Thus, it is highly desirable to (1) implement governance mechanisms that serve that goal and (2) attract a community of stakeholders that aligns with such goals.\n\nTime-commitment based distribution of governance power as well as rewards can be a powerful mechanism in that regard, due to the following effects:\n\n-   Rewarding long-term oriented over short-term oriented stakeholders should attract the former in the first place, while enticing them to time-commit\n\n-   Long-term alignment due to locked-in governance tokens should make stakeholders consider long-term value creation & accrual in the way they behave and vote\n\n-   Stakeholders that contribute specific types of resources - such as liquidity providers (LPs) who have decided to lock-up tokens in order to enjoy increased rewards - are inclined to make use of those benefits and thus incentivize them to become long-term providers of those resources, which allows for better planning for a given project\n\n-   Dynamic early exit fees can decrease the barrier to lock tokens in the first place and  allow some level of short-term activism while partly re-distributing gains to loyal long-term stakeholders\n\nWhile there are a number of challenges with such mechanisms -  mainly centered around hedging economic alignment as well as applying work-arounds of the on-chain mechanisms -  there are also potential remedies, which have been discussed.\n\nDesign decisions include (but are not limited to):\n\n-   Linear vs. progressive increase in governance power and rewards\n\n-   Types of rewards that are boosted through lock-up (e.g. protocol fee distributions, LP rewards)\n\n-   Minimum and maximum length of the lock-up\n\n-   Early exit fees\n\n-   Whitelisted smart contracts to participate in governance (and policy on how to whitelist)\n\n-   Social norms around slashing for actors that attempt work-arounds\n\nAs the space is still in its nascent stages and the mechanisms are supposed to lead to long-term success, it is too early to judge their effectiveness as of now on an empirical basis. It will be exciting to see further iterations of such approaches and their effectiveness in the wild over time.\n\nIf you are working on similar mechanisms, others that aim at the same goals, or have any feedback I would love to hear from you!\n\n---\n\nMany thanks to Mario Laul, Jack du Rose, Dermot O`Riordan, Pat Rawson, Lito Coen, John Light, Romain Figuereo and Evan Mair as well as my colleagues Jendrik, Georg and Gleb for their valuable feedback and discussions!\n\nDisclosure: This content is for general informational purposes only that expresses our opinion, and it should not be construed as legal, tax, investment, financial, or other advice. Nothing contained here constitutes a solicitation, recommendation, endorsement, or offer by Greenfield One or the author to buy or sell any digital assets or other financial instruments. Greenfield One or the author may hold assets mentioned in the content. All data used is derived from publicly available sources.\n", "timestamp": 1625162373, "digest": "bbsycl6pCNQ4503O8Cqkq7yaI3uJtJ4LhI9zj91-E-M", "contributor": "0xb1676B5Ab63F01F154bb9938F5e8999d9Da5444B"}
{"id": "KwROLX1vhVWGIA4guFeytv4YRQ8gYeuv0GfZWf9cX9o", "title": "Long-term Alignment in Cryptonetworks & DAOs", "body": "By [Felix Machart](https://twitter.com/felix_macht)\n\n## Special focus: Time-lock weighted token voting\n\n*A longer version covering DeFi case studies (Curve & Sovryn) is available [here on Arweave](https://ah2j2zw6xx2tcdhlnb6mkv2f6gdnivjzqol2xhkkstken5vxchvq.arweave.net/AfSdZt699TEM62h8xVdF8YbUVTmDl6udSpTURva3Ees)*\n\nOne of the most difficult problems in any organization is how to balance short-term interests and long-term goals.\n\nBoth are necessary for sustainable success in provisioning goods and services, but in traditional finance (TradFi) as well as decentralized finance (DeFi) capital markets there is a growing trend towards focusing on the short-term. In TradFi, figureheads such as Warren Buffet and Jamie Dimon recognize this problem and are publicly advocating for the elimination of the focus on quarterly earnings reports. In DeFi, [liquidity mining](https://medium.com/bollinger-investment-group/liquidity-mining-a-user-centric-token-distribution-strategy-1d05c5174641) has attracted significant mercenary capital that rapidly moves wherever the highest yields are paid in the short-term.\n\n![](https://lh4.googleusercontent.com/AhfAP6M3MgnHs8MwZ5YB0CqFdaEnV6MWgwroxYf2Wsp__7Dg8bfJjRISTgrQm9VKUWVM0ZyYCe8-DhHYDJ5wtvIuxk9KxTHaBBbQrl9W02khy-6sdyr8ZXN1lcxGwbenyV6XzqQg)\n\nThe future will not be reported quarterly?! [Fredrik Haga](https://duneanalytics.com/blog/revolution-not-quarterly) (Dune Analytics) on how blockchain data is open, free and real-time.\n\nOne great quality of blockchains is that they democratize access to data. Anyone can view and verify metrics like earnings, transactions, risk and solvency in real-time. Community analysts can build upon each other's work in open-source collaborations.\n\nHowever, if quarterly reporting has led traditional firms (and their [activist investors](https://www.investopedia.com/terms/a/activist-investor.asp)) to excessive short-term orientation, and leaders have advocated decreasing reporting frequency, where will real-time accounting lead us?\n\nHaving a clearer picture on our circumstances should enable us to make better decisions on resource allocation. On what time-frame though?\n\n### Focusing on the long-term matters\n\nWhen looking at for-profit sector data, we see significantly better business metrics in long-term focused firms than their counterparts (see chart below).\n\n![](https://lh4.googleusercontent.com/ZN9kNqv26Ws6592c9uzIj3-dH1ztPPDNpWDAR5ETkH0OqqKTUuB4-HtufnDJZMbCkceGxl6RogUNldorFWFFO9Bn9EP-gm-c9RdKoabAunDeC_gZirUisjb-mojueh_Wc97bw0vM)\n\nPerformance benchmark of long-term oriented firms vs. others - source: [McKinsey](https://www.mckinsey.com/featured-insights/long-term-capitalism/where-companies-with-a-long-term-view-outperform-their-peers#) global institute [analysis](https://hbr.org/2017/02/finally-proof-that-managing-for-the-long-term-pays-off) of McKinsey/S&P Capital IQ data - 615 large and mid-cap US publicly listed companies from 2001 to 2015 - based on patterns of investment, growth, earnings quality, and earnings management (to separate long-term firms from others and to compare their relative performance, after controlling for industry characteristics and company size); 1 indexed to 2001; Market capitalization of long-term firms grew on average by $7B more\n\nBeyond financial metrics, long-term firms added nearly 12k more jobs on average than other firms from 2001 to 2015, thus contributing more to the ecosystems they operate in through financing the livelihoods of people.\n\nAs innovation is one of the strongest drivers of sustainable success, one likely explanation for the outperformance is significantly higher growth in R&D spending (8.5% vs. 3.7% per annum.).\n\nManagement researcher Jim Collins also shows in \"[Built to Last](https://readingraphics.com/book-summary-built-to-last/#:~:text=In%20%E2%80%9CBuilt%20to%20Last%E2%80%9D%2C,can%20be%20built%20to%20last)\" that long-term oriented companies have outperformed their peers in terms of stock performance. He mainly argues that such visionary companies have cult-like cultures and preserve their core that goes beyond making profits (mission/ideology/values), while at the same time stimulating progress and innovation.\n\nFormer McKinsey boss Dominic Barton and Mark Wiseman (CEO of the Canada Pension Plan Investment Board) make the case that mainly pressure from financial markets led to a detrimental focus on short-term performance. They note that avoiding such pressure is one reason why private equity firms buy publicly traded companies to take them private. The result is that investing in private equity rather than comparable public companies yields long-term annual returns that are 1.5%-2% higher. Reversing this detrimental trend in public markets, they [argue](https://hbr.org/2014/01/focusing-capital-on-the-long-term), depends on the leadership of major asset owners and their active involvement in governance.\n\nIf history in the context of traditional companies has shown that optimizing for the long-run creates more wealth, it is likely that the same holds true for cryptonetworks. One could argue that long-term alignment in cryptonetworks is even more important given that they are meant to  outlast their initial founding teams and communities (even though that is also true for \"visionary\" companies as Jim Collins defines them).\n\nHow do we design incentives for optimizing long-term performance in cryptonetworks?\n-----------------------------------------------------------------------------------\n\nCryptonetworks often issue liquid tokens at inception that allow stakeholders to easily on-board and participate in governance. Traditional tech companies on the other hand deliberately remain private for longer.\n\nWhat if the pressures of a liquid market for governance tokens in cryptonetworks are detrimental to long-term success, such as what has been observed with traditional companies? If so, can we leverage programmable illiquidity (lock-ups) to strategically align long-term incentives?\n\nTo analyze this question we need to first examine the typical stakeholder-relationships and control structures in a cryptonetwork.\n\n### Spectrum of stakeholder-relationships in cryptonetworks/DAOs\n\nIn principle, any organizational structure can be implemented on a blockchain so there is a broad spectrum of what is considered a decentralized (autonomous) organization (DO/DAO, see our prev. [post](https://medium.com/greenfield-one/the-state-of-blockchain-governance-governance-by-and-of-blockchains-f6418c46077) and [paper](https://65eocu3ftlpiygeym3g5kply6zy2dtdjyrhbm4m26cb6bt3msyla.arweave.net/90jhU2Wa3owYmGbN1T149nGhzGnEThZxmvCD4M9slhY)).\n\nIn the idealized form of a cryptonetwork or DAO, stakeholder relationships are more akin to peer-to-peer (p2p) networks or a cooperative, i.e. without any particular person, group or entity in control.  (see the right side of the chart below).\n\nUsually, however, there is a founding team that acts as a de-facto executive body driving development. Though, in many cases founding teams will need to access further funding from a project's treasury by token-holder vote, at which point they might need to compete with alternative teams for resources.\n\nOn the other end of the spectrum is the archetypical traditional corporation in which shareholders elect a board which then appoints management to execute the company's strategy.\n\n![](https://lh6.googleusercontent.com/c3OGEPFYYsDs96nOYwdxExYAqyiCsN2Xdlfu_XhJE-S8u6y-bua9jxSR35bBKinfja-RlD5DEp8CZtf_Eppue5q4e0PluMOaFqB9bHgZJeIgBPYTDyjuury5iyQ5G3O9JLV4QAL5)\n\nSimplified stakeholder relationships cryptonetworks / DAOs (with on-chain governance) vs. corporate governance\n\nIdeally, there is a wide distribution of ownership which is one angle of decentralization (often of native governance tokens). Initially, a core group of founders/developers will gather an early community and, over time, more and more stakeholders join to contribute towards the vision of the project. As a network grows and gets more diverse, so should token [ownership](https://blog.curvelabs.eu/ownership-in-cryptonetworks-96f13f4a113e) (see also [progressive decentralization](https://variant.fund/progressive-decentralization-a-playbook-for-building-crypto-applications/)).\n\nIn cryptonetworks and DAOs, ownership and decision making authority is often distributed more widely and roles overlap to a larger extent than in a corporate governance setting. However, unclear separation of roles can in practice lead to conflict and inefficient use of time/resources.\n\nAs a result, when analyzing incentive and governance structures, one needs to account for the fact that community members and token-holders are both governors ([principals](https://www.investopedia.com/terms/p/principal-agent-problem.asp)) as well as the governed (agents). Increasingly we see representation happening and considered advisable (token-holders often delegate their votes to protocol politicians in a flexible fashion), which again introduces classic principal-agent dynamics.\n\nGoing forward, organization designs in the crypto space might move more towards appointing executives in dedicated areas for set time-frames, which would resemble more classic corporate governance structures (with plenty of room for hybrid, as well as newly imagined, forms).\n\nStill one can separate codified decision-making authority and control over reward functions - the principals - on the one hand and the reward functions that govern the actions of agents on the other hand for analysis. The former are represented for example by native governance tokens that define network ownership, while the latter are for example token incentives for contributors or the distribution of earnings for analysis.\n\n### Control through cryptonetwork ownership\n\nTokenized on-chain governance means holders have voting rights. In order to steer a project's or company's governance towards optimizing for long-term success, tokens (ergo, voting power) must be distributed towards long-term-oriented stakeholders.\n\nIt is those who have the strongest attachment to a given system (or [skin in the game](https://medium.com/incerto/what-do-i-mean-by-skin-in-the-game-my-own-version-cc858dc73260)), which are most inclined to responsibly govern it.\n\nStakeholder lock-in is a measure of interest alignment and legitimacy of governance rights (see our [prev. paper](https://medium.com/greenfield-one/the-state-of-blockchain-governance-governance-by-and-of-blockchains-f6418c46077))\n\nA great opportunity with programmable tokens is to design custom vesting structures that model each stakeholders' time horizon of remaining with the protocol.\n\nWe have previously argued that all stakeholders should be represented in governance, which is a difficult, though worthwhile endeavor. One could focus on a broad and balanced distribution of transferable governance tokens amongst stakeholders, or utilize systems that also distribute voting power based on non-transferable reputation scores earned from valuable input to an organization (e.g. labor). Further, non-codified (real-world) reputation can be a strong measure of skin in the game.\n\n\"Community is about ownership --- feeling not just that I am part of something bigger than myself, but that I have some skin in the game. It doesn't matter so much whether that stake is economic or not --- in fact, I think non-economic stake (e.g. reputation) can be a much bigger motivator.\"[  Lane Rettig](https://twitter.com/lrettig/status/1037685148681216000), former Ethereum core dev, currently part of Spacemesh.\n\nAlso, there are many projects where off-chain or informal governance prevails and has significant influence over a system.\n\nThis post further focuses on on-chain governance mechanisms through transferable tokens that represent financial value on secondary markets (financial capital backing a project).\n\nThe mechanisms discussed are however only single pieces in the toolkit among many, which can and will be iterated on (as well as applied in combination). After all, the best mechanisms cannot trump a strong community with cult-like [culture](https://newsletter.banklesshq.com/p/culture-eats-capital-for-breakfast).\n\nSmart contracts allow for measuring and representing long-term commitments\n\nOne can define increases in voting power based on certain measurable commitments in a granularly programmable and easily verifiable fashion (e.g. a lock-up for a certain period of time).\n\n-   Committed long-term capital could have more voting power in order to optimize for long-term goals\n\n-   Profits could be distributed in a higher proportion towards committed long-term capital\n\nLooking towards traditional corporate governance, [tenure](https://a16z.com/2019/08/14/tenure-voting-vs-dual-class-corporate-governance/)  [voting](https://sites.law.berkeley.edu/sustainability-compliance/tenure-based-voting-a-potential-governance-solution-for-corporate-sustainability/) is often [suggested](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2625926) in order to align long-term interests. To a large extent, rigid requirements of traditional large exchanges and regulators concerned about discriminating any class of shareholders over another in the US dominated financial system prevented large-scale adoption (see also [a16z ](https://a16z.com/2019/08/14/tenure-voting-vs-dual-class-corporate-governance/)on that topic).\n\nAs opposed to traditional tenure voting, which is mainly backwards looking in terms of the time a given instrument (such as equity) has been held, crypto protocols specifically utilize forward looking mechanisms. This is a superior fit for optimizing long-term decision-making which by definition is about the future.\n\n### Incentivizing long-term commitment and decision making\n\nOn one hand, distributing control over an organization based on the strength of one's locked capital should (1) attract long-run stakeholders and (2) automatically weight votes based on the strength of long-term alignment.\n\nOn the other hand, the question arises why someone would enter into such a lock-in in the first place, given the opportunity cost associated with giving up their liquidity? Is an increase in voting power reason enough? How should rewards, if any, be structured for stakeholders?\n\nOne interesting approach is to grant additional advantages in the form of boosted token rewards (a multiplier of rewards that are paid to contributors) and to distribute residual profits based on the length of the lock-up. Intuitively this makes sense: Long-term committed capital is more valuable (and on the other side of the coin more costly) than short-term committed capital. In debt markets, there are usually higher yields being paid for longer duration bonds than shorter duration.\n\n#### Token holders as both principal and agent\n\nAs argued previously, stakeholder relationships and roles in DAOs overlap to a larger extent than in traditional firms. One lens through which to view a DAO is as a worker-owned cooperative (see our prev. governance [paper](https://medium.com/greenfield-one/the-state-of-blockchain-governance-governance-by-and-of-blockchains-f6418c46077) or [leadership in cryptonetworks](https://variant.fund/leadership-in-the-ownership-economy/)). Many DAOs operate to a large extent through directly voting on proposals. Token-holders both have the authority of decision-making over the direction of the whole organization (principal), while finding themselves in more executive roles as developers or other contributors (agents). Monitoring functions are performed to a larger degree in a p2p manner, enabled through a high degree of transparency based on the shared ledger and other commons such as forums and openly accessible community chats (Discord).\n\nIn the context of traditional companies, it has been [found](https://alexedmans.com/blog/executive-pay/long-term-executive-incentives-improve-innovation-and-corporate-responsibility/) that long-term executive incentives indeed have led to improved long-term performance (including improved innovation and social responsibility).\n\nViewing token-holders in their role as directly democratic executive decision-makers, one could argue that they need to be compensated with long-term incentives. One such incentive design can be allocating profits based on the length of a capital lock-up. As a result, even if there is compensation flowing to them at present, a certain level of skin in the game is enforced through the mechanism.\n\nArguably, the structures of DAOs will still evolve and become even more multifaceted than today with increasing representation and to some degree specialized executives (be it protocol politicians with delegated votes or novel structures that allow executive power at the edges of an organization).\n\nThus, there is room for specialized forms of incentive designs for individual functions within an organization. To highlight one interesting mechanism, [KPI options](https://medium.com/uma-project/uma-kpi-options-and-airdrop-bae86be16ce4) allocate rewards based on reaching certain performance metrics - be it as a collective or targeted at individual roles.\n\nThis post continues elaborating on some of the challenges with time-lock weighted token voting, while the longer-form [paper](https://ah2j2zw6xx2tcdhlnb6mkv2f6gdnivjzqol2xhkkstken5vxchvq.arweave.net/AfSdZt699TEM62h8xVdF8YbUVTmDl6udSpTURva3Ees) goes into more detail explaining the mechanisms, looking at case studies of Curve, including its relationship with aggregators such as yearn and Sovryn.\n\nChallenges\n----------\n\n### Hedging exposure can create misaligned incentives\n\nIf stakers of a governance token that receive a boost in both voting power and rewards can hedge their exposure through some mechanism, they could achieve increased influence over a protocol, while not being economically aligned to the full extent of their tokens locked.\n\nTwo mechanisms that achieve this are smart-contracts that allow tokens to be made liquid through tokenization (allowing holders to sell their tokenized position), as well as external lending and derivatives markets.\n\nThe challenges mainly arise in a pseudonymous setting, as is often desired in cryptoeconomic systems and communities in order to promote privacy and resilience.  An identity solution that reliably ties a given on-chain address to a specific user would align that person with the organization quite well. Hedging one's exposure can and is in many cases constrained through traditional natural language contracts, however where not possible or desirable, alternative remedies have to be found.\n\n#### Staking with smart contracts can create liquidity and vote delegation\n\nAs exemplified by the yearn [yveCRV](https://docs.yearn.finance/resources/guides/how-to-understand-yvecrv) vaults and alternatives (see the full paper for a deep dive), smart contracts that time-lock tokens can, in turn, make the position liquid by tokenizing it, while allowing different classes of stakeholders (CRV holders & LPs) to share in the rewards that otherwise would need to be earned by stakeholders having both CRV and LP positions. In the case of yearn, [StakeDAO](https://stakedao.org/) as well as [convex.finance](https://www.convexfinance.com/), voting power of individual users that use the mechanism is effectively delegated to the aggregator communities as a whole.\n\nThe effects of the delegation depend on the way governance decisions are taken in those particular communities. The relationships could well be symbiotic, allowing all communities to thrive to a greater extent than each of them individually. Alternatively, a community that amasses excessive governance power in another could exploit their power. This highlights the necessity of whitelisting smart contracts in order to control the ability of token holders to behave in undesired ways.\n\nPotentially, certain smart contracts could be whitelisted with a limit on the total number of tokens to be locked, in order to define the maximum influence an external DAO can have on the governance of the project in question.\n\n#### Lending & derivatives markets\n\nExternal lending and derivatives markets allow holders of locked tokens to hedge their exposure by short-selling the token in question. As opposed to smart contracts that make a given position liquid through tokenization, voters can sell a greater amount than 100% of their value locked, which could potentially open the door for malicious governance attacks. In such a scenario, an actor would lock-up his tokens to gain governance power, while entering into a highly leveraged short position on an external market. If the actor has a governance stake significant enough to influence the outcome of particular proposals, he can maliciously try to decrease the value of the network in question and profit through the highly leveraged position in the opposite direction.\n\nHowever, this is not a problem particular to time-commitment scaled voting. On the contrary, such mechanisms alleviate the attack surface due to the fact that, depending on parameters, a short position would need to be upheld for extended periods of time (potentially on the order of years). The longer the time-frame, the longer the expected cost as well as uncertainty of cost and price-movements of the token in question, which in turn makes exploits both less profitable as well as considerably more risky, which should serve as strong deterrents.\n\nA particular subset of this attack utilizes flash-loans in order to exploit a voting mechanism. In such an attack, tokens are lent out, a governance vote is affected and the loan is paid back in the same block (see e.g. a case in [MakerDAO](https://decrypt.co/46575/group-uses-flash-loan-to-game-maker-protocol-governance)). By scaling voting power based on the time-lock, flash-loans would be made maximally ineffective, as the tokens could not be locked for any time-period in order for them to be paid back within a single block.\n\nBeyond malicious behavior, hedging can enable stakeholders to reap the benefits of increased voting power as well as rewards, while being less economically aligned with the success of the project. As a result, they might place less diligence in their governance actions than they would have otherwise. A factor alleviating this is the incentive to time-lock governance tokens in the first place. If staking rewards are high enough, the supply available on lending markets will be very limited, which makes shorting prohibitively expensive to offset exposure over long periods of time. If synthetic derivatives exist, their pricing will likely also be affected by similar dynamics, as longs will take into account the increased rewards they could earn through participating in the staking mechanism, which in turn makes shorts more expensive (in e.g. [perpetual swap contracts](https://research.paradigm.xyz/cartoon-guide-to-perps)).\n\n### Physically exchanging keys to exit positions & early exit fees\n\nEven if time-locking of tokens is properly governed on-chain to avoid undesired work-arounds (e.g. through a well executed smart contract whitelisting policy), the private keys that control access to voting rights can be exchanged physically in pseudonymous systems that do not require identification of users. As a result, a time-commitment can be transferred from one person to another without any strings attached.\n\nThis opens up the question of whether it is important to reward specific personas or ownership positions irrespective of their ultimate beneficial owner with increased voting power and rewards? How would the behavior of a given voter change based on the possibility to trade private keys in a pseudonymous system?\n\nAs exemplified in the case of [Sovryn](https://wiki.sovryn.app/en/governance/about-sovryn-governance) there is the possibility to withdraw time-committed tokens earlier by paying a penalty fee. It is likely that private keys to a given staked position would also trade at a discount, depending on the length of time they are still locked up for, as they lack the optionality of unlocked tokens. However, buyers of such positions might want to stake them anyways in order to enjoy the benefits, which would lead to a lower discount compared to the penalty fee. If the mechanism employed in a community explicitly employs a penalty fee that is re-distributed to loyal stakers, the social contract of such a community would likely deem such behavior as socially harmful and thus undesirable.\n\nThe behavior change of the voter in governance should depend on the expected discount at which she can dispose of the staked position in the short-to-medium term, similar to how a penalty fee would affect such behavior. If staked tokens can be disposed of relatively cheaply (close to their principal value), there is a relatively stronger incentive to boost voting power to drive short-term oriented outcomes, at the detriment of the long-term, to then exit positions before the long-term plays out. With an on-chain mechanism that explicitly defines penalty fees for early exit, the payoff structures of such behavior can be controlled to some extent, while re-distributing some of the gains of short-term activists to long-term stakeholders.\n\nIn order to avoid the work-around through exchanging private keys of staked positions, such behavior should be made as costly and infeasible as possible. Though, it should already be much more difficult and costly to find a willing counterparty for such a trade, as opposed to regular token markets (due to difficulties in execution, potential counterparty risk and much lower frequency of such trades).\n\nA community could leverage social norms to explicitly deem exiting time-committed positions without complying to the penalty fees of the on-chain mechanism as undesirable and define steep slashing penalties for actors that are found to have engaged in such behavior (through majority governance vote). It remains to be seen, however, to what extent such behavior can be observed. At least though, the threat of slashing would make it much more difficult to find willing counterparties, as openly announcing the willingness to trade one's time-locked tokens could be deemed a slashing condition already, which thus makes it much more costly and infeasible to execute.\n\n### Concentration of token holdings through compounding\n\nHeavily rewarding long-term committed token holders could allow the most dedicated ones to accumulate increasing amounts of the total supply, countering the ideals of decentralized ownership and control. Potential remedies include combining token-weighted voting with other measures of skin in the game such as reputation and allowing motivated contributors to earn themselves a meaningful stake. Another potential remedy is to leverage quadratic voting on the basis of identities so that several individuals with a given stake have a higher weight than a single individual as an equalizing force (though this is still a hard problem to solve in a decentralized fashion).\n\n#### Attracting and maintaining good governors\n\nFinally, the governance outcome of any mechanism heavily depends on the composition of participants. While long-term oriented mechanisms should attract long-term oriented community members, it is not a given that they have the necessary knowledge or skills to responsibly govern a given system.\n\nIn order to be sustainably successful,it is crucial for projects to attract as well as educate the community and team members that are fit for the specific purpose, as well as align them with the organization's core values. As described in the previously mentioned work by [Jim Collins](https://readingraphics.com/book-summary-built-to-last/#:~:text=In%20%E2%80%9CBuilt%20to%20Last%E2%80%9D%2C,can%20be%20built%20to%20last) it is crucial to maintain a cult-like culture that preserves the core of an organization (mission/ideology), while at the same time stimulating progress through ambitious goals, experimentation and continuous improvement. Ideally, members organically grow within the organization/community into roles with increasing responsibility and governance power.\n\nConclusion\n----------\n\nProjects that optimize for the long-term are considerably more successful in the long-run than those that do not. Thus, it is highly desirable to (1) implement governance mechanisms that serve that goal and (2) attract a community of stakeholders that aligns with such goals.\n\nTime-commitment based distribution of governance power as well as rewards can be a powerful mechanism in that regard, due to the following effects:\n\n-   Rewarding long-term oriented over short-term oriented stakeholders should attract the former in the first place, while enticing them to time-commit\n\n-   Long-term alignment due to locked-in governance tokens should make stakeholders consider long-term value creation & accrual in the way they behave and vote\n\n-   Stakeholders that contribute specific types of resources - such as liquidity providers (LPs) who have decided to lock-up tokens in order to enjoy increased rewards - are inclined to make use of those benefits and thus incentivize them to become long-term providers of those resources, which allows for better planning for a given project\n\n-   Dynamic early exit fees can decrease the barrier to lock tokens in the first place and  allow some level of short-term activism while partly re-distributing gains to loyal long-term stakeholders\n\nWhile there are a number of challenges with such mechanisms -  mainly centered around hedging economic alignment as well as applying work-arounds of the on-chain mechanisms -  there are also potential remedies, which have been discussed.\n\nDesign decisions include (but are not limited to):\n\n-   Linear vs. progressive increase in governance power and rewards\n\n-   Types of rewards that are boosted through lock-up (e.g. protocol fee distributions, LP rewards)\n\n-   Minimum and maximum length of the lock-up\n\n-   Early exit fees\n\n-   Whitelisted smart contracts to participate in governance (and policy on how to whitelist)\n\n-   Social norms around slashing for actors that attempt work-arounds\n\nAs the space is still in its nascent stages and the mechanisms are supposed to lead to long-term success, it is too early to judge their effectiveness as of now on an empirical basis. It will be exciting to see further iterations of such approaches and their effectiveness in the wild over time.\n\nIf you are working on similar mechanisms, others that aim at the same goals, or have any feedback I would love to hear from you!\n\n---\n\nMany thanks to Mario Laul, Jack du Rose, Dermot O`Riordan, Pat Rawson, Lito Coen, John Light, Romain Figuereo and Evan Mair as well as my colleagues Jendrik, Georg and Gleb for their valuable feedback and discussions!\n\nDisclosure: This content is for general informational purposes only that expresses our opinion, and it should not be construed as legal, tax, investment, financial, or other advice. Nothing contained here constitutes a solicitation, recommendation, endorsement, or offer by Greenfield One or the author to buy or sell any digital assets or other financial instruments. Greenfield One or the author may hold assets mentioned in the content. All data used is derived from publicly available sources.\n", "timestamp": 1625163010, "digest": "bbsycl6pCNQ4503O8Cqkq7yaI3uJtJ4LhI9zj91-E-M", "contributor": "0xb1676B5Ab63F01F154bb9938F5e8999d9Da5444B"}
{"id": "wCdl25R4EISrlMRnLBaQlBvaBiTfuyWDsFu3waOmPq4", "title": "Test Attributes", "body": "test", "timestamp": 1625168741, "digest": "cuSNAJCOfhmOFAOTcO6kf419Q8-VZMXzs6ElDiETDak", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "LHTD15yjqLxNs-LtPT4ISkeQ-VdYqNW_kNKVmWs6h4M", "title": "Test Attributes v2", "body": "test", "timestamp": 1625169145, "digest": "2JoQdkmGlZAZVPSnN2ei0zcuOL5W0t9zZCe4FgV6uP8", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "MvSIpXECPqq0UqYvOrqwNf2OnahGql1cnUCKwbd_PaQ", "title": "DAO Landscape", "body": "DAOs have taken center stage.\n\nEver since 14% of the entire ETH supply was locked in [The DAO](https://en.wikipedia.org/wiki/The_DAO_(organization)) in early 2016, we’ve spent the last five years distilling what it means to coordinate digital working groups.\n\n**DAOs are internet communities with a shared cap table and bank account.**\n\nMembers work together to create, distribute and capture value relative to a shared mission. Ownership shares economic, social and political components, creating best practices for digital coordination.\n\nIn this post, we’ll break down the DAO landscape and examine the relationship between financial and social capital.\n\n![DAO Landscape Cover](https://images.mirror-media.xyz/publication-images/ed6f1c94-5204-4eca-95d4-804f189f3ed3.jpeg?height=1440&width=2560)\n\n*The DAOs mentioned in this post are non-comprehensive. I definitely missed some. If your DAO wasn’t mentioned, you probably missed [this tweet.](https://twitter.com/Cooopahtroopa/status/1407458878246121475?s=20*)*\n\n## What is a DAO?\n\nA DAO is a commitment to share value with a community.\n\nDAOs seek to:\n\n- Provide members with a voice through governance.\n- Flatten hierarchy and create fluid workstreams.\n- Allocate resources to achieve a core mission.\n\nA Telegram group with 10 members and 1 ETH is a DAO.\n\nA DeFi protocol with $1B+ of assets governed on-chain by 10,000+ token holders is a DAO.\n\n**Regardless of size, DAOs look to solve core missions - evolving a group chat into a success-driven community.**\n\n## DAO Landscape\n\nToday, there are more than 100 DAOs managing over $10B in assets.\n\n![DAO Landscape 2021](https://images.mirror-media.xyz/publication-images/5d496d8a-8119-4a79-ad40-fe6a754903b5.jpeg?height=2880&width=5120)\n\n### DAO Operating Systems\n\nThe first chapter of DAOs are the operating systems used to create them.\n\nThese projects offer different templates, frameworks and tools for communities to pool resources and start their first DAO.\n\nThey commonly offer smart contracts and interfaces to facilitate on-chain actions for decentralized communities.\n\n**DAO Operating Systems make it easy for anyone to start a DAO with limited technical skills.**\n\n### Grants DAOs\n\nThe first real use case for DAOs were grants.\n\nCommunities donate funds and use a DAO to vote on how that capital is allocated to various contributors in the form of governance proposals.\n\nGovernance of Grants DAOs was originally conducted through non-transferable shares, meaning participation was largely motivated by social capital over financial returns.\n\n**Grants DAOs show that niche communities are [more nimble](https://molochdao.medium.com/moloch-2019-year-in-review-eb6f53dc035) in capital allocation than formal bodies.** \n\n### Protocol DAOs\n\nProtocol DAOs transition power from a core team into the hands of the community, spawning a new way for projects to issue fungible tokens into the market.\n\nWhereas the first chapter of DAOs featured non-transferable shares, Protocol DAOs were the first to issue transferable ERC20 tokens with a secondary market value.\n\nThese tokens are commonly used to govern protocols, meaning tokenholders have the sole authority to propose, vote on and implement changes to the underlying mechanics of the network.\n\nProjects commonly vote on how to distribute tokens, thus opening the doors to liquidity mining, yield farming, fair launches and everything in between.\n\n**Protocol DAOs provided a framework for any network to issue a token that was (hopefully) owned and operated by its community.**\n\n### Investment DAOs\n\nWith Protocol DAOs bringing new tokens into the world, it only seemed logical that groups band together to invest in them.\n\nAfter a long period of non-profit DAOs, investment clubs flipped the switch for members to focus on generating a return.\n\nWhile these DAOs come with a lot more legal restrictions than a Grants DAO, they showed that any group of individuals could come together to invest larger amounts of capital with low barriers to entry.\n\n**Investment DAOs allow members to pool capital and invest in projects at their earliest stages.**\n\n### Service DAOs\n\nWith so many tokens coming into the world, projects need talent. Service DAOs are talent allocators, using on-chain credentials to funnel and allocate resources from one DAO to another.\n\nService DAOs create decentralized working groups for individuals to work for the open internet - essentially acting as crypto-native talent agencies.\n\nFrom legal to creative, governance to marketing, development to treasury management, Service DAOs create funnels to contract web3 mercenaries. Work is often rewarded with ERC20 tokens - providing ownership over the value created for a network.\n\n**Service DAOs explore the future of work, and what employment looks like in crypto-native world.**\n\n### Social DAOs\n\nWhat does it mean to be a member of a DAO?\n\nIn an industry dominated by speculation, Social DAOs focus on social capital over financial capital. Social DAOs are the natural evolution of group chats, where friends become co-workers. \n\nWhere social media turned everybody into a media company, Social DAOs turn every group chat into a digital business.\n\nThey challenge what it means to be a part of a community and offer ways to lean into becoming a part of a digitally-native tribe.\n\n**Social DAOs show that there is more to crypto than making a quick buck, and that the internet is the best place to meet people with similar interests.**\n\n### Collector DAOs\n\nNFTs. You’ve heard of them - and for a while, you couldn’t ignore them.\n\nOn the back of mainstream adoption, Collector DAOs popped up to collect them.\n\nCurator groups act as the underlying glue behind a specific artist, platform or series to help establish longevity.\n\n**Collector DAOs seek to curate which NFTs have long-term value.**\n\n### Media DAOs\n\nIn an age when information is globally accessible, ownership of the narratives through which they are distributed should be, too.\n\nMedia DAOs give that power back to those who consume the content. \n\nThey break down the way in which writers, streamers, and readers engage with the content they release. Whether it be media mining programs to incentivize contributions or governance over which topics make the front page, Media DAOs turn consumption into a two-way street.\n\n**Media DAOs share an outlet’s open agenda to spread awareness and news.**\n\n## DAO Tools\n\nAcross the board, a suite of tools are acting as the defacto standard for most DAOs today.\n\n*[Gnosis Safe](https://gnosis-safe.io/)* - Multisig wallets commonly used to manage community treasuries.\n\n*[Snapshot](https://snapshot.org/#/)* - Off-chain voting platform for easy token-based governance.\n\n*[Discourse](https://www.discourse.org/)* - Forum commonly used to discuss governance proposals.\n\n*[CollabLand](https://collab.land/)* - Bots providing token-gated access and tipping to community chat groups.\n\n*[Coordinape](https://coordinape.com/)* - Coordination game to determine which contributors(s) deserve token rewards.\n\n*[Parcel](https://parcel.money/)* - Treasury management to easily track and send payments.\n\n*[SoureCred](https://sourcecred.io/)* - Instance to track community participation and reward active members.\n\n*[Mirror](https://mirror.xyz/race)* - Finance creative projects through tokenized crowdfunds.\n\n*[Tally](https://www.withtally.com/)* - Governance dashboard to track on-chain voting history across different protocols.\n\n*[Boardroom](https://app.boardroom.info/)* - Governance hub for tokenholder management to empower key decision making.\n\n*[Sybil](https://sybil.org/#/)* - Create and track on-chain governance delegation.\n\n*[RabbitHole](https://rabbithole.gg/)* - Reward tokens for completing specific on-chain tasks.\n\nTogether, this stack allows anyone to spin up a treasury, introduce governance, reward key contributions and engage communities in ongoing discussions.\n\nNot bad!\n\n## How DAOs Evolve\n\nDAOs live on a spectrum.\n\n![](https://images.mirror-media.xyz/publication-images/73d3af5f-c315-420f-b2e5-d6dddbe47ecc.jpeg?height=2880&width=5120)\n\nThe lightest DAOs are social-first with off-chain governance. The goal is to create active discussion and communal belonging - more than to generate a profit.\n\nThe heaviest DAOs have tremendous amounts of capital at stake, requiring on-chain governance to execute and ratify proposals.\n\nWhat we’re currently witnessing is a shift from very heavy protocols to extremely light micro-economies.\n\nhttps://twitter.com/Cooopahtroopa/status/1392975646108778498\n\nCommunities are creating social DAOs in real-time, rather than being restricted to on-chain structures to get started.\n\nFor the heavier DAOs, on-chain proposals are creating and empowering lighter, off-chain working groups. This is best highlighted by the recent growth around Grants DAOs, allowing trusted community members to move faster with funds, rather than having to meet quorum to execute simple payments.\n\n[](https://twitter.com/uniswapgrants/status/1407429123664928772?s=20)\n\nAs DAOs gain momentum, it’s common to see [Treasury Diversification proposals](https://research.lido.fi/t/proposal-ldo-treasury-diversification-part-2/506). These events allow the wider community to contribute directly to a DAO treasury in exchange for its native token(s).\n\nThis shift signals that fundraising can apply to a community-wide treasury, rather than being managed solely by a core team.\n\nOnce runway is secured, DAOs need to figure out how to put it to work. The evolution of working groups and subcommittees is one I’m deeply fascinated by, and something we’re watching play out in real-time.\n\n[](https://twitter.com/alexxzzhang/status/1404536836274393090?s=20)\n\n## DAO Mercenaries\n\nDAOs mature on the back of community-driven services and governance.\n\nAs treasuries grow in size and communities grow in quality, core contributions become more and more important to keep the ball rolling.\n\nThrough [Fire Eyes DAO](https://www.fireeyes.xyz/), I’ve been lucky enough to pass on-chain proposals on protocols like Aave, Balancer, Rocket Pool and Gitcoin.\n\nGovernance will become increasingly more important, and feature a much wider design diamond of possibilities. With this, so will the number of teams working to put capital to work through on-chain proposals.\n\nFrom grants to payroll, token swaps to M&A - expect the next wave of mercenaries to show why web3 governance is a complete paradigm shift. (more on this topic to come in my next post).\n\nVery soon, we could see a world where **DAOs are the new LLCs.**\n\nIt feels inevitable that tokens will eventually replace equity, and with it - so will the legacy legal structures that underpin them.\n\n## Just DAO It\n\nThis post was published in June, 2021.\n\nBelow is a growing list of resources to keep up with DAOs, their growth and the key people to watch. This list will be updated periodically, so please DM me with anything worth adding to the list!\n\n[Julia Lipton] - [Open Source DAO Market Research](https://docs.google.com/spreadsheets/d/16IDgIyPcfwJGG-zmXeMAenYbePQVHkc2P6WCwKEZgpk/edit#gid=0)\n[pet3rpan] - [How to Grow Decentralized Communities](https://medium.com/1kxnetwork/how-to-grow-decentralized-communities-1bf1044924f8)\n[Linda Xie] - [A Beginner’s Guide to DAOs](https://linda.mirror.xyz/Vh8K4leCGEO06_qSGx-vS5lvgUqhqkCz9ut81WwCP2o)\n[Kinjal Shah] - [DAOs & Creators - Resources to Get Started Today](https://kinjal.mirror.xyz/eD3-Sgv2h50j-kwjHQCOnwqMKqSLTfnrqrtNypU-P5k)\n[Cooper Turley] - [How to Launch a Token](https://forefront.news/blog/how-to-launch-a-token)\n[Bankless] - [Life of a Protocol Politician](https://newsletter.banklesshq.com/p/the-life-of-a-protocol-politician)\n[Kevin Owocki] - [Know Thy Enemy - Coordination Failures](https://newsletter.banklesshq.com/p/know-thy-enemy-coordination-failures)\n[Packy McCormack] - [The DAO of DAOs](https://www.notboring.co/p/the-dao-of-daos-5b9)\n[Packy McCormack] - [Cooperation Economy](https://www.notboring.co/p/the-cooperation-economy-)\n[Patrick Rivera] - [A Guide to Crypto Tokens](https://future.a16z.com/a-taxonomy-of-tokens-distinctions-with-a-difference/)\n[pet3rpan] - [An Introduction to DAOs](https://medium.com/metawork/an-introduction-to-daos-782e3817e2cd)\n[Vitalik Buterin] - [DAOs, DACs, DAs and More: An Incomplete Terminology Guide](https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/)\n\nTo the DAO contributors of the world - keep up the great work.\n\nWe’ve got a long way to go before DAOs have proven real traction at scale, but this snapshot should show that some of the world’s brightest minds are committed to making that happen.\n\nIn the meantime, keep shipping and remember… when in doubt - **Just DAO It.**\n\n*Special thanks to Carlos Gomes for the graphics and to Li Jin, Jesse Walden, Pet3rpan, Lucas Campbell, Kinjal Shah, Jess Sloss, Brian Flynn, Jake Chervinsky, Packy McCormick, and Alex Zhang for their feedback!*\n\nWant to continue the conversation? Here's your chance!\n\n[Token #3773](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=3773&auctionId=0xc001ca3aff4414dd7a9d0e8be9cc41367838ad624d2886484ded285a20d3d94e)\n\nLooking to offer more passive support? Leave a tip!\n\n[DAO Landscape](split://0xa01Ed7E91835c82C21FF0cB823b859757Bc8be57?network=mainnet)", "timestamp": 1625174431, "digest": "_EDyn4cs9tDoOxNGZLfKL7JjLo5rGkkEfRa_a-6VEWw", "contributor": "0x46301F7E700Be9cFfCE3e5e142a2244Df3f2d4F2"}
{"id": "77wrxZ-ckKuob5LeZXoepGATlBzCilRlZ7ZqtrN1cMA", "title": "Test", "body": "test", "timestamp": 1625177798, "digest": "tD716MIAbRu5JHrN2mwprGQ16_5mAbju1Hw6dpkpF7o", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "c44TevuJGZi7nCIzWQBtBPNNkdNBwNyqWzdjMQ6XUgo", "title": "Test", "body": "test", "timestamp": 1625177773, "digest": "BaIrbw58KBhhbuM0F4YB647BhgUzaASAF-_5kgT21yg", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "wb7-KqlK5KCisoeGsP8ucQivFFkXGMVA8F4PZYw4fIM", "title": "test", "body": "test", "timestamp": 1625180935, "digest": "n5rBQZ42oYhRaOMhj4tQCx-GSWdF5NT5_KuTrD7v9j8", "contributor": "0xf36615A5a8A9c19a368DcE3357B8C6B723C75701"}
