{"id": "B70ZFspjvgW354yP-wgg8wVWb4bh6fkucjupV7uVZGg", "title": "test", "body": "123", "timestamp": 1613442414, "digest": "PCeCSBjrlRasbfQx_dZ9M1_XHSNm1lcil0K2UZtqeBE", "contributor": "0xa841B1Fe3c6c2dAFd542638Be0e7a357F17cc596"}
{"id": "LDZA1q3CvALkT6y8fvnQM2jGD6lqs0T8AiYUGwpFn8k", "title": "Test", "body": "testing", "timestamp": 1613442864, "digest": "Gz5GRXAIthehFFmOT1xvZ3ihTIUc8fOnoCPK92qXRRg", "contributor": "0xe857Ae656B05A757A82E5e5d2b692Dd4b5D34fb5"}
{"id": "_2tJUbo0URkiwbr5-z1WjARUCXOM_iDfdm4UwJhvC2M", "title": "test", "body": "sadf", "timestamp": 1613444908, "digest": "VKqwl2T9nXZOpIxZQkGWdbpNv9mYIO9IXTg_4tac-Lw", "contributor": "0xF32EAd798529EE8ebdf6453979C4177eaB2Bbbf9"}
{"id": "a4_jdCFMOi51uv558C9jbV7-_Sza6o6wcKE4R_qIcS0", "title": "BusinessModel-Content Fit", "body": "In tech, we're constantly framing early stage companies around the search for [product-market fit](https://a16z.com/2017/02/18/12-things-about-product-market-fit/). But entering a time where individual creators are viewed as businesses of their own, I've been thinking about the reverse: \"BusinessModel-Content Fit.\"\n\nWe're all familiar with the quote \"First we shape our tools, thereafter they shape us,\" often mis-attributed to Marshall McLuhan. It's true that with work of any kind, the tools available to us influence the work we create. It follows that in times where nearly every interaction is financialized to some degree, this effect is less about tools and more about business models.\n\nI noted this in the announcement of the [$ESSAY crowdfund](https://j.mirror.xyz/uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0) last month:\n\n> When the only tool around for getting paid to write is a newsletter publisher, it's no wonder we see more and more newsletters, and less of everything else.\n\nClearly stated: The business models available to creators determine what content they create. \n\nToday, there are two main business models that have reached ubiquity: Advertising and paid subscriptions.\n\nAdvertising-based monetization has been the predominant model for awhile, and the incentives are clear. More views means more dollars, and the inevitable result of years under this model is that creators monetizing via ads are optimizing for clickbait at the cost of thoughtful, high-quality content.\n\nToday, Substack presents another option: paid subscriptions. Though the model has been around for awhile, Substack has made it much easier to operate a paid subscription newsletter, opening up the model to a much larger group of people.\n\nHowever, this business model comes with constraints around the content that's published under it, and the publishing frequency of that content. When paying a monthly subscription, readers expect to read something new at least once per week. This cadence then affects what's possible for writers to create, and how much time they can spend creating it. For writing that takes months of in-depth research, for example, a weekly cadence just isn't possible.\n\nKnowing this, you'd think that only some writers would end up writing newsletters, and others would pursue different models. Unfortunately, the variety of business models available to creators is still quite limited, so instead we see the opposite: writers of all kinds changing the type of work they do in order to fit into the only business model available for getting paid to write.\n\nThere's no problem with paid subscriptions. In fact, they're great for tons of different things. But if we want to experience a variety of different writing, art, and media, we need business models that are well-suited to many more kinds of work. This is what BusinessModel-Content Fit is.\n\nWhen there's BusinessModel-Content Fit, writers (and creators of all kind) can go about the work they'd already be doing while still getting paid for their work. This is a good thing.\n\nThe $ESSAY crowdfund was an experiment with one new model, focused on slightly longer-form essays, but there are many more experiments being run, and many of them will surely become great options for people creating different kinds of work. Among them:\n\n- **Writing sponsored by a VC / Company**: When a writer's thesis is already aligned with, and therefore attracts companies relevant to that investor, or customers related to that company. This is similar to a brand deal, but without any explicit advertisement.\n- **Selling work as an NFT**: When the work represents a collectible piece of history.\n- **Crowdfunding public work**: When work needs a certain amount of monetization to be produced, but the creator wants it to be free for anyone to access.\n- **Bounties**: For when an audience has strong opinions about what they're interested in. Works the same as a crowdfund, but an audience pre-funds a project for a creator to then work on.\n- **Pay to comment**: For when a creator's time is limited, but the audience wants to engage.\n- **Pay to join live audio discussion**: When there's demand to be part of a smaller experience, potentially including engagement with a creator or writer.\n- **Pay to access content early**: When content represents alpha, or has limited shelf life, and the audience cares about seeing that content on time.\n\nWe're still in the early days of this kind of experimentation, but I'm sure that in a few years' time, many more models will have been popularized, and creators of all kinds will have the opportunity to get paid without the need to adapt their work for a suboptimal model. That's what BusinessModel-Content Fit is all about.", "timestamp": 1613452228, "digest": "Lg5AQmanO8wE1du79Tex1Fs_dUmXVNm3NgMJUaRXWYw", "contributor": "0xB0623C91c65621df716aB8aFE5f66656B21A9108"}
{"id": "v_xW01eh_wrJTSQ4IxI-lKj_mXGRG7KnPajNBgfQIbM", "title": "BusinessModel-Content Fit", "body": "In tech, we're constantly framing early stage companies around the search for [product-market fit](https://a16z.com/2017/02/18/12-things-about-product-market-fit/). But entering a time where individual creators are viewed as businesses of their own, I've been thinking about the reverse: \"BusinessModel-Content Fit.\"\n\nWe're all familiar with the quote \"First we shape our tools, thereafter they shape us,\" often misattributed to Marshall McLuhan. It's true that with work of any kind, the tools available to us influence the work we create. It follows that in times where nearly every interaction is financialized to some degree, this effect is less about tools and more about business models.\n\nI noted this in the announcement of the [$ESSAY crowdfund](https://j.mirror.xyz/uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0) last month:\n\n> When the only tool around for getting paid to write is a newsletter publisher, it's no wonder we see more and more newsletters, and less of everything else.\n\nClearly stated: The business models available to creators determine what content they create. \n\nToday, there are two main business models that have reached ubiquity: Advertising and paid subscriptions.\n\nAdvertising-based monetization has been the predominant model for awhile, and the incentives are clear. More views means more dollars, and the inevitable result of years under this model is that creators monetizing via ads are optimizing for clickbait at the cost of thoughtful, high-quality content.\n\nToday, Substack presents another option: paid subscriptions. Though the model has been around for awhile, Substack has made it much easier to operate a paid subscription newsletter, opening up the model to a much larger group of people.\n\nHowever, this business model comes with constraints around the content that's published under it, and the publishing frequency of that content. When paying a monthly subscription, readers expect to read something new at least once per week. This cadence then affects what's possible for writers to create, and how much time they can spend creating it. For writing that takes months of in-depth research, for example, a weekly cadence just isn't possible.\n\nKnowing this, you'd think that only some writers would end up writing newsletters, and others would pursue different models. Unfortunately, the variety of business models available to creators is still quite limited, so instead we see the opposite: writers of all kinds changing the type of work they do in order to fit into the only business model available for getting paid to write.\n\nThere's no problem with paid subscriptions. In fact, they're great for tons of different things. But if we want to experience a variety of different writing, art, and media, we need business models that are well-suited to many more kinds of work. This is what BusinessModel-Content Fit is.\n\nWhen there's BusinessModel-Content Fit, writers (and creators of all kind) can go about the work they'd already be doing while still getting paid for their work. This is a good thing.\n\nThe $ESSAY crowdfund was an experiment with one new model, focused on slightly longer-form essays, but there are many more experiments being run, and many of them will surely become great options for people creating different kinds of work. Among them:\n\n- **Writing sponsored by a VC / Company**: When a writer's thesis is already aligned with, and therefore attracts companies relevant to that investor, or customers related to that company. This is similar to a brand deal, but without any explicit advertisement.\n- **Selling work as an NFT**: When the work represents a collectible piece of history.\n- **Crowdfunding public work**: When work needs a certain amount of monetization to be produced, but the creator wants it to be free for anyone to access.\n- **Bounties**: For when an audience has strong opinions about what they're interested in. Works the same as a crowdfund, but an audience pre-funds a project for a creator to then work on.\n- **Pay to comment**: For when a creator's time is limited, but the audience wants to engage.\n- **Pay to join live audio discussion**: When there's demand to be part of a smaller experience, potentially including engagement with a creator or writer.\n- **Pay to access content early**: When content represents alpha, or has limited shelf life, and the audience cares about seeing that content on time.\n\nWe're still in the early days of this kind of experimentation, but I'm sure that in a few years' time, many more models will have been popularized, and creators of all kinds will have the opportunity to get paid without the need to adapt their work to fit a suboptimal model. That's what BusinessModel-Content Fit is all about.", "timestamp": 1613454228, "digest": "Lg5AQmanO8wE1du79Tex1Fs_dUmXVNm3NgMJUaRXWYw", "contributor": "0xB0623C91c65621df716aB8aFE5f66656B21A9108"}
{"id": "a6sOsfjdlbi6AIxvQkr6KMBS5eG57qlLE0vY7OeUj4A", "title": "NFTs make the internet ownable", "body": "## Why crypto is becoming the \"port of entry\" for all internet media. \n\nBefore tech, I was an artist manager in music. When I started [the firm](http://coolmanagers.com), I believed one thing about the music industry very firmly: ownership endows power. Typically, labels had ownership over the music, and thus had the power over artists. \n\nOur goal was to help artists retain ownership of their work and run their business independently, using technology to reach their fans directly. Today, we’re all creators online, and ownership continues to carry a ton of weight. Yet the role of ownership on technology platforms is often overlooked.\n\nEvery day billions of images, videos, songs, and more media are shared on social media. When those files are posted, a copy of the media is taken from the creator’s device and pasted to the server of the platform distributing it—Facebook, Twitter, YouTube, TikTok and the like. \n\nThis may seem like a lightweight interaction, but when uploading, creators don’t simply copy a file—**they also copy-paste ownership of the file to the platform itself.**\n\nI’m not talking about copyright. I’m talking about the Terms of Service, which typically specify that when a file is uploaded, its ownership is shared with the platform, to monetize as they see fit. This comes with some advantages: platforms can offer distribution or economies of scale that optimize ad-based revenues. But it's no secret that today’s monetization models aren’t always aligned with the best interests of creators. And this is where the problem lies. For too long, platforms have reaped the bulk of the value from owning creators' content.\n\nMeanwhile, crypto is unlocking a different path—what I call The [Ownership Economy](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/)—where the value of platforms built by users can actually be *owned by the users directly*. \n\n[TOE](https://variant.fund/the-ownership-economy-crypto-and-consumer-software)\n\nIn media, NFTs—or Non-Fungible Tokens—make it possible for creators to retain ownership of their content, without limiting the propagation of their files across the internet. As a result, NFTs have the potential to invert the ownership model of media—offering creators, their audiences, and developers who build for them, a viable alternative to monetization.  \n\n**A simple way to think about NFTs are as files that live on the blockchain.**  This means they can't be copy-pasted, edited, deleted, or otherwise manipulated. \n\nThese guarantees stem from the same technical properties that make cryptocurrencies valuable: like Bitcoin, NFTs are digital tokens that can be bought, sold, traded, and whose ownership and provenance are always immutably tracked by the blockchain. What's yours is yours, verifiably so, and without the need for any third party to intermediate that ownership.\n\n**NFTs make it possible to own digital media assets in the same way that you can own a digital financial asset.** That is directly, independent of any third-party.\n\nTo many, NFTs look like a new tech toy, a soon-to-burst bubble. And while it's true the money being spent on digital art and crypto collectibles has been fast and flashy, their utility stands in sharp relief to the way platforms enable creator monetization today.\n\nI believe we are well on our way to **NFTs becoming the \"port of entry\" for every piece of media on the internet**. This includes the 2D audio/visual and text-based work of the web today, and the emerging 3D work that will encompass the metaverse of games and virtual worlds tomorrow.\n\nWhat I believe will pull this future forward is the fact that the business model enabled by NFTs is better for every stakeholder involved—creators, their audiences, and developers can all make more money in a marketplace built around true digital ownership.\n\nTo unpack this further, I'll address some common questions I've heard about NFTs. Many of the answers below expand on tweetstorms I’ve written over the last few years.\n\n### How do NFTs work?\n\n[NFT is a file format](https://twitter.com/jessewldn/status/1321239372449153024)\n\nIn practice, an NFT is simply a unique token representing a digital file. Each has a canonical identifier, a unique ID. Hooked to that ID is arbitrary metadata, for example, who created it, what it’s about, or its price history. When an NFT is minted by a creator, this information is immutably registered on the blockchain and becomes a sort of digital passport for the work. Moving forward, anytime that piece of media is distributed on another platform, that platform can \"check its passport\" and see its entire history. This means that instances of an idea can point back to the original, immutable record registered on the blockchain. An image on the internet no longer needs to be a two-dimensional box. Instead, it can take on a “Z-Axis” where all of its history and context can be discovered by third-parties, adding to its cultural and financial value.\n\n### Is there value in owning digital art? \n\n[The value of an NFT](https://twitter.com/jessewldn/status/1321447490370080769?s=20)\n\nA common critique is that because digital art and digital collectibles can be copied, they don’t carry much value. But NFTs introduce a new possibility that enables true ownership to exist while a work continues to freely circulate online.  \n \nThe more a file is shared and seen online, the more cultural value it accrues. Consider the mass production of posters and t-shirts of Warhol imagery. With increase in notoriety, the concept of owning the canonical work becomes more thrilling, and more a marker of social status. It can also drive up the value that can be derived from reselling the work should its notoriety increase after purchase. NFTs enable collectors to reap most of the benefits of owning a physical work of art, with the added bonus that their collection can be freely shared across the internet without limitation—and thus accrue more value with wider distribution.\n\nAnd its not just art. The growing universe of crypto collectibles, game assets, digital fashion, skins, and more blurs the line between art and programmed utility. More on that below. \n\n### Why collect NFTs right now? \n \nPeople collect NFTs for a number of reasons. It could be the thrill of discovering a promising new artist or artwork, the allure of a piece’s potential cultural value, the social status of owning something unique and canonical, or the prospect of turning a profit by reselling the work down the line. \n \nRight now, in NFTs (and in other crypto markets) many collect for speculative value. And like the rest of the crypto market, **NFT markets are reflexive.** Just like cryptocurrencies and traditional art, the more people who think an asset might have value—even for subjective reasons—the more real value it can typically fetch in the market. \n \nAs an example of this, the reflexivity of Bitcoin markets began as the currency bootstrapped its popularity, eventually growing in momentum from a pizza memecoin to a global reserve asset. Similarly, NFTs may start out looking like fun and games for crypto whales, but as more money flows into these markets—and as more creators mint tokens and get involved—outsiders will start to see value changing hands, and the perceived value will rise. This kind of reflexivity creates a positive feedback loop that, in many instances, helps drive an inevitable rise in market activity over time. \n \n### Longterm, where are NFTs heading?\n\n[Media Legos](https://twitter.com/jessewldn/status/1301669871789445122)\n\nComing back to utility: as with many technological hype cycles, speculative value often gives way to functional value. Because these assets are programmable and open, any developer can build on top of them. And because NFTs are user-portable, programmable assets can take on new utility across the totality of our digital world.\n\nTokens and smart contracts have been called \"money legos\" as they allow programmers to [compose and remix](https://jessewalden.com/4-eras-of-blockchain-computing-degrees-of-composability/) DeFi applications. Similarly, NFTs are \"media legos\" for developers and creators to permissionlessly remix and build new experiences around. As a result, users can look forward to richer experiences, and compounding utility around the items they own. \n\n### Is NFT adoption inevitable? \n\n[port of entry](https://twitter.com/jessewldn/status/1346470700979089414)\n\nI think NFTs will become the port of entry to all internet media because everyone involved can make more money from the markets they enable: \n\n**Creators** make more money by selling directly to their fans and by collecting royalties every time their NFTs are resold. This is an entirely new revenue stream that is only possible because of true digital ownership that can encode royalty logic in the media itself.\n\nFor **consumers**, NFTs are a better model because they combine the social and utilitarian benefits of patronage with the *possibility* of turning a profit or realizing compounding utility. On the web today, consumers rent access to most goods and services, including the creators they patronize. A key tenet of new Ownership Economy platforms is the incentive alignment that comes from having skin in the game. With regard to supporting creators, I've called this “[Patronage+](https://twitter.com/jessewldn/status/1355165547441303554)” where the “plus” is the possibility of earning value alongside the creators you support. This is strong and under-explored incentive to become a patron in the first place, and I think will drive more meaningful and fruitful participation in markets for creative work.\n\n**Developers** can make money by building to enable these new markets. Wheras major platforms choke access to developer APIs and limit free market development, developers building atop permissionless infrastructure stand to step into the flow of a growing market-economy with property rights that in many ways, function more like those in the physical world.\n\n### Where are we in the NFT adoption cycle?\n\n[frenzy](https://twitter.com/jessewldn/status/1335979344225820673)\n\nThe backdrop of the 2021 crypto/everything-bull market, coupled with the internet waking up to investing as a team sport (WallStreetBets), has created the right conditions for NFT markets to enter their frenzy stage, capturing mainstream attention and serious money.\n\nMuch of it is taking place in the digital art space, but it’s also happening in burgeoning niches—including gaming world assets like [Axie Infinity](https://axieinfinity.com/), or sets of crypto collectibles like [Hashmasks](https://www.thehashmasks.com/) and [CryptoPunks](https://www.larvalabs.com/cryptopunks), or generative artworks that are programmatically created on-chain (like [this series](https://www.artblocks.io/project/5) I commissioned for Variant.) \n\n<div className=\"nft-embed\"></div>\n<script\n  async\n  src=\"https://nfte.app/api/embed.js?contract=0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270&tokenId=5000001\">\n</script>\n\nWe are also seeing new marketplaces popping up where creators can mint NFTs and connect with collectors. [Foundation](https://foundation.app) saw over $150K in sales during its first week online, including the [first Vine video ever created, which sold for $14K](https://foundation.app/dom/summer-night-77). VCs are [buying AI-generated artworks for their portfolios](https://twitter.com/NTmoney/status/1346642772397199360?s=20) (myself included.)  The decentralized blogging platform on which I am publishing this essay, [Mirror](https://mirror.xyz), recently [crowdfunded $13,000+ for an essay](https://twitter.com/viamirror/status/1359990786985766918?s=20) that was subsequently auctioned as an NFT, earning the crowdfunders royalties on their investment. \n \nThis is all happening despite the fact that it’s still fairly clunky and expensive to engage with NFTs on Ethereum. Minting a single NFT costs roughly $100 in ETH, and buying and trading incurs high transaction fees. \n\nBut 2021 is also the year major technical upgrades are set to arrive in the crypto space. Reduced transaction costs and higher throughput will help developers push NFTs into higher-volume social territory. [Zora](https://zora.co) is heading that direction, with a Tumblr-like interface where each “post” is minted as an NFT. Because these social experiences have markets baked-in, and users can make money alongside the creators they support, there are strong incentives to participate. \n \nAnd remember, these are not just collectors’ items, they are programmable assets that any developer can remix. As developers build new contexts for NFTs to live, there will be compounding demand from creators to have their work included in this emerging metaverse and for collectors to flex their ownership rights. \n\n### Wrapping up\n\nIn 2014, I started a company called [Mediachain Labs](https://twitter.com/jessewldn/status/1346490319332892674?s=20) where we were working on an open protocol called Mediachain. Our goal was to build a “[universal media library](https://github.com/mediachainlabs/canonical-content-registry)” that would do for digital media assets what Bitcoin did for digital financial assets. \n\nRoughly six years later, in a world where the early majority (10%+ of Americans) own digital currency, the infrastructure and markets for those ideas are here and now.  \n\nI’m incredibly grateful to continue to be involved with teams and communities who are building out the universal media library via NFTs. If that’s you, I'd love to [learn about what you're building](https://variant.fund/#site-footer).\n\n---\n*Thanks to [Lindsay Howard](https://twitter.com/Lindsay_Howard), [Spencer Noon](https://twitter.com/spencernoon), [Willa Koerner](https://twitter.com/willak) and [Denis Nazarov](https://twitter.com/Iiterature) for reviewing drafts of this post.*\n", "timestamp": 1613484819, "digest": "T8kdtZRIgy_srXB5B06L8vBqFHYlEBcv6ae2zR6Y_eo", "contributor": "0xe7925D190aea9279400cD9a005E33CEB9389Cc2b"}
{"id": "7ag5hi02Q6gQQ2v5xcuOeObi79cxy92y5_BjAtYkbjA", "title": "NFTs make the internet ownable", "body": "## Why crypto is becoming the \"port of entry\" for all internet media. \n\nBefore tech, I was an artist manager in music. When I started [the firm](http://coolmanagers.com), I believed one thing about the music industry very firmly: ownership endows power. Typically, labels had ownership over the music, and thus had the power over artists. \n\nOur goal was to help artists retain ownership of their work and run their business independently, using technology to reach their fans directly. Today, we’re all creators online, and ownership continues to carry a ton of weight. Yet the role of ownership on technology platforms is often overlooked.\n\nEvery day billions of images, videos, songs, and more media are shared on social media. When those files are posted, a copy of the media is taken from the creator’s device and pasted to the server of the platform distributing it—Facebook, Twitter, YouTube, TikTok and the like. \n\nThis may seem like a lightweight interaction, but when uploading, creators don’t simply copy a file—**they also copy-paste ownership of the file to the platform itself.**\n\nI’m not talking about copyright. I’m talking about the Terms of Service, which typically specify that when a file is uploaded, its ownership is shared with the platform, to monetize as they see fit. This comes with some advantages: platforms can offer distribution or economies of scale that optimize ad-based revenues. But it's no secret that today’s monetization models aren’t always aligned with the best interests of creators. And this is where the problem lies. For too long, platforms have reaped the bulk of the value from owning creators' content.\n\nMeanwhile, crypto is unlocking a different path—what I call The [Ownership Economy](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/)—where the value of platforms built by users can actually be *owned by the users directly*. \n\n[TOE](https://variant.fund/the-ownership-economy-crypto-and-consumer-software)\n\nIn media, NFTs—or Non-Fungible Tokens—make it possible for creators to retain ownership of their content, without limiting the propagation of their files across the internet. As a result, NFTs have the potential to invert the ownership model of media—offering creators, their audiences, and developers who build for them, a viable alternative to monetization.  \n\n**A simple way to think about NFTs are as files that live on the blockchain.**  This means they can't be copy-pasted, edited, deleted, or otherwise manipulated. \n\nThese guarantees stem from the same technical properties that make cryptocurrencies valuable: like Bitcoin, NFTs are digital tokens that can be bought, sold, traded, and whose ownership and provenance are always immutably tracked by the blockchain. What's yours is yours, verifiably so, and without the need for any third party to intermediate that ownership.\n\n**NFTs make it possible to own digital media assets in the same way that you can own a digital financial asset.** \n\nTo many, NFTs look like a new tech toy, a soon-to-burst bubble. And while it's true the money being spent on digital art and crypto collectibles has been fast and flashy, their utility stands in sharp relief to the way platforms enable creator monetization today.\n\nI believe we are well on our way to **NFTs becoming the \"port of entry\" for every piece of media on the internet**. This includes the 2D audio/visual and text-based work of the web today, and the emerging 3D work that will encompass the metaverse of games and virtual worlds tomorrow.\n\nWhat I believe will pull this future forward is the fact that the business model enabled by NFTs is better for every stakeholder involved—creators, their audiences, and developers can all make more money in a marketplace built around true digital ownership.\n\nTo unpack this further, I'll address some common questions I've heard about NFTs. Many of the answers below expand on tweetstorms I’ve written over the last few years.\n\n### How do NFTs work?\n\n[NFT is a file format](https://twitter.com/jessewldn/status/1321239372449153024)\n\nIn practice, an NFT is simply a unique token representing a digital file. Each has a canonical identifier, a unique ID. Hooked to that ID is arbitrary metadata, for example, who created it, what it’s about, or its price history. When an NFT is minted by a creator, this information is immutably registered on the blockchain and becomes a sort of digital passport for the work. Moving forward, anytime that piece of media is distributed on another platform, that platform can \"check its passport\" and see its entire history. This means that instances of an idea can point back to the original, immutable record registered on the blockchain. An image on the internet no longer needs to be a two-dimensional box. Instead, it can take on a “Z-Axis” where all of its history and context can be discovered by third-parties, adding to its cultural and financial value.\n\n### Is there value in owning digital art? \n\n[The value of an NFT](https://twitter.com/jessewldn/status/1321447490370080769?s=20)\n\nA common critique is that because digital art and digital collectibles can be copied, they don’t carry much value. But NFTs introduce a new possibility that enables true ownership to exist while a work continues to freely circulate online.  \n \nThe more a file is shared and seen online, the more cultural value it accrues. Consider the mass production of posters and t-shirts of Warhol imagery. With increase in notoriety, the concept of owning the canonical work becomes more thrilling, and more a marker of social status. It can also drive up the value that can be derived from reselling the work should its notoriety increase after purchase. NFTs enable collectors to reap most of the benefits of owning a physical work of art, with the added bonus that their collection can be freely shared across the internet without limitation—and thus accrue more value with wider distribution.\n\nAnd its not just art. The growing universe of crypto collectibles, game assets, digital fashion, skins, and more blurs the line between art and programmed utility. More on that below. \n\n### Why collect NFTs right now? \n \nPeople collect NFTs for a number of reasons. It could be the thrill of discovering a promising new artist or artwork, the allure of a piece’s potential cultural value, the social status of owning something unique and canonical, or the prospect of turning a profit by reselling the work down the line. \n \nRight now, in NFTs (and in other crypto markets) many collect for speculative value. And like the rest of the crypto market, **NFT markets are reflexive.** Just like cryptocurrencies and traditional art, the more people who think an asset might have value—even for subjective reasons—the more real value it can typically fetch in the market. \n \nAs an example of this, the reflexivity of Bitcoin markets began as the currency bootstrapped its popularity, eventually growing in momentum from a pizza memecoin to a global reserve asset. Similarly, NFTs may start out looking like fun and games for crypto whales, but as more money flows into these markets—and as more creators mint tokens and get involved—outsiders will start to see value changing hands, and the perceived value will rise. This kind of reflexivity creates a positive feedback loop that, in many instances, helps drive an inevitable rise in market activity over time. \n \n### Longterm, where are NFTs heading?\n\n[Media Legos](https://twitter.com/jessewldn/status/1301669871789445122)\n\nComing back to utility: as with many technological hype cycles, speculative value often gives way to functional value. Because these assets are programmable and open, any developer can build on top of them. And because NFTs are user-portable, programmable assets can take on new utility across the totality of our digital world.\n\nTokens and smart contracts have been called \"money legos\" as they allow programmers to [compose and remix](https://jessewalden.com/4-eras-of-blockchain-computing-degrees-of-composability/) DeFi applications. Similarly, NFTs are \"media legos\" for developers and creators to permissionlessly remix and build new experiences around. As a result, users can look forward to richer experiences, and compounding utility around the items they own. \n\n### Is NFT adoption inevitable? \n\n[port of entry](https://twitter.com/jessewldn/status/1346470700979089414)\n\nI think NFTs will become the port of entry to all internet media because everyone involved can make more money from the markets they enable: \n\n**Creators** make more money by selling directly to their fans and by collecting royalties every time their NFTs are resold. This is an entirely new revenue stream that is only possible because of true digital ownership that can encode royalty logic in the media itself.\n\nFor **consumers**, NFTs are a better model because they combine the social and utilitarian benefits of patronage with the *possibility* of turning a profit or realizing compounding utility. On the web today, consumers rent access to most goods and services, including the creators they patronize. A key tenet of new Ownership Economy platforms is the incentive alignment that comes from having skin in the game. With regard to supporting creators, I've called this “[Patronage+](https://twitter.com/jessewldn/status/1355165547441303554)” where the “plus” is the possibility of earning value alongside the creators you support. This is strong and under-explored incentive to become a patron in the first place, and I think will drive more meaningful and fruitful participation in markets for creative work.\n\n**Developers** can make money by building to enable these new markets. Wheras major platforms choke access to developer APIs and limit free market development, developers building atop permissionless infrastructure stand to step into the flow of a growing market-economy with property rights that in many ways, function more like those in the physical world.\n\n### Where are we in the NFT adoption cycle?\n\n[frenzy](https://twitter.com/jessewldn/status/1335979344225820673)\n\nThe backdrop of the 2021 crypto/everything-bull market, coupled with the internet waking up to investing as a team sport (WallStreetBets), has created the right conditions for NFT markets to enter their frenzy stage, capturing mainstream attention and serious money.\n\nMuch of it is taking place in the digital art space, but it’s also happening in burgeoning niches—including gaming world assets like [Axie Infinity](https://axieinfinity.com/), or sets of crypto collectibles like [Hashmasks](https://www.thehashmasks.com/) and [CryptoPunks](https://www.larvalabs.com/cryptopunks), or generative artworks that are programmatically created on-chain (like [this series](https://www.artblocks.io/project/5) I commissioned for Variant.) \n\n<div className=\"nft-embed\"></div>\n<script\n  async\n  src=\"https://nfte.app/api/embed.js?contract=0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270&tokenId=5000001\">\n</script>\n\nWe are also seeing new marketplaces popping up where creators can mint NFTs and connect with collectors. [Foundation](https://foundation.app) saw over $150K in sales during its first week online, including the [first Vine video ever created, which sold for $14K](https://foundation.app/dom/summer-night-77). VCs are [buying AI-generated artworks for their portfolios](https://twitter.com/NTmoney/status/1346642772397199360?s=20) (myself included.)  The decentralized blogging platform on which I am publishing this essay, [Mirror](https://mirror.xyz), recently [crowdfunded $13,000+ for an essay](https://twitter.com/viamirror/status/1359990786985766918?s=20) that was subsequently auctioned as an NFT, earning the crowdfunders royalties on their investment. \n \nThis is all happening despite the fact that it’s still fairly clunky and expensive to engage with NFTs on Ethereum. Minting a single NFT costs roughly $100 in ETH, and buying and trading incurs high transaction fees. \n\nBut 2021 is also the year major technical upgrades are set to arrive in the crypto space. Reduced transaction costs and higher throughput will help developers push NFTs into higher-volume social territory. [Zora](https://zora.co) is heading that direction, with a Tumblr-like interface where each “post” is minted as an NFT. Because these social experiences have markets baked-in, and users can make money alongside the creators they support, there are strong incentives to participate. \n \nAnd remember, these are not just collectors’ items, they are programmable assets that any developer can remix. As developers build new contexts for NFTs to live, there will be compounding demand from creators to have their work included in this emerging metaverse and for collectors to flex their ownership rights. \n\n### Wrapping up\n\nIn 2014, I started a company called [Mediachain Labs](https://twitter.com/jessewldn/status/1346490319332892674?s=20) where we were working on an open protocol called Mediachain. Our goal was to build a “[universal media library](https://github.com/mediachainlabs/canonical-content-registry)” that would do for digital media assets what Bitcoin did for digital financial assets. \n\nRoughly six years later, in a world where the early majority (10%+ of Americans) own digital currency, the infrastructure and markets for those ideas are here and now.  \n\nI’m incredibly grateful to continue to be involved with teams and communities who are building out the universal media library via NFTs. If that’s you, I'd love to [learn about what you're building](https://variant.fund/#site-footer).\n\n---\n**Update**: If you're looking to jump into the NFT space, teams are hiring engineers, creator/dev evangelists, community, product and design roles. [Get in touch](https://forms.gle/cY4vgKZj7yn9pTSA9) and I'll do my best to connect the dots!\n\nJoin the discussion on [Twitter](https://twitter.com/jessewldn/status/1361344223216340993)\n\n---\n*Thanks to [Lindsay Howard](https://twitter.com/Lindsay_Howard), [Spencer Noon](https://twitter.com/spencernoon), [Willa Koerner](https://twitter.com/willak) and [Denis Nazarov](https://twitter.com/Iiterature) for reviewing drafts of this post.*\n", "timestamp": 1613485222, "digest": "T8kdtZRIgy_srXB5B06L8vBqFHYlEBcv6ae2zR6Y_eo", "contributor": "0xe7925D190aea9279400cD9a005E33CEB9389Cc2b"}
{"id": "dFhdPYWDg2pbfce8FDseJomxKajeQaHziqxabpBA6wg", "title": "NFTs make the internet ownable", "body": "## Why crypto is becoming the \"port of entry\" for all internet media. \n\nBefore tech, I was an artist manager in music. When I started [the firm](http://coolmanagers.com), I believed one thing about the music industry very firmly: ownership endows power. Typically, labels had ownership over the music, and thus, power over artists. \n\nOur goal was to help artists retain ownership of their work and run their business independently, using technology to reach their fans directly. Today, we’re all creators online, and ownership continues to carry a ton of weight. Yet the role of ownership on technology platforms is often overlooked.\n\nEvery day billions of images, videos, songs, and more media are shared on social media. When those files are posted, a copy of the media is taken from the creator’s device and pasted to the server of the platform distributing it—Facebook, Twitter, YouTube, TikTok and the like. \n\nThis may seem like a lightweight interaction, but when uploading, creators don’t simply copy a file—**they also copy-paste ownership of the file to the platform itself.**\n\nI’m not talking about copyright. I’m talking about the Terms of Service, which typically specify that when a file is uploaded, its ownership is shared with the platform, to monetize as they see fit. This comes with some advantages: platforms can offer distribution or economies of scale that optimize ad-based revenues. But it's no secret that today’s monetization models aren’t always aligned with the best interests of creators. And this is where the problem lies. For too long, platforms have reaped the bulk of the value from owning creators' content.\n\nMeanwhile, crypto is unlocking a different path—what I call The [Ownership Economy](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/)—where the value of platforms built by users can actually be *owned by the users directly*. \n\n[TOE](https://variant.fund/the-ownership-economy-crypto-and-consumer-software)\n\nIn media, NFTs—or Non-Fungible Tokens—make it possible for creators to retain ownership of their content, without limiting the propagation of their files across the internet. As a result, NFTs have the potential to invert the ownership model of media—offering creators, their audiences, and developers who build for them, a viable alternative to monetization.  \n\n**A simple way to think about NFTs are as files that live on the blockchain.**  This means they can't be copy-pasted, edited, deleted, or otherwise manipulated. \n\nThese guarantees stem from the same technical properties that make cryptocurrencies valuable: like Bitcoin, NFTs are digital tokens that can be bought, sold, traded, and whose ownership and provenance are always immutably tracked by the blockchain. What's yours is yours, verifiably so, and without the need for any third party to intermediate that ownership.\n\n**NFTs make it possible to own digital media assets in the same way that you can own a digital financial asset.** \n\nTo many, NFTs look like a new tech toy, a soon-to-burst bubble. And while it's true the money being spent on digital art and crypto collectibles has been fast and flashy, their utility stands in sharp relief to the way platforms enable creator monetization today.\n\nI believe we are well on our way to **NFTs becoming the \"port of entry\" for every piece of media on the internet**. This includes the 2D audio/visual and text-based work of the web today, and the emerging 3D work that will encompass the metaverse of games and virtual worlds tomorrow.\n\nWhat I believe will pull this future forward is the fact that the business model enabled by NFTs is better for every stakeholder involved—creators, their audiences, and developers can all make more money in a marketplace built around true digital ownership.\n\nTo unpack this further, I'll address some common questions I've heard about NFTs. Many of the answers below expand on tweetstorms I’ve written over the last few years.\n\n### How do NFTs work?\n\n[NFT is a file format](https://twitter.com/jessewldn/status/1321239372449153024)\n\nIn practice, an NFT is simply a unique token representing a digital file. Each has a canonical identifier, a unique ID. Hooked to that ID is arbitrary metadata, for example, who created it, what it’s about, or its price history. When an NFT is minted by a creator, this information is immutably registered on the blockchain and becomes a sort of digital passport for the work. Moving forward, anytime that piece of media is distributed on another platform, that platform can \"check its passport\" and see its entire history. This means that instances of an idea can point back to the original, immutable record registered on the blockchain. An image on the internet no longer needs to be a two-dimensional box. Instead, it can take on a “Z-Axis” where all of its history and context can be discovered by third-parties, adding to its cultural and financial value.\n\n### Is there value in owning digital art? \n\n[The value of an NFT](https://twitter.com/jessewldn/status/1321447490370080769?s=20)\n\nA common critique is that because digital art and digital collectibles can be copied, they don’t carry much value. But NFTs introduce a new possibility that enables true ownership to exist while a work continues to freely circulate online.  \n \nThe more a file is shared and seen online, the more cultural value it accrues. Consider the mass production of posters and t-shirts of Warhol imagery. With increase in notoriety, the concept of owning the canonical work becomes more thrilling, and more a marker of social status. It can also drive up the value that can be derived from reselling the work should its notoriety increase after purchase. NFTs enable collectors to reap most of the benefits of owning a physical work of art, with the added bonus that their collection can be freely shared across the internet without limitation—and thus accrue more value with wider distribution.\n\nAnd its not just art. The growing universe of crypto collectibles, game assets, digital fashion, skins, and more blurs the line between art and programmed utility. More on that below. \n\n### Why collect NFTs right now? \n \nPeople collect NFTs for a number of reasons. It could be the thrill of discovering a promising new artist or artwork, the allure of a piece’s potential cultural value, the social status of owning something unique and canonical, or the prospect of turning a profit by reselling the work down the line. \n \nRight now, in NFTs (and in other crypto markets) many collect for speculative value. And like the rest of the crypto market, **NFT markets are reflexive.** Just like cryptocurrencies and traditional art, the more people who think an asset might have value—even for subjective reasons—the more real value it can typically fetch in the market. \n \nAs an example of this, the reflexivity of Bitcoin markets began as the currency bootstrapped its popularity, eventually growing in momentum from a pizza memecoin to a global reserve asset. Similarly, NFTs may start out looking like fun and games for crypto whales, but as more money flows into these markets—and as more creators mint tokens and get involved—outsiders will start to see value changing hands, and the perceived value will rise. This kind of reflexivity creates a positive feedback loop that, in many instances, helps drive an inevitable rise in market activity over time. \n \n### Longterm, where are NFTs heading?\n\n[Media Legos](https://twitter.com/jessewldn/status/1301669871789445122)\n\nComing back to utility: as with many technological hype cycles, speculative value often gives way to functional value. Because these assets are programmable and open, any developer can build on top of them. And because NFTs are user-portable, programmable assets can take on new utility across the totality of our digital world.\n\nTokens and smart contracts have been called \"money legos\" as they allow programmers to [compose and remix](https://jessewalden.com/4-eras-of-blockchain-computing-degrees-of-composability/) DeFi applications. Similarly, NFTs are \"media legos\" for developers and creators to permissionlessly remix and build new experiences around. As a result, users can look forward to richer experiences, and compounding utility around the items they own. \n\n### Is NFT adoption inevitable? \n\n[port of entry](https://twitter.com/jessewldn/status/1346470700979089414)\n\nI think NFTs will become the port of entry to all internet media **because everyone involved can make more money from the markets they enable**: \n\n**Creators** make more money by selling directly to their fans and by collecting royalties every time their NFTs are resold. This is an entirely new revenue stream that is only possible because of true digital ownership that can encode royalty logic in the media itself.\n\nFor **consumers**, NFTs are a better model because they combine the social and utilitarian benefits of patronage with the *possibility* of turning a profit or realizing compounding utility. On the web today, consumers rent access to most goods and services, including the creators they patronize. A key tenet of new Ownership Economy platforms is the incentive alignment that comes from having skin in the game. With regard to supporting creators, I've called this “[Patronage+](https://twitter.com/jessewldn/status/1355165547441303554)” where the “plus” is the possibility of earning value alongside the creators you support. This is a strong, under-explored incentive to become a patron in the first place—and I think it may drive more engaging and rewarding demand in markets for creative work.\n\n**Developers** can make money by building to enable these new markets. Wheras major platforms choke access to developer APIs and limit free market development, developers building atop permissionless infrastructure stand to step into the flow of a growing market-economy with property rights that in many ways, function more like those in the physical world.\n\n### Where are we in the NFT adoption cycle?\n\n[frenzy](https://twitter.com/jessewldn/status/1335979344225820673)\n\nThe backdrop of the 2021 crypto/everything-bull market, coupled with the internet waking up to investing as a team sport (WallStreetBets), has created the right conditions for NFT markets to enter their frenzy stage, capturing mainstream attention and serious money.\n\nMuch of it is taking place in the digital art space, but it’s also happening in burgeoning niches—including gaming world assets like [Axie Infinity](https://axieinfinity.com/), or sets of crypto collectibles like [Hashmasks](https://www.thehashmasks.com/) and [CryptoPunks](https://www.larvalabs.com/cryptopunks), or generative artworks that are programmatically created on-chain (like [this series](https://www.artblocks.io/project/5) I commissioned for Variant.) \n\n<div className=\"nft-embed\"></div>\n<script\n  async\n  src=\"https://nfte.app/api/embed.js?contract=0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270&tokenId=5000001\">\n</script>\n\nWe are also seeing new marketplaces popping up where creators can mint NFTs and connect with collectors. [Foundation](https://foundation.app) saw over $150K in sales during its first week online, including the [first Vine video ever created, which sold for $14K](https://foundation.app/dom/summer-night-77). VCs are [buying AI-generated artworks for their portfolios](https://twitter.com/NTmoney/status/1346642772397199360?s=20) (myself included.)  The decentralized blogging platform on which I am publishing this essay, [Mirror](https://mirror.xyz), recently [crowdfunded $13,000+ for an essay](https://twitter.com/viamirror/status/1359990786985766918?s=20) that was subsequently auctioned as an NFT, earning the crowdfunders royalties on their investment. \n \nThis is all happening despite the fact that it’s still fairly clunky and expensive to engage with NFTs on Ethereum. Minting a single NFT costs roughly $100 in ETH, and buying and trading incurs high transaction fees. \n\nBut 2021 is also the year major technical upgrades are set to arrive in the crypto space. Reduced transaction costs and higher throughput will help developers push NFTs into higher-volume, social territory. [Zora](https://zora.co) is heading that direction with a Tumblr-like interface where each “post” is minted as an NFT. Because these social experiences have markets baked-in, and users can make money alongside the creators they support, there are strong incentives to participate. \n \nAnd remember, these are not just collectors’ items, they are programmable assets that any developer can remix. As developers build new contexts for NFTs to live, there will be compounding demand from creators to have their work included in this emerging metaverse and for collectors to flex their ownership rights. \n\n### Wrapping up\n\nIn 2014, I started a company called [Mediachain Labs](https://twitter.com/jessewldn/status/1346490319332892674?s=20) where we were working on an open protocol called Mediachain. Our goal was to build a “[universal media library](https://github.com/mediachainlabs/canonical-content-registry)” that would do for digital media assets what Bitcoin did for digital financial assets. \n\nRoughly six years later, in a world where the early majority (10%+ of Americans) own digital currency, the infrastructure and markets for those ideas are here and now.  \n\nI’m incredibly grateful to continue to be involved with teams and communities who are building out the universal media library via NFTs. If that’s you, I'd love to [learn about what you're building](https://variant.fund/#site-footer).\n\n---\n**Update**: If you're looking to jump into the NFT space, teams are hiring engineers, creator/dev evangelists, community, product and design roles. [Get in touch](https://forms.gle/cY4vgKZj7yn9pTSA9) and I'll do my best to connect the dots!\n\nJoin the discussion on [Twitter](https://twitter.com/jessewldn/status/1361344223216340993)\n\n---\n*Thanks to [Lindsay Howard](https://twitter.com/Lindsay_Howard), [Spencer Noon](https://twitter.com/spencernoon), [Willa Koerner](https://twitter.com/willak) and [Denis Nazarov](https://twitter.com/Iiterature) for reviewing drafts of this post.*\n", "timestamp": 1613488490, "digest": "T8kdtZRIgy_srXB5B06L8vBqFHYlEBcv6ae2zR6Y_eo", "contributor": "0xe7925D190aea9279400cD9a005E33CEB9389Cc2b"}
{"id": "e3U3cLNGHmM9xr_c2zjOU4G7YmsEjp4BzEosaSz9SZ4", "title": "NFTs make the internet ownable", "body": "## Why crypto is becoming the \"port of entry\" for all internet media. \n\nBefore tech, I was an artist manager in music. When I started [the firm](http://coolmanagers.com), I believed one thing about the music industry very firmly: ownership endows power. Typically, labels had ownership over the music, and thus, power over artists. \n\nOur goal was to help artists retain ownership of their work and run their business independently, using technology to reach their fans directly. Today, we’re all creators online, and ownership continues to carry a ton of weight. Yet the role of ownership on technology platforms is often overlooked.\n\nEvery day billions of images, videos, songs, and more media are shared on social media. When those files are posted, a copy of the media is taken from the creator’s device and pasted to the server of the platform distributing it—Facebook, Twitter, YouTube, TikTok and the like. \n\nThis may seem like a lightweight interaction, but when uploading, creators don’t simply copy a file—**they also copy-paste ownership of the file to the platform itself.**\n\nI’m not talking about copyright. I’m talking about the Terms of Service, which typically specify that when a file is uploaded, its ownership is shared with the platform, to monetize as they see fit. This comes with some advantages: platforms can offer distribution or economies of scale that optimize ad-based revenues. But it's no secret that today’s monetization models aren’t always aligned with the best interests of creators. And this is where the problem lies. For too long, platforms have reaped the bulk of the value from owning creators' content.\n\nMeanwhile, crypto is unlocking a different path—what I call the [Ownership Economy](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/)—a broader thesis that the next generation of internet platforms will be built, operated, and *owned by users directly*. \n\n[TOE](https://variant.fund/the-ownership-economy-crypto-and-consumer-software)\n\nIn media, NFTs—or Non-Fungible Tokens—make it possible for creators to retain ownership of their content, without limiting the propagation of their files across the internet. As a result, NFTs have the potential to invert the ownership model of media—offering creators, their audiences, and developers who build for them, a viable alternative to monetization.  \n\n**A simple way to think about NFTs are as files that live on the blockchain.**  This means they can't be copy-pasted, edited, deleted, or otherwise manipulated. \n\nThese guarantees stem from the same technical properties that make cryptocurrencies valuable: like Bitcoin, NFTs are digital tokens that can be bought, sold, traded, and whose ownership and provenance are always immutably tracked by the blockchain. What's yours is yours, verifiably so, and without the need for any third party to intermediate that ownership.\n\n**NFTs make it possible to own digital media assets in the same way that you can own a digital financial asset.** \n\nTo many, NFTs look like a new tech toy, a soon-to-burst bubble. And while it's true the money being spent on digital art and crypto collectibles has been fast and flashy, their utility stands in sharp relief to the way platforms enable creator monetization today.\n\nI believe we are well on our way to **NFTs becoming the \"port of entry\" for every piece of media on the internet**. This includes the 2D audio/visual and text-based work of the web today, and the emerging 3D work that will encompass the metaverse of games and virtual worlds tomorrow.\n\nWhat I believe will pull this future forward is the fact that the business model enabled by NFTs is better for every stakeholder involved—creators, their audiences, and developers can all make more money in a marketplace built around true digital ownership.\n\nTo unpack this further, I'll address some common questions I've heard about NFTs. Many of the answers below expand on tweetstorms I’ve written over the last few years.\n\n### How do NFTs work?\n\n[NFT is a file format](https://twitter.com/jessewldn/status/1321239372449153024)\n\nIn practice, an NFT is simply a unique token representing a digital file. Each has a canonical identifier, a unique ID. Hooked to that ID is arbitrary metadata, for example, who created it, what it’s about, or its price history. When an NFT is minted by a creator, this information is immutably registered on the blockchain and becomes a sort of digital passport for the work. Moving forward, anytime that piece of media is distributed on another platform, that platform can \"check its passport\" and see its entire history. This means that instances of an idea can point back to the original, immutable record registered on the blockchain. An image on the internet no longer needs to be a two-dimensional box. Instead, it can take on a “Z-Axis” where all of its history and context can be discovered by third-parties, adding to its cultural and financial value.\n\n### Is there value in owning digital art? \n\n[The value of an NFT](https://twitter.com/jessewldn/status/1321447490370080769?s=20)\n\nA common critique is that because digital art and digital collectibles can be copied, they don’t carry much value. But NFTs introduce a new possibility that enables true ownership to exist while a work continues to freely circulate online.  \n \nThe more a file is shared and seen online, the more cultural value it accrues. Consider the mass production of posters and t-shirts of Warhol imagery. With increase in notoriety, the concept of owning the canonical work becomes more thrilling, and more a marker of social status. It can also drive up the value that can be derived from reselling the work should its notoriety increase after purchase. NFTs enable collectors to reap most of the benefits of owning a physical work of art, with the added bonus that their collection can be freely shared across the internet without limitation—and thus accrue more value with wider distribution.\n\nAnd its not just art. The growing universe of crypto collectibles, game assets, digital fashion, skins, and more blurs the line between art and programmed utility. More on that below. \n\n### Why collect NFTs right now? \n \nPeople collect NFTs for a number of reasons. It could be the thrill of discovering a promising new artist or artwork, the allure of a piece’s potential cultural value, the social status of owning something unique and canonical, or the prospect of turning a profit by reselling the work down the line. \n \nRight now, in NFTs (and in other crypto markets) many collect for speculative value. And like the rest of the crypto market, **NFT markets are reflexive.** Just like cryptocurrencies and traditional art, the more people who think an asset might have value—even for subjective reasons—the more real value it can typically fetch in the market. \n \nAs an example of this, the reflexivity of Bitcoin markets began as the currency bootstrapped its popularity, eventually growing in momentum from a pizza memecoin to a global reserve asset. Similarly, NFTs may start out looking like fun and games for crypto whales, but as more money flows into these markets—and as more creators mint tokens and get involved—outsiders will start to see value changing hands, and the perceived value will rise. This kind of reflexivity creates a positive feedback loop that, in many instances, helps drive an inevitable rise in market activity over time. \n \n### Longterm, where are NFTs heading?\n\n[Media Legos](https://twitter.com/jessewldn/status/1301669871789445122)\n\nComing back to utility: as with many technological hype cycles, speculative value often gives way to functional value. Because these assets are programmable and open, any developer can build on top of them. And because NFTs are user-portable, programmable assets can take on new utility across the totality of our digital world.\n\nTokens and smart contracts have been called \"money legos\" as they allow programmers to [compose and remix](https://jessewalden.com/4-eras-of-blockchain-computing-degrees-of-composability/) DeFi applications. Similarly, NFTs are \"media legos\" for developers and creators to permissionlessly remix and build new experiences around. As a result, users can look forward to richer experiences, and compounding utility around the items they own. \n\n### Is NFT adoption inevitable? \n\n[port of entry](https://twitter.com/jessewldn/status/1346470700979089414)\n\nI think NFTs will become the port of entry to all internet media **because everyone involved can make more money from the markets they enable**: \n\n**Creators** make more money by selling directly to their fans and by collecting royalties every time their NFTs are resold. This is an entirely new revenue stream that is only possible because of true digital ownership that can encode royalty logic in the media itself.\n\nFor **consumers**, NFTs are a better model because they combine the social and utilitarian benefits of patronage with the *possibility* of turning a profit or realizing compounding utility. On the web today, consumers rent access to most goods and services, including the creators they patronize. A key tenet of new Ownership Economy platforms is the incentive alignment that comes from having skin in the game. With regard to supporting creators, I've called this “[Patronage+](https://twitter.com/jessewldn/status/1355165547441303554)” where the “plus” is the possibility of earning value alongside the creators you support. This is a strong, under-explored incentive to become a patron in the first place—and I think it may drive more engaging and rewarding demand in markets for creative work.\n\n**Developers** can make money by building to enable these new markets. Wheras major platforms choke access to developer APIs and limit free market development, developers building atop permissionless infrastructure stand to step into the flow of a growing market-economy with property rights that in many ways, function more like those in the physical world.\n\n### Where are we in the NFT adoption cycle?\n\n[frenzy](https://twitter.com/jessewldn/status/1335979344225820673)\n\nThe backdrop of the 2021 crypto/everything-bull market, coupled with the internet waking up to investing as a team sport (WallStreetBets), has created the right conditions for NFT markets to enter their frenzy stage, capturing mainstream attention and serious money.\n\nMuch of it is taking place in the digital art space, but it’s also happening in burgeoning niches—including gaming world assets like [Axie Infinity](https://axieinfinity.com/), or sets of crypto collectibles like [Hashmasks](https://www.thehashmasks.com/) and [CryptoPunks](https://www.larvalabs.com/cryptopunks), or generative artworks that are programmatically created on-chain (like [this series](https://www.artblocks.io/project/5) I commissioned for Variant.) \n\n<div className=\"nft-embed\"></div>\n<script\n  async\n  src=\"https://nfte.app/api/embed.js?contract=0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270&tokenId=5000001\">\n</script>\n\nWe are also seeing new marketplaces popping up where creators can mint NFTs and connect with collectors. [Foundation](https://foundation.app) saw over $150K in sales during its first week online, including the [first Vine video ever created, which sold for $14K](https://foundation.app/dom/summer-night-77). VCs are [buying AI-generated artworks for their portfolios](https://twitter.com/NTmoney/status/1346642772397199360?s=20) (myself included.)  The decentralized blogging platform on which I am publishing this essay, [Mirror](https://mirror.xyz), recently [crowdfunded $13,000+ for an essay](https://twitter.com/viamirror/status/1359990786985766918?s=20) that was subsequently auctioned as an NFT, earning the crowdfunders royalties on their investment. \n \nThis is all happening despite the fact that it’s still fairly clunky and expensive to engage with NFTs on Ethereum. Minting a single NFT costs roughly $100 in ETH, and buying and trading incurs high transaction fees. \n\nBut 2021 is also the year major technical upgrades are set to arrive in the crypto space. Reduced transaction costs and higher throughput will help developers push NFTs into higher-volume, social territory. [Zora](https://zora.co) is heading that direction with a Tumblr-like interface where each “post” is minted as an NFT. Because these social experiences have markets baked-in, and users can make money alongside the creators they support, there are strong incentives to participate. \n \nAnd remember, these are not just collectors’ items, they are programmable assets that any developer can remix. As developers build new contexts for NFTs to live, there will be compounding demand from creators to have their work included in this emerging metaverse and for collectors to flex their ownership rights. \n\n### Wrapping up\n\nIn 2014, I started a company called [Mediachain Labs](https://twitter.com/jessewldn/status/1346490319332892674?s=20) where we were working on an open protocol called Mediachain. Our goal was to build a “[universal media library](https://github.com/mediachainlabs/canonical-content-registry)” that would do for digital media assets what Bitcoin did for digital financial assets. \n\nRoughly six years later, in a world where the early majority (10%+ of Americans) own digital currency, the infrastructure and markets for those ideas are here and now.  \n\nI’m incredibly grateful to continue to be involved with teams and communities who are building out the universal media library via NFTs. If that’s you, I'd love to [learn about what you're building](https://variant.fund/#site-footer).\n\n---\n**Update**: If you're looking to jump into the NFT space, teams are hiring engineers, creator/dev evangelists, community, product and design roles. [Get in touch](https://forms.gle/cY4vgKZj7yn9pTSA9) and I'll do my best to connect the dots!\n\nJoin the discussion on [Twitter](https://twitter.com/jessewldn/status/1361344223216340993)\n\n---\n*Thanks to [Lindsay Howard](https://twitter.com/Lindsay_Howard), [Spencer Noon](https://twitter.com/spencernoon), [Willa Koerner](https://twitter.com/willak) and [Denis Nazarov](https://twitter.com/Iiterature) for reviewing drafts of this post.*\n", "timestamp": 1613488592, "digest": "T8kdtZRIgy_srXB5B06L8vBqFHYlEBcv6ae2zR6Y_eo", "contributor": "0xe7925D190aea9279400cD9a005E33CEB9389Cc2b"}
{"id": "Wc2SoEbpQ1I54RnfvhgJFmOQC5kc5pijwRppMxXSCeo", "title": "NFTs make the internet ownable", "body": "## Why crypto is becoming the \"port of entry\" for all internet media. \n\nBefore tech, I was an artist manager in music. When I started [the firm](http://coolmanagers.com), I believed one thing about the music industry very firmly: ownership endows power. Typically, labels had ownership over the music, and thus, power over artists. \n\nOur goal was to help artists retain ownership of their work and run their business independently, using technology to reach their fans directly. Today, we’re all creators online, and ownership continues to carry a ton of weight. Yet the role of ownership on technology platforms is often overlooked.\n\nEvery day billions of images, videos, songs, and more media are shared on social media. When those files are posted, a copy of the media is taken from the creator’s device and pasted to the server of the platform distributing it—Facebook, Twitter, YouTube, TikTok and the like. \n\nThis may seem like a lightweight interaction, but when uploading, creators don’t simply copy a file—**they also copy-paste ownership of the file to the platform itself.**\n\nI’m not talking about copyright. I’m talking about the Terms of Service, which typically specify that when a file is uploaded, its ownership is shared with the platform, to monetize as they see fit. This comes with some advantages: platforms can offer distribution or economies of scale that optimize ad-based revenues. But it's no secret that today’s monetization models aren’t always aligned with the best interests of creators. And this is where the problem lies. For too long, platforms have reaped the bulk of the value from owning creators' content.\n\nMeanwhile, crypto is unlocking a different path—what I call the [Ownership Economy](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/)—where the value of platforms built by users can actually be *owned by the users directly*. \n\n[TOE](https://variant.fund/the-ownership-economy-crypto-and-consumer-software)\n\nIn media, NFTs—or Non-Fungible Tokens—make it possible for creators to retain ownership of their content, without limiting the propagation of their files across the internet. As a result, NFTs have the potential to invert the ownership model of media—offering creators, their audiences, and developers who build for them, a viable alternative to monetization.  \n\n**A simple way to think about NFTs are as files that live on the blockchain.**  This means they can't be copy-pasted, edited, deleted, or otherwise manipulated. \n\nThese guarantees stem from the same technical properties that make cryptocurrencies valuable: like Bitcoin, NFTs are digital tokens that can be bought, sold, traded, and whose ownership and provenance are always immutably tracked by the blockchain. What's yours is yours, verifiably so, and without the need for any third party to intermediate that ownership.\n\n**NFTs make it possible to own digital media assets in the same way that you can own a digital financial asset.** \n\nTo many, NFTs look like a new tech toy, a soon-to-burst bubble. And while it's true the money being spent on digital art and crypto collectibles has been fast and flashy, their utility stands in sharp relief to the way platforms enable creator monetization today.\n\nI believe we are well on our way to **NFTs becoming the \"port of entry\" for every piece of media on the internet**. This includes the 2D audio/visual and text-based work of the web today, and the emerging 3D work that will encompass the metaverse of games and virtual worlds tomorrow.\n\nWhat I believe will pull this future forward is the fact that the business model enabled by NFTs is better for every stakeholder involved—creators, their audiences, and developers can all make more money in a marketplace built around true digital ownership.\n\nTo unpack this further, I'll address some common questions I've heard about NFTs. Many of the answers below expand on tweetstorms I’ve written over the last few years.\n\n### How do NFTs work?\n\n[NFT is a file format](https://twitter.com/jessewldn/status/1321239372449153024)\n\nIn practice, an NFT is simply a unique token representing a digital file. Each has a canonical identifier, a unique ID. Hooked to that ID is arbitrary metadata, for example, who created it, what it’s about, or its price history. When an NFT is minted by a creator, this information is immutably registered on the blockchain and becomes a sort of digital passport for the work. Moving forward, anytime that piece of media is distributed on another platform, that platform can \"check its passport\" and see its entire history. This means that instances of an idea can point back to the original, immutable record registered on the blockchain. An image on the internet no longer needs to be a two-dimensional box. Instead, it can take on a “Z-Axis” where all of its history and context can be discovered by third-parties, adding to its cultural and financial value.\n\n### Is there value in owning digital art? \n\n[The value of an NFT](https://twitter.com/jessewldn/status/1321447490370080769?s=20)\n\nA common critique is that because digital art and digital collectibles can be copied, they don’t carry much value. But NFTs introduce a new possibility that enables true ownership to exist while a work continues to freely circulate online.  \n \nThe more a file is shared and seen online, the more cultural value it accrues. Consider the mass production of posters and t-shirts of Warhol imagery. With increase in notoriety, the concept of owning the canonical work becomes more thrilling, and more a marker of social status. It can also drive up the value that can be derived from reselling the work should its notoriety increase after purchase. NFTs enable collectors to reap most of the benefits of owning a physical work of art, with the added bonus that their collection can be freely shared across the internet without limitation—and thus accrue more value with wider distribution.\n\nAnd its not just art. The growing universe of crypto collectibles, game assets, digital fashion, skins, and more blurs the line between art and programmed utility. More on that below. \n\n### Why collect NFTs right now? \n \nPeople collect NFTs for a number of reasons. It could be the thrill of discovering a promising new artist or artwork, the allure of a piece’s potential cultural value, the social status of owning something unique and canonical, or the prospect of turning a profit by reselling the work down the line. \n \nRight now, in NFTs (and in other crypto markets) many collect for speculative value. And like the rest of the crypto market, **NFT markets are reflexive.** Just like cryptocurrencies and traditional art, the more people who think an asset might have value—even for subjective reasons—the more real value it can typically fetch in the market. \n \nAs an example of this, the reflexivity of Bitcoin markets began as the currency bootstrapped its popularity, eventually growing in momentum from a pizza memecoin to a global reserve asset. Similarly, NFTs may start out looking like fun and games for crypto whales, but as more money flows into these markets—and as more creators mint tokens and get involved—outsiders will start to see value changing hands, and the perceived value will rise. This kind of reflexivity creates a positive feedback loop that, in many instances, helps drive an inevitable rise in market activity over time. \n \n### Longterm, where are NFTs heading?\n\n[Media Legos](https://twitter.com/jessewldn/status/1301669871789445122)\n\nComing back to utility: as with many technological hype cycles, speculative value often gives way to functional value. Because these assets are programmable and open, any developer can build on top of them. And because NFTs are user-portable, programmable assets can take on new utility across the totality of our digital world.\n\nTokens and smart contracts have been called \"money legos\" as they allow programmers to [compose and remix](https://jessewalden.com/4-eras-of-blockchain-computing-degrees-of-composability/) DeFi applications. Similarly, NFTs are \"media legos\" for developers and creators to permissionlessly remix and build new experiences around. As a result, users can look forward to richer experiences, and compounding utility around the items they own. \n\n### Is NFT adoption inevitable? \n\n[port of entry](https://twitter.com/jessewldn/status/1346470700979089414)\n\nI think NFTs will become the port of entry to all internet media **because everyone involved can make more money from the markets they enable**: \n\n**Creators** make more money by selling directly to their fans and by collecting royalties every time their NFTs are resold. This is an entirely new revenue stream that is only possible because of true digital ownership that can encode royalty logic in the media itself.\n\nFor **consumers**, NFTs are a better model because they combine the social and utilitarian benefits of patronage with the *possibility* of turning a profit or realizing compounding utility. On the web today, consumers rent access to most goods and services, including the creators they patronize. A key tenet of new Ownership Economy platforms is the incentive alignment that comes from having skin in the game. With regard to supporting creators, I've called this “[Patronage+](https://twitter.com/jessewldn/status/1355165547441303554)” where the “plus” is the possibility of earning value alongside the creators you support. This is a strong, under-explored incentive to become a patron in the first place—and I think it may drive more engaging and rewarding demand in markets for creative work.\n\n**Developers** can make money by building to enable these new markets. Wheras major platforms choke access to developer APIs and limit free market development, developers building atop permissionless infrastructure stand to step into the flow of a growing market-economy with property rights that in many ways, function more like those in the physical world.\n\n### Where are we in the NFT adoption cycle?\n\n[frenzy](https://twitter.com/jessewldn/status/1335979344225820673)\n\nThe backdrop of the 2021 crypto/everything-bull market, coupled with the internet waking up to investing as a team sport (WallStreetBets), has created the right conditions for NFT markets to enter their frenzy stage, capturing mainstream attention and serious money.\n\nMuch of it is taking place in the digital art space, but it’s also happening in burgeoning niches—including gaming world assets like [Axie Infinity](https://axieinfinity.com/), or sets of crypto collectibles like [Hashmasks](https://www.thehashmasks.com/) and [CryptoPunks](https://www.larvalabs.com/cryptopunks), or generative artworks that are programmatically created on-chain (like [this series](https://www.artblocks.io/project/5) I commissioned for Variant.) \n\n<div className=\"nft-embed\"></div>\n<script\n  async\n  src=\"https://nfte.app/api/embed.js?contract=0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270&tokenId=5000001\">\n</script>\n\nWe are also seeing new marketplaces popping up where creators can mint NFTs and connect with collectors. [Foundation](https://foundation.app) saw over $150K in sales during its first week online, including the [first Vine video ever created, which sold for $14K](https://foundation.app/dom/summer-night-77). VCs are [buying AI-generated artworks for their portfolios](https://twitter.com/NTmoney/status/1346642772397199360?s=20) (myself included.)  The decentralized blogging platform on which I am publishing this essay, [Mirror](https://mirror.xyz), recently [crowdfunded $13,000+ for an essay](https://twitter.com/viamirror/status/1359990786985766918?s=20) that was subsequently auctioned as an NFT, earning the crowdfunders royalties on their investment. \n \nThis is all happening despite the fact that it’s still fairly clunky and expensive to engage with NFTs on Ethereum. Minting a single NFT costs roughly $100 in ETH, and buying and trading incurs high transaction fees. \n\nBut 2021 is also the year major technical upgrades are set to arrive in the crypto space. Reduced transaction costs and higher throughput will help developers push NFTs into higher-volume, social territory. [Zora](https://zora.co) is heading that direction with a Tumblr-like interface where each “post” is minted as an NFT. Because these social experiences have markets baked-in, and users can make money alongside the creators they support, there are strong incentives to participate. \n \nAnd remember, these are not just collectors’ items, they are programmable assets that any developer can remix. As developers build new contexts for NFTs to live, there will be compounding demand from creators to have their work included in this emerging metaverse and for collectors to flex their ownership rights. \n\n### Wrapping up\n\nIn 2014, I started a company called [Mediachain Labs](https://twitter.com/jessewldn/status/1346490319332892674?s=20) where we were working on an open protocol called Mediachain. Our goal was to build a “[universal media library](https://github.com/mediachainlabs/canonical-content-registry)” that would do for digital media assets what Bitcoin did for digital financial assets. \n\nRoughly six years later, in a world where the early majority (10%+ of Americans) own digital currency, the infrastructure and markets for those ideas are here and now.  \n\nI’m incredibly grateful to continue to be involved with teams and communities who are building out the universal media library via NFTs. If that’s you, I'd love to [learn about what you're building](https://variant.fund/#site-footer).\n\n---\n**Update**: If you're looking to jump into the NFT space, teams are hiring engineers, creator/dev evangelists, community, product and design roles. [Get in touch](https://forms.gle/cY4vgKZj7yn9pTSA9) and I'll do my best to connect the dots!\n\nJoin the discussion on [Twitter](https://twitter.com/jessewldn/status/1361344223216340993)\n\n---\n*Thanks to [Lindsay Howard](https://twitter.com/Lindsay_Howard), [Spencer Noon](https://twitter.com/spencernoon), [Willa Koerner](https://twitter.com/willak) and [Denis Nazarov](https://twitter.com/Iiterature) for reviewing drafts of this post.*\n", "timestamp": 1613488530, "digest": "T8kdtZRIgy_srXB5B06L8vBqFHYlEBcv6ae2zR6Y_eo", "contributor": "0xe7925D190aea9279400cD9a005E33CEB9389Cc2b"}
{"id": "xoehbDMJefMA_eBDPJVhWMMmcTxX8V7-Db9z9sK3Cek", "title": "NFTs make the internet ownable", "body": "## Why crypto is becoming the \"port of entry\" for all internet media. \n\nBefore tech, I was an artist manager in music. When I started [the firm](http://coolmanagers.com), I believed one thing about the music industry very firmly: ownership endows power. Typically, labels had ownership over the music, and thus, power over artists. \n\nOur goal was to help artists retain ownership of their work and run their business independently, using technology to reach their fans directly. Today, we’re all creators online, and ownership continues to carry a ton of weight. Yet the role of ownership on technology platforms is often overlooked.\n\nEvery day billions of images, videos, songs, and more media are shared on social media. When those files are posted, a copy of the media is taken from the creator’s device and pasted to the server of the platform distributing it—Facebook, Twitter, YouTube, TikTok and the like. \n\nThis may seem like a lightweight interaction, but when uploading, creators don’t simply copy a file—**they also copy-paste ownership of the file to the platform itself.**\n\nI’m not talking about copyright. I’m talking about the Terms of Service, which typically specify that when a file is uploaded, its ownership is shared with the platform, to monetize as they see fit. This comes with some advantages: platforms can offer distribution or economies of scale that optimize ad-based revenues. But it's no secret that today’s monetization models aren’t always aligned with the best interests of creators. And this is where the problem lies. For too long, platforms have reaped the bulk of the value from owning creators' content.\n\nMeanwhile, crypto is unlocking a different path—what I call the [Ownership Economy](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/)—a broader thesis that the next generation of internet platforms will be built, operated, and *owned by users directly*. \n\n[TOE](https://variant.fund/the-ownership-economy-crypto-and-consumer-software)\n\nIn media, NFTs—or Non-Fungible Tokens—make it possible for creators to retain ownership of their content, without limiting the propagation of their files across the internet. As a result, NFTs have the potential to invert the ownership model of media—offering creators, their audiences, and developers who build for them, a viable alternative to platform-driven monetization.  \n\n**A simple way to think about NFTs are as files that live on the blockchain.**  This means they can't be copy-pasted, edited, deleted, or otherwise manipulated. \n\nThese guarantees stem from the same technical properties that make cryptocurrencies valuable: like Bitcoin, NFTs are digital tokens that can be bought, sold, traded, and whose ownership and provenance are always immutably tracked by the blockchain. What's yours is yours, verifiably so, and without the need for any third party to intermediate that ownership.\n\n**NFTs make it possible to own digital media assets in the same way that you can own a digital financial asset.** \n\nTo many, NFTs look like a new tech toy, a soon-to-burst bubble. And while it's true the money being spent on digital art and crypto collectibles has been fast and flashy, their utility stands in sharp relief to the way platforms enable creator monetization today.\n\nI believe we are well on our way to **NFTs becoming the \"port of entry\" for every piece of media on the internet**. This includes the 2D audio/visual and text-based work of the web today, and the emerging 3D work that will encompass the metaverse of games and virtual worlds tomorrow.\n\nWhat I believe will pull this future forward is the fact that the business model enabled by NFTs is better for every stakeholder involved—creators, their audiences, and developers can all make more money in a marketplace built around true digital ownership.\n\nTo unpack this further, I'll address some common questions I've heard about NFTs. Many of the answers below expand on tweetstorms I’ve written over the last few years.\n\n### How do NFTs work?\n\n[NFT is a file format](https://twitter.com/jessewldn/status/1321239372449153024)\n\nIn practice, an NFT is simply a unique token representing a digital file. Each has a canonical identifier, a unique ID. Hooked to that ID is arbitrary metadata, for example, who created it, what it’s about, or its price history. When an NFT is minted by a creator, this information is immutably registered on the blockchain and becomes a sort of digital passport for the work. Moving forward, anytime that piece of media is distributed on another platform, that platform can \"check its passport\" and see its entire history. This means that instances of an idea can point back to the original, immutable record registered on the blockchain. An image on the internet no longer needs to be a two-dimensional box. Instead, it can take on a “Z-Axis” where all of its history and context can be discovered by third-parties, adding to its cultural and financial value.\n\n### Is there value in owning digital art? \n\n[The value of an NFT](https://twitter.com/jessewldn/status/1321447490370080769?s=20)\n\nA common critique is that because digital art and digital collectibles can be copied, they don’t carry much value. But NFTs introduce a new possibility that enables true ownership to exist while a work continues to freely circulate online.  \n \nThe more a file is shared and seen online, the more cultural value it accrues. Consider the mass production of posters and t-shirts of Warhol imagery. With increase in notoriety, the concept of owning the canonical work becomes more thrilling, and more a marker of social status. It can also drive up the value that can be derived from reselling the work should its notoriety increase after purchase. NFTs enable collectors to reap most of the benefits of owning a physical work of art, with the added bonus that their collection can be freely shared across the internet without limitation—and thus accrue more value with wider distribution.\n\nAnd its not just art. The growing universe of crypto collectibles, game assets, digital fashion, skins, and more blurs the line between art and programmed utility. More on that below. \n\n### Why collect NFTs right now? \n \nPeople collect NFTs for a number of reasons. It could be the thrill of discovering a promising new artist or artwork, the allure of a piece’s potential cultural value, the social status of owning something unique and canonical, or the prospect of turning a profit by reselling the work down the line. \n \nRight now, in NFTs (and in other crypto markets) many collect for speculative value. And like the rest of the crypto market, **NFT markets are reflexive.** Just like cryptocurrencies and traditional art, the more people who think an asset might have value—even for subjective reasons—the more real value it can typically fetch in the market. \n \nAs an example of this, the reflexivity of Bitcoin markets began as the currency bootstrapped its popularity, eventually growing in momentum from a pizza memecoin to a global reserve asset. Similarly, NFTs may start out looking like fun and games for crypto whales, but as more money flows into these markets—and as more creators mint tokens and get involved—outsiders will start to see value changing hands, and the perceived value will rise. This kind of reflexivity creates a positive feedback loop that, in many instances, helps drive an inevitable rise in market activity over time. \n \n### Longterm, where are NFTs heading?\n\n[Media Legos](https://twitter.com/jessewldn/status/1301669871789445122)\n\nComing back to utility: as with many technological hype cycles, speculative value often gives way to functional value. Because these assets are programmable and open, any developer can build on top of them. And because NFTs are user-portable, programmable assets can take on new utility across the totality of our digital world.\n\nTokens and smart contracts have been called \"money legos\" as they allow programmers to [compose and remix](https://jessewalden.com/4-eras-of-blockchain-computing-degrees-of-composability/) DeFi applications. Similarly, NFTs are \"media legos\" for developers and creators to permissionlessly remix and build new experiences around. As a result, users can look forward to richer experiences, and compounding utility around the items they own. \n\n### Is NFT adoption inevitable? \n\n[port of entry](https://twitter.com/jessewldn/status/1346470700979089414)\n\nI think NFTs will become the port of entry to all internet media **because everyone involved can make more money from the markets they enable**: \n\n**Creators** make more money by selling directly to their fans and by collecting royalties every time their NFTs are resold. This is an entirely new revenue stream that is only possible because of true digital ownership that can encode royalty logic in the media itself.\n\nFor **consumers**, NFTs are a better model because they combine the social and utilitarian benefits of patronage with the *possibility* of turning a profit or realizing compounding utility. On the web today, consumers rent access to most goods and services, including the creators they patronize. A key tenet of new Ownership Economy platforms is the incentive alignment that comes from having skin in the game. With regard to supporting creators, I've called this “[Patronage+](https://twitter.com/jessewldn/status/1355165547441303554)” where the “plus” is the possibility of earning value alongside the creators you support. This is a strong, under-explored incentive to become a patron in the first place—and I think it may drive more engaging and rewarding demand in markets for creative work.\n\n**Developers** can make money by building to enable these new markets. Wheras major platforms choke access to developer APIs and limit free market development, developers building atop permissionless infrastructure stand to step into the flow of a growing market-economy with property rights that in many ways, function more like those in the physical world.\n\n### Where are we in the NFT adoption cycle?\n\n[frenzy](https://twitter.com/jessewldn/status/1335979344225820673)\n\nThe backdrop of the 2021 crypto/everything-bull market, coupled with the internet waking up to investing as a team sport (WallStreetBets), has created the right conditions for NFT markets to enter their frenzy stage, capturing mainstream attention and serious money.\n\nMuch of it is taking place in the digital art space, but it’s also happening in burgeoning niches—including gaming world assets like [Axie Infinity](https://axieinfinity.com/), or sets of crypto collectibles like [Hashmasks](https://www.thehashmasks.com/) and [CryptoPunks](https://www.larvalabs.com/cryptopunks), or generative artworks that are programmatically created on-chain (like [this series](https://www.artblocks.io/project/5) I commissioned for Variant.) \n\n<div className=\"nft-embed\"></div>\n<script\n  async\n  src=\"https://nfte.app/api/embed.js?contract=0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270&tokenId=5000001\">\n</script>\n\nWe are also seeing new marketplaces popping up where creators can mint NFTs and connect with collectors. [Foundation](https://foundation.app) saw over $150K in sales during its first week online, including the [first Vine video ever created, which sold for $14K](https://foundation.app/dom/summer-night-77). VCs are [buying AI-generated artworks for their portfolios](https://twitter.com/NTmoney/status/1346642772397199360?s=20) (myself included.)  The decentralized blogging platform on which I am publishing this essay, [Mirror](https://mirror.xyz), recently [crowdfunded $13,000+ for an essay](https://twitter.com/viamirror/status/1359990786985766918?s=20) that was subsequently auctioned as an NFT, earning the crowdfunders royalties on their investment. \n \nThis is all happening despite the fact that it’s still fairly clunky and expensive to engage with NFTs on Ethereum. Minting a single NFT costs roughly $100 in ETH, and buying and trading incurs high transaction fees. \n\nBut 2021 is also the year major technical upgrades are set to arrive in the crypto space. Reduced transaction costs and higher throughput will help developers push NFTs into higher-volume, social territory. [Zora](https://zora.co) is heading that direction with a Tumblr-like interface where each “post” is minted as an NFT. Because these social experiences have markets baked-in, and users can make money alongside the creators they support, there are strong incentives to participate. \n \nAnd remember, these are not just collectors’ items, they are programmable assets that any developer can remix. As developers build new contexts for NFTs to live, there will be compounding demand from creators to have their work included in this emerging metaverse and for collectors to flex their ownership rights. \n\n### Wrapping up\n\nIn 2014, I started a company called [Mediachain Labs](https://twitter.com/jessewldn/status/1346490319332892674?s=20) where we were working on an open protocol called Mediachain. Our goal was to build a “[universal media library](https://github.com/mediachainlabs/canonical-content-registry)” that would do for digital media assets what Bitcoin did for digital financial assets. \n\nRoughly six years later, in a world where the early majority (10%+ of Americans) own digital currency, the infrastructure and markets for those ideas are here and now.  \n\nI’m incredibly grateful to continue to be involved with teams and communities who are building out the universal media library via NFTs. If that’s you, I'd love to [learn about what you're building](https://variant.fund/#site-footer).\n\n---\n**Update**: If you're looking to jump into the NFT space, teams are hiring engineers, creator/dev evangelists, community, product and design roles. [Get in touch](https://forms.gle/cY4vgKZj7yn9pTSA9) and I'll do my best to connect the dots!\n\nJoin the discussion on [Twitter](https://twitter.com/jessewldn/status/1361344223216340993)\n\n---\n*Thanks to [Lindsay Howard](https://twitter.com/Lindsay_Howard), [Spencer Noon](https://twitter.com/spencernoon), [Willa Koerner](https://twitter.com/willak) and [Denis Nazarov](https://twitter.com/Iiterature) for reviewing drafts of this post.*\n", "timestamp": 1613488654, "digest": "T8kdtZRIgy_srXB5B06L8vBqFHYlEBcv6ae2zR6Y_eo", "contributor": "0xe7925D190aea9279400cD9a005E33CEB9389Cc2b"}
{"id": "hPOwMwFYjKqdutxl1IvAE0yfGcidjY26kWIrFj0mjHU", "title": "NFTs make the internet ownable", "body": "## Why crypto is becoming the \"port of entry\" for all internet media. \n\nBefore tech, I was an artist manager in music. When I started [the firm](http://coolmanagers.com), I believed one thing about the music industry very firmly: ownership endows power. Typically, labels had ownership over the music, and thus, power over artists. \n\nOur goal was to help artists retain ownership of their work and run their business independently, using technology to reach their fans directly. Today, we’re all creators online, and ownership continues to carry a ton of weight. Yet the role of ownership on technology platforms is often overlooked.\n\nEvery day billions of images, videos, songs, and more media are shared on social media. When those files are posted, a copy of the media is taken from the creator’s device and pasted to the server of the platform distributing it—Facebook, Twitter, YouTube, TikTok and the like. \n\nThis may seem like a lightweight interaction, but when uploading, creators don’t simply copy a file—**they also copy-paste ownership of the file to the platform itself.**\n\nI’m not talking about copyright. I’m talking about the Terms of Service, which typically specify that when a file is uploaded, its ownership is shared with the platform, to monetize as they see fit. This comes with some advantages: platforms can offer distribution or economies of scale that optimize ad-based revenues. But it's no secret that today’s monetization models aren’t always aligned with the best interests of creators. And this is where the problem lies. For too long, platforms have reaped the bulk of the value from owning creators' content.\n\nMeanwhile, crypto is unlocking a different path—what I call the [Ownership Economy](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/)—a broader thesis that the next generation of internet platforms will be built, operated, and *owned by users directly*. \n\n[TOE](https://variant.fund/the-ownership-economy-crypto-and-consumer-software)\n\nIn media, NFTs—or Non-Fungible Tokens—make it possible for creators to retain ownership of their content, without limiting the propagation of their files across the internet. As a result, NFTs have the potential to invert the ownership model of media—offering creators, their audiences, and developers who build for them, a viable alternative to platform-driven monetization.  \n\n**A simple way to think about NFTs are as files that live on the blockchain.**  This means they can't be copy-pasted, edited, deleted, or otherwise manipulated. \n\nThese guarantees stem from the same technical properties that make cryptocurrencies valuable: like Bitcoin, NFTs are digital tokens that can be bought, sold, traded, and whose ownership and provenance are always immutably tracked by the blockchain. What's yours is yours, verifiably so, and without the need for any third party to intermediate that ownership.\n\n**NFTs make it possible to own digital media assets in the same way that you can own a digital financial asset.** \n\nTo many, NFTs look like a new tech toy, a soon-to-burst bubble. And while it's true the money being spent on digital art and crypto collectibles has been fast and flashy, their utility stands in sharp relief to the way platforms enable creator monetization today.\n\nI believe we are well on our way to **NFTs becoming the \"port of entry\" for every piece of media on the internet**. This includes the 2D audio/visual and text-based work of the web, and the emerging 3D work that will encompass the metaverse of games and virtual worlds tomorrow.\n\nWhat I believe will pull this future forward is the fact that the business model enabled by NFTs is better for every stakeholder involved: **creators, their audiences, and developers can all make more money in a marketplace built around true digital ownership.**\n\nTo unpack this further, I'll address some common questions I've heard about NFTs. Many of the answers below expand on tweetstorms I’ve written over the last few years.\n\n### How do NFTs work?\n\n[NFT is a file format](https://twitter.com/jessewldn/status/1321239372449153024)\n\nIn practice, an NFT is simply a unique token representing a digital file. Each has a canonical identifier, a unique ID. Hooked to that ID is arbitrary metadata, for example, who created it, what it’s about, or its price history. When an NFT is minted by a creator, this information is immutably registered on the blockchain and becomes a sort of digital passport for the work. Moving forward, anytime that piece of media is distributed on another platform, that platform can \"check its passport\" and see its entire history. This means that instances of an idea can point back to the original, immutable record registered on the blockchain. An image on the internet no longer needs to be a two-dimensional box. Instead, it can take on a “Z-Axis” where all of its history and context can be discovered by third-parties, adding to its cultural and financial value.\n\n### Is there value in owning digital art? \n\n[The value of an NFT](https://twitter.com/jessewldn/status/1321447490370080769?s=20)\n\nA common critique is that because digital art and digital collectibles can be copied, they don’t carry much value. But NFTs introduce a new possibility that enables true ownership to exist while a work continues to freely circulate online.  \n \nThe more a file is shared and seen online, the more cultural value it accrues. Consider the mass production of posters and t-shirts of Warhol imagery. With increase in notoriety, the concept of owning the canonical work becomes more thrilling, and more a marker of social status. It can also drive up the value that can be derived from reselling the work should its notoriety increase after purchase. NFTs enable collectors to reap most of the benefits of owning a physical work of art, with the added bonus that their collection can be freely shared across the internet without limitation—and thus accrue more value with wider distribution.\n\nAnd its not just art. The growing universe of crypto collectibles, game assets, digital fashion, skins, and more blurs the line between art and programmed utility. More on that below. \n\n### Why collect NFTs right now? \n \nPeople collect NFTs for a number of reasons. It could be the thrill of discovering a promising new artist or artwork, the allure of a piece’s potential cultural value, the social status of owning something unique and canonical, or the prospect of turning a profit by reselling the work down the line. \n \nRight now, in NFTs (and in other crypto markets) many collect for speculative value. And like the rest of the crypto market, **NFT markets are reflexive.** Just like cryptocurrencies and traditional art, the more people who think an asset might have value—even for subjective reasons—the more real value it can typically fetch in the market. \n \nAs an example of this, the reflexivity of Bitcoin markets began as the currency bootstrapped its popularity, eventually growing in momentum from a pizza memecoin to a global reserve asset. Similarly, NFTs may start out looking like fun and games for crypto whales, but as more money flows into these markets—and as more creators mint tokens and get involved—outsiders will start to see value changing hands, and the perceived value will rise. This kind of reflexivity creates a positive feedback loop that, in many instances, helps drive an inevitable rise in market activity over time. \n \n### Longterm, where are NFTs heading?\n\n[Media Legos](https://twitter.com/jessewldn/status/1301669871789445122)\n\nComing back to utility: as with many technological hype cycles, speculative value often gives way to functional value. Because these assets are programmable and open, any developer can build on top of them. And because NFTs are user-portable, programmable assets can take on new utility across the totality of our digital world.\n\nTokens and smart contracts have been called \"money legos\" as they allow programmers to [compose and remix](https://jessewalden.com/4-eras-of-blockchain-computing-degrees-of-composability/) DeFi applications. Similarly, NFTs are \"media legos\" for developers and creators to permissionlessly remix and build new experiences around. As a result, users can look forward to richer experiences, and compounding utility around the items they own. \n\n### Is NFT adoption inevitable? \n\n[port of entry](https://twitter.com/jessewldn/status/1346470700979089414)\n\nI think NFTs will become the port of entry to all internet media **because everyone involved can make more money from the markets they enable**: \n\n**Creators** make more money by selling directly to their fans and by collecting royalties every time their NFTs are resold. This is an entirely new revenue stream that is only possible because of true digital ownership that can encode royalty logic in the media itself.\n\nFor **consumers**, NFTs are a better model because they combine the social and utilitarian benefits of patronage with the *possibility* of turning a profit or realizing compounding utility. On the web today, consumers rent access to most goods and services, including the creators they patronize. A key tenet of new Ownership Economy platforms is the incentive alignment that comes from having skin in the game. With regard to supporting creators, I've called this “[Patronage+](https://twitter.com/jessewldn/status/1355165547441303554)” where the “plus” is the possibility of earning value alongside the creators you support. This is a strong, under-explored incentive to become a patron in the first place—and I think it may drive more engaging and rewarding demand in markets for creative work.\n\n**Developers** can make money by building to enable these new markets. Wheras major platforms choke access to developer APIs and limit free market development, developers building atop permissionless infrastructure stand to step into the flow of a growing market-economy with property rights that in many ways, function more like those in the physical world.\n\n### Where are we in the NFT adoption cycle?\n\n[frenzy](https://twitter.com/jessewldn/status/1335979344225820673)\n\nThe backdrop of the 2021 crypto/everything-bull market, coupled with the internet waking up to investing as a team sport (WallStreetBets), has created the right conditions for NFT markets to enter their frenzy stage, capturing mainstream attention and serious money.\n\nMuch of it is taking place in the digital art space, but it’s also happening in burgeoning niches—including gaming world assets like [Axie Infinity](https://axieinfinity.com/), or sets of crypto collectibles like [Hashmasks](https://www.thehashmasks.com/) and [CryptoPunks](https://www.larvalabs.com/cryptopunks), or generative artworks that are programmatically created on-chain (like [this series](https://www.artblocks.io/project/5) I commissioned for Variant.) \n\n<div className=\"nft-embed\"></div>\n<script\n  async\n  src=\"https://nfte.app/api/embed.js?contract=0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270&tokenId=5000001\">\n</script>\n\nWe are also seeing new marketplaces popping up where creators can mint NFTs and connect with collectors. [Foundation](https://foundation.app) saw over $150K in sales during its first week online, including the [first Vine video ever created, which sold for $14K](https://foundation.app/dom/summer-night-77). VCs are [buying AI-generated artworks for their portfolios](https://twitter.com/NTmoney/status/1346642772397199360?s=20) (myself included.)  The decentralized blogging platform on which I am publishing this essay, [Mirror](https://mirror.xyz), recently [crowdfunded $13,000+ for an essay](https://twitter.com/viamirror/status/1359990786985766918?s=20) that was subsequently auctioned as an NFT, earning the crowdfunders royalties on their investment. \n \nThis is all happening despite the fact that it’s still fairly clunky and expensive to engage with NFTs on Ethereum. Minting a single NFT costs roughly $100 in ETH, and buying and trading incurs high transaction fees. \n\nBut 2021 is also the year major technical upgrades are set to arrive in the crypto space. Reduced transaction costs and higher throughput will help developers push NFTs into higher-volume, social territory. [Zora](https://zora.co) is heading that direction with a Tumblr-like interface where each “post” is minted as an NFT. Because these social experiences have markets baked-in, and users can make money alongside the creators they support, there are strong incentives to participate. \n \nAnd remember, these are not just collectors’ items, they are programmable assets that any developer can remix. As developers build new contexts for NFTs to live, there will be compounding demand from creators to have their work included in this emerging metaverse and for collectors to flex their ownership rights. \n\n### Wrapping up\n\nIn 2014, I started a company called [Mediachain Labs](https://twitter.com/jessewldn/status/1346490319332892674?s=20) where we were working on an open protocol called Mediachain. Our goal was to build a “[universal media library](https://github.com/mediachainlabs/canonical-content-registry)” that would do for digital media assets what Bitcoin did for digital financial assets. \n\nRoughly six years later, in a world where the early majority (10%+ of Americans) own digital currency, the infrastructure and markets for those ideas are here and now.  \n\nI’m incredibly grateful to continue to be involved with teams and communities who are building out the universal media library via NFTs. If that’s you, I'd love to [learn about what you're building](https://variant.fund/#site-footer).\n\n---\n**Update**: If you're looking to jump into the NFT space, teams are hiring engineers, creator/dev evangelists, community, product and design roles. [Get in touch](https://forms.gle/cY4vgKZj7yn9pTSA9) and I'll do my best to connect the dots!\n\nJoin the discussion on [Twitter](https://twitter.com/jessewldn/status/1361344223216340993)\n\n---\n*Thanks to [Lindsay Howard](https://twitter.com/Lindsay_Howard), [Spencer Noon](https://twitter.com/spencernoon), [Willa Koerner](https://twitter.com/willak) and [Denis Nazarov](https://twitter.com/Iiterature) for reviewing drafts of this post.*\n", "timestamp": 1613488887, "digest": "T8kdtZRIgy_srXB5B06L8vBqFHYlEBcv6ae2zR6Y_eo", "contributor": "0xe7925D190aea9279400cD9a005E33CEB9389Cc2b"}
{"id": "NjA9no-kJV2J2xMbEgnqXENg8aWXUdRInNd6F-SNdeQ", "title": "NFTs make the internet ownable", "body": "## Why crypto is becoming the \"port of entry\" for all internet media. \n\nBefore tech, I was an artist manager in music. When I started [the firm](http://coolmanagers.com), I believed one thing about the music industry very firmly: ownership endows power. Typically, labels had ownership over the music, and thus, power over artists. \n\nOur goal was to help artists retain ownership of their work and run their business independently, using technology to reach their fans directly. Today, we’re all creators online, and ownership continues to carry a ton of weight. Yet the role of ownership on technology platforms is often overlooked.\n\nEvery day billions of images, videos, songs, and more media are shared on social media. When those files are posted, a copy of the media is taken from the creator’s device and pasted to the server of the platform distributing it—Facebook, Twitter, YouTube, TikTok and the like. \n\nThis may seem like a lightweight interaction, but when uploading, creators don’t simply copy a file—**they also copy-paste ownership of the file to the platform itself.**\n\nI’m not talking about copyright. I’m talking about the Terms of Service, which typically specify that when a file is uploaded, its ownership is shared with the platform, to monetize as they see fit. This comes with some advantages: platforms can offer distribution or economies of scale that optimize ad-based revenues. But it's no secret that today’s monetization models aren’t always aligned with the best interests of creators. And this is where the problem lies. For too long, platforms have reaped the bulk of the value from owning creators' content.\n\nMeanwhile, crypto is unlocking a different path—what I call the [Ownership Economy](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/)—a broader thesis that the next generation of internet platforms will be built, operated, and *owned by users directly*. \n\n[TOE](https://variant.fund/the-ownership-economy-crypto-and-consumer-software)\n\nIn media, NFTs—or Non-Fungible Tokens—make it possible for creators to retain ownership of their content, without limiting the propagation of their files across the internet. As a result, NFTs have the potential to invert the ownership model of media—offering creators, their audiences, and developers who build for them, a viable alternative to platform-driven monetization.  \n\n**A simple way to think about NFTs are as files that live on the blockchain.**  This means they can't be copy-pasted, edited, deleted, or otherwise manipulated. \n\nThese guarantees stem from the same technical properties that make cryptocurrencies valuable: like Bitcoin, NFTs are digital tokens that can be bought, sold, traded, and whose ownership and provenance are always immutably tracked by the blockchain. What's yours is yours, verifiably so, and without the need for any third party to intermediate that ownership.\n\n**NFTs make it possible to own digital media assets in the same way that you can own a digital financial asset.** \n\nTo many, NFTs look like a new tech toy, a soon-to-burst bubble. And while it's true the money being spent on digital art and crypto collectibles has been fast and flashy, their utility stands in sharp relief to the way platforms enable creator monetization today.\n\nI believe we are well on our way to **NFTs becoming the \"port of entry\" for every piece of media on the internet**. This includes the 2D audio/visual and text-based work of the web, and the emerging 3D work that will encompass the metaverse of games and virtual worlds tomorrow.\n\nWhat I believe will pull this future forward is the fact that the business model enabled by NFTs is better for every stakeholder involved—creators, their audiences, and developers can all make more money in a marketplace built around true digital ownership.\n\nTo unpack this further, I'll address some common questions I've heard about NFTs. Many of the answers below expand on tweetstorms I’ve written over the last few years.\n\n### How do NFTs work?\n\n[NFT is a file format](https://twitter.com/jessewldn/status/1321239372449153024)\n\nIn practice, an NFT is simply a unique token representing a digital file. Each has a canonical identifier, a unique ID. Hooked to that ID is arbitrary metadata, for example, who created it, what it’s about, or its price history. When an NFT is minted by a creator, this information is immutably registered on the blockchain and becomes a sort of digital passport for the work. Moving forward, anytime that piece of media is distributed on another platform, that platform can \"check its passport\" and see its entire history. This means that instances of an idea can point back to the original, immutable record registered on the blockchain. An image on the internet no longer needs to be a two-dimensional box. Instead, it can take on a “Z-Axis” where all of its history and context can be discovered by third-parties, adding to its cultural and financial value.\n\n### Is there value in owning digital art? \n\n[The value of an NFT](https://twitter.com/jessewldn/status/1321447490370080769?s=20)\n\nA common critique is that because digital art and digital collectibles can be copied, they don’t carry much value. But NFTs introduce a new possibility that enables true ownership to exist while a work continues to freely circulate online.  \n \nThe more a file is shared and seen online, the more cultural value it accrues. Consider the mass production of posters and t-shirts of Warhol imagery. With increase in notoriety, the concept of owning the canonical work becomes more thrilling, and more a marker of social status. It can also drive up the value that can be derived from reselling the work should its notoriety increase after purchase. NFTs enable collectors to reap most of the benefits of owning a physical work of art, with the added bonus that their collection can be freely shared across the internet without limitation—and thus accrue more value with wider distribution.\n\nAnd its not just art. The growing universe of crypto collectibles, game assets, digital fashion, skins, and more blurs the line between art and programmed utility. More on that below. \n\n### Why collect NFTs right now? \n \nPeople collect NFTs for a number of reasons. It could be the thrill of discovering a promising new artist or artwork, the allure of a piece’s potential cultural value, the social status of owning something unique and canonical, or the prospect of turning a profit by reselling the work down the line. \n \nRight now, in NFTs (and in other crypto markets) many collect for speculative value. And like the rest of the crypto market, **NFT markets are reflexive.** Just like cryptocurrencies and traditional art, the more people who think an asset might have value—even for subjective reasons—the more real value it can typically fetch in the market. \n \nAs an example of this, the reflexivity of Bitcoin markets began as the currency bootstrapped its popularity, eventually growing in momentum from a pizza memecoin to a global reserve asset. Similarly, NFTs may start out looking like fun and games for crypto whales, but as more money flows into these markets—and as more creators mint tokens and get involved—outsiders will start to see value changing hands, and the perceived value will rise. This kind of reflexivity creates a positive feedback loop that, in many instances, helps drive an inevitable rise in market activity over time. \n \n### Longterm, where are NFTs heading?\n\n[Media Legos](https://twitter.com/jessewldn/status/1301669871789445122)\n\nComing back to utility: as with many technological hype cycles, speculative value often gives way to functional value. Because these assets are programmable and open, any developer can build on top of them. And because NFTs are user-portable, programmable assets can take on new utility across the totality of our digital world.\n\nTokens and smart contracts have been called \"money legos\" as they allow programmers to [compose and remix](https://jessewalden.com/4-eras-of-blockchain-computing-degrees-of-composability/) DeFi applications. Similarly, NFTs are \"media legos\" for developers and creators to permissionlessly remix and build new experiences around. As a result, users can look forward to richer experiences, and compounding utility around the items they own. \n\n### Is NFT adoption inevitable? \n\n[port of entry](https://twitter.com/jessewldn/status/1346470700979089414)\n\nI think NFTs will become the port of entry to all internet media **because everyone involved can make more money from the markets they enable**: \n\n**Creators** make more money by selling directly to their fans and by collecting royalties every time their NFTs are resold. This is an entirely new revenue stream that is only possible because of true digital ownership that can encode royalty logic in the media itself.\n\nFor **consumers**, NFTs are a better model because they combine the social and utilitarian benefits of patronage with the *possibility* of turning a profit or realizing compounding utility. On the web today, consumers rent access to most goods and services, including the creators they patronize. A key tenet of new Ownership Economy platforms is the incentive alignment that comes from having skin in the game. With regard to supporting creators, I've called this “[Patronage+](https://twitter.com/jessewldn/status/1355165547441303554)” where the “plus” is the possibility of earning value alongside the creators you support. This is a strong, under-explored incentive to become a patron in the first place—and I think it may drive more engaging and rewarding demand in markets for creative work.\n\n**Developers** can make money by building to enable these new markets. Wheras major platforms choke access to developer APIs and limit free market development, developers building atop permissionless infrastructure stand to step into the flow of a growing market-economy with property rights that in many ways, function more like those in the physical world.\n\n### Where are we in the NFT adoption cycle?\n\n[frenzy](https://twitter.com/jessewldn/status/1335979344225820673)\n\nThe backdrop of the 2021 crypto/everything-bull market, coupled with the internet waking up to investing as a team sport (WallStreetBets), has created the right conditions for NFT markets to enter their frenzy stage, capturing mainstream attention and serious money.\n\nMuch of it is taking place in the digital art space, but it’s also happening in burgeoning niches—including gaming world assets like [Axie Infinity](https://axieinfinity.com/), or sets of crypto collectibles like [Hashmasks](https://www.thehashmasks.com/) and [CryptoPunks](https://www.larvalabs.com/cryptopunks), or generative artworks that are programmatically created on-chain (like [this series](https://www.artblocks.io/project/5) I commissioned for Variant.) \n\n<div className=\"nft-embed\"></div>\n<script\n  async\n  src=\"https://nfte.app/api/embed.js?contract=0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270&tokenId=5000001\">\n</script>\n\nWe are also seeing new marketplaces popping up where creators can mint NFTs and connect with collectors. [Foundation](https://foundation.app) saw over $150K in sales during its first week online, including the [first Vine video ever created, which sold for $14K](https://foundation.app/dom/summer-night-77). VCs are [buying AI-generated artworks for their portfolios](https://twitter.com/NTmoney/status/1346642772397199360?s=20) (myself included.)  The decentralized blogging platform on which I am publishing this essay, [Mirror](https://mirror.xyz), recently [crowdfunded $13,000+ for an essay](https://twitter.com/viamirror/status/1359990786985766918?s=20) that was subsequently auctioned as an NFT, earning the crowdfunders royalties on their investment. \n \nThis is all happening despite the fact that it’s still fairly clunky and expensive to engage with NFTs on Ethereum. Minting a single NFT costs roughly $100 in ETH, and buying and trading incurs high transaction fees. \n\nBut 2021 is also the year major technical upgrades are set to arrive in the crypto space. Reduced transaction costs and higher throughput will help developers push NFTs into higher-volume, social territory. [Zora](https://zora.co) is heading that direction with a Tumblr-like interface where each “post” is minted as an NFT. Because these social experiences have markets baked-in, and users can make money alongside the creators they support, there are strong incentives to participate. \n \nAnd remember, these are not just collectors’ items, they are programmable assets that any developer can remix. As developers build new contexts for NFTs to live, there will be compounding demand from creators to have their work included in this emerging metaverse and for collectors to flex their ownership rights. \n\n### Wrapping up\n\nIn 2014, I started a company called [Mediachain Labs](https://twitter.com/jessewldn/status/1346490319332892674?s=20) where we were working on an open protocol called Mediachain. Our goal was to build a “[universal media library](https://github.com/mediachainlabs/canonical-content-registry)” that would do for digital media assets what Bitcoin did for digital financial assets. \n\nRoughly six years later, in a world where the early majority (10%+ of Americans) own digital currency, the infrastructure and markets for those ideas are here and now.  \n\nI’m incredibly grateful to continue to be involved with teams and communities who are building out the universal media library via NFTs. If that’s you, I'd love to [learn about what you're building](https://variant.fund/#site-footer).\n\n---\n**Update**: If you're looking to jump into the NFT space, teams are hiring engineers, creator/dev evangelists, community, product and design roles. [Get in touch](https://forms.gle/cY4vgKZj7yn9pTSA9) and I'll do my best to connect the dots!\n\nJoin the discussion on [Twitter](https://twitter.com/jessewldn/status/1361344223216340993)\n\n---\n*Thanks to [Lindsay Howard](https://twitter.com/Lindsay_Howard), [Spencer Noon](https://twitter.com/spencernoon), [Willa Koerner](https://twitter.com/willak) and [Denis Nazarov](https://twitter.com/Iiterature) for reviewing drafts of this post.*\n", "timestamp": 1613488839, "digest": "T8kdtZRIgy_srXB5B06L8vBqFHYlEBcv6ae2zR6Y_eo", "contributor": "0xe7925D190aea9279400cD9a005E33CEB9389Cc2b"}
{"id": "ZCy9BUphgboEmENBcYLX3Huj7YeAzTjt7tPXPGXgqOg", "title": "Using an Ethereum NFT to Crowdfund my Writing", "body": "I'm really excited to be trying something new this week: using crypto to crowdfund the next essay I'm writing, titled 'Scissor Labels.'\n\nInstead of publishing my work for free, or putting it behind a paywall, I'm doing something in between: raising funds to produce a new essay in exchange for ownership of the work. This will allow me to devote my full time to writing the piece, while allowing it to exist as a public good for anyone to read.\n\nBelow is Mirror's new [Crowdfunding Block](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ), which contains everything you need to know about backing this project. The crowdfund will go live on **Thursday, January 28th at 12pm PT**.\n\n[Scissor Essay](crowdfund://0x517bab7661C315C63C6465EEd1b4248e6f7FE183?softCap=2&endsAt=1612468800)\n\nUnlike other patronage models, this form of crowdfunding is not pure altruism. Instead, patrons receive a stake in the success of the work. Here's how it works:\n\n1. The essay exists as permanent, public data published via Mirror.\n2. That essay is minted as an NFT on the new [Zora protocol](https://cryptomedia.wtf/).\n3. Backers can send ETH to the crowdfund in exchange for $ESSAY tokens.\n4. When the NFT is sold, the ETH in the contract increases\n5. $ESSAY tokens can be bought and sold like any other ERC-20 token, or redeemed for underlying ETH.\n6. Participants in the initial crowdfund will be embedded in the essay forever, as the supporters who made it possible.\n\nBelow is the link where the essay will live, which currently contains only an abstract of the planned contents.\n\n[](https://j.mirror.xyz/RUeJfZEZxr-hkuzUCakQyUuf2kOJVMPPiAWBaQFhhqc)\n\n### Inspiration\nOver the past couple years, paid writing has made great strides, with Substack popularizing newsletter subscriptions as the dominant business model for writing online. However, the paid newsletter model only works for a certain kind of writing - something regular, consistent, and often a bit shorter.\n\nWhile newsletters are great for many reasons, we also need other business models for writing. Some of the greatest thinkers around are primarily dedicated to something besides publishing their ideas on a regular cadence, and therefore won't be found starting a weekly newsletter. Even those who *are* dedicated to writing often produce their best work after weeks or months of research, not by writing a new piece every few days. Unfortunately, these kinds of writers face a tough choice today: adapt their work to a newsletter format, or write without being paid.\n\nEven for writers running successful newsletters, there's an inherent tradeoff in the subscription format: in order to monetize their content, writers must hide some, if not all of their work, behind a paywall, reserved for those who pay to subscribe. With each new piece is a choice between rewarding those who pay and sharing ideas widely.\n\nThe tools we have at our disposal influence the kind of work we create, and when the only tool around for getting paid to write is a newsletter publisher, it's no wonder we see more and more newsletters, and less of everything else.\n\nOther formats and styles of writing are obviously valuable and worth paying for, and for this reason alone it's worth experimenting with new funding models. I believe that these issues can be solved if we can introduce effective new business models for writing.\n\nThis week, in an attempt to move towards that goal, I'm pursuing my own writing under the new crowdfunding model described above. This model has been on my mind for awhile, and I'm really curious to see if it's possible.\n\nIf my funding goal is hit, the piece will be published publicly, free for everyone to read and share, while those who funded it hold ownership. If the funding goal isn't hit, everyone will receive their money back.\n\n![](https://images.mirror-media.xyz/publication-images/7d42a4b3-363c-4b13-b7f3-592d3b9cb6c1.jpeg?height=1340&width=2400)\n\nThough not proven, I believe this model can can solve both of the problems mentioned above:\n\n1. It offers a path to being paid for a one-off work that's not part of a subscription or newsletter.\n2. It offers a way to monetize work that remains a public good, without a paywall.\n\nIf this experiment is a success, it will mark an early promising sign for a new way to fund not just writing, but all kinds of creative work.\n\nThat all being said, I hope you'll stick around to fund, share, or at least observe as we try something new. Some additional information about me is below.\n\n### About Me\nI’m a product designer and software engineer, mostly involved in helping early stage startups design and grow products in interesting markets. I started my career as a software engineer at Snapchat, then founded a startup, which went through Y Combinator in 2018. Since then, I've worked as a designer and consultant for several startups and investors, including WorkOS, Muze, a16z Crypto, and Y Combinator, where I help out part-time with admissions. You can find me on Twitter [here](https://twitter.com/john_c_palmer).\n\nI typically write 1-2 longer essays each year, most often concerning new insights around startup strategy and product design. Among them, my [Spatial Software](https://darkblueheaven.com/spatialsoftware/) post from last year was probably the most popular, describing a wave of new products being built around game-like interfaces and what makes them unique.", "timestamp": 1613510322, "digest": "OgVaYso25gEqxn7N4RyPnPbMO9pbNQJZQKEUvV9pxv8", "contributor": "0xB0623C91c65621df716aB8aFE5f66656B21A9108"}
{"id": "7xtVr_P8o6QLWmkYYqDBEudpfTC4FeWPP5-uiRFAZ10", "title": "Scissor Labels", "body": "> We live in an age of constant narrative conflict. But today, not every battle is legible to the untrained observer. While some grifts are plainly perpetrated by would-be thought leaders, other battles for narrative control are hiding in plain sight, happening under the guise of intellectual debate. When these battles go unrecognized for what they are, even the best among us fall victim to meaningless conversations that waste the time of those involved. In this piece, I introduce the concept of \"scissor labels,\" why they foment controversy, and how they're different from other linguistic debates. I then suggest how to engage with this phenomenon with a more fruitful, future-oriented mindset.\n\n![](https://images.mirror-media.xyz/publication-images/6839dc60-67a9-40e9-b685-4ab6fa084886.jpeg?height=1340&width=2400)\n\n### What the fuck is Hyperpop?\nA specific shape of online debate caught my attention in 2020. As I've reflected on the past year, I've realized that this pattern is happening frequently but is rarely understood.\n\nA standout example from 2020 was the rise of \"Hyperpop.\" The term came about to describe a particular musical aesthetic associated with artists like A.G. Cook and SOPHIE, and gained momentum over the past couple years, reaching a peak sometime in early 2020.\n\nThe musical landscape of Hyperpop is interesting on its own, but equally powerful is the divisive power of the word itself.\n\nLast year, the term served as a centralizing idea around which an entire movement built momentum. In this way, Hyperpop as a label possessed immense generative power, identifying a widely recognized trend, and providing a singular phrase around which a subculture for associated sounds and artists could congregate.\n\nBut what exactly Hyperpop is, no one has fully agreed on. If you ask around, you won't find a canonical definition for Hyperpop. Laura Les of 100 gecs, on [The Pitchfork Review](https://open.spotify.com/episode/3R8H2UdIfdPiNluvfVX1K7?si=oKyjwGdnQPCeIQteWd61Hw), said \"Everybody draws the line in the sand at a different point\" (22:40). Eli Enis from [Vice](https://www.vice.com/en/article/bvx85v/this-is-hyperpop-a-genre-tag-for-genre-less-music) calls it \"a genre tag for distinctly genre-less music.\" This sense of ambiguity is what makes Hyperpop so divisive. Though the term initially served as a cultural magnet for a range of musicians and fans, its definition quickly became the object of repetitive debates.\n\n![Meme by u/hihiyo](https://images.mirror-media.xyz/publication-images/3d3622e9-80ef-45f9-91b9-b20acd5cea85.jpeg?height=907&width=1319)\n\nOnce the term reached a peak in popularity (likely around 100 gecs' takeover of Spotify's Hyperpop playlist in July 2020), it was most often heard in discussions about what does or doesn't *count* as being Hyperpop. This kind of binary categorization annoyed most people familiar with the term, including the very artists responsible for its popularity. But as we enter the new year, what counts as Hyperpop is still being debated.\n\nIn isolation, this dialogue feels unique to 2020. But what's happening with Hyperpop isn't a one-off. It's just one instance of a cultural phenomenon that's been happening for a long time, whenever a similar label comes about.\n\n### Scissor labels\nHyperpop is an example of what I'm calling a \"scissor label,\" loosely based on Scott Alexander's \"[scissor statement](https://slatestarcodex.com/2018/10/30/sort-by-controversial/).\" While his original term, scissor statements, are truth claims engineered to create dissent, **scissor labels are categorical terms that happen to be maximally divisive.**\n\nA **scissor label** is a word or phrase that, for the first time, establishes a widely embraced name for a trend without simultaneously establishing a canonical definition. It is a vague term masquerading as a specific one, where the missing definition is still up for grabs. Scissor labels aren't coined or engineered, nor formally initiated by an institution. Rather, they're discovered by accident, suddenly adopted en masse amidst a trend that's already in motion.\n\nOnce a scissor label is established, controlling its definition means controlling whatever the trend represents. A scissor label therefore represents the battleground for a power struggle. By nature, scissor labels have a peculiar divisive power, building energy and momentum around a trend while simultaneously bringing about controversy and debate.\n\nScissor labels trap even the most savvy cultural observer by disguising one type of conflict as another. At first glance, the debates around a term like Hyperpop come about due to the ambiguity of the word itself. It's unsurprising that people argue over the meaning of a category when its definition is unclear, and everyone has their own preconceived idea of what it is. But that doesn't explain why these debates continue for so long, or why they're so intense. Seen clearly, a conflict over the correct definition of a particular scissor label is just a distraction from what's actually going on.\n\nDebates around scissor labels become so intense and perpetuate for so long because of one primary reason: there is something valuable at stake. The label is a narrative up for grabs, and controlling the narrative is a form of power.\n\n### Narratives and incentives\nAnyone who spends time on Twitter is familiar with the idea of popular narratives as an organizing force for online subcultures. Being part of a widely known trend offers legitimization, and an entire ecosystem has evolved for manufacturing, growing, and then utilizing narratives to fulfill the agenda of those involved. Toby Shorin alludes to this below.\n\n[](https://twitter.com/tobyshorin/status/1309130086713634816?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed&ref_url=notion%3A%2F%2Fwww.notion.so%2FScissor-Labels-Draft-V5-Dave-94a0f85885764aaea9fa3edc30b66e3f)\n\nWe're living in a time where this narrative environment has matured quite a bit. Jockeying for narrative control happens everywhere, and semiotic land grabs are a significant part of the ecosystem. On tech Twitter, we see people peddling narratives like the future of communities, the creator economy, tools for thought, and the no-code \"movement.\" Oftentimes, these people are simply performing land grabs of their own, hoping to claim more and more territory within the narrative they deem powerful. Once someone has established a strong position in this fashion, they can use their voice both to influence others and to legitimize other people and organizations, whether or not those entities are worthy of legitimization.\n\nLuckily, this territory is well mapped by cultural observers. I assume most of my readers are aware of, and therefore immune to this kind of thing, and are not whole-heartedly buying into someone else's grift.\n\nYet when it comes to scissor labels, where the battle for narrative control is disguised as intellectual conversation, few can resist the pull of the debate.\n\nA more legible example emerged around some of my own work in April last year, when I published my second essay on [spatial software](https://darkblueheaven.com/spatialsoftware/). The piece was mainly design exploration, describing different kinds of applications built around 3D space and real-world metaphors. I speculated that game-like applications would make their way into every niche of software, not just video games. What drew me to the topic was a sense of curiosity and play. This kind of software is *fun to use*, and I've continued to explore it through that lens.\n\nHowever, soon after I published the piece, I noticed more and more founders and investors on Twitter announcing their own new spatial software apps. The term itself received more attention than any of the ideas in the piece, and notably, many of the spatial products being announced were not what I considered spatial software at all, despite my inclusion of clear definitions and descriptions in the original essay. The term took on a life of its own and became the object of mimetic competition between many participants in the Startup Twitter timeline.\n\nThis experience put the scissor label concept on my radar. Like Hyperpop, people started to debate \"spatial software\" publicly, questioning what was and wasn't spatial *enough* to justify use of the term. Within our chat server, a group of my own friends found ourselves in several conversations about the definition of spatial software that ended up leading nowhere, including one animated disagreement on the topic.\n\n![](https://images.mirror-media.xyz/publication-images/ef3d917a-666b-40d5-9505-b780cad82b7b.jpeg?height=2182&width=2922)\n\nBy every indication, \"spatial software\" is another scissor label, and it's a clear example that illustrates how these debates are more about incentives than intellectual truth-seeking: In a world where companies are funded based on whether or not they fit into the narratives that venture capitalists have bought into, being part of the spatial software narrative can determine a lot for an early stage startup. For a company hoping to raise capital, recruit employees, or even gain early user adoption, the founders have everything to gain by making sure the definition of spatial software includes their own app. Whether consciously or unconsciously, this is the motivational context for how these people engage with the term.\n\nIn the case of Hyperpop, different specifics are at play. Like any other trend, all of the same dynamics around legitimization are present: for an artist making new music, being labeled as Hyperpop means association with something new and exciting, and ultimately, the chance to gain a meaningful following. Laura Les and Dylan Brady of 100 gecs discussed this on the Pitchfork Review, including that they wanted to use their curation of Spotify's Hyperpop playlist to help lesser-known artists get more exposure. Laura mentioned this at 33:50:\n\n> It's this word that doesn't mean anything, but it does have power. It's like a symbol that you can be like, \"Hey check this out this is Hyperpop.\" And people will be like \"Hey I'm gonna listen to that.\"\n\nand\n\n> \"At its best, it produces a way for artists who might go unappreciated to be appreciated...who might not fit under a definition super well to have an audience and a community of people.\"\n\nBut with Hyperpop, there's something more important at stake than just popularity: preserving a special community. Long before the term's sudden rise, the Hyperpop genre grew around a strong community, one that skews young, and where a lot of the best known artists are queer or trans. This became a uniquely welcoming space for musicians and fans alike. For this reason, debates around Hyperpop are not just about definitions - they're inherently about fighting to protect and maintain a culture. For many, this is of even greater significance than the term's impact on an artist's visibility. This was most obvious last summer, when Youtuber pewdiepie revealed that his Recently Played playlist on Spotify included several Hyperpop artists, who promptly asked him and his millions of fans to stop listening.\n\nUnderstanding what's at stake here reveals why the conversations around what is and isn't Hyperpop are never ending. Its definition can change for purely cultural reasons, adapting in order to preserve the existing scene. An artist's music may have all the markings of the Hyperpop sound, but if they aren't aligned with the values of the culture, their music can be excluded from the genre. When people argue over what is and isn't Hyperpop, the conflict is not just about the definition of the word, but about preserving what it stands for. This kind of debate won't end as long as there's a community worth defending.\n\n### Other examples\nHyperpop and spatial software aren't rare examples, just the ones I noticed popping up in my field of view last year. Today, other terms like “digital objects\" and \"decentralization\" are spurring similar conversations.\n\nPlenty more scissor labels from the past come to mind once the concept is familiar. In his [interview with Charlie Rose](https://youtu.be/GopJ1x7vK2Q?t=390) (6:30), David Foster Wallace describes the popularity of David Lynch in the grad school environment he was part of, and dives into what is and isn't \"Lynchian.\" In [his article](http://www.lynchnet.com/lh/lhpremiere.html) for Premiere on the subject, he writes: \"...like postmodern or pornographic, Lynchian is one of those Porter Stewart-type words that's ultimately definable only ostensively-i.e., we know it when we see it.\"\n\nIn their own time, words like \"normcore,\" \"hipster,\" and \"vaporwave\" were scissor labels as well. When I think of all these terms, I remember the arguments that happened around them, but I don't remember any of them being particularly edifying. The details have faded in my memory, and the only impression I have is that we debated these terms for no reason other than that the term was trendy, and some cultural cache was at stake.\n\nPeople aren't debating these topics in the same way today, but that just reveals a corollary to the scissor label definition: Scissor labels are only scissor labels as long as something is at stake. When their definitions fade in importance, scissor labels become categorical terms like any other, but with a cheap feeling left behind that makes it hard to take them seriously. This is the mark of scissor labels from the past.\n\n### Recognizing and engaging in scissor label conversations\nRecognizing and successfully navigating this phenomenon is no longer optional for those meaningfully involved in any online subculture. It's necessary to have an understanding of when to participate in these discussions and how to do so productively.\n\nIn order to do so, the first step is being able to recognize a scissor label conversation as it's happening. The telltale sign of such a conversation is that it's rooted in a strictly binary orientation, primarily about what *is* or *isn't* part of trend X. When this happens, X is most likely a scissor label, and the answer likely isn't binary.\n\nThese conversations build upon themselves, and most people involved jump in immediately, without realizing the incentives behind the scene. They believe their definition is the right one, rather than an interpretation of a trend, and fight accordingly.\n\nWhen we find ourselves in this kind of situation, the first thing to know is that it's a case-by-case decision whether it's worth getting involved at all. But when we do decide to engage with scissor labels, we might as well cut through these dynamics and get to the root of the matter.\n\nTo do so, we must make two main moves. First, we need to identify what's at stake in the discussion, ignoring binary questions and identifying what people are really debating. We can then bring this to the forefront of the conversation instead of debating the scissor label as a proxy. In the case that the scissor label is purely a stand-in for something else, this presents the opportunity for everyone to shift away from a pointless discussion and towards the thing they were really discussing all along.\n\nIf the scissor label's definition is actually of import, we can make a second move: to cut the binary nature of the discussion and introduce a spectrum, or subcategories within the label. This shifts the conversation towards a much more curious place, focused on getting to know the rough topology and boundaries of the label instead of fighting over one definition. This isn't just more accommodating, but often more accurate to the ideas a label describes.\n\nThis is the playbook for engaging with scissor labels productively, but honestly, most of the time, this strategy just isn't worth it. This is because there's a much greater opportunity behind each scissor label, and no matter how strategically one approaches the debate, getting too caught up in these conversations means missing out on that opportunity.\n\n### Future orientation\nThis core reality remains: Scissor labels pop up when something exciting has emerged organically, recognized by everyone who sees it. Though much else may be at stake as a result of its popularity, a scissor label most often has its origin in something honest, artistic, and interesting.\n\nIf we want the ideas that inspire us to evolve instead of turning into cheap fads from the past, we need more people who are unambiguously oriented towards the future, and not stuck debating the present moment. These people, like SOPHIE, remain focused on the same spark that preceded a scissor label's existence — even after a scissor label comes about — and keep pushing it towards the future. They pursue the thing for its own sake, not for clout or success. In doing so, they reinvent a category over and over again. They don't just ponder or debate the scissor label, but influence it through their own work, intuiting that the category itself is dynamic, and shaped by those who keep creating. They too may recognize the scissor label debate for what it is, but they don't have time to get stuck arguing over what's here today; there's always something more exciting in the future.\n\nWhen we get caught up in land grabs, labels, and grifts, we anchor ourselves to the present and miss out on the chance to create what comes next. Though every scissor label needs more people to bring clarity into these conversations, the greater opportunity is often found in this future-oriented approach. Now more than ever, let's recognize this phenomenon and engage only when we need to. As much as possible, let's seek out the exciting idea behind each scissor label and carry that thing forward. Not because we want to win, but because doing so is worth it - for its own sake.\n\n---\n\n#### Closing Note\nTwo weeks ago, Hyperpop lost one of its most pioneering artists, SOPHIE, whose music pushed the boundaries of pop over and over again. I hope this piece has done justice to SOPHIE's work, and that it might encourage more of the same.\n\n#### Special thanks\nThank you to [Toby Shorin](https://twitter.com/tobyshorin), [Kara Kittel](https://twitter.com/karakittel), [Aaron Z. Lewis](https://twitter.com/aaronzlewis), and the rest of [Other Internet](https://otherinter.net/) peer review for helping me with this piece.\n#### About me\nI’m a product designer and software engineer, mostly involved in designing and growing products in interesting markets. These days, I'm mostly interested in [spatial software](https://darkblueheaven.com/spatialsoftware/) and crypto.\n\nI started my career as a software engineer at Snapchat, then founded a startup, which went through Y Combinator in 2018. Since then, I've worked as a designer and consultant for several startups and investors, including Mirror, Muze, a16z Crypto, and Y Combinator, where I help out part-time with admissions. You can find me on [Twitter](https://twitter.com/john_c_palmer) or subscribe to my posts on my [blog](https://darkblueheaven.com/).\n\n#### Backers\nThank you to the 63 backers who crowdfunded this essay. Your support really changed the piece.\n\n[Scissor Essay](crowdfund://0x517bab7661C315C63C6465EEd1b4248e6f7FE183?softCap=2&endsAt=1612468800)", "timestamp": 1613510370, "digest": "RUeJfZEZxr-hkuzUCakQyUuf2kOJVMPPiAWBaQFhhqc", "contributor": "0xB0623C91c65621df716aB8aFE5f66656B21A9108"}
{"id": "D805OWIMUHXZrG7uLkK36aKKBNEjVAeT-inq4IsSIZQ", "title": "Crowdfund: $ESSAY", "body": "A new experiment begins today: using crypto to crowdfund the next essay I'm writing, titled [Scissor Labels](https://j.mirror.xyz/RUeJfZEZxr-hkuzUCakQyUuf2kOJVMPPiAWBaQFhhqc).\n\nInstead of publishing my work for free, or putting it behind a paywall, I'm doing something in between: raising funds to produce a new essay in exchange for ownership of the work. This will allow me to devote my full time to writing the piece, while allowing it to exist as a public good for anyone to read. **The crowdfund is now live**, and will stay open for one week, or until the cap is hit.\n\n\n[Scissor Essay](crowdfund://0x517bab7661C315C63C6465EEd1b4248e6f7FE183?softCap=2&endsAt=1612468800)\n\n![](https://images.mirror-media.xyz/publication-images/70da6b7c-f699-4cf8-896e-02bdc272a70b.jpeg?height=1340&width=2400)\n\nUnlike other patronage models, this form of crowdfunding is not pure altruism. Instead, patrons receive a stake in the success of the work. Here's how it works:\n1. The essay exists as permanent, public data published via Mirror.\n2. That essay is minted as an NFT on the new [Zora protocol](https://zora.engineering/).\n3. Backers can send ETH to the crowdfund in exchange for $ESSAY tokens.\n4. When the NFT is sold, the ETH in the contract increases\n5. $ESSAY tokens can be bought and sold like any other ERC-20 token, or redeemed for underlying ETH.\n6. Participants in the initial crowdfund will be embedded in the essay forever, as the supporters who made it possible.\n\n### Inspiration\nOver the past couple years, paid writing has made great strides, with Substack popularizing newsletter subscriptions as the dominant business model for writing online. However, the paid newsletter model only works for a certain kind of writing - something regular, consistent, and often a bit shorter.\n\nWhile newsletters are great for many reasons, we also need other business models for writing. Some of the greatest thinkers around are primarily dedicated to something besides publishing their ideas on a regular cadence, and therefore won't be found starting a weekly newsletter. Even those who *are* dedicated to writing often produce their best work after weeks or months of research, not by writing a new piece every few days. Unfortunately, these kinds of writers face a tough choice today: adapt their work to a newsletter format, or write without being paid.\n\nEven for writers running successful newsletters, there's an inherent tradeoff in the subscription format: in order to monetize their content, writers must hide some, if not all of their work, behind a paywall, reserved for those who pay to subscribe. With each new piece is a choice between rewarding those who pay and sharing ideas widely.\n\nThe tools we have at our disposal influence the kind of work we create, and when the only tool around for getting paid to write is a newsletter publisher, it's no wonder we see more and more newsletters, and less of everything else.\n\nOther formats and styles of writing are obviously valuable and worth paying for, and for this reason alone it's worth experimenting with new funding models. I believe that these issues can be solved if we can introduce effective new business models for writing.\n\nThis week, in an attempt to move towards that goal, I'm pursuing my own writing under the new crowdfunding model described above. This model has been on my mind for awhile, and I'm really curious to see if it's possible.\n\nIf my funding goal is hit, the piece will be published publicly, free for everyone to read and share, while those who funded it hold ownership. If the funding goal isn't hit, everyone will receive their money back.\n\n![](https://images.mirror-media.xyz/publication-images/7d42a4b3-363c-4b13-b7f3-592d3b9cb6c1.jpeg?height=1340&width=2400)\n\nThough not proven, I believe this model can can solve both of the problems mentioned above:\n\n1. It offers a path to being paid for a one-off work that's not part of a subscription or newsletter.\n2. It offers a way to monetize work that remains a public good, without a paywall.\n\nIf this experiment is a success, it will mark an early promising sign for a new way to fund not just writing, but all kinds of creative work.\n\nThat all being said, I hope you'll stick around to fund, share, or at least observe as we try something new. A link to the post containing the abstract is below, along with some information about me.\n\n[](https://j.mirror.xyz/RUeJfZEZxr-hkuzUCakQyUuf2kOJVMPPiAWBaQFhhqc)\n\n### About Me\nI’m a product designer and software engineer, mostly involved in helping early stage startups design and grow products in interesting markets. I started my career as a software engineer at Snapchat, then founded a startup, which went through Y Combinator in 2018. Since then, I've worked as a designer and consultant for several startups and investors, including WorkOS, Muze, a16z Crypto, and Y Combinator, where I help out part-time with admissions. You can find me on Twitter [here](https://twitter.com/john_c_palmer).\n\nI typically write 1-2 longer essays each year, most often concerning new insights around startup strategy and product design. Among them, my [Spatial Software](https://darkblueheaven.com/spatialsoftware/) post from last year was probably the most popular, describing a wave of new products being built around game-like interfaces and what makes them unique.\n", "timestamp": 1613510341, "digest": "uVGCCwwm3k341lPpxaJmHTZROESVse9Pe_rmbiuUAC0", "contributor": "0xB0623C91c65621df716aB8aFE5f66656B21A9108"}
{"id": "3Nu4Pnyoe74vXiDdGOJiBdjZjUp_Wev3jMBREWJabLc", "title": "Crowdfund test", "body": "[Scissor Essay](crowdfund://0x517bab7661C315C63C6465EEd1b4248e6f7FE183?softCap=2&endsAt=1612468800)", "timestamp": 1613511556, "digest": "3ryMikJGp_bz5WjvjscuXOnCShTKY3k0gnQKvCJ7PmA", "contributor": "0xc46004492f3C10B6E9211D60A7f261E72Cc03a8e"}
