{"id": "xhnzmBVOP6F7UnHHot_Kwjtnz-l76nbZsEOFYv1VL8s", "title": "Tokenomics - Three things Creators need to know before making a Social Token for their community.", "body": "*Hey there! [Coinvise](https://www.coinvise.co/) is a web3 platform that helps creators & communities build and manage their Social Tokens. You can join the [community here](https://discord.gg/GQNx6HpW). If you find this essay interesting, make sure to subscribe to [Coinvise’s newsletter](https://coinvise.substack.com) and follow Coinvise on [Twitter](https://twitter.com/CoinviseCo). Enjoy! 🔥*\n\n![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fba0f21ee-d45d-4211-831d-d517ebfe7615_2842x1622.png)\n\nWith the creator economy booming, we're seeing more talented individuals sharing content online and gathering tight-knit communities. But there are still two major problems for creators today: Ownership and Collaboration.\n\nHow can we give back the power to creators, enable these individuals to build their communities, help them collaborate with other creators to achieve their ambitious goals?\n\nThe path that seems the most promising for creators is exit to community. In recent months, we've seen mainstream media talking about NFT (Non-Fungible Tokens) and Social Tokens, and the revolution for more ownership is happening in front of our eyes.\n\nPlatforms like [Coinvise](https://www.coinvise.co/), offer creators the power to create their virtual currency, also known as Social Tokens. Social Tokens are virtual currencies that are enforced on a blockchain and allow specific advantages in a certain economy.\n\nCreating a Social Token is the easy part. What's more complicated, however, is to get it accepted by a community. How will creators convince anyone to work for them in exchange of a virtual currency they just created? What actions can creators take to start a virtual economy with a digital currency being accepted by their whole community?\n\nThe answer is: having strong Token economics for their project. We call Tokenomics (Token + Economics) all the things that enable participants to contributing positively enabled by strong token design. Setting up Tokenomics for a project means \"What can a creator put in place to allocate & incentivize a community to participate in the project.\"\n\nSocial tokens have shown their efficiency on incentivizing individuals to share their skills with others. Projects that have succeeded in creating thriving communities all have strong Tokenomics. Tokenomics is a successful community’s superpower.\n\nBut setting up Tokenomics is not a small task for creators, specifically for those new to the crypto world. How many tokens should a creator allocate to contributors? How much of the supply should be reserved for the community’s treasury? What will be the total initial supply? Many questions come to mind, and it's not always easy to have the correct answers.\n\nThis essay aims to explore further what creators can put in place to create strong Tokenomics around their project, and aims to break it down into an easy-to-read step-by-step guide.\n\n## 0 - Before starting\n\nBefore deep diving into Tokenomics, it’s important to clarify certain things.\n\n**Creators should gather a strong community toward a joint project.** A project beyond the creator themselves, a project that requires strong collaboration to be achieved. A singer can gather a large audience, but to turn this audience into a community, they need to have a broader project that requires collaboration. We could think of an album. Any fan could become a contributor by creating designs/posters, spreading the word, organizing crowdfunding and so on. We could also think of a fitness instructor making videos on Youtube, creating the go-to-place for everything related to having a healthy lifestyle. Fans, led by the creator, could create a platform, create challenges, and gather resources to achieve this broader goal. The point is: the project needs to go beyond the creator.\n\nIt’s also important to clarify what a creator is. **We will consider a creator as anyone pushing ideas, and a vision, through content on the internet.**[Jeff Kauffman Jr.](https://twitter.com/jeffkauffmanjr) for example, while maybe not considered as a creator in a traditional sense, has created a [thriving community](https://www.joinjump.community/) around advertising and marketing in Web3, pushing his ideas and vision through essays and podcasts, gathering a strong community keen to help him achieve his high ambition goals. [Dom Hofmann](https://twitter.com/dhof), the founder of Vine, is also a great example of this new wave of creators. Through his project [Loot](https://twitter.com/lootproject), Dom revolutionized the way we're thinking about collaboration around NFTs, and has gathered a community that collaborate to achieve a large goal.\n\nWith a common definition of what we’ll call a creator, and the prerequisites to create a thriving decentralized community, let's dig into the three main aspects of Tokenomics: **Token design -Token Distribution -Financial aspects.**\n\n## 1 - Token design: What key factors should Creators take into account before creating the Token?\n\nToken design is a critical component of creating a thriving community. It's essential as the Token design (aka - all the technical aspects of the token) will serve as a foundation to incentivize a community to participate in the project.\n\nThe first question that should come to mind when creating a Token should be \"What will be the total initial supply?\" or, in other words, \"**How many tokens should I create?\"**\n\nThere isn't a one-size-fits-all answer to \"How much token should I create,\" but we'll go over the main characteristics that you should take into account to come up with an answer.\n\nFirst of all, when creating a Token, there are two models, with both pros/cons, that you should be aware of.\n\n* ***The Fixed supply model -*** It's a model where you define the number of tokens you want to create beforehand (for example, 10M tokens) and receive them directly on a wallet.\n* ***The Bonding curve model -*** Anyone has to buy the Token to create it. Its price increases as the Supply or distribution of the Token do. The more tokens have been distributed, the higher the price. Let's take an example to illustrate what a bonding curve is. You've just launched your Token on a Bonding curve, and your best friend John wants to buy some. To make it easier, let's say that your Token is on a classic (linear) bonding curve and that the price of the first Token is $1. John will pay $1 for the first Token, $2 for the second, for the third, $3, and so on. To get the first ten tokens, John will have to pay $1+$2+$3+$4+$5. Totaling at $55. Now, let's say your Mom wants to buy ten tokens. Your Mom's tokens price won't start at $1 but at $11 (as John already purchased the first ten tokens). Every new buyer pushed the price up by increasing the Supply. On the other hand, when someone sells a Token, it will be burnt (destroyed), decrease the Supply, and lower the Token price..\n\n![Three types of bonding curves: Linear, Sigmoid, and Negative Exponential Curve](https://images.mirror-media.xyz/publication-images/UKj1WMCKz0CDf0MmzDbVx.png?height=1080&width=2160)\n\nThere are many advantages to creating a token on a bonding curve. It guarantees Liquidity, allows a limitless Supply, reduces the volatility of the Token, and reduces the risks of hacks. However, it's more common to see communities minting their Token on a Fixed supply. Unless you're an expert and know what you're doing, we recommend creating a Token on a Fixed Supply. Indeed, it allows better usability, lowers entry barriers, gives community leaders full power over the distribution of the native Token, and doesn't require a strong community ready to pay from day one. If you're still interested in creating a Token on a bonding curve, we suggest reading this article to learn more.\n\nNow that you're aware of the two models, and considering you want to create a Token on a Fixed supply, you can start thinking of the total Supply you want to create. The standard is to create a supply of 10M, but again, some successful communities have thrived with less supply (e.g. [Metafactory has a 420 000 total supply](https://forefront.market/creators/robot)) or more (e.g. [Bankless DAO has a 1 billion initial supply](https://medium.com/bankless-dao/announcing-bankless-dao-133220f5efd8)).\n\nWhat's more important when considering creating a token is to **think about the relative amount of tokens** (i.e. what percentage of the total Supply are we talking about). For example, let's say you decide to create 100 000 tokens worth 100 000 dollars. It means that if someone buys 1000 tokens, he will have to pay $1000. If you decide to create 1M tokens that are still worth 100 000 dollars in another scenario, if someone pays $1000, he will get 10 000 Tokens. In both cases, the person ending-up holding the same relative amount of tokens: 1% of all tokens. **More than the total supply, while extremely important, you also have to think about the relative amount of token (i.e the percentage) when taking decision.** Instead of thinking about the number of tokens you should put in the treasury, maybe it’s better to think in percentages.\n\nWhen creating a Token on Coinvise, we suggest you make a supply of 10M tokens, following the industry standard. **You'll also have to think about a name and a Symbol for your Token.** It can be anything, but, usually, community leaders are putting the name of their community or their own name. For the Symbol, it can be anything between 1 and 7 characters. To well understand the differences between a Name and a Symbol, here are some examples: [Ethereum](https://ethereum.org/en/)($ETH), [Forefront](https://forefront.market/) ($FF), [Bitcoin](https://bitcoin.org/en/) ($BTC), [Alex Masmej Token](https://twitter.com/AlexMasmej) ($ALEX).\n\nThe price of the Token is also part of the Token Design and will be decided when community leaders will create a Liquidity pool. The token's price and its volatility are vital components of Tokenomics. We'll talk further about it later in this article.\n\nToken design is the first step in creating a Token, and it's not a small task. It's important to think about it thoroughly, depending on your use cases, as it will be complicated to increase the total supply if you realize it was not enough.\n\nWith the Token created and sent to a secured wallet, community leaders will have to think about distributing it to contributors.\n\n## 2 - Token Distribution: **How should a creator distribute the token to incentivize more people to help the project grow?**\n\nOnce a creator has gathered a small and tight community (can be as few as \\~20 people) and has created a Token, the second step is to think about how to reward these early believers. **Thinking about how to incentivize them to continue building, and motivate some more people to join the community.** It's always a big step when introducing a Token in a community, and it's essential to make it right.\n\nThe challenge with Token Distribution is to create efficient distribution mechanisms that would put the tokens in the hands of people willing to produce long-term work for the network. Your role, as a community leader, is to create a healthy community that can thrive in the long term, and the first step to accomplish this goal is to decide on what percentage of the supply should go in the treasury, to the stakeholders, as a retroactive airdrop, as a [vested treasury](https://www.notion.so/What-is-Vesting-Schedule-dccd252171ea44409ebbe06ab5306e40), etc.. If you're interested to learn more about Token distribution, we suggest you read the [Forefront’s Token announcement](https://forefront.news/blog/ff-hello-world) where they explain the $FF distribution.\n\n![$FF distribution by Forefront - the token has been minted on a 10M Fixed Supply.](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F476b073d-0118-44fd-a9d2-1b43c29068a7_1280x720.jpeg)\n\nThere are several areas in your community where you can distribute your Token. You could choose for example to allocate a part of the supply to **airdrop** (send) tokens to members of other communities that are related to your project. Doing Airdrops can be an interesting way to attract potential contributors. You could also allocate part of the supply to the **core team** to motivate them build a great community or keep some tokens in **the treasury** to allocate them to community members that help the project grow. You have to think thoroughly about the percentage of the total supply you want to assign to the treasury. There is no rule of thumb for the treasury's percentage. Some communities have 15% of their supply allocated to their treasury, some 20%, and others 45%. The Treasury will help you fund exciting initiatives within the community.\n\nThere are two main ways to allocate Tokens to community members when creating a decentralized community: **Bounties and budget allocations**. There are fundamental differences between bounty hunters and core contributors (as outlined in this essay), and it's essential to distribute the tokens accordingly.\n\nSetting up bounties will serve for one-off missions. It can be extremely useful to attract more people to your community. Bounty hunters will usually participate very flexibly on an ad-hoc basis. They're ready to rent their time in exchange for Tokens but won't be involved in the vision and the day-to-day operations. Make sure to have [well-designed incentives if](https://coinvise.substack.com/p/how-to-design-great-incentives) you want your community to be active.\n\nThe second way to distribute tokens is to develop Guilds, or working groups, in charge of specific missions within the community. By creating these working groups, community leaders will allocate funds to specifics teams and organize the community more thoughtfully. Community members in those working groups are core contributors and Staff. They will take care of more complex missions, help run the day-to-day operations, and be committed in the long term.\n\nIn any case, Bounty hunters and core contributors will be incentivized to work thanks to the Social Token, and **having enough treasury to reward all the active community members is extremely important.**\n\nWhile the monetary value of the token can play a huge role in why people are contributing, the are many other rights and perks that can be assigned to token holders.\n\nIndeed, once you've started distributing the token, you should reflect on the rights you want to give to token holders. In specific communities, owning a token bestows a right that results in product usage, a governance action, a given contribution, voting, or direct access to a product or market. For example, [GlobalCoinResearch's](https://globalcoinresearch.com/) members holding the $GCR token have governance rights, can pool liquidity (stake), earn more tokens in doing so, have access to exclusive content, access to deals and events etc..\n\nAs the last piece of advice on token distribution, it's essential, specifically at the beginning, to **consider any person to whom you give token an investor**. With a very centralized community at the beginning (mostly the creator of the token or a small core team), each person that will receive the token will (potentially) have governance power and can have a huge influence over the future decisions of the community.\n\nIn most new communities, the only way to earn a token is to put some work in the community and be involved in it. Later on, however, community leaders should start opening the access to the community and allow anyone to buy tokens. This process is called “Pooling Liquidity” and comes with the concerns of price stability.\n\n## 3 - Financial aspects: How creators can manage the stability of the token so people are still motivated to collaborate?\n\nAs in every project, the financial aspect is a critical component of a Social Token. A token that gains value (both social and financial value) will attract top talent and incentivize community members to become contributors.\n\nFirst of all, it's important to explain briefly what gives value to a token.\n\n**At its creation, a Social Token created on a fixed supply has no inherent value, as no one has put money in it yet.** You could have a million of a $NAME Token you've just created that you couldn't buy any item in real life. That's the reason why, at some point, communities are looking to add Liquidity, allowing anyone to buy the Token in exchange for some other cryptocurrencies that already have a monetary value. By allowing anyone to buy and sell the Token, the coin gains economic value, and community leaders can use this money to make the community grow.\n\nConcretely, pooling liquidity means creating a Pool where people can make their Token and another one (bond) available for anyone wanting to buy it. When the Liquidity Pool is created, users can add the exact value of two Token (ex. $500 of your Token + $500 of collateral, aka any other token) in a Pool and earn trading fees proportional to their share of the total Liquidity. Put simply, these **Liquidity providers facilitate trading by willing to buy or sell a particular asset at any given time, thereby providing Liquidity and enabling traders to trade without waiting for another buyer or seller to show up.** The price is determined by Automated Market Maker directly on the Decentralized Exchange you're creating the pool on (ex: Uniswap).\n\n![Uniswap (decentralized exchange) interface](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F204e8e10-c8d8-4628-b71a-fb4822f08041_1456x739.jpeg)\n\nWith a better understanding of Social Token's financial value, it will be essential to understand how to manage the stability of the Token. Indeed, **with a highly volatile token, contributors won't risk their time in exchange for a token that could plummet the day after.** Likewise, a Token that can double in value overnight will attract only speculators, members that are only there for a quick buck and not keen to put some work to make the community grow and evolve.\n\nThere are many ways to limit the volatility of a token. The first one is to **vest a portion of the supply.** Concretely, **vesting a token means locking a certain amount of tokens over a certain period as a commitment to hold the Token.** When a token is vested, the owner of those Token can't withdraw them directly and have to wait until the vesting period ends. It's made possible thanks to blockchain mechanisms, and specifically smart contracts, that make it easy to lock a certain amount of funds until contract conditions are met. In our case, when the vesting period has been completed, the smart contract, enforced on a blockchain, will allow the holders to withdraw their tokens.\n\n**It is also possible to bond the Token with a stable coin in a Liquidity Pool to ensure price stability.** Indeed, when creating a liquidity pool, while it's not the only factor that makes the price fluctuate, the Token with whom you're bonding your Token can have an impact on your token price. When bonding your Token with collateral volatile, if the price of this token drops considerably, it will, in a way, impact the price of your Token.\n\nThirdly, you can try to stabilize the price of the Token by creating Liquidity Mining Programs. Liquidity Mining is the same concept that having a savings account and making interests. **When putting your money at the bank, you agree that bankers will play with your money in exchange for a specific interest rate. When pooling Liquidity on a decentralized exchange, you agree to automatically buy or sell a particular asset at any given time to help the project grow in exchange for a reward.** It is a powerful way of incentivizing users to hold on to their crypto holdings, as, in return for doing so, these users will receive staking rewards. Creating Liquidity Mining Programs, and therefore having more Liquidity, will increase transaction depth. Transaction depth is the degree of market price stability. The greater the depth, the less significant the impact of several transactions will be on the price. On the other hand, with low Liquidity, a single person can drop or bump the cost of your Token by buying or selling a significant amount. Through Liquidity Mining Programs, community leaders ensure to have enough Liquidity to grow their project and start a gradual path to community ownership. Liquidity Mining Programs have shown their efficiency to align incentives and create a positive-sum game.\n\n![Forefront Liquidity Mining Campaign Landing Page](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fdf06bd73-fdc4-4bce-a4d4-657ce1ae25f5_1456x743.jpeg)\n\nAs we've just seen, there are many financial tools at the disposal of community leaders to reduce the volatility of a token.\n\n## Conclusion\n\nAs seen in this essay, all of the above elements will play a major role in the way people collaborate in a decentralized community. As a creator, it's important to think thoroughly about the Token design, Token Distribution, and Financial aspects of your Token to ensure the long-term success of the community. We've just seen multiple examples of concrete actions community leaders can take to incentivize a community to participate in the project, and that's what we call Tokenomics.\n\nYou will rapidly notice that thriving communities often have great Tokenomics. They have good mechanisms that make more people join the community and actively participate and create value. If you want to see great Tokenomics, we recommend you [to join the](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F83f7b0bb-5b21-49b7-b24a-7c657b02feb8_1456x743.png)[Forefront Discord](https://discord.gg/DWEhDCFdrf), [GlobalCoinResearch Discord](https://discord.gg/qUsbgFk6wC), and [Jump Discord](https://www.joinjump.community/jump-start) and notice how active are the contributors.\n\nWhile there is no one-size-fits-all solution to figure the Tokenomics of a project, this essay should give you the basics and open your eyes on what's possible to do with a Token.\n\n[edition://0xDF5b5ee15CC96ba7d0CB6BD9b2c0fc4417ab6445?editionId=5](edition://0xDF5b5ee15CC96ba7d0CB6BD9b2c0fc4417ab6445?editionId=5)\n\n\n---\n\n###### **Want more?**\n\nFollow us on **[Twitter](https://twitter.com/CoinviseCo)**,  [Instagram](https://www.instagram.com/coinvise/?hl=en) and join us on **[Discord](https://discord.gg/8jaQB5CZ) 🔥**\n\nThanks for being here!\n\n\n---\n\n***Further resources:***\n\n* [$GCR Tokenomics](https://globalcoinresearch.com/2021/08/27/gcr-tokenomics/)\n* [Announcing Bankless DAO 🏴](https://medium.com/bankless-dao/announcing-bankless-dao-133220f5efd8)\n* [$FF Hello World](https://forefront.news/blog/ff-hello-world)\n* [Fair Initial Token Distribution for Optimal Decentralization](https://medium.com/@plaurent789/fair-initial-token-distribution-for-optimal-decentralization-8363e83173ff)\n* [FLOW Token Distribution](https://www.onflow.org/token-distribution)", "timestamp": 1632459333, "digest": "-8jI4r9zZriROBYpXJXRFZmUeq5d5yGoMxVXBp-Nizs", "contributor": "0xC0241e384dB48C35E7b3FEded3BfEcd29A3E73e3"}
{"id": "lKpysv7cJrBZb9xrNDvYkyGjXq6BDSxcjosPXjevFRE", "title": "ZERO IDEA WHAT THE FUCK IS HAPPENING ", "body": "This is my Cool Cat #5299. Today, my cat jpeg is worth about $21,000. If you think that’s wild, one day I’ll tell about the ape rooms and my friend who bought 47 ape jpegs (give or take). Today the cheapest ape jpeg is 38.99 ETH or $120,000. *I’m watching jpegs change lives and I’m seeing a lot of good people make life-changing money.*  \\n Good people are winning.\n\n \\n We’ve witnessed these events. We’ve experienced them ourselves. I'm living through it too, but I can’t explain it to anyone in the world outside.\n\nWhat I do know is I want to write some of this shit down because every day I am confused. Every day I smile that new and familiar that says, “I have no idea what the fuck is going on.” I know I’m not the only one.\n\nI’ve got more to say, but tonight I’m keeping it short. I’m super excited to use this platform to talk about art history in the making and all of my friends. \n\nLucky to be here \\n \\~Trish \n\n________\n\n*Dedicated to [Taylor.wtf](https://twitter.com/TAYL0RWTF) and all of my friends at [discord.art](http://discord.art). It’s all happening.*", "timestamp": 1632460874, "digest": "vtoug3w2ESujPpESiy6_lXGuf_3IbpLRH0LxTDxQzvY", "contributor": "0x5f8b9B4541Ecef965424f1dB923806aAD626Add2"}
{"id": "XPO_ysLsY7ArqKfPF87zjKtAcKgO1w8Sq680PVHh1zI", "title": "ZERO IDEA WHAT THE FUCK IS HAPPENING ", "body": "This is my Cool Cat #5299. Today, my cat jpeg is worth about $21,000. If you think that’s wild, one day I’ll tell about the ape rooms and my friend who bought 47 ape jpegs (give or take). Today the cheapest ape jpeg is 38.99 ETH or $120,000. *I’m watching jpegs change lives and I’m seeing a lot of good people make life-changing money.*  \\\\n Good people are winning.\n\n\\\\n We’ve witnessed these events. We’ve experienced them ourselves. I'm living through it too, but I can’t explain it to anyone in the world outside.\n\nWhat I do know is I want to write some of this shit down because every day I am confused. Every day I smile that new and familiar that says, “I have no idea what the fuck is going on.” I know I’m not the only one.\n\nI’ve got more to say, but tonight I’m keeping it short. I’m super excited to use this platform to talk about art history in the making and all of my friends.\n\nLucky to be here \n\n\n________\n\n*Dedicated to [Taylor.wtf](https://twitter.com/TAYL0RWTF) and all of my friends at [discord.art](http://discord.art). It’s all happening.*", "timestamp": 1632461027, "digest": "vtoug3w2ESujPpESiy6_lXGuf_3IbpLRH0LxTDxQzvY", "contributor": "0x5f8b9B4541Ecef965424f1dB923806aAD626Add2"}
{"id": "F9M8pDYbuv6Nc8wVuVai9fy77SbKn_9VpCol2Ie5_6I", "title": "Funding Friday: Newly Finite Themes", "body": "My friend [Mike Masnick](https://twitter.com/mmasnick), founder and leader of [Techdirt](https://www.techdirt.com/), is [crowdfunding a new paper on NFTs](https://techdirt.mirror.xyz/crowdfunds/0xDbf6787Bf9322f8768B36cCa815bcC91474aD5bC).\n\n![](https://avc.com/content/uploads/2021/09/Screen-Shot-2021-09-24-at-6.17.28-AM.png)\n\nI backed the project just now with 0.1 ETH and you can do the same [here](https://techdirt.mirror.xyz/crowdfunds/0xDbf6787Bf9322f8768B36cCa815bcC91474aD5bC).\n", "timestamp": 1632479001, "digest": "Fmb_2XgWUHpoLm5Py7ZnwwNvurIK25_N9LO1rxJU0-0", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "c_w0Or9G1TGr_phv3pHHQN2TaAWbfF3R-U-5Qx_f2oQ", "title": "Announcing Mirror-Bot, a Discord bot for Community Discovery and Discussion", "body": "Open data in Web3 means we get to play with a large variety of interfaces for displaying information. While this means there is a lot of flexibility, it does introduce an extra step in the groundwork requirements for creating any kind of live discovery feed. We’ve decided to build a V1 feed into our Discord server for all Mirror events from our smart contracts, which can be further leveraged for our web interface in the future.\n\n![](https://images.mirror-media.xyz/publication-images/zxV6miW9j-39H63Lax1Ej.jpg?height=1142&width=2284)\n\nSo why Discord? On most platforms, it's fairly difficult to get both organic discovery and discussion across content, teams, and individuals. Discord provides a happy (albeit chaotic) medium to bridge this gap and it also has a strong third-party developer ecosystem around bots.\n\nWhile the basis of development is a feed, building this into a Discord bot will help supplement discovery and discussion within the community on a platform that already enforces a tight feedback loop between those two elements.\n\nThe development of the bot came in three parts:\n\n* provide a feed that covers all new writers, their project and content creation, as well as their funding or sales progress in activity channels.\n  * the bot can sit in any Discord server and *push the events of a specified set of Mirror publications*.\n* provide interactive commands for easily viewing *all* ongoing project raises/sales on Mirror\n* provide commands that enable streamlined communication of feature requests and bugs, pushed *directly into our development backlog*\n\n## Activity Feeds\n\nWe've added event tracking to activity channels in our discord for live updates based on the following categories:\n\n![](https://images.mirror-media.xyz/publication-images/j2okljkwzsJQwssrUgqzZ.jpg?height=1142&width=2284&&size=medium)\n\n1. **[#sign-ups:](https://discord.com/channels/821771133422272542/888094195108180078/890650527334023188)** A new creator has started or joined a publication on Mirror.\n2. **[#new-entries:](https://discord.com/channels/821771133422272542/883857527899582475/890906411066884107)** A live feed of all entries published.\n3. **[#crowdfund-updates:](https://discord.com/channels/821771133422272542/883479657830301716/890934211932979230)** someone has contributed to a crowdfund.\n4. **[#edition-updates:](https://discord.com/channels/821771133422272542/883857355584974878/890856633121538108)** someone has bought an edition.\n5. **[#milestones:](https://discord.com/channels/821771133422272542/883857477861539850/888759370895208509)** A creator has started a crowdfund raise or editions sale. Additionally, all crowdfund closes and editions sell-outs will get a shoutout on both Discord and [on Twitter](https://twitter.com/mir_milestones) as well.\n\n### Registering Mirror-bot in your Discord\n\nWant to bring all of the above events from your publication to your own community server? You can now register any channel to track your ENS-specific events (as long as the bot has access)!\n\nAfter you invite Mirror-bot to your server, you can use the `/track register_ens` slash command in the channel you want events to feed into:\n\n![](https://images.mirror-media.xyz/publication-images/WGogDe9CUiZwC-orDjxX6.gif?height=125&width=935)\n\nFor now, **you can add up to five publications to your server,** any of which can be removed from tracking by using the `/track remove_ens` slash command.\n\nIf you're interested in this feature, please [DM me](https://twitter.com/andrewhong5297) and I'll give you the bot invite link and help get you set up!\n\n## Interactive Commands\n\nWe've leveraged Discord slash commands to bring more interactivity into other channels as well. Are you wondering what projects are currently raising a crowdfund or selling editions? Pull up a paginated table using either the `/table crowdfunds` or `/table editions` commands!\n\n![](https://images.mirror-media.xyz/publication-images/g8fObWJh6nFDNXqgbcMWD.gif?height=340&width=682)\n\nIn case the activity feed gets too cluttered, this is a great way of catching up on the last few weeks of projects on Mirror.\n\n## Direct Feedback into Dev Pipeline\n\nMirror is a constantly growing product, with great ideas and suggestions flowing constantly in the chat. To make sure these ideas aren't lost, we have a `/feature notification` that pushes the idea directly into our product development backlog for prioritization in future sprints.\n\n![](https://images.mirror-media.xyz/publication-images/UGrhVeHowrtJBmc3LFFST.gif?height=125&width=935)\n\nOn the flip side, if you encounter any bugs then you can notify us and put them in the queue as well with the `/bug notification` command.\n\n## Discord Bots, Roll out!\n\nMirror-bot will continue to grow with the community, aiming to supplement the [mirror.xyz](http://mirror.xyz) experience for everyone. Come join us all in the [Mirror discord](https://discord.gg/txuCHcE8wV), and if you have any ideas for more bot capabilities then put your ideas down with `/feature` 😉", "timestamp": 1632491118, "digest": "nb6ldFOJcpd7OIBCD3z76tKdZ3hglgw83pi16CNqIu8", "contributor": "0x2Ae8c972fB2E6c00ddED8986E2dc672ED190DA06"}
{"id": "0Fuejew9ribeCa-VngTluO76_ti2n2PHluuPI-7_OSo", "title": "Top Crypto Product Launches: Sep 24", "body": "**📈  Past week’s Top Crypto Product Launches**\n\n[Twitter launches crypto Tips on Bitcoin Lightning](https://techcrunch.com/2021/09/23/twitter-accelerates-again-with-bitcoin-tips-nfts-recorded-spaces-creator-fund-and-more/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAJK_arVQhHfTZGqs6rZUVCg4vI9USNaecHbLMK_L_lnl76PXrzhUJHmyWJjYHqKrXWbhOTCI6YDldGNqKFf7EHLn4IXUJbikVIDB8sploxMKd88naL-Z_tmLKDbDXNfHMib424zFs9TcYba8lTjqysygTzDnm7Q0wmXa-0EciitT) | 🔼  234\n\n[Robinhood rolling out full crypto wallet with transfers](https://www.theblockcrypto.com/post/118271/robinhood-rolling-out-crypto-wallet-transfer-features) | 🔼  187\n\n[DeFi $DATA Index from Index Coop tracks Web3 Data Economy](https://twitter.com/indexcoop/status/1441115211176415237?s=20)  | 🔼  65\n\n## 👇  More detail below\n\n[https://techcrunch.com/2021/09/23/twitter-accelerates-again-with-bitcoin-tips-nfts-recorded-spaces-creator-fund-and-more/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAJK_arVQhHfTZGqs6rZUVCg4vI9USNaecHbLMK_L_lnl76PXrzhUJHmyWJjYHqKrXWbhOTCI6YDldGNqKFf7EHLn4IXUJbikVIDB8sploxMKd88naL-Z_tmLKDbDXNfHMib424zFs9TcYba8lTjqysygTzDnm7Q0wmXa-0EciitT](https://techcrunch.com/2021/09/23/twitter-accelerates-again-with-bitcoin-tips-nfts-recorded-spaces-creator-fund-and-more/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAJK_arVQhHfTZGqs6rZUVCg4vI9USNaecHbLMK_L_lnl76PXrzhUJHmyWJjYHqKrXWbhOTCI6YDldGNqKFf7EHLn4IXUJbikVIDB8sploxMKd88naL-Z_tmLKDbDXNfHMib424zFs9TcYba8lTjqysygTzDnm7Q0wmXa-0EciitT)\n\n**🤔   Why it Matters**\n\n> The financial system of the Internet will be built on crypto and DeFi. Period. Twitter has strategically pushed into the creator economy recently (newsletters, ticketed spaces, etc) and Tip Jar is the latest feature, providing several payment options including Bitcoin payments over the Lightening network powered by [Strike](https://strike.me/).\n>\n> Twitter also announced NFT authentication of profile pictures, which appears to be the killer app of the recent NFT boom (reputation, flexing, tribal, speculation). Social media is the center of our digital lives today (until the Metaverse is ready) so having crypto payment rails and property rights (NFTs) embedded is going to be a space race amongst the different platforms, with Reddit and Twitter leading the way currently.\n\n\n---\n\n[https://www.theblockcrypto.com/post/118271/robinhood-rolling-out-crypto-wallet-transfer-features](https://www.theblockcrypto.com/post/118271/robinhood-rolling-out-crypto-wallet-transfer-features)\n\n**🤔   Why it Matters**\n\n> The great Fintech+DeFi convergence is in motion and accelerating. Robinhood clearly sees crypto and DeFi as a valuable product segment, so I would expect them to add more and more functionality over time including access to DeFi yield, liquidity pools, NFTs, etc. In \\~2-3 years, everyone will have a crypto wallet (or multiple) whether they know it or not. Regulatory environment pending of course.\n\n\n---\n\n[https://twitter.com/indexcoop/status/1441115211176415237?s=20](https://twitter.com/indexcoop/status/1441115211176415237?s=20)\n\n**🤔   Why it Matters**\n\n> New DeFi investors, particularly institutions, want to bet on whole crypto sectors (L1s, NFTs, DeFi, Web3) and not sort through hundreds of tokens and pick some winners. Index funds provide a real solution to this problem, and [Index Coop](https://www.indexcoop.com/) launched the [$DATA index](https://www.tokensets.com/v2/set/0x33d63Ba1E57E54779F7dDAeaA7109349344cf5F1) this week providing exposure to the growing Web3 Data Economy like [Filecoin](https://filecoin.io/), [Chainlink](https://chain.link/), [The Graph](https://thegraph.com/), etc. Crypto will unlock totally new asset classes like cultural or social capital, and the capital help in data markets is largely untapped today except for advertising. Watch this trend over the next 2-3 years and if you want exposure to its growth, consider [getting some $DATA](https://app.sushi.com/swap?inputCurrency=&outputCurrency=0x33d63Ba1E57E54779F7dDAeaA7109349344cf5F1) yourself.\n\n\n---", "timestamp": 1632500581, "digest": "yz0mPHfzBQMWbxDXkrGLfpgMDOIEzILbXgmLArLruqU", "contributor": "0x869eC00FA1DC112917c781942Cc01c68521c415e"}
{"id": "ldE4vTHRd6kXWjjO_KMjlpjn4o3JwSoES7aHuJiSIQ8", "title": "FF Data Bites: Social Token Tags Network Analysis", "body": "*This post is a guest essay from [Omni Analytics Group](https://twitter.com/OmniAnalytics). Omni Analytics Group is a group of passionate technologists who help others use data science to change the world.*\n\n## Introduction\n\nSocial tokens are cryptocurrencies that enable a share of value between content creators, artists, builders, and other community members with a shared interest. This can allow creators to monetize access to their content, but also can simply provide a community with a currency that, due to their shared interests, has inherent value to each of them.\n\nForefront aggregates news, insights, and other content about social tokens and DAOs. The team at Forefront tracks data on the tokens [listed on its market](https://forefront.market/market).\n\nThese tokens vary in terms of the communities they cater to and the goals of each. For example, [MetaGame](https://forefront.market/creators/metagame) bills itself as “a weird combination of a social network, a freelancing platform & an MMO-RPG.” [Harrison First](https://forefront.market/creators/harrison-first), as the name suggests, is a creator-based token tied to the DJ Harrison First. [Bankless DAO](https://forefront.market/creators/bankless-dao) focuses on raising awareness of bankless money systems.\n\nBecause the variation in these tokens is so large, Forefront attempts to categorize them by using tagging. For example, the previously mentioned MetaGame is tagged as “metaverse,” but also “tooling,” “community,” and “membership.” Harrison First is tagged as, among other things, “NFTs” and “entertainment.” These tags help users discover, at a glance, the community or communities a particular social token is targeting. In addition to tags, social tokens are also broken down by utilities. In the case of MetaGame, its utilities include “access,” “governance,” and “servicing.” Harrison First also has “access” and “servicing” as listed utilities, while some other tokens have “NFTs,” “payments,” and more. This categorization in terms of tags and utilities helps to break down the list of social tokens into relevant characteristics and highlight those that might appeal to a certain individual or group.\n\n## Network Analysis\n\nSince we have a breakdown of the tags and utilities associated with particular social tokens on Forefront, we can actually perform a network analysis by using the shared tags and utilities to derive a metric of similarity. This can allow us to visually represent how interrelated a set of social tokens are based on these characteristics. To do that, we needed to scrape and collect the tags and utility data.\n\nTo perform the data collection, we called the Forefront API, retrieving data for the tokens tracked on the site. This loop was done with R, using supporting packages `tidyverse` for data manipulation, and `httr` for making synchronous API calls.\n\nTo create the utilities network graph, we needed to create a graph structure out of the data. Graphs are represented by nodes – in this case, the social tokens themselves as well as the utilities – and edges. The edges between nodes are defined by sharing a utility. The graph is shown below. We immediately see that “governance” is a utility that binds many of the social tokens together. We also see that certain social tokens are more interconnected by virtue of having a wide variety of utility, such as MetaGame.\n\n[Utilities Network Graph](https://crypto.omnianalytics.io/forefront/Utils_NodeName.html?display=iframe)\n\nThe same procedure can be used with the tags, and doing so produces the following network graph. This graph is busier due to the larger number of tags, but we see a distinct “cluster” of social tokens with shared tags, followed by an orbit consisting of the social tokens with less common or more distinct tags, like DeFi Omega with the “investment” tag, or [Yup](https://forefront.market/creators/yup) with “reputation.”\n\n[Creator Tags Network](https://crypto.omnianalytics.io/forefront/Tags_NodeName.html?display=iframe)\n\nWe have produced interactive versions of these graphs here. You can interact with the graphs yourself and see what interesting or unexpected connections or relationships you find!\n\n* [Utilities Network Graph](https://crypto.omnianalytics.io/forefront/Utils_NodeName.html)\n* [Tags Network Graph](https://crypto.omnianalytics.io/forefront/Tags_NodeName.html)\n\n## Benefits Analysis\n\nNext, we collected data on the benefits that each social token provides to its holders. The benefits are roughly broken down into three distinct categories:\n\n* Access: Being granted access to exclusive content or a community.\n* Earn: The ability to earn more of that token by doing some task.\n* Redeem: The ability to redeem that token for items or content.\n\nWhile many of the tokens offer some form of access or earnings, very few offer the ability to redeem, which was a distinguishing characteristic of just a handful. Because of the hierarchical nature of this data, we were able to break it down into a `dendrogram`, which traces the three different types of benefits to the tokens that offer them, and then a description of what specifically those benefits are. The dendrogram is shown below. We immediately see that “access” is the benefit given by the largest number of social tokens, where only three provide the ability to redeem for rewards. Interestingly, some tokens break down their benefits even within a particular category at a more fine-grained level. For example, SKULL lists four separate access benefits that are all related to Discord access tiers.\n\n![Forefront tracked tokens benefit analysis.](https://images.mirror-media.xyz/publication-images/hlw1P3Blvr76zg1pUd2qe.png?height=840&width=2048)\n\nWe can restructure this view in a slightly different format, flipping the token to the beginning and then splitting the benefits offered by that token from there. That graph is shown below. This representation allows us to better analyze the benefits offered by a specific token and see them in the chart together. For example, the Swagg Network offers one benefit from each category in this representation of the data.\n\n![Forefront tracked tokens benefit analysis (alt format).](https://images.mirror-media.xyz/publication-images/EA5OSvLqgM5uwfaufhIhs.png?height=840&width=2048)\n\n## Conclusion\n\nThis analysis highlights the way data science and analytics can be used to better understand characteristics of social tokens. In this case, we were able to use simple tags, utilities, and benefits data to order tokens with shared characteristics, and visually represent these characteristics in a simple yet appealing way.\n\nAs Forefront continues to grow, we look forward to performing a reprise of this analysis. If you have any further suggestions or ideas about what can be done in a future iteration of this analysis, please share and we will see what can be done!", "timestamp": 1632501959, "digest": "yMCdVyx6H1N_E_5EzFyDwM6PcFoqGwKtBsRnAAOiI18", "contributor": "0x70eCe45cDc64A768f936Ccb8aC851578251363e3"}
{"id": "pAmxjMZhwfhr573kYBapRg0e2upfStTW682jNNryG5M", "title": "FF Data Bites: Social Token Tags Network Analysis", "body": "*This post is a guest essay from [Omni Analytics Group](https://twitter.com/OmniAnalytics). Omni Analytics Group is a group of passionate technologists who help others use data science to change the world.*\n\n## Introduction\n\nSocial tokens are cryptocurrencies that enable a share of value between content creators, artists, builders, and other community members with a shared interest. This can allow creators to monetize access to their content, but also can simply provide a community with a currency that, due to their shared interests, has inherent value to each of them.\n\nForefront aggregates news, insights, and other content about social tokens and DAOs. The team at Forefront tracks data on the tokens [listed on its market](https://forefront.market/market).\n\nThese tokens vary in terms of the communities they cater to and the goals of each. For example, [MetaGame](https://forefront.market/creators/metagame) bills itself as “a weird combination of a social network, a freelancing platform & an MMO-RPG.” [Harrison First](https://forefront.market/creators/harrison-first), as the name suggests, is a creator-based token tied to the DJ Harrison First. [Bankless DAO](https://forefront.market/creators/bankless-dao) focuses on raising awareness of bankless money systems.\n\nBecause the variation in these tokens is so large, Forefront attempts to categorize them by using tagging. For example, the previously mentioned MetaGame is tagged as “metaverse,” but also “tooling,” “community,” and “membership.” Harrison First is tagged as, among other things, “NFTs” and “entertainment.” These tags help users discover, at a glance, the community or communities a particular social token is targeting. In addition to tags, social tokens are also broken down by utilities. In the case of MetaGame, its utilities include “access,” “governance,” and “servicing.” Harrison First also has “access” and “servicing” as listed utilities, while some other tokens have “NFTs,” “payments,” and more. This categorization in terms of tags and utilities helps to break down the list of social tokens into relevant characteristics and highlight those that might appeal to a certain individual or group.\n\n## Network Analysis\n\nSince we have a breakdown of the tags and utilities associated with particular social tokens on Forefront, we can actually perform a network analysis by using the shared tags and utilities to derive a metric of similarity. This can allow us to visually represent how interrelated a set of social tokens are based on these characteristics. To do that, we needed to scrape and collect the tags and utility data.\n\nTo perform the data collection, we called the Forefront API, retrieving data for the tokens tracked on the site. This loop was done with R, using supporting packages `tidyverse` for data manipulation, and `httr` for making synchronous API calls.\n\nTo create the utilities network graph, we needed to create a graph structure out of the data. Graphs are represented by nodes – in this case, the social tokens themselves as well as the utilities – and edges. The edges between nodes are defined by sharing a utility. The graph is shown below. We immediately see that “governance” is a utility that binds many of the social tokens together. We also see that certain social tokens are more interconnected by virtue of having a wide variety of utility, such as MetaGame.\n\n[Utilities Network Graph](https://crypto.omnianalytics.io/forefront/Utils_NodeName.html?display=iframe)\n\nThe same procedure can be used with the tags, and doing so produces the following network graph. This graph is busier due to the larger number of tags, but we see a distinct “cluster” of social tokens with shared tags, followed by an orbit consisting of the social tokens with less common or more distinct tags, like DeFi Omega with the “investment” tag, or [Yup](https://forefront.market/creators/yup) with “reputation.”\n\n[Creator Tags Network](https://crypto.omnianalytics.io/forefront/Tags_NodeName.html?display=iframe)\n\nWe have produced interactive versions of these graphs here. You can interact with the graphs yourself and see what interesting or unexpected connections or relationships you find!\n\n* [Utilities Network Graph](https://crypto.omnianalytics.io/forefront/Utils_NodeName.html)\n* [Tags Network Graph](https://crypto.omnianalytics.io/forefront/Tags_NodeName.html)\n\n## Benefits Analysis\n\nNext, we collected data on the benefits that each social token provides to its holders. The benefits are roughly broken down into three distinct categories:\n\n* Access: Being granted access to exclusive content or a community.\n* Earn: The ability to earn more of that token by doing some task.\n* Redeem: The ability to redeem that token for items or content.\n\nWhile many of the tokens offer some form of access or earnings, very few offer the ability to redeem, which was a distinguishing characteristic of just a handful. Because of the hierarchical nature of this data, we were able to break it down into a `dendrogram`, which traces the three different types of benefits to the tokens that offer them, and then a description of what specifically those benefits are. The dendrogram is shown below. We immediately see that “access” is the benefit given by the largest number of social tokens, where only three provide the ability to redeem for rewards. Interestingly, some tokens break down their benefits even within a particular category at a more fine-grained level. For example, SKULL lists four separate access benefits that are all related to Discord access tiers.\n\n![Forefront tracked tokens benefit analysis.](https://images.mirror-media.xyz/publication-images/hlw1P3Blvr76zg1pUd2qe.png?height=840&width=2048)\n\nWe can restructure this view in a slightly different format, flipping the token to the beginning and then splitting the benefits offered by that token from there. That graph is shown below. This representation allows us to better analyze the benefits offered by a specific token and see them in the chart together. For example, the Swagg Network offers one benefit from each category in this representation of the data.\n\n![Forefront tracked tokens benefit analysis (alt format).](https://images.mirror-media.xyz/publication-images/EA5OSvLqgM5uwfaufhIhs.png?height=840&width=2048)\n\n## Conclusion\n\nThis analysis highlights the way data science and analytics can be used to better understand characteristics of social tokens. In this case, we were able to use simple tags, utilities, and benefits data to order tokens with shared characteristics, and visually represent these characteristics in a simple yet appealing way.\n\nAs Forefront continues to grow, we look forward to performing a reprise of this analysis. If you have any further suggestions or ideas about what can be done in a future iteration of this analysis, please share and we will see what can be done!", "timestamp": 1632501959, "digest": "yMCdVyx6H1N_E_5EzFyDwM6PcFoqGwKtBsRnAAOiI18", "contributor": "0x70eCe45cDc64A768f936Ccb8aC851578251363e3"}
{"id": "XHr9lMcuft2u1k5CaYDpLxAtUiLvBdQQV6TV6Bs_CT8", "title": "The Weekly Hop #5: Bottom-up value creation in Loot", "body": "***The Weekly Hop is a newsletter written by Pathfinders. Click [here](https://rabbithole.mirror.xyz/2aWOCnFgLTRePfJn4C2P8RgmYh_I0VbPcColjQTtcJ8) to learn more about Pathfinders and our role in the decentralization of RabbitHole.***\n\nAlmost three weeks since its drop, [Loot](https://www.lootproject.com/) is still on my mind. And not because of what it is–yet–but because of what it could become.\n\n[Avichal Garg](https://twitter.com/avichal) of Electric Capital sums it up well when he likens Loot with a [deck of cards](https://twitter.com/avichal/status/1434271052939493376?s=20). On its own, a deck of cards is just 52 pieces of paper with signs and symbols on it. But with a bit of creativity, a deck of cards becomes the foundation to your favorite games–from Crazy 8’s, to Hearts, to my personal favorite, Poker. Similarly, while Loot may appear to be just an NFT with eight lines of white text against a black background, it could become the [foundation of an entire gaming metaverse](https://rabbithole.mirror.xyz/61mpC8avnWGmepJ0Ps1lN-Zzr9dyf_5R30j2JNiVEAU).\n\n### Turning social capital into financial capital: web3 membership communities\n\nBy building the [foundation of a game, without building a game itself](https://blog.coinbase.com/loot-project-the-first-community-owned-nft-gaming-platform-125fa1d5ffa8), Loot leaves its fate to the decentralized community that has begun to take shape around it.\n\nWith this strategy, Loot is helping to usher in what [Jacob Peters](https://twitter.com/J__Cub) describes as a [new era of community membership](https://twitter.com/J__Cub/status/1434527760790208512). Whereas web2 communities make money by charging membership fees, web3 communities make money by taking a percentage of the profits when NFTs are bought and sold. In an environment where NFT supply is fixed, so membership is scarce, communities are incentivized to grow by scaling their narrative.\n\nPeters sums up this process well in his community-first product development flywheel below.\n\n[https://twitter.com/J__Cub/status/1434527760790208512](https://twitter.com/J__Cub/status/1434527760790208512)\n\n### Loot as a headless brand\n\nGiven Loot’s reliance on bottom-up value creation, I wouldn’t be surprised to see Loot transform into what our friends over at the [Other Internet](https://otherinter.net/) refer to as a [headless brand](https://otherinter.net/research/headless-brands/).  One which is not controlled centrally, has some “immutable aspect,” and where users have a real stake in the brand–be it token, equity, status.\n\nIt’s this “stake in the brand” point that really puts things into perspective. Especially when we’re talking about developers: the [“true scarce resources of the web3 community world.”](https://twitter.com/J__Cub/status/1434527762040098822)\n\nSure, in the first couple weeks since Loot’s creation we’ve seen a multitude of projects pop  up–from [Lootmart](https://twitter.com/jonjyan/status/1433205141029761026?s=20), to [lootcharacter.com](https://www.lootcharacter.com/), to the ERC-20 Adventure Gold ($AGLD) token. But if we’ve [learned anything from previous projects like CryptoKitties](https://twitter.com/Flynnjamm/status/1434157038142111748), for Loot to continue to be successful and sustainable, developers need to continue to want to build on top of it. And importantly, that also includes developers who don’t own a Loot bag (i.e. those who wouldn't linearly benefit from the NFT’s uptake in value.)\n\n### What’s next for Loot\n\nKey to a developer’s willingness to build is the promise of mass market appeal. And in an environment where the majority of gamers are priced out of a Loot bag (current floor price is [7.39 ETH](https://opensea.io/collection/lootproject)), this just isn’t feasible.\n\nWhile Loot founder Dom Hofmann’s release of [Synthetic Loot](https://twitter.com/dhof/status/1433110412187287560?s=20) (i.e. a [type of Loot bag](https://blog.coinbase.com/loot-project-the-first-community-owned-nft-gaming-platform-125fa1d5ffa8) that “can’t be sold or transferred but can be used in Loot games, should a developer choose to allow it”) is an important step to opening the door to more players, I’m more excited to \\*hopefully\\* watch the broader Loot ecosystem begin to flex its decentralized strength. For me, it’s the development of Loot’s DAO that makes the difference between just another unsustainable NFT bubble and a stepping stone to achieving an open-source fantasy metaverse.\n\nJoin us in a conversation about what is next for Loot in its journey to decentralize the metaverse [@pathfinders_gg](https://twitter.com/pathfinders_gg) on Twitter! \n\n*This analysis of Loot and the role of decentralization in the project was written by [@anay_sim](https://twitter.com/anay_sim).* \n\n### Pathfinder update\n\nWe’re taking Pathfinders to the next level with the introduction of Artisans, a selected group of artists and designers creating the next generation of RabbitHole NFTs.\n\nHere’s a sneak peak on what they have in store. Any thoughts on what it could be?\n\n*Hint: RabbitHole hasn’t had a reward quite like this one.*\n\n![](https://images.mirror-media.xyz/publication-images/_-aZ4Zu5kd0W5Xf7ULxa7.png?height=582&width=463)\n\n### New Pathfinder guides\n\n* [Setting up / Bridging Funds on xDAI](https://rabbithole.mirror.xyz/Oxs8NXUGG2Gz4FsNmh509tBj5LEzJNvpt_IAYOFRVmg) by [@TheAlexYao](https://twitter.com/TheAlexYao)\n* [Deposit on PoolTogether (Polygon Network)](https://rabbithole.mirror.xyz/iOf5n4JioWli_Ht0txdXsfFxOBbQW_ecQBi0jJVVE-w) by [@bvajresh](https://twitter.com/bvajresh)\n* [How to Send Funds Using Hop](https://rabbithole.mirror.xyz/1uuTNpX30dZG3X__D1CONWlcqCx_2nGG1FSfpSIU7LA) by [@accel_capital](https://twitter.com/accel_capital)\n\n*Pathfinder update and compilation of this week’s Pathfinder guides written by [@JonahBaer](https://twitter.com/JonahBaer).*\n\n### Rabbit of the week\n\nYu-Gi-Oh! Rescue Rabbit Monster Card\n\n* Sending this guy to assist in your web3 journey\n* Don’t make us activate our trap card\n\n![](https://images.mirror-media.xyz/publication-images/cFU3KUOD3rxy0fF0Km9tP.png?height=695&width=478)\n\n", "timestamp": 1632505057, "digest": "v0eYFdIA05qthcWBgQcSfzHTUTcINME9YDCfj3omMLU", "contributor": "0x0ba85c9e1863E5efB8395a55cd042d61DECD6e89"}
{"id": "GEqlwafznhVZRBkDFUtmNMfin1zv-5iv_yauoRf2x6Q", "title": "Anti-Advertisement Campaign 1/?", "body": "## Rant\n\nAds… I hate them! I can’t imagine a reason anyone would like them. I block every social media advertisement that I come across, even if they’re targeting algorithm is extremely accurate.\n\n(I apologize for those whose careers are in advertising. I hate the game not the players—get your daily bread.)\n\nDigital ads are avoidable, but in the meatverse you can’t block ads. You’re all but forced to see what people pay to have you see. Your visual and mental bandwidth have a monetary value, and while I see the economic value in it; I believe that it has been over-saturated and perverted.\n\nShouldn’t the ad space you’re subjected to be a reflection of your community, be visually pleasing or, at the very least, be worth looking at again because you gain something from it? Maybe that’s just me.\n\n“*No it’s not just you, Tunacandrew!”*\n\nPhew! Okay, then let’s continue.\n\n### So what then?\n\nSo what you ask? Well, I’m introducing myself as Player ~~2 3 4~~ X. I want to bring community, art, stories, and NFTs to the real-world advertising space. I have selected a specific ad medium that suits all of these desires well and am working on an NFT project to act as a vehicle for it. In practice it will look like this:\n\nYou see the NFT while out at and about and, if you so choose, can collect it and support the project/artist via a QR code that directs you to the minting site.\n\nIt brings the NFT offline. Your first interaction isn’t through a crypto twitter shill or drop announcement 5 hours late because you live in a different time zone. You walk/drive/bike by and it naturally draws you in as art or literature SHOULD.\n\nThis project is in its infancy. As of right now it is a solo ordeal. I’m teaching myself 3D modeling and some coding to get this started so forgive me for holding all of my cards close to my chest. As the project develops I will be certain to reveal more information and bring in those well-suited to assist me in implementing this.\n\n### What comes next?\n\nHere is a list of what I believe are the next steps for this project to gain speed. (subject to change and not particularly in order)\n\n* Build up 3D modeling skills\n* Create rendered prototypes\n* Write story \n* Get a segment of aforementioned story illustrated for prototype\n* Debut prototype on Mirror\n* Crowdfund for ad space purchasing/minting costs/further illustration costs\n* Get entire story illustrated\n* Launch story in both meat and metaverses\n* Reach out to artists for collaborations\n* Grow and flourish\n* *Rent a blimp by end of year 1?*\n\nI’m excited. Diving headfirst into Web3.\n\n\\-Tunacandrew\n\nHave a song :)\n\n[https://www.youtube.com/watch?v=EfLiX4TX4PA](https://www.youtube.com/watch?v=EfLiX4TX4PA)\n\n", "timestamp": 1632512530, "digest": "QaWp4KQqnEqAySH7hMeLe_7hId-3wOMBSkjzkFv6jCs", "contributor": "0x2bA7EF752b2724cd5baB9bE5527118f3532Ff381"}
{"id": "I2i6CiJqj_4HgIClZV-Gw8-khBvmM7E9IqoR4WazY7A", "title": "Tutorial: How to stake ETH on Lido", "body": "## What is Lido?\n\n[Lido](https://lido.fi/) is a decentralized, non-custodial, liquid platform for staking ETH. Users are able to stake any amount and receive stETH (staked ether) in return. StETH represents the deposited amount plus lending rewards, which is updated daily. The current APR for staking on Lido is 5% — you can find the updated amount [here](https://lido.fi/ethereum). As you might know, APR increases if the protocol has too little ETH staked in order to incentivize more providers.\n\nThe [LDO](https://blog.lido.fi/introducing-ldo/) governance token is distributed to its DAO members, who are responsible for protocol upgrades, defining parameters, and managing the group of liquidity pools that Lido has. The LDO tokens have a 1-year lock-up period, following a 1-year vesting period. It is up to the DAO, not the user, to decide which pool the stake enters.\n\nLet’s navigate over to [Lido](https://lido.fi/) and go through how to stake ETH on it.\n\n### Step 1: Click “Stake now” on the Ethereum 2.0 option and connect your preferred wallet\n\n![](https://images.mirror-media.xyz/publication-images/X6-F5yNV0vDmnfUfToEIV.png?height=779&width=1446)\n\n![](https://images.mirror-media.xyz/publication-images/Pssy4Am63aZ-vBHBZPjRL.png?height=717&width=999)\n\nGo through the usual steps of connecting your preferred wallet to Lido.\n\n### Step 2: Choose the amount to stake\n\nOnce you connect your wallet and enter the staking [page](https://stake.lido.fi/), choose the amount of ether that you would like to stake.\n\n![](https://images.mirror-media.xyz/publication-images/tirx9HikD6w381E35WdfI.png?height=750&width=1016)\n\nThe equivalent amount of stETH will appear on the screen (it will vary slightly from the expected 1:1). The reward fee percentage refers to the fee collected on stake rewards and not the staked amount. It is put towards the Lido DAO and the node validators.\n\nThere is no minimum required amount to stake nor a lock-up period for the staked tokens.\n\n### Step 3: Confirm the transaction and receive stETH\n\nYou will be prompted by your wallet to confirm the transaction after you click on “Submit”. Be sure to approve the amount and give it a few moments for the stake to complete.\n\n![](https://images.mirror-media.xyz/publication-images/K6XEC6J6asH0I8gn54J9d.png?height=600&width=882)\n\nYour wallet should now contain the equivalent amount of stETH — rewards update on a daily basis and you should notice your stETH accruing accordingly.\n\n### Congratulations! You have now staked ether on Lido.\n\n### Quick cautionary note on staking on Ethereum 2.0\n\nEthereum 2.0 is currently under active development, which means there is a higher risk of bugs being present in addition to Lido’s own risk of smart contract vulnerability. Due to the network’s limitations on transactions, there is no ability to unstake the provided ETH as of now. The stETH token provided by Lido exists in order to allow users to use, transfer, and trade on other DeFi protocols while their ETH is locked up.\n\nKeep in mind that the amount of stETH held ties directly back to the staked ETH, so when it comes time to unstake the ETH, the user will only be able to unstake the equivalent amount of stETH they hold.\n\n### \n\n\n---\n\nIf you have any further questions about this guide, feel free to reach out on Twitter [@eshita](https://twitter.com/eshita)", "timestamp": 1632512433, "digest": "GWZZfv6RxB3tYQpi63m3uFNnDkImmE73M4lNGmsXwhQ", "contributor": "0x29Bc18979B5aF84B820bDDfAc207b224c7a959DE"}
{"id": "H7cgtyExUFRWbdoUyWb6FcBCgyC_pcYWL265Ygl2l3Y", "title": "Lurker | First Porn on Mirror", "body": "This episode explores three timely issues relating to DAOs. But first some porn.\n\n![Not a turn-on](https://images.mirror-media.xyz/publication-images/BVV_JNPPsw9tnj-0H0lpp.jpg?height=560&width=1600)\n\nWhat you just viewed is a portion of the body of the person associated with the wallet 0xa5A975bBE102B1bcc2bd2E992525d5D351BABDD3. This individual, a Lurker Season 1, Episode 1 NFT collector, agreed to submit this image into the blockchain on the condition we didn’t divulge what  body part it featured. We’ve been authorized to confirm it’s an extremely sensitive and strange smelling region of the body that enjoys hot tubs and Giants games. It considers itself spiritual rather than religious, and its biggest regret is thinking “What is this shit?” when it saw a Squiggle for the first time.\n\nWe’d like to state very clearly for Arweave and the historical-record IRL, that this is the first porn ever published on Mirror, unless you consider Mirror pub owner @coopatroopa’s simple presence and everyday-outfits sensual enough to induce arousal (hint: It is and they are).\n\n![oh hell yes](https://images.mirror-media.xyz/publication-images/MlEwLYDk3f6lxrRGhdIRn.jpg?height=560&width=1600)\n\nNow, to Lurker business. These are the things on our mind, at the moment.\n\n### Issue # 1 - Whiners\n\nThey’ve arrived. DAOs are made up of humans. And humans come in all types. And some of those types are a bit miffed because the creator-economy-focused DAO they are members of didn’t choose to fund their magical-realism book project that also apparently will include some crypto-references in chapter twelve.\n\n![Reminds us of a few BTC-maxis we know](https://images.mirror-media.xyz/publication-images/iYDd3xNL5P8BzaXaXwdrW.jpg?height=560&width=1600)\n\nThese folks have been telling anyone who will listen that they “thought this project was going to be more decentralized.” They’ve attracted the attention of the community managers who are trying to buck them up by following them on twitter and hitting every one of their sniffly Discord comments with a [️‍](https://emojipedia.org/heart-on-fire/)🔥.\n\nDo these individuals have the mojo to form a splinter DAO? Will they propose their own snapshot vote to counter DAO leadership? Or will they suck it up and get over it? Lurkers everywhere will be watching to find out.\n\n### Issue #2 - Shit involving DJs\n\nFrom the first moment lurkers joined DAOs it was clear that just about everyone else was more bespoke, intellectual and hip than they were. Want a taste? This is a realistic, yet make-believe intro post on Friends with Benefits:\n\n***Greetings- I’m Stefan, a PhD student at the University of Berlin. I’m working on a treatise about the German Black Forest and its relationship to psychedelic-induced nirvana. I’ll be presenting my findings to the United Nations General Assembly in October. My hot partner Gretchen and I road-tripped through southern Africa this summer. You may have seen the documentary about the trip titled Good Looking, Brilliant People Driving Through Africa. Once the World Chess Championships are over and I’m back from Moscow, I look forward to vibing with you all. Also, Gretchen and I just joined a16z as General Partners. And we surf!***\n\nThis guy would be a total loser in most DAOs. He doesn’t appear to have any connection to DJs. That’s the new cool in DAOs. It is amazing how many people in this space are either supporting DJ-related projects, are members of a posse led by DJs *or are actual DJs themselves*.\n\n![how does one get invited to such an event?](https://images.mirror-media.xyz/publication-images/XO-b1ZdcrhpN3fwrvTkCz.jpg?height=560&width=1600)\n\nDo we really want to go there? Once we accept the hipster-inflation of requiring DJ cred to be cool, we permanently disadvantage millions of MetMask wallets. Most importantly, every Lurker on earth takes a hit because we don’t know any DJs, other than Bradley in Phoenix whose sixty-three year old father is a “DJ” in the band, *Mid-Life Crisis*.\n\nFor our mental health we are going to assume ninety-percent of those who claim connections to DJs are liars. Because in our world, the only way to get involved with a DJ is to show up at a late night-y club and when the DJ goes on break, approach him or her, stick out one’s hand and say, “Hello, my name is Alfred, it’s nice to meet you.” And that just doesn’t sound like it would work.\n\n### Issue # 3 - Vibes. Where do we stand?\n\nBeing a member of a DAO is more than just flexing online, though that is extremely important. It’s also about the vibes.\n\nMost people assume you can reliably measure the vibes by the number of gms in your feed. But that’s not good enough. Lurker has developed a proprietary algorithm that is  more precise. We used it to review the vibes at three blue-chip DAOs.\n\n![Billion-dollar organizations on trillion-dollar networks?](https://images.mirror-media.xyz/publication-images/xDyUdLRKsSOSBBVNbCJ08.png?height=560&width=1600)\n\n### Friends with Benefits\n\nThe vibes in FWB were OK earlier in the summer, nothing to get too excited about. In early August, the vibes started getting better. Then on August 26th and again on August 28th, the vibes turned orgasmic. These were the vibes the VCs came for. But then on September 4th the vibes changed. Suddenly the vibes SUCKED ASS. Now that the vibes are going sideways, many FWB members are thinking about diversifying their vibes into ETH or maybe some Solana small-caps.\n\n### Forefront\n\nMedia companies haven’t had great vibes over the past ten years. That’s why it was cute but not realistic that Forefront could create good vibes. They are a media company. On the blockchain. These guys aren’t exactly talking about taking over world culture city-by-city like the frenzied masses at FWB. So the vibes were predictably mellow through June. And then in August and extending into September, THE VIBES WENT PARABOLIC. They went so parabolic that even shy, pale lurkers, often snacking on a bag of Flamin-Hot Doritos in their mom’s basements have a small, shy smile on their faces.\n\n### Bankless\n\nMeasuring the vibes in the Bankless DAO is difficult because it’s filled with some of the biggest dweebs in crypto. This is distracting. The first task, before even considering technical analysis, is to distinguish between David Hoffman and Ryan Sean Adams. At first blush, they are the same perky person. They each have the complexion of an eleven year old girl. Both are fueled by lemonade, sunshine and Easter Bunny whiskers. But with our proprietary Lurker algorithm, we’ve come up with some good data. It’s just too boring to share. In short, Bankless has had pretty solid vibes all summer. Yet, these vibes come at a steady discount because when a high-level lurker joined the DAO they were aggressively approached with a question, “Hi Gerald, why did you join Bankless and what projects do you plan on working on?”\n\n### Artist’s note\n\n![Meet GREP](https://images.mirror-media.xyz/publication-images/yRhI53v7wCQIvY6NsuWtP.png?height=560&width=1600)\n\nThis episode features GREP (ze/zir/zim), the second of Lurker’s mascots. Ze quietly lurks in the cloud, watching all the plain-text data sets pass by, occasionally stopping to read someone’s particularly interesting unencrypted Target shopping list or peruse a public database of city names that start with Q. Zir star sign is Capricorn.\n\ndesignerd reference 1: grep is a UNIX command\n\ndesignerd reference 2: Zir clouds have a hex pattern made up of hex code (0-F)\n\n## Collect this NFT of Season 1, Episode 2 above… or have fun staying poor.\n\nHave ideas or tips for future episodes? Check out our [Discord](https://discord.gg/AwFrfh2HKu).", "timestamp": 1632517206, "digest": "4_VfzE7foOGA9BRqmOGB4pjH9KUR4Ju9Wn3W1rJ8ayk", "contributor": "0xfbdf598dB4dBA841f40680Cd9C2D3cF618265be0"}
{"id": "pVB_CHLPJjXyJe63hOIIYLHean6LvOvQBxg1USqU_AE", "title": "Lurker | First Porn on Mirror", "body": "This episode explores three timely issues relating to DAOs. But first some porn.\n\n![Not a turn-on](https://images.mirror-media.xyz/publication-images/BVV_JNPPsw9tnj-0H0lpp.jpg?height=560&width=1600)\n\nWhat you just viewed is a portion of the body of the person associated with the wallet 0xa5A975bBE102B1bcc2bd2E992525d5D351BABDD3. This individual, a Lurker Season 1, Episode 1 NFT collector, agreed to submit this image into the blockchain on the condition we didn’t divulge what  body part it featured. We’ve been authorized to confirm it’s an extremely sensitive and strange smelling region of the body that enjoys hot tubs and Giants games. It considers itself spiritual rather than religious, and its biggest regret is thinking “What is this shit?” when it saw a Squiggle for the first time.\n\nWe’d like to state very clearly for Arweave and the historical-record IRL, that this is the first porn ever published on Mirror, unless you consider Mirror pub owner @coopatroopa’s simple presence and everyday-outfits sensual enough to induce arousal (hint: It is and they are).\n\n![oh hell yes](https://images.mirror-media.xyz/publication-images/MlEwLYDk3f6lxrRGhdIRn.jpg?height=560&width=1600)\n\nNow, to Lurker business. These are the things on our mind, at the moment.\n\n### Issue # 1 - Whiners\n\nThey’ve arrived. DAOs are made up of humans. And humans come in all types. And some of those types are a bit miffed because the creator-economy-focused DAO they are members of didn’t choose to fund their magical-realism book project that also apparently will include some crypto-references in chapter twelve.\n\n![Reminds us of a few BTC-maxis we know](https://images.mirror-media.xyz/publication-images/iYDd3xNL5P8BzaXaXwdrW.jpg?height=560&width=1600)\n\nThese folks have been telling anyone who will listen that they “thought this project was going to be more decentralized.” They’ve attracted the attention of the community managers who are trying to buck them up by following them on twitter and hitting every one of their sniffly Discord comments with a [️‍](https://emojipedia.org/heart-on-fire/)🔥.\n\nDo these individuals have the mojo to form a splinter DAO? Will they propose their own snapshot vote to counter DAO leadership? Or will they suck it up and get over it? Lurkers everywhere will be watching to find out.\n\n### Issue #2 - Shit involving DJs\n\nFrom the first moment lurkers joined DAOs it was clear that just about everyone else was more bespoke, intellectual and hip than they were. Want a taste? This is a realistic, yet make-believe intro post on Friends with Benefits:\n\n***Greetings- I’m Stefan, a PhD student at the University of Berlin. I’m working on a treatise about the German Black Forest and its relationship to psychedelic-induced nirvana. I’ll be presenting my findings to the United Nations General Assembly in October. My hot partner Gretchen and I road-tripped through southern Africa this summer. You may have seen the documentary about the trip titled Good Looking, Brilliant People Driving Through Africa. Once the World Chess Championships are over and I’m back from Moscow, I look forward to vibing with you all. Also, Gretchen and I just joined a16z as General Partners. And we surf!***\n\nThis guy would be a total loser in most DAOs. He doesn’t appear to have any connection to DJs. That’s the new cool in DAOs. It is amazing how many people in this space are either supporting DJ-related projects, are members of a posse led by DJs *or are actual DJs themselves*.\n\n![how does one get invited to such an event?](https://images.mirror-media.xyz/publication-images/XO-b1ZdcrhpN3fwrvTkCz.jpg?height=560&width=1600)\n\nDo we really want to go there? Once we accept the hipster-inflation of requiring DJ cred to be cool, we permanently disadvantage millions of MetMask wallets. Most importantly, every Lurker on earth takes a hit because we don’t know any DJs, other than Bradley in Phoenix whose sixty-three year old father is a “DJ” in the band, *Mid-Life Crisis*.\n\nFor our mental health we are going to assume ninety-percent of those who claim connections to DJs are liars. Because in our world, the only way to get involved with a DJ is to show up at a late night-y club and when the DJ goes on break, approach him or her, stick out one’s hand and say, “Hello, my name is Alfred, it’s nice to meet you.” And that just doesn’t sound like it would work.\n\n### Issue # 3 - Vibes. Where do we stand?\n\nBeing a member of a DAO is more than just flexing online, though that is extremely important. It’s also about the vibes.\n\nMost people assume you can reliably measure the vibes by the number of gms in your feed. But that’s not good enough. Lurker has developed a proprietary algorithm that is  more precise. We used it to review the vibes at three blue-chip DAOs.\n\n![Billion-dollar organizations on trillion-dollar networks?](https://images.mirror-media.xyz/publication-images/xDyUdLRKsSOSBBVNbCJ08.png?height=560&width=1600)\n\n### Friends with Benefits\n\nThe vibes in FWB were OK earlier in the summer, nothing to get too excited about. In early August, the vibes started getting better. Then on August 26th and again on August 28th, the vibes turned orgasmic. These were the vibes the VCs came for. But then on September 4th the vibes changed. Suddenly the vibes SUCKED ASS. Now that the vibes are going sideways, many FWB members are thinking about diversifying their vibes into ETH or maybe some Solana small-caps.\n\n### Forefront\n\nMedia companies haven’t had great vibes over the past ten years. That’s why it was cute but not realistic that Forefront could create good vibes. They are a media company. On the blockchain. These guys aren’t exactly talking about taking over world culture city-by-city like the frenzied masses at FWB. So the vibes were predictably mellow through June. And then in August and extending into September, THE VIBES WENT PARABOLIC. They went so parabolic that even shy, pale lurkers, often snacking on a bag of Flamin-Hot Doritos in their mom’s basements have a small, shy smile on their faces.\n\n### Bankless\n\nMeasuring the vibes in the Bankless DAO is difficult because it’s filled with some of the biggest dweebs in crypto. This is distracting. The first task, before even considering technical analysis, is to distinguish between David Hoffman and Ryan Sean Adams. At first blush, they are the same perky person. They each have the complexion of an eleven year old girl. Both are fueled by lemonade, sunshine and Easter Bunny whiskers. But with our proprietary Lurker algorithm, we’ve come up with some good data. It’s just too boring to share. In short, Bankless has had pretty solid vibes all summer. Yet, these vibes come at a steady discount because when a high-level lurker joined the DAO they were aggressively approached with a question, “Hi Gerald, why did you join Bankless and what projects do you plan on working on?”\n\n### Artist’s note\n\n![Meet GREP](https://images.mirror-media.xyz/publication-images/yRhI53v7wCQIvY6NsuWtP.png?height=560&width=1600)\n\nThis episode features GREP (ze/zir/zim), the second of Lurker’s mascots. Ze quietly lurks in the cloud, watching all the plain-text data sets pass by, occasionally stopping to read someone’s particularly interesting unencrypted Target shopping list or peruse a public database of city names that start with Q. Zir star sign is Capricorn.\n\ndesignerd reference 1: grep is a UNIX command\n\ndesignerd reference 2: Zir clouds have a hex pattern made up of hex code (0-F)\n\n## Collect this NFT of Season 1, Episode 2 above… or have fun staying poor.\n\nHave ideas or tips for future episodes? Check out our [Discord](https://discord.gg/AwFrfh2HKu).", "timestamp": 1632513952, "digest": "4_VfzE7foOGA9BRqmOGB4pjH9KUR4Ju9Wn3W1rJ8ayk", "contributor": "0xfbdf598dB4dBA841f40680Cd9C2D3cF618265be0"}
{"id": "sw7LfT_bgSgcQQJkAg_VItarGNpS9_E3RDq9yuuL2XA", "title": "Lurker | First Porn on Mirror", "body": "This episode explores three timely issues relating to DAOs. But first some porn.\n\n![Not a turn-on](https://images.mirror-media.xyz/publication-images/BVV_JNPPsw9tnj-0H0lpp.jpg?height=560&width=1600)\n\nWhat you just viewed is a portion of the body of the person associated with the wallet 0xa5A975bBE102B1bcc2bd2E992525d5D351BABDD3. This individual, a Lurker Season 1, Episode 1 NFT collector, agreed to submit this image into the blockchain on the condition we didn’t divulge what  body part it featured. We’ve been authorized to confirm it’s an extremely sensitive and strange smelling region of the body that enjoys hot tubs and Giants games. It considers itself spiritual rather than religious, and its biggest regret is thinking “What is this shit?” when it saw a Squiggle for the first time.\n\nWe’d like to state very clearly for Arweave and the historical-record IRL, that this is the first porn ever published on Mirror, unless you consider Mirror pub owner @coopatroopa’s simple presence and everyday-outfits sensual enough to induce arousal (hint: It is and they are).\n\n![oh hell yes](https://images.mirror-media.xyz/publication-images/MlEwLYDk3f6lxrRGhdIRn.jpg?height=560&width=1600)\n\nNow, to Lurker business. These are the things on our mind, at the moment.\n\n### Issue # 1 - Whiners\n\nThey’ve arrived. DAOs are made up of humans. And humans come in all types. And some of those types are a bit miffed because the creator-economy-focused DAO they are members of didn’t choose to fund their magical-realism book project that also apparently will include some crypto-references in chapter twelve.\n\n![Reminds us of a few BTC-maxis we know](https://images.mirror-media.xyz/publication-images/iYDd3xNL5P8BzaXaXwdrW.jpg?height=560&width=1600)\n\nThese folks have been telling anyone who will listen that they “thought this project was going to be more decentralized.” They’ve attracted the attention of the community managers who are trying to buck them up by following them on twitter and hitting every one of their sniffly Discord comments with a [️‍](https://emojipedia.org/heart-on-fire/)🔥.\n\nDo these individuals have the mojo to form a splinter DAO? Will they propose their own snapshot vote to counter DAO leadership? Or will they suck it up and get over it? Lurkers everywhere will be watching to find out.\n\n### Issue #2 - Shit involving DJs\n\nFrom the first moment lurkers joined DAOs it was clear that just about everyone else was more bespoke, intellectual and hip than they were. Want a taste? This is a realistic, yet make-believe intro post on Friends with Benefits:\n\n***Greetings- I’m Stefan, a PhD student at the University of Berlin. I’m working on a treatise about the German Black Forest and its relationship to psychedelic-induced nirvana. I’ll be presenting my findings to the United Nations General Assembly in October. My hot partner Gretchen and I road-tripped through southern Africa this summer. You may have seen the documentary about the trip titled Good Looking, Brilliant People Driving Through Africa. Once the World Chess Championships are over and I’m back from Moscow, I look forward to vibing with you all. Also, Gretchen and I just joined a16z as General Partners. And we surf!***\n\nThis guy would be a total loser in most DAOs. He doesn’t appear to have any connection to DJs. That’s the new cool in DAOs. It is amazing how many people in this space are either supporting DJ-related projects, are members of a posse led by DJs *or are actual DJs themselves*.\n\n![how does one get invited to such an event?](https://images.mirror-media.xyz/publication-images/XO-b1ZdcrhpN3fwrvTkCz.jpg?height=560&width=1600)\n\nDo we really want to go there? Once we accept the hipster-inflation of requiring DJ cred to be cool, we permanently disadvantage millions of MetMask wallets. Most importantly, every Lurker on earth takes a hit because we don’t know any DJs, other than Bradley in Phoenix whose sixty-three year old father is a “DJ” in the band, *Mid-Life Crisis*.\n\nFor our mental health we are going to assume ninety-percent of those who claim connections to DJs are liars. Because in our world, the only way to get involved with a DJ is to show up at a late night-y club and when the DJ goes on break, approach him or her, stick out one’s hand and say, “Hello, my name is Alfred, it’s nice to meet you.” And that just doesn’t sound like it would work.\n\n### Issue # 3 - Vibes. Where do we stand?\n\nBeing a member of a DAO is more than just flexing online, though that is extremely important. It’s also about the vibes.\n\nMost people assume you can reliably measure the vibes by the number of gms in your feed. But that’s not good enough. Lurker has developed a proprietary algorithm that is  more precise. We used it to review the vibes at three blue-chip DAOs.\n\n![Billion-dollar organizations on trillion-dollar networks?](https://images.mirror-media.xyz/publication-images/xDyUdLRKsSOSBBVNbCJ08.png?height=560&width=1600)\n\n### Friends with Benefits\n\nThe vibes in FWB were OK earlier in the summer, nothing to get too excited about. In early August, the vibes started getting better. Then on August 26th and again on August 28th, the vibes turned orgasmic. These were the vibes the VCs came for. But then on September 4th the vibes changed. Suddenly the vibes SUCKED ASS. Now that the vibes are going sideways, many FWB members are thinking about diversifying their vibes into ETH or maybe some Solana small-caps.\n\n### Forefront\n\nMedia companies haven’t had great vibes over the past ten years. That’s why it was cute but not realistic that Forefront could create good vibes. They are a media company. On the blockchain. These guys aren’t exactly talking about taking over world culture city-by-city like the frenzied masses at FWB. So the vibes were predictably mellow through June. And then in August and extending into September, THE VIBES WENT PARABOLIC. They went so parabolic that even shy, pale lurkers, often snacking on a bag of Flamin-Hot Doritos in their mom’s basements have a small, shy smile on their faces.\n\n### Bankless\n\nMeasuring the vibes in the Bankless DAO is difficult because it’s filled with some of the biggest dweebs in crypto. This is distracting. The first task, before even considering technical analysis, is to distinguish between David Hoffman and Ryan Sean Adams. At first blush, they are the same perky person. They each have the complexion of an eleven year old girl. Both are fueled by lemonade, sunshine and Easter Bunny whiskers. But with our proprietary Lurker algorithm, we’ve come up with some good data. It’s just too boring to share. In short, Bankless has had pretty solid vibes all summer. Yet, these vibes come at a steady discount because when a high-level lurker joined the DAO they were aggressively approached with a question, “Hi Gerald, why did you join Bankless and what projects do you plan on working on?”\n\n### Artist’s note\n\n![Meet GREP](https://images.mirror-media.xyz/publication-images/yRhI53v7wCQIvY6NsuWtP.png?height=560&width=1600)\n\nThis episode features GREP (ze/zir/zim), the second of Lurker’s mascots. Ze quietly lurks in the cloud, watching all the plain-text data sets pass by, occasionally stopping to read someone’s particularly interesting unencrypted Target shopping list or peruse a public database of city names that start with Q. Zir star sign is Capricorn.\n\ndesignerd reference 1: grep is a UNIX command\n\ndesignerd reference 2: Zir clouds have a hex pattern made up of hex code (0-F)\n\n## Collect this NFT of Season 1, Episode 2 above… or have fun staying poor.\n\nHave ideas or tips for future episodes? Check out our [Discord](https://discord.gg/AwFrfh2HKu).", "timestamp": 1632513952, "digest": "4_VfzE7foOGA9BRqmOGB4pjH9KUR4Ju9Wn3W1rJ8ayk", "contributor": "0xfbdf598dB4dBA841f40680Cd9C2D3cF618265be0"}
{"id": "C7UO4sUH908CWXeW_797qWPGIGclv2-UTCa56bqH-S4", "title": "The First Film: Cabourg", "body": "Last week, the community asked if an NFT platform would ever support videos over 2 minutes.\n\n[https://twitter.com/AllAroundArtsy/status/1438610612616040449?s=20](https://twitter.com/AllAroundArtsy/status/1438610612616040449?s=20)\n\n[https://twitter.com/GlassProtocol/status/1438735983772454915?s=20](https://twitter.com/GlassProtocol/status/1438735983772454915?s=20)\n\n# Today, we respond with the first 20 minute film…\n\n* The first film uploaded to the [Permaweb](https://www.arweave.org/)\\*\n* The first film monetized with [Solana](https://solana.com)\\*\n* The first long-form video on [Glass](https://glass.xyz)\n* The first production by [Dito](https://www.instagram.com/orlandito/)\n\n# Watch Cabourg on Glass 👇\n\n[https://glass.xyz/v/2lZaBhUrYmu4wK8NnTBw-BP8av8m5CNi-RlYlqVhVlo](https://glass.xyz/v/2lZaBhUrYmu4wK8NnTBw-BP8av8m5CNi-RlYlqVhVlo)\n\nThis is a classic story of an artist and his entourage which includes the manager, DJ, and videographer. The group goes to a Normandy villa to celebrate the end of their European tour. However, the celebration takes an ominous turn under the eyes of the property’s caretaker.\n\n> **The team had a $2000 budget for the film. Let’s help fund their next work. [Leave a tip if you like the film!](https://glass.xyz/v/2lZaBhUrYmu4wK8NnTBw-BP8av8m5CNi-RlYlqVhVlo)**\n\n# …or just watch it here on Mirror 😏\n\n[https://glass.xyz/embed/2lZaBhUrYmu4wK8NnTBw-BP8av8m5CNi-RlYlqVhVlo?display=iframe](https://glass.xyz/embed/2lZaBhUrYmu4wK8NnTBw-BP8av8m5CNi-RlYlqVhVlo?display=iframe)\n\n# About The Film\n\nCabourg was shot over the Summer of 2019 between six friends from New York with a passion for creative storytelling. Produced, co-Directed, and written by Orlando also known as ‘Dito’. It was his first film. Cabourg ended up winning the Audience Choice Award at the Hip Hop Film Fest.\n\n![Cabourg Movie Poster](https://images.mirror-media.xyz/publication-images/w2ED4wOkY2CL60eaQEVLr.jpeg?height=1464&width=1170)\n\n# Director Interview\n\n[https://www.clique.works/artist-interviews/cliques-profile-cabourg-film](https://www.clique.works/artist-interviews/cliques-profile-cabourg-film)\n\n# Disclaimer\n\n\\* First Arweave & Solana film **to our knowledge**.", "timestamp": 1632525157, "digest": "amZuMoq37URc9iHCOSHyL0th2u0GNARPaydFqDFoQbY", "contributor": "0xDb6c1a8aF1883262aaD221A25816468ef693D4A2"}
{"id": "0tn-6bcWAGEczrAqFOeQdin0uQXoozym5mSdkV0U534", "title": "Lets have fun with it. ", "body": "Let’s have fun with it. 🤝", "timestamp": 1632546311, "digest": "31YO5oTHSf5xzW7Drf3cy4_HQPp9yJVe0-BXnW3ENPA", "contributor": "0xEf58304E292fBAeacFdeC25b67b3438031FdE313"}
{"id": "fwc4M9P1tOCxP4s2YSjKIX2knuSbyNQsxwQb0CdjRnA", "title": "Let's have some fun with it. ", "body": "Let’s have some fun with it. 🤝", "timestamp": 1632546345, "digest": "31YO5oTHSf5xzW7Drf3cy4_HQPp9yJVe0-BXnW3ENPA", "contributor": "0xEf58304E292fBAeacFdeC25b67b3438031FdE313"}
{"id": "2Xt1rsNLZE5L_Bz0z1uSrKbfLSRnBckzn9n43kahYUs", "title": "Hello World", "body": "We are Phlote. (“flōt”)\n\nWhy are we here?\n\nWe’re here to free artists.\n\nHow do we do that?\n\nWe’ll sell mp3’s for $2 million. \n\nThe goal is clear. We want more artists to exist in the world because a more creative world is a better one. We’ll use Mirror to document our discoveries along the way to building Phlote into something special. Everyone is welcome to participate. \n\nLet’s do it together. 🤝", "timestamp": 1632547845, "digest": "RzPvnxUMmsWXzw9MALtY2NnMqDxYhZvNUhPghKoprSk", "contributor": "0xEf58304E292fBAeacFdeC25b67b3438031FdE313"}
