{"id": "IxxgXO2pjIQXLAfxdY2G794LELmxktXfyySJcL0qBPc", "title": "My Dream for the Planet School", "body": "Last week, I stepped off the *SSV* (Sailing School Vessel) *Corwith Cramer* after spending six weeks at sea as the 3rd Mate for “Marine Biodiversity & Conservation,” a college semester-at-sea program run by the Sea Education Association (SEA)*.* Coming aboard in Key West, Florida seven weeks ago marked 14 years since I had stepped onto *Cramer* as a student myself. I had never been sailing before and I had no idea how profoundly that voyage would impact me. They say that the sea is a great teacher and I agree, but the community we intentionally create at sea deserves description too.\n\nAn isolated ship at sea is, in many ways, an ideal medium for creating deeply impactful learning opportunities. For this inaugural Planet School blog post, I want to share why I love to teach at sea and how the core elements of an ocean-based curriculum do not actually need to be unique to the sea at all. To do that, I need to give a bit of background on what it means to go sailing for a semester on a tall ship.\n\n![Removing the crutch of GPS and navigating with the stars is yet another opportunity for authentic student agency.](https://images.mirror-media.xyz/publication-images/2czv-EUWimA9Q8y4l-iNF.jpeg?height=450&width=600)\n\nMake no mistake: sailing is hard work. I suspect that many students, like me when I was 20 years old, perceive a semester aboard a sailboat as one of relaxing exoticism bordering on luxuriousness: perfect sunsets, dolphins chasing the bow, strumming a guitar, reading *Treasure Island* or *Moby Dick* and coming home with a perfect tan and a year’s worth of Instagram posts—no filter, obviously. After all, yachts are a pastime of the wealthy and the Caribbean is a vacation destination. While there are innumerable moments of grandeur to be had at sea and all of the things I listed above usually happen multiple times on every voyage, they belie the full story. Any notion of #YachtLife is a delusion that gets shaken almost instantly.\n\nStudents step onto the ship and they step into a new world. First, the language is completely different—both the immense vocabulary of nautical terminology as well as the style of repeating commands. When you are given a task, you repeat the command back to the person who just gave it to you, then you go do the task, then once the task is done you return to the person who gave you the task and tell them it is complete, which they then repeat back to you. This creates a closed loop—there is little chance for miscommunication—but that much repetition does not come naturally. So not only do students have multiple subject areas to master—navigation, seamanship, meteorology, watch standing duties, laboratory procedures—but their way of communicating is being frequently corrected. They are studying new subjects in a new language in a place that is constantly moving (making many of them seasick) and with a watch-standing schedule that means their sleep is inconsistent. On all fronts, my semester with SEA in college was, hands down, my most challenging term and Brown University was not exactly a cake walk.\n\n![](https://images.mirror-media.xyz/publication-images/wYOcovwOe7n5jeVg9IkIg.jpeg?height=3456&width=4608)\n\n## A Three Phase Approach\n\nEvery voyage program I have sailed on—SEA vessels and Proctor Academy’s Ocean Classroom semester—breaks their trip into three phases: The Spaghetti Phase, The Shadow Phase, and the Junior Watch Officer (JWO) Phase. The Spaghetti Phase is so named because, for the students, it feels like information is being thrown at them like spaghetti: some of it sticks and some (most) just falls to the deck. It could also be called the Firehose Phase because it can feel like drinking from a firehose. Whatever the metaphor, the first phase is characterized by feeling overwhelmed, adjusting to the boat, and being corrected frequently. It can be discouraging, so building unity within a student’s watch is important as is creating frequent moments for light hearted community building. The goal is for students to learn *what* to do and to see this behavior role-modeled by the staff.\n\nThe second phase (usually following two weeks of spaghetti) is when students start to shift to learning *why* things are done. During each watch, a student is selected to be the shadow and follow the mate through their duties. The mate narrates what they are doing as they do it, the student accompanies the mate when they check in with the captain, and the student starts to take the lead in various routines, like making sure the hourly boat checks and weather observations are completed. This is the chance to start peeking behind the curtain and feel invited to partake in the boat’s management.\n\nFinally, the JWO Phase. In many ways, the entire trip builds to the JWO Phase. During this phase, a student is elevated to the position of Junior Watch Officer during their watch and takes over for the mate. Students interact directly with the captain to respond to weather changes, recommend sail evolutions, and delegate tasks within their watch.  The JWO can even delegate tasks to the mate, so long as the task does not take the mate away from the quarterdeck for more than 10 minutes. While the mate is still the safety officer and legally responsible for the watch, they step back as much as possible. Mates are told to let mistakes happen and only yell “Hold!” if a student is about to injure someone or damage the boat. No reason is given for yelling “Hold!”, so action does not resume until the JWO or one of their watchmates discovers the problem and corrects it.\n\n![A JWO, wearing the \"JWO Hat,\" plotting the ship's position.](https://images.mirror-media.xyz/publication-images/pw2OQCJQxLevILLX_gG1F.jpeg?height=3024&width=4032)\n\n## A Recipe for Great Learning\n\nThis three phase progression is where the magic happens. All three phases are essential; neither is successful without the other two. Most conventional classrooms never make it past the Spaghetti Phase. Conversely, if we were to skip the Spaghetti Phase, the students would not feel prepared for the greater responsibility asked of them. This progression works because of the learning environment that is very intentionally created by the staff, both in the program’s core design and through staff meetings that happen underway. That environment consists of a few essential ingredients:\n\n1. **Authenticity**. If students feel that their input and time is valued as part of an experience that is not “busy work,” they will invest in it. Since the boat is a real boat sailing on the ocean, everything connected to that objective being completed successfully is very clearly not busy work. There are very real consequences to not doing a job completely or correctly. This element drives home the value of “Seek Excellence.”\n2. **Relevance**. A student could be assigned the authentic task of digging a big hole or meticulously cleaning the interior components of an antique pocket watch but will probably lose interest if the question “why” is not answered. This can sometimes happen with boat checks, which happen every hour on a boat and begin to take on an element of blind routine if their value is not reinforced. When it comes to establishing relevance, the connection can be specific to the student, broad to society, temporal to the moment at hand, or tied to the legacy of the human race 10,000 years from now, but there must be an answer.\n3. **Ownership**. Of all the characteristics here, this is the one we see the most frequently in existing classrooms. High school students are given charge of completing their assignments, showing up to class on time, and discharging a multitude of duties. What I advocate for here is that we create more pathways for the sphere of ownership to keep expanding. We should reward great performance with greater ownership.\n4. **Agency**. This is different from ownership, perhaps even a step up from ownership. Agency combines ownership, relevance, and authenticity to create a moments where the student makes choices that have consequences. As a mate, when I delegate setting a sail to a student, I have given them ownership of that task. Often, the ownership of something means following a script for how that job needs to be done: there is a right way to set a sail and a myriad of wrong ways. Agency means writing the script.\n5. **Ability to Fail**. It is possible to create a learning environment where all of the above are present and yet the lesson still falls short on this final element. A JWO will feel authenticity, relevance, ownership, and agency by the nature of being JWO, but if the mate steps in to answer a tough question or offers an overly revealing hint, the ability to fail dissolves. In some ways, ability to fail creates a deeper layer of fusion between authenticity and the relevance of the experience that generate moments of genuine discomfort for students.\n\n   As a mate, a critical element in creating a successful JWO Phase is to step back and let the student make mistakes, or forget things, or become overwhelmed. This can be hard because I want my students to succeed, but I have come to appreciate that there needs to be a “butterfly emerging from the chrysalis” moment if the value of everything that happened up to that point is going to matter. A student can watch and study something a million times, but then it is their turn to step up and do it. Near the end of the novel *The Alchemist*, the alchemist describes this concept to the protagonist:\n\n> “What you still need to know is this: before a dream is realized, the Soul of the World tests everything that was learned along the way. It does this not because it is evil, but so that we can, in addition to realizing our dreams, master the lessons we’ve learned as we’ve moved toward that dream. That’s the point at which, as we say in the language of the desert, one ‘dies of thirst just when the palm trees have appeared on the horizon.’\n>\n> Every search begins with beginner’s luck. And every search ends with the victor’s being severely tested.”\n\n![](https://images.mirror-media.xyz/publication-images/XFo5fuOKYfz2DwkCXIQz_.jpg?height=447&width=450)\n\nTo be clear, I am not talking about fear of failing as a person. Our classrooms already have this trait to a damaging degree with our modern grading system and the pressure of college admissions. I have frequently seen tears on JWO and while sometimes that is just how a person processes stress, there needs to be a calibration of duties with what a student is ready for, which varies by person. When I debrief with my JWO after the watch is over, a pointer I frequently remind them of is to not be too hard on themself when they fail: accept that you will make a mistake, take a moment to reflect on it, and then give yourself the grace to move past it and you can unpack the lesson later. As a leader, you must move past it or you will be distracted from your job in that moment. I also believe that a student needs, ideally, a minimum of three shifts as JWO to enable them to witness their own progress and internalize lessons. Most often, a student’s first JWO stint is not pretty and having that be their one shot would be unfortunate.\n\n## Beyond Sailing\n\nSailing for weeks at a time is an amazing adventure that makes creating many of these conditions easier, but in some ways it is not ideal. The sleep schedule, seasickness, and risk of burnout for staff and students are the most obvious downsides. Sailing is also an expensive and exclusive opportunity. And do we really need a boat in order to do any of this?\n\nAbsolutely not.\n\n![Planet School terms will begin with 4-5 weeks sailing and then transfer to a land campus, bringing along the ethos developed underway.](https://images.mirror-media.xyz/publication-images/yh6OSBRAKEr2wfgdma3uE.jpeg?height=3024&width=4032)\n\nMy goal with the Planet School is to take this process that I have seen be so effective on sailboats and replicate it in other realms. A three phase progression carried out between a knowledgeable practitioner and a group of students can be done in almost any field: the leader of a “watch” need not be a professional mariner. The expert could be a farmer, an engineer, an economist, or an artist. The task need not be sailing, it could be starting a business, managing a farm, or building a yurt. It could even be building a school.\n\nThe underlying project of the Planet School is to build the school itself. Since a campus is a community, such an undertaking could reasonably include a project in almost any discipline, giving students the chance to explore their passions and be exposed to potential passions they have not experienced before. Some of my most potent memories from high school are from the activities that included role-playing of “real life”: speech and debate, theatre, Model UN, Youth Legislature, and the school newspaper. Through the prevalence of internships, externships, and youth employment as well as the cliche of how teenagers yearn to leave home, the desire for real world experience at that age is evident. We should build our schools to be authentic laboratories for trying out real world solutions. If we are to be better stewards of our planet, then we need to do more than encourage experimentation, bold thinking, and sustainability—we need to create education spaces where we actively train youth in those habits.\n\nI never imagined myself as a teacher. I never imagined myself working in education. Yet I have learned that any systemic reimagining of human civilization must begin with how we equip our future generations. My vision for school is that, whatever the project, students are challenged in an authentic, relevant way where they have agency, feel ownership, and are trusted to be able to fail.", "timestamp": 1653239582, "digest": "SiaaK_sDxGc1-zoy7KhbTktMsmr-WZmS8dSheqQM8Yc", "contributor": "0x505683cF3aDdF5DE8E82AABB9d24763B9A72aAD0"}
{"id": "-xEPSdIp1pN8n8-c7Z4KWokABPxqtQaDmHIgdXnYhp0", "title": "《SAAR 雪人家族》调研报告", "body": "`——TSA 调研组：佩佩 制作`\n\n**// 特别强调：**\n\n1. 链游项⽬均为⾼⻛险项⽬，有复杂的经济模型\n2. 此份研报初衷在于项⽬分享，仅以目前（2022.5.23）的信息归纳分析汇总，情况可能不准确，不作为投资建议。\n\nSAAR是一款基于wax的区块链P2E游戏，讲述的是生活在冰冻洞穴中的几个不同雪人种族的故事，随着人口的增加，雪人们面临着资源稀缺和空间不足的问题，于是他们开始了在阿曼达大陆上的资源找寻挖掘之旅。\n\n这是一款采挖类游戏，团队吸取了市场上各类玩赚项目的宝贵经验，引入新的机制，希望通过动态调节经济模型，来平衡玩家所获得的游戏内资源，以保持长期的市场需求，该项目已于5月16日正式上线，目前属于一个头矿期，那它是否有什么特别之处呢，下面就让我们一起来看下雪人家族它有怎样的一个玩法。\n\n## 1. 代币经济模型\n\n雪人家族中的每个角色也可称为Yeti，玩家入门需要至少一个Yeti NFT，以及一些能量(energy)和矿石(millirium)来恢复体力和工具耐久。 \n\n游戏内设计了四种代币，分别代表四种资源：\n\n![](https://images.mirror-media.xyz/publication-images/pPrCgbWjKbwVmyWarw7k5.png?height=182&width=554)\n\nSRE(能量代币)：用于合成和恢复雪人们的体力。 \n\nSRM(矿石代币)：用于合成和恢复雪人们使用的工具的耐久度。 \n\nSRW(木头代币)：用于合成和恢复雪人们使用的工具的耐久度。 \n\nSRS(精神代币)：用于自动化开采，游戏默认是每小时claim一次，Spirit支持充能达到4级，可每隔4小时进行一次claim。\n\n![](https://images.mirror-media.xyz/publication-images/2huzTYgZjXS-mQ34ZVL5Y.png?height=315&width=554)\n\n上图为总体模型，玩家通过持有不同种族的雪人NFT，挖掘四种资源(即token)，四种币除了分别用于耐力恢复和自动开采，还可以升级雪人以及创建新的雪人包，和可以制作增加挖矿产出的护身符。\n\n## 2. NFT游戏角色简介\n\n### 2.1 雪人Yeti\n\nYeti是游戏最主要的角色，它们可用于开采特定资源，具体取决于Yeti的种族类型和稀有度。 \n\n一共有9种不同的雪人，根据产出的不同可以分为三组类型：\n\n![](https://images.mirror-media.xyz/publication-images/vAsGagFc0aXYodf-AgWKq.png?height=263&width=554)\n\n拿着普通斧头、高级斧头，手拿普通锯子的雪人开采木头资源，每次开采需消耗能量和工具耐久度，耐久度可通过矿石代币修复。\n\n![](https://images.mirror-media.xyz/publication-images/5YSw19O1fsamU1y-TtNol.png?height=271&width=554)\n\n带电锯、普通镐和电钻的雪人开采矿石资源(millirium)，每次开采需消耗能量和工具耐久度，耐久度通过木头代币修复。\n\n![](https://images.mirror-media.xyz/publication-images/3MYMR2ANfzZv_wLaqA5v2.png?height=265&width=554)\n\n初学、中级和高级的雪人工程师是可再生能源生产的先驱，它们产出能量，每次开采仅消耗耐久，耐久需要通过矿石和木头来修复。\n\n### 2.2 护身符Amulet\n\n游戏中目前有6种不同的护身符，可以用于增加每次开采的资源数量，或减少每次开采所需要消耗的数量，同时将护身符放置到祭坛还可以产出一些spirit代币。\n\n![](https://images.mirror-media.xyz/publication-images/9nw67oE3IxfpdMcVCDmQ-.png?height=282&width=312)\n\n护身符除了可从atomichub交易市场购买，还可以使用木头、矿石和精神三种代币来制作。\n\n### 2.3 魔法砖magicbrick\n\n![](https://images.mirror-media.xyz/publication-images/-epA4k2iHzHWgbxPy2aR1.png?height=346&width=430)\n\n小屋(cabin)是雪人们居住的建筑物，游戏初始为每个玩家提供了两间小屋，初始每间小屋仅可容纳一个同一类型的雪人，也就是如果你有两个工程师雪人NFT用于挖能量代币，可将它们分别放置到两个小屋中，但如果有第三个同样用于挖掘能量的雪人，就需要使用魔法砖来升级你的小屋。 \n\n蓝色和绿色魔法砖可用于增加小屋容量，普通cabin升级到大型cabin需要3块蓝色魔法砖或1块绿色魔法砖，大型升级到别墅需要6块蓝色魔法砖或2块绿砖，一个玩家最多可在游戏内放置18只不同类型的雪人。 \n\n粉色和紫色魔法砖则可用于增加使用护身符的插槽。\n\n \n\n### 2.4 土地land\n\n![](https://images.mirror-media.xyz/publication-images/B9wzz_HQZRDqr-7hphMyv.png?height=320&width=554)\n\n玩家除了挖掘资源，也可以选择持有一块或多块土地，每块土地有不同的开采类型和稀有度，土地所有者可从其他玩家在该土地上开采的资源中获得 2% 到 8% 的分润收益。 \n\n注意目前土地还未开始销售，另外如上图所示，在页面中心的阿曼达岛屿附近有六块大型岛屿(megaland)，官方后期将会举行拍卖会，它们每一块是普通土地面积的7倍，且该土地的所有者将和传奇土地所有者平分系统总佣金池的40%。\n\n \n\n## 3. 玩法流程 \n\n在对经济模型和游戏角色有个基础了解后，让我们来看看雪人家族的具体玩法： \n\n**进入游戏网站自动连接钱包：**\n\n[https://saar.game/](https://saar.game/)\n\n**第一次登录首先会看到资源选择页面：**\n\n![](https://images.mirror-media.xyz/publication-images/vdC2xqfZ1zS57DBucooNs.png?height=329&width=554)\n\n根据你持有的雪人类型选择其中一种资源类型来采挖，玩家在同一时间段只能开采木头、矿石、能源这三种中的其中一种，如果你选择开采能源，而账号中还有挖掘木头的雪人，那它将只能产出spirit代币(无需消耗能量)。 \n\n玩家可自由切换采挖资源类型，但需要支付相应的代币，比如从挖能源切换到挖木头，需支付500个srw币。 \n\n**选择土地：**\n\n![](https://images.mirror-media.xyz/publication-images/yIYHEJHdvNmdviTTCuKUe.png?height=287&width=554)\n\n土地可以选megaland或是周围的普通土地都可以，只要点击每块土地看到左侧详细信息里显示有choose for mining即可选择，土地选择需注意，如果是普通地，land type要选择和你主挖的资源一致的地，另外天气尽量选当前是sunny的，如果是其他天气类型会影响产出。\n\n \n\n**选好后在页面右下角点击Village进入游戏页面如下图所示：**\n\n![](https://images.mirror-media.xyz/publication-images/4cCnUWahZUSIGs44sUNhq.png?height=308&width=554)\n\n**点击小屋，进入采挖页面：**\n\n![](https://images.mirror-media.xyz/publication-images/6K5wHYo_jd99wwTM7YL82.png?height=316&width=554)\n\n根据你的雪人类型在右侧分栏选择合适的插槽放置NFT，放置好后如无显示刷新页面即可。\n\n**雪人放置好后即可开始采挖：**\n\n![](https://images.mirror-media.xyz/publication-images/fFmRVQoPILIRN_7MqqIqN.png?height=320&width=554)\n\n上图是普通能量开采工程师的采挖页面，每1小时claim一次，一次大约可获得45.45个能量代币，消耗60个耐久度，需要12个矿石和18个木头代币来修复，这里玩家可选择每次去repair，也可以积累到耐久度用完。 \n\n另如果是挖木头或矿石，采挖时需要消耗能量，因此要事先充入一些能量代币到游戏中。 \n\n以上就是雪人家族大致的流程，目前claim间隔默认是1小时，每支付5个spirit币可将claim间隔时间延长1小时。 \n\n**收益方面团队暂时没有给官方的ROI表，这里附上一份社区玩家做的表格：**\n\n[https://docs.google.com/spreadsheets/d/1iOYDIqOca5KLEZB3QS6Eqs5TblaK0oE9dB2VnXgCGzs/edit#gid=2079524431](https://docs.google.com/spreadsheets/d/1iOYDIqOca5KLEZB3QS6Eqs5TblaK0oE9dB2VnXgCGzs/edit#gid=2079524431)\n\n![](https://images.mirror-media.xyz/publication-images/XuB9ij_hikVtKoIYzx9pR.png?height=251&width=554)\n\n可以填入你想配置的NFT，参考下大致的ROI，但需要注意，游戏内数据是动态变化的，它这里记录的消耗产出和实际存在出入，同时没有考虑手续费和精神代币的产出，所以它只是暂时的参考，从目前观察来看，产出矿石和能量的ROI比木头要好，同时等级越高的收益越高，不考虑价格波动，史诗传奇的ROI平均在10天上下，相对普通的在30天以上。\n\n## 4. 项目测评及潜力分析\n\nSAAR雪人家族是比较典型的多币制挖矿游戏，这也是目前市场主流的一种经济模型，玩家可选择不同的玩法策略，token之间互为供需，可使游戏维持更长期的经济平衡。 \n\n相对于市场同类项目，SAAR的主要亮点一是通过第四种代币sws的消耗，来延长claim时间间隔，达到一定程度的自动化采挖，从同类项目来看，这种设计是有一定玩家需求的。 \n\n另一个是天气状况的设计，每块土地每24小时都可能会有不同的天气变化，Sunny太阳天不会对玩家有任何影响，Windy阴天，有30%概率产生，它会减少Yeti15%的产出量，有10%的几率遇到Snowstorm暴风雪天，在这种天气条件下，开采量减少50%，同时消耗量翻倍，对于普通NFT，这时玩家可能需要选择停工。 \n\n天气的变量增加了游戏的随机性，同时也有助于对游戏内各种资源供需进行动态调整，通过对近年来链游市场的观察，我们也发现，经济模式不只是写在白皮书和表格里的单一数据，随着游戏的发展，能进行有效的动态调节对项目的长期很重要。 \n\n问题方面目前来说可能最主要的还是市场偏小众，据Dappradar数据，日活用户数在500左右，这里主要原因可能在于随着加密市场进入熊市，链游市场一直萎靡不振，特别是近期wax价格大幅下跌，也导致很多玩家离场，另外该项目从销售到上线的时间间隔稍长，现在也会存在一点热度缺失，包括NFT市场交易量暂时不高，还需要看团队在未来是否能够通过一些营销或市场活动激发更多玩家的兴趣。 \n\n不过市场趋冷对玩家来说不一定是坏事，像现在市场上的入门包也就在10-30刀不等，风险可控，所以它还是比较适合一些喜欢玩这种采挖游戏的玩家去体验。 \n\n对于未来的关注点一是制作合成，从NFT市场来看，他家各类型的雪人体量并不是特别大，早期包八九成也都被打开，随着用户增长，有望刺激合成需求，合成消耗更多的代币，代币价值增长再推动更多的用户增长，这也是这种挖矿合成类主要的增长模式。 \n\n另一个就是土地，目前官方还未公布销售规则，对玩家来说，它可能也是该游戏接下来的一个机会点。\n\n## 相关链接\n\n`官推：`\n\n[https://twitter.com/SaaR_nft](https://twitter.com/SaaR_nft)\n\n`白皮书：`\n\n[https://whitepaper.saar.network/](https://whitepaper.saar.network/)\n\n", "timestamp": 1653239757, "digest": "MIbMrEPFslnl04gAUayyZ2CpW313s_6GVvk6md56GEI", "contributor": "0xeF96650E66688D5Fedb995432E28cdadDCcCBF71"}
{"id": "hbEj9k6swRJQhaEVLAYWfxAWtGLoJWn6Mcr6ogWNPU8", "title": "ASX Genesis Event", "body": "## Not you usual TGE\n\nThere have been many debates about what the fairest token generation event mechanism would be, but a consensus has yet to be reached. With that in mind, we’ve decided to do things a little differently and base our launch on (possibly) the rarest commodity in this market: awareness. Welcome to our stealth launch.\n\n\n---\n\n*The ASX Genesis Event has arrived. Please read this article carefully to understand the novel mechanics of this event.*\n\n\n---\n\n## TL;DR\n\n*Values in US$ consider ETH priced at $1,925.*\n\n* **Token:** ASX (ERC-20) → Governance Token of the ASX Protocol\n* **Network:** Ethereum Mainnet\n* **Total / Max Supply:** 1,000,000,000 ASX\n* **Genesis Event Allocation:** 800,000,000 ASX\n* **Initial Liquidity Allocation:** 200,000,000 ASX\n* **Mint Rate:** 1 ASX / 0.000004 ETH or 250,000 ASX / 1 ETH\n* **Venue:** Self-hosted at <https://mint.asx.st/>\n* **Mode:** First-come, first-served basis (FCFS)\n* **Start date**: Live now\n* **End date**: 10 days after the soft cap is reached\n* **Soft Cap:** 1000 ETH | 250,000,000 ASX minted\n* **Hard Cap:** 3200 ETH | 800,000,000 ASX minted\n* **Fully Diluted Market Cap / Value (FDV)**\n  * **at Soft Cap:** 312,500,000 ASX \\~ $2,406,250 | 687,500,000 ASX burned\n  * **at Hard Cap:** 1,000,000,000 ASX \\~ $7,700,000 | 0 ASX burned\n* **Initial Liquidity (40% of FDV)**\n  * **at Soft Cap:** 62,500,000 ASX + 250 ETH | \\~ $962,500\n  * **at Hard Cap:** 200,000,000 ASX + 800 ETH | \\~ $3,080,000\n* There's no founders or team allocation, no seed or private sale, no liquidity mining, and no airdrop. The Genesis Event is the first and only place to get ASX tokens before listing.\n* Team and partners are allowed to participate after the progress bar reaches 50%.\n* Participants can claim their ASX tokens once the event is completed. There's no vesting. 100% of the max supply will be unlocked and circulating on day one.\n* Once the soft cap is reached (250,000,000 ASX minted), a countdown of 10 days will start. When it hits zero, the Genesis Event will end, the initial liquidity pool on Uniswap will be created and the remaining ASX will be burned along with the liquidity provider (LP) token.\n* ASX ERC-20 smart contract address: **0x5313235002b9F11698D7B9187Be44f836FEbD6b5**.\n\n\n---\n\n## A unique token launch\n\nAs a community-focused project committed to the ethos and founding principles of the blockchain space, we are pleased to announce the official launch of **ASX**, the governance token of the ASX Protocol.\n\nIn the spirit of equal distribution, fairness, decentralization, and a community-first ideology, the launch event is taking place on our [custom-made platform](https://mint.asx.st/) and it's the first and only opportunity for anyone to get access to the ASX Protocol's native token, **ASX**, which will give holders the power to govern and curate essential infrastructure components of the network.\n\nOur mission is to give everyone in our community an opportunity to become a stakeholder in the ecosystem, and we want to extend that opportunity as fairly as possible. Launching ASX on our own platform, with a mechanism that is fair and transparent for all participants, drastically increases the chances of achieving this mission.\n\nApart from building our own token launch platform, we made sure everyone was on a level playing field. There's no seed or private sale, no liquidity mining, no emission (zero inflation), zero tokens to influencers or promoters, no airdrop, and zero Treasury, Company, Founders, Team, or Partners allocation.\n\n### 1 billion ASX tokens. 800 million to be minted, 200 million for liquidity. That's it.\n\n> *The protocol's revenue will exclusively serve ASX holders and all operations will be funded with ETH or stablecoins.*\n\nThe ASX Genesis Event is open to all interested and qualifying parties. It's a major milestone for the ASX Protocol ecosystem and speaks to the viability of our core technology and business model as we aim to become the ultimate permissionless omnichain liquidity hub for staked assets.\n\nAt ASX Labs, we believe in creating a global staking ecosystem of the people, by the people, for the people, that shall not perish under any threats. The crypto dream has never been about creating an instrument that can easily be put in a box, but about creating global assets that can govern and manage these new decentralized global networks.\n\n## Understanding the mechanics\n\nTo mint 1 ASX you need to contribute 0.000004 ETH. A total of 800,000,000 ASX will be available for minting. Due to the low fully diluted market cap of the project and to ensure as broad a distribution as possible and dramatically soften the potential for a massive gas war, we decided to operate in stealth mode until 50% of the tokens are minted.\n\nThere's a minimum of 1 ASX per mint and no maximum. Setting up a max cap per wallet without KYC is foolish and we're not big fans of KYC in DeFi. For us, privacy and freedom are paramount, and we respect and stand by yours. With that said, there's a cap of 100 ETH per mint on our Interface just to slow things down, if they get a bit crazy.\n\nIf you're lucky enough to hear about the ASX Protocol early, you'll have enough time to participate. Otherwise, you can get ASX tokens on Uniswap, after the Genesis Event is completed.\n\n## How to participate\n\nParticipating in the ASX Genesis Event is simple, quick, and intuitive, and getting prepared is even easier. Here’s what you’ll need:\n\n→ **An Ethereum-compatible web3 browser wallet**, such as MetaMask. You can generate a wallet address from these web3 wallets directly, or use your seeds to import an existing wallet address.\n\n→ **Sufficient ETH**, which you will need in order to contribute and pay for transactions gas fees.\n\nOnce you’ve got your checklist all set, here’s what the process will look like:\n\n1. To get started, head to our custom-made [Launch Platform](https://mint.asx.st/).\n2. You’ll be prompted with a welcome message. Click on \"**PARTICIPATION TERMS**\". Read everything and, if you agree, click on \"**I AGREE**\". Next, click on \"**CONTINUE**\".\n3. The next message will be a TL;DR of the ASX Genesis Event. Carefully read everything and click on \"**CONTINUE**\".\n4. You can now connect your wallet. We support almost any web3 injected wallet, but for a flawless experience, we recommend using MetaMask. Click on \"**CONNECT WALLET**\", either in the center or on the upper right-hand corner of the page.\n5. Once your wallet is connected, the ETH and ASX input fields will become available to you. You may either insert the amount of ASX you would like to receive or the amount of ETH you would like to contribute. Enter the desired amount and click on \"**MINT**\". Please make sure you have enough ETH in your wallet to pay for transaction fees.\n6. You will see a popup from your MetaMask wallet. Confirm the transaction and then wait for it to go through. Once it is validated on the Ethereum blockchain, your ASX balance, on the top of the page, will update and a \"CLAIM\" button will appear. You will be able to claim your ASX tokens once the event is completed.\n7. That's it! You successfully participated in the ASX Genesis Event.\n\n*Once your transaction is validated, a smart contract, that works like an escrow, will receive your ASX tokens and keep them safe until the end of the Genesis Event, when you will be able to claim them. Claimed ASX tokens are not locked and there is no vesting.*\n\n*Team and partners are allowed to participate in the Genesis Event after the progress bar reaches 50%. If the desired amount of ASX that those parties intend to hold can't be fully minted during this event, the remaining amount will be purchased on Uniswap.*\n\n## Liquidity\n\nBy the end of the Genesis Event, the initial liquidity of the ASX token will be immediately provided as a full range position on Uniswap V3. Since the resulting liquidity provider (LP) token will be directly burned, this initial position will be perpetual.\n\nThe liquidity depth will represent 40% of the FDV (Fully Diluted Value) and its absolute value will be based on the total ASX minted.\n\n* At soft cap, 250 ETH will be paired with 62,500,000 ASX, pricing the token at $0.0077 / ASX with $962,500 of liquidity depth.\n* At hard cap, 800 ETH will be paired with 200,000,000 ASX, pricing the token at $0.0077 / ASX with $3,080,000 of liquidity depth.\n\n*The Genesis Event will end in 10 days after the soft cap is reached or when all ASX tokens are minted, whichever comes first. Any unminted ASX will be burned.*\n\n## Security\n\nWe were very careful when deciding the code for the ASX ERC-20 smart contract and, to make it the safest possible, we only allowed the absolutely necessary lines of code. There's no mint function, no pause function and the contract is not upgradeable. It is an immutable token on the Ethereum Mainnet Network.\n\nBoth the ERC-20 and the Genesis Event smart contracts were developed with the highest levels of security, leveraging the battle-tested OpenZeppelin standard. With the entire supply circulating by the end of the Genesis Event plus the immediate burn of the liquidity provider (LP) token, you can rest assured that the ASX token can never be hacked or rugged.\n\n### Important Notes\n\nThe team at ASX Labs will NEVER DM YOU FIRST or ask you for money on any platform. You should be very skeptical of any DMs received by anyone claiming to be from ASX Labs.\n\nOnly trust ASX Protocol's official channels at the bottom of this announcement for information surrounding the event.\n\nThe ASX token will only be available once the Genesis Event is completed. Only then you will be able to trade it on Uniswap. Be sure to always check the smart contract address before trading.\n\n\n---\n\nThis is the first step towards an omnichain yield future. Welcome aboard.\n\n\n---\n\n* Participate in the [ASX Genesis Event →](https://mint.asx.st/)\n* Access our [Interface →](https://asx.st/)\n* Follow us on [Twitter →](https://twitter.com/asxlabs)\n* Join us on [Telegram →](https://t.me/asxprotocol)\n\n\n---\n\n## Legal Disclaimers\n\n*You understand that the ASX tokens have no intrinsic value and are solely tools of governance, and as such have no intrinsic potential for future appreciation in any form whatsoever. You further represent and warrant that you are an active user of blockchain technology and blockchain-based software systems and have the pre-requisite technical knowledge to understand what has been mentioned in this announcement and the risks that follow*.\n\n*The information provided within this announcement is for general informational purposes only pertaining to the governance tool. You understand that the ASX Protocol governance structure is an experiment in the field of decentralization and community governed structures, in which participation via the ASX token and otherwise is entirely at your own risk*.\n\n*Information contained in this announcement should not be relied upon at any time as advice to buy or sell or hold the aforementioned governance tokens and a particular note should be made to emphasize the solely governance-based nature of the ASX tokens and their lack of intrinsic ownership or economic value. This announcement does not take into account nor does it provide any tax, legal, or investment advice or opinion regarding the specific investment objectives or financial situation of any person.*\n\n*ASX Protocol and its associated parties, as appropriate, make no representation or warranties, expressed or implied, as to the accuracy of such information and ASX Protocol expressly disclaims any liability that may be based on such information or errors or omissions thereof. ASX Protocol reserves the right to amend or replace the information contained herein, in part or in its entirety, at any time, and undertakes no obligation to provide the recipient with access to the amended information or to notify the recipient thereof. The information contained in this announcement supersedes any prior representation, post, or conversation whether informal or formal, concerning the same, similar, or related information*.\n\n*This communication is not for distribution to U.S. newswire or similar services or any dissemination in the United States. This communication shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of, ASX tokens to any U.S. person (including, without limitation, any citizen or resident of the United States) or in the United States or in any jurisdiction in which such offer, solicitation, or sale would be unlawful before registration or qualification under the laws of any such jurisdiction*.\n\n*Any reference or mention of the ASX Genesis Event being open or accessible to the “public” should be understood to refer only to qualified individuals and entities under the applicable law.*\n\n*The ASX token is not an investment contract or security and should not be treated as such.*\n\n\n---\n\n## Restricted List of Countries\n\n*The ASX Genesis Event is not available to anyone located, incorporated or otherwise established in, or a citizen or resident of the United States of America, Afghanistan, Albania, American Samoa, Angola, Antigua and Barbuda, Aruba, Bangladesh, Barbados, Belarus, Benin, Bermuda, Bhutan, Bolivia, Bosnia and Herzegovina, Botswana, Brunei Darussalam, Burkina Faso, Burundi, Cabo Verde, Cambodia, Cameroon, Canada, Cayman Islands, Central African Republic, Chad, China, Comoros, Congo, Côte D'ivoire, Crimea and Sevastopol, Cuba, Democratic People's Republic of Korea, Democratic Republic of the Congo, Djibouti, Dominica, Ecuador, Egypt, El Salvador, Equatorial Guinea, Eritrea, Eswatini, Ethiopia, Fiji, Gabon, Gambia, Ghana, Guam, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, Hong Kong, Iran, Iraq, Jamaica, Jordan, Kenya, Kyrgyzstan, Lao People's Democratic Republic, Lebanon, Lesotho, Liberia, Libya, Macao, Madagascar, Malawi, Maldives, Mali, Malta, Mauritania, Mauritius, Micronesia, Moldova, Mongolia, Montenegro, Morocco, Mozambique, Myanmar, Nauru, Nepal, New Caledonia, Nicaragua, Niger, Nigeria, Niue, Northern Mariana Islands, Oman, Pakistan, Palau, Palestine, Panama, Papua New Guinea, Puerto Rico, Russian Federation, Rwanda, Samoa, Sao Tome and Principe, Senegal, Serbia, Seychelles, Sierra Leone, Somalia, South Georgia, South Sudan, Sri Lanka, Sudan, Suriname, Syrian Arab Republic, Tajikistan, Tanzania, Thailand, Timor-Leste, Togo, Tonga, Trinidad and Tobago, Tunisia, Turkey, Turkmenistan, Uganda, Ukraine, United Kingdom, United States Minor Outlying Islands, US Virgin Islands, Uzbekistan, Vanuatu, Venezuela, Western Sahara, Yemen, Zambia, Zimbabwe, or any state, country, or jurisdiction where it would be illegal, according to applicable law, to participate in this event*.", "timestamp": 1653239791, "digest": "SPP24Za2i393DM3Tx2hJqKXW0GYafuXHOu-pvMLcjNg", "contributor": "0x1be3C6a0a7617CE21Ca1765917629629787b48aD"}
{"id": "JEsmyhO3sPRcqERajgdSY-vgvqoWieNCH7zfZLAOEcg", "title": "GUIDE TO KYVE TESTNET", "body": "Only participate in this testnet for fun and not participate for monetary return,though incentive is expected.\n\ni will be participating with this wallet address : \n\nkyve1ke2ft28wqlufzzkyxsfny0fzwzuk3w52znl9p2\n\n![kyve1ke2ft28wqlufzzkyxsfny0fzwzuk3w52znl9p2](https://images.mirror-media.xyz/publication-images/1urXxryKBFWRlWYq4Uw7v.png?height=404&width=591)\n\n## Introduction\n\nKyve (Twitter : <https://twitter.com/KYVENetwork>) Building the Web3 data lake solution Making data reliable, permanently stored, and easily accessible\n\n![Incentivized Testnet is live](https://images.mirror-media.xyz/publication-images/YNM9go3fMQPjHLlMr0BFg.png?height=500&width=1269)\n\n## TERMS & CONDITIONS\n\nKyve’s incentivized testnet will be open for two months **since 2nd of may 2022**\n\n2% of the the supply (20,000,000 $KYVE) is allocated for the incentivized testnet. The rewards are distributed as follows:\n\n* Pool A rewards the top 5,000 participants on the leaderboard (5,000,000 $KYVE)\n* Pool B rewards top 10,000 participants on the leaderboard (5,000,000 $KYVE)\n* Top node runners in either top 2500 or 5000 (10,000,000 $KYVE)\n\n### You’ll have to complete design, community and engineering tasks to get points to rank high in the leaderboard.\n\nNOW LET BEGIN\n\nGo to <https://app.kyve.network/> and connect your Keplr wallet. It will automatically ask you to add the KYVE Korellia network.\n\nThen click “Facuet” and claim your testnet $KYVE from all 3 sources (Twitter, Discord and wheel spinning). For Discord and wheel spinning, you can claim everyday.\n\n## (Due to extreme congestion of the facuet, prepare to wait a few hours before receiving your tokens.)\n\n![click on perform the three faucet task to get your test faucet](https://images.mirror-media.xyz/publication-images/Xw4U3eJfQdIgShINPdEo5.png?height=599&width=1351)\n\n**Step 1:**\n\nGo to “Tasks” and read the task description.\n\nCommunity tasks are easy to complete,make sure to perform them.\\\\\n\nContent tasks involve making videos/memes/content.\n\nIn this guide, we will go through two simple engineering task, Pool Delegating and Pool Funding.\n\n![select task](https://images.mirror-media.xyz/publication-images/VtVYYQzjY4W6pyWl7HdbP.png?height=604&width=1353)\n\n**Step 2:**\n\nWe first go for the “Pool Delegating Task”.\n\nGo to “Pools” and choose one of the network.\n\n![goto pools and select become a delegator](https://images.mirror-media.xyz/publication-images/7e6Mk0yOnZu1xaXN8Ee3_.png?height=500&width=1323)\n\nAt “Delegation”, choose a validator to delegate your $KYVE to. Input your amount to delegate and confirm.\n\n![click delegation and become a delegator](https://images.mirror-media.xyz/publication-images/hBOmV3pw4Wo7VanPGAKL2.png?height=483&width=1015)\n\n![](https://images.mirror-media.xyz/publication-images/kxmYccKO7pXuVvgnybgkd.png?height=514&width=611)\n\n**Step 2:**\n\nNow we move on to the “Pool Funding Task”.\n\nAt “Funders”, click “Become a funder”. Input an amount higher than minimum funding amount and confirm.\n\n![](https://images.mirror-media.xyz/publication-images/QEqFnF2j68sXNG-WEimuH.png?height=536&width=1285)\n\n![](https://images.mirror-media.xyz/publication-images/q0kdBopa7BAiy4APzZ9IO.png?height=503&width=640)\n\n**Step 3: (Optional)**\n\nCheck the governance section for proposals that you can vote on to finish the governance vote mission. (At the time of writing, there are no proposals to vote on.)\n\n**Step 4:**\n\nTo check your score and rank, go to “Korellia Profile\n\n![](https://images.mirror-media.xyz/publication-images/3-uKDqlQB7-Hnt_RIDjsB.png?height=467&width=1296)\n\nif you need more info you can contact kyve discord\n\n[https://discord.com/invite/UtDMtZ6j8N](https://discord.com/invite/UtDMtZ6j8N)\n\nyou may also reach me on telegram @princeoof for one on one chat", "timestamp": 1653239803, "digest": "-FViJIHJaKOF8AM4a8iPjQCtB8ymI1wUeRLOi_o0yDY", "contributor": "0x06040158f9DD01fB6CC71Ad99EC854C1a5A69ee9"}
{"id": "Bi-lraQ651yKKHG4ZI-d87xyaWLcZhfal5ocgCkQapg", "title": "ASX Genesis Event", "body": "## Not you usual TGE\n\nThere have been many debates about what the fairest token generation event mechanism would be, but a consensus has yet to be reached. With that in mind, we’ve decided to do things a little differently and base our launch on (possibly) the rarest commodity in this market: awareness. Welcome to our stealth launch.\n\n\n---\n\n*The ASX Genesis Event has arrived. Please read this article carefully to understand the novel mechanics of this event.*\n\n\n---\n\n## TL;DR\n\n*Values in US$ consider ETH priced at $1,925.*\n\n* **Token:** ASX (ERC-20) → Governance Token of the ASX Protocol\n* **Network:** Ethereum Mainnet\n* **Total / Max Supply:** 1,000,000,000 ASX\n* **Genesis Event Allocation:** 800,000,000 ASX\n* **Initial Liquidity Allocation:** 200,000,000 ASX\n* **Mint Rate:** 1 ASX / 0.000004 ETH or 250,000 ASX / 1 ETH\n* **Venue:** Self-hosted at <https://mint.asx.st/>\n* **Mode:** First-come, first-served basis (FCFS)\n* **Start date**: Live now\n* **End date**: 10 days after the soft cap is reached\n* **Soft Cap:** 1000 ETH | 250,000,000 ASX minted\n* **Hard Cap:** 3200 ETH | 800,000,000 ASX minted\n* **Fully Diluted Market Cap / Value (FDV)**\n  * **at Soft Cap:** 312,500,000 ASX \\~ $2,406,250 | 687,500,000 ASX burned\n  * **at Hard Cap:** 1,000,000,000 ASX \\~ $7,700,000 | 0 ASX burned\n* **Initial Liquidity (40% of FDV)**\n  * **at Soft Cap:** 62,500,000 ASX + 250 ETH | \\~ $962,500\n  * **at Hard Cap:** 200,000,000 ASX + 800 ETH | \\~ $3,080,000\n* There's no founders or team allocation, no seed or private sale, no liquidity mining, and no airdrop. The Genesis Event is the first and only place to get ASX tokens before listing.\n* Team and partners are allowed to participate after the progress bar reaches 50%.\n* Participants can claim their ASX tokens once the event is completed. There's no vesting. 100% of the max supply will be unlocked and circulating on day one.\n* Once the soft cap is reached (250,000,000 ASX minted), a countdown of 10 days will start. When it hits zero, the Genesis Event will end, the initial liquidity pool on Uniswap will be created and the remaining ASX will be burned along with the liquidity provider (LP) token.\n* ASX ERC-20 smart contract address: **0x5313235002b9F11698D7B9187Be44f836FEbD6b5**.\n\n\n---\n\n## A unique token launch\n\nAs a community-focused project committed to the ethos and founding principles of the blockchain space, we are pleased to announce the official launch of **ASX**, the governance token of the ASX Protocol.\n\nIn the spirit of equal distribution, fairness, decentralization, and a community-first ideology, the launch event is taking place on our [custom-made platform](https://mint.asx.st/) and it's the first and only opportunity for anyone to get access to the ASX Protocol's native token, **ASX**, which will give holders the power to govern and curate essential infrastructure components of the network.\n\nOur mission is to give everyone in our community an opportunity to become a stakeholder in the ecosystem, and we want to extend that opportunity as fairly as possible. Launching ASX on our own platform, with a mechanism that is fair and transparent for all participants, drastically increases the chances of achieving this mission.\n\nApart from building our own token launch platform, we made sure everyone was on a level playing field. There's no seed or private sale, no liquidity mining, no emission (zero inflation), zero tokens to influencers or promoters, no airdrop, and zero Treasury, Company, Founders, Team, or Partners allocation.\n\n### 1 billion ASX tokens. 800 million to be minted, 200 million for liquidity. That's it.\n\n> ***The protocol's revenue will exclusively serve ASX holders and all operations will be funded with ETH or stablecoins.***\n\nThe ASX Genesis Event is open to all interested and qualifying parties. It's a major milestone for the ASX Protocol ecosystem and speaks to the viability of our core technology and business model as we aim to become the ultimate permissionless omnichain liquidity hub for staked assets.\n\nAt ASX Labs, we believe in creating a global staking ecosystem of the people, by the people, for the people, that shall not perish under any threats. The crypto dream has never been about creating an instrument that can easily be put in a box, but about creating global assets that can govern and manage these new decentralized global networks.\n\n## Understanding the mechanics\n\nTo mint 1 ASX you need to contribute 0.000004 ETH. A total of 800,000,000 ASX will be available for minting. Due to the low fully diluted market cap of the project and to ensure as broad a distribution as possible and dramatically soften the potential for a massive gas war, we decided to operate in stealth mode until 50% of the tokens are minted.\n\nThere's a minimum of 1 ASX per mint and no maximum. Setting up a max cap per wallet without KYC is foolish and we're not big fans of KYC in DeFi. For us, privacy and freedom are paramount, and we respect and stand by yours. With that said, there's a cap of 100 ETH per mint on our Interface just to slow things down, if they get a bit crazy.\n\nIf you're lucky enough to hear about the ASX Protocol early, you'll have enough time to participate. Otherwise, you can get ASX tokens on Uniswap, after the Genesis Event is completed.\n\n## How to participate\n\nParticipating in the ASX Genesis Event is simple, quick, and intuitive, and getting prepared is even easier. Here’s what you’ll need:\n\n→ **An Ethereum-compatible web3 browser wallet**, such as MetaMask. You can generate a wallet address from these web3 wallets directly, or use your seeds to import an existing wallet address.\n\n→ **Sufficient ETH**, which you will need in order to contribute and pay for transactions gas fees.\n\nOnce you’ve got your checklist all set, here’s what the process will look like:\n\n1. To get started, head to our custom-made [Launch Platform](https://mint.asx.st/).\n2. You’ll be prompted with a welcome message. Click on \"**PARTICIPATION TERMS**\". Read everything and, if you agree, click on \"**I AGREE**\". Next, click on \"**CONTINUE**\".\n3. The next message will be a TL;DR of the ASX Genesis Event. Carefully read everything and click on \"**CONTINUE**\".\n4. You can now connect your wallet. We support almost any web3 injected wallet, but for a flawless experience, we recommend using MetaMask. Click on \"**CONNECT WALLET**\", either in the center or on the upper right-hand corner of the page.\n5. Once your wallet is connected, the ETH and ASX input fields will become available to you. You may either insert the amount of ASX you would like to receive or the amount of ETH you would like to contribute. Enter the desired amount and click on \"**MINT**\". Please make sure you have enough ETH in your wallet to pay for transaction fees.\n6. You will see a popup from your MetaMask wallet. Confirm the transaction and then wait for it to go through. Once it is validated on the Ethereum blockchain, your ASX balance, on the top of the page, will update and a \"CLAIM\" button will appear. You will be able to claim your ASX tokens once the event is completed.\n7. That's it! You successfully participated in the ASX Genesis Event.\n\n*Once your transaction is validated, a smart contract, that works like an escrow, will receive your ASX tokens and keep them safe until the end of the Genesis Event, when you will be able to claim them. Claimed ASX tokens are not locked and there is no vesting.*\n\n*Team and partners are allowed to participate in the Genesis Event after the progress bar reaches 50%. If the desired amount of ASX that those parties intend to hold can't be fully minted during this event, the remaining amount will be purchased on Uniswap.*\n\n## Liquidity\n\nBy the end of the Genesis Event, the initial liquidity of the ASX token will be immediately provided as a full range position on Uniswap V3. Since the resulting liquidity provider (LP) token will be directly burned, this initial position will be perpetual.\n\nThe liquidity depth will represent 40% of the FDV (Fully Diluted Value) and its absolute value will be based on the total ASX minted.\n\n* At soft cap, 250 ETH will be paired with 62,500,000 ASX, pricing the token at $0.0077 / ASX with $962,500 of liquidity depth.\n* At hard cap, 800 ETH will be paired with 200,000,000 ASX, pricing the token at $0.0077 / ASX with $3,080,000 of liquidity depth.\n\n*The Genesis Event will end in 10 days after the soft cap is reached or when all ASX tokens are minted, whichever comes first. Any unminted ASX will be burned.*\n\n## Security\n\nWe were very careful when deciding the code for the ASX ERC-20 smart contract and, to make it the safest possible, we only allowed the absolutely necessary lines of code. There's no mint function, no pause function and the contract is not upgradeable. It is an immutable token on the Ethereum Mainnet Network.\n\nBoth the ERC-20 and the Genesis Event smart contracts were developed with the highest levels of security, leveraging the battle-tested OpenZeppelin standard. With the entire supply circulating by the end of the Genesis Event plus the immediate burn of the liquidity provider (LP) token, you can rest assured that the ASX token can never be hacked or rugged.\n\n### Important Notes\n\nThe team at ASX Labs will NEVER DM YOU FIRST or ask you for money on any platform. You should be very skeptical of any DMs received by anyone claiming to be from ASX Labs.\n\nOnly trust ASX Protocol's official channels at the bottom of this announcement for information surrounding the event.\n\nThe ASX token will only be available once the Genesis Event is completed. Only then you will be able to trade it on Uniswap. Be sure to always check the smart contract address before trading.\n\n\n---\n\nThis is the first step towards an omnichain yield future. Welcome aboard.\n\n\n---\n\n* Participate in the [ASX Genesis Event →](https://mint.asx.st/)\n* Access our [Interface →](https://asx.st/)\n* Follow us on [Twitter →](https://twitter.com/asxlabs)\n* Join us on [Telegram →](https://t.me/asxprotocol)\n\n\n---\n\n## Legal Disclaimers\n\n*You understand that the ASX tokens have no intrinsic value and are solely tools of governance, and as such have no intrinsic potential for future appreciation in any form whatsoever. You further represent and warrant that you are an active user of blockchain technology and blockchain-based software systems and have the pre-requisite technical knowledge to understand what has been mentioned in this announcement and the risks that follow*.\n\n*The information provided within this announcement is for general informational purposes only pertaining to the governance tool. You understand that the ASX Protocol governance structure is an experiment in the field of decentralization and community governed structures, in which participation via the ASX token and otherwise is entirely at your own risk*.\n\n*Information contained in this announcement should not be relied upon at any time as advice to buy or sell or hold the aforementioned governance tokens and a particular note should be made to emphasize the solely governance-based nature of the ASX tokens and their lack of intrinsic ownership or economic value. This announcement does not take into account nor does it provide any tax, legal, or investment advice or opinion regarding the specific investment objectives or financial situation of any person.*\n\n*ASX Protocol and its associated parties, as appropriate, make no representation or warranties, expressed or implied, as to the accuracy of such information and ASX Protocol expressly disclaims any liability that may be based on such information or errors or omissions thereof. ASX Protocol reserves the right to amend or replace the information contained herein, in part or in its entirety, at any time, and undertakes no obligation to provide the recipient with access to the amended information or to notify the recipient thereof. The information contained in this announcement supersedes any prior representation, post, or conversation whether informal or formal, concerning the same, similar, or related information*.\n\n*This communication is not for distribution to U.S. newswire or similar services or any dissemination in the United States. This communication shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of, ASX tokens to any U.S. person (including, without limitation, any citizen or resident of the United States) or in the United States or in any jurisdiction in which such offer, solicitation, or sale would be unlawful before registration or qualification under the laws of any such jurisdiction*.\n\n*Any reference or mention of the ASX Genesis Event being open or accessible to the “public” should be understood to refer only to qualified individuals and entities under the applicable law.*\n\n*The ASX token is not an investment contract or security and should not be treated as such.*\n\n\n---\n\n## Restricted List of Countries\n\n*The ASX Genesis Event is not available to anyone located, incorporated or otherwise established in, or a citizen or resident of the United States of America, Afghanistan, Albania, American Samoa, Angola, Antigua and Barbuda, Aruba, Bangladesh, Barbados, Belarus, Benin, Bermuda, Bhutan, Bolivia, Bosnia and Herzegovina, Botswana, Brunei Darussalam, Burkina Faso, Burundi, Cabo Verde, Cambodia, Cameroon, Canada, Cayman Islands, Central African Republic, Chad, China, Comoros, Congo, Côte D'ivoire, Crimea and Sevastopol, Cuba, Democratic People's Republic of Korea, Democratic Republic of the Congo, Djibouti, Dominica, Ecuador, Egypt, El Salvador, Equatorial Guinea, Eritrea, Eswatini, Ethiopia, Fiji, Gabon, Gambia, Ghana, Guam, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, Hong Kong, Iran, Iraq, Jamaica, Jordan, Kenya, Kyrgyzstan, Lao People's Democratic Republic, Lebanon, Lesotho, Liberia, Libya, Macao, Madagascar, Malawi, Maldives, Mali, Malta, Mauritania, Mauritius, Micronesia, Moldova, Mongolia, Montenegro, Morocco, Mozambique, Myanmar, Nauru, Nepal, New Caledonia, Nicaragua, Niger, Nigeria, Niue, Northern Mariana Islands, Oman, Pakistan, Palau, Palestine, Panama, Papua New Guinea, Puerto Rico, Russian Federation, Rwanda, Samoa, Sao Tome and Principe, Senegal, Serbia, Seychelles, Sierra Leone, Somalia, South Georgia, South Sudan, Sri Lanka, Sudan, Suriname, Syrian Arab Republic, Tajikistan, Tanzania, Thailand, Timor-Leste, Togo, Tonga, Trinidad and Tobago, Tunisia, Turkey, Turkmenistan, Uganda, Ukraine, United Kingdom, United States Minor Outlying Islands, US Virgin Islands, Uzbekistan, Vanuatu, Venezuela, Western Sahara, Yemen, Zambia, Zimbabwe, or any state, country, or jurisdiction where it would be illegal, according to applicable law, to participate in this event*.", "timestamp": 1653239864, "digest": "SPP24Za2i393DM3Tx2hJqKXW0GYafuXHOu-pvMLcjNg", "contributor": "0x1be3C6a0a7617CE21Ca1765917629629787b48aD"}
{"id": "D-IoBJO5DEL7okXc9-nI9fBoB8maIiqCiLlw2-AYEyI", "title": "My Dream for the Planet School", "body": "Last week, I stepped off the *SSV* (Sailing School Vessel) *Corwith Cramer* after spending six weeks at sea as the 3rd Mate for “Marine Biodiversity & Conservation,” a college semester-at-sea program run by the Sea Education Association (SEA)*.* Coming aboard in Key West, Florida seven weeks ago marked 14 years since I had stepped onto *Cramer* as a student myself. I had never been sailing before and I had no idea how profoundly that voyage would impact me. They say that the sea is a great teacher and I agree, but the community we intentionally create at sea deserves description too.\n\nAn isolated ship at sea is, in many ways, an ideal medium for creating deeply impactful learning opportunities. For this inaugural Planet School blog post, I want to share why I love to teach at sea and how the core elements of an ocean-based curriculum do not actually need to be unique to the sea at all. To do that, I need to give a bit of background on what it means to go sailing for a semester on a tall ship.\n\n![Removing the crutch of GPS and navigating with the stars is yet another opportunity for authentic student agency.](https://images.mirror-media.xyz/publication-images/2czv-EUWimA9Q8y4l-iNF.jpeg?height=450&width=600)\n\nMake no mistake: sailing is hard work. I suspect that many students, like me when I was 20 years old, perceive a semester aboard a sailboat as one of relaxing exoticism bordering on luxuriousness: perfect sunsets, dolphins chasing the bow, strumming a guitar, reading *Treasure Island* or *Moby Dick* and coming home with a perfect tan and a year’s worth of Instagram posts—no filter, obviously. After all, yachts are a pastime of the wealthy and the Caribbean is a vacation destination. While there are innumerable moments of grandeur to be had at sea and all of the things I listed above usually happen multiple times on every voyage, they belie the full story. Any notion of #YachtLife is a delusion that gets shaken almost instantly.\n\nStudents step onto the ship and they step into a new world. First, the language is completely different—both the immense vocabulary of nautical terminology as well as the style of repeating commands. When you are given a task, you repeat the command back to the person who just gave it to you, then you go do the task, then once the task is done you return to the person who gave you the task and tell them it is complete, which they then repeat back to you. This creates a closed loop—there is little chance for miscommunication—but that much repetition does not come naturally. So not only do students have multiple subject areas to master—navigation, seamanship, meteorology, watch standing duties, laboratory procedures—but their way of communicating is being frequently corrected. They are studying new subjects in a new language in a place that is constantly moving (making many of them seasick) and with a watch-standing schedule that means their sleep is inconsistent. On all fronts, my semester with SEA in college was, hands down, my most challenging term and Brown University was not exactly a cake walk.\n\n![](https://images.mirror-media.xyz/publication-images/wYOcovwOe7n5jeVg9IkIg.jpeg?height=3456&width=4608)\n\n## A Three Phase Approach\n\nEvery voyage program I have sailed on—SEA vessels and Proctor Academy’s Ocean Classroom semester—breaks their trip into three phases: The Spaghetti Phase, The Shadow Phase, and the Junior Watch Officer (JWO) Phase. The Spaghetti Phase is so named because, for the students, it feels like information is being thrown at them like spaghetti: some of it sticks and some (most) just falls to the deck. It could also be called the Firehose Phase because it can feel like drinking from a firehose. Whatever the metaphor, the first phase is characterized by feeling overwhelmed, adjusting to the boat, and being corrected frequently. It can be discouraging, so building unity within a student’s watch is important as is creating frequent moments for light hearted community building. The goal is for students to learn *what* to do and to see this behavior role-modeled by the staff.\n\nThe second phase (usually following two weeks of spaghetti) is when students start to shift to learning *why* things are done. During each watch, a student is selected to be the shadow and follow the mate through their duties. The mate narrates what they are doing as they do it, the student accompanies the mate when they check in with the captain, and the student starts to take the lead in various routines, like making sure the hourly boat checks and weather observations are completed. This is the chance to start peeking behind the curtain and feel invited to partake in the boat’s management.\n\nFinally, the JWO Phase. In many ways, the entire trip builds to the JWO Phase. During this phase, a student is elevated to the position of Junior Watch Officer during their watch and takes over for the mate. Students interact directly with the captain to respond to weather changes, recommend sail evolutions, and delegate tasks within their watch.  The JWO can even delegate tasks to the mate, so long as the task does not take the mate away from the quarterdeck for more than 10 minutes. While the mate is still the safety officer and legally responsible for the watch, they step back as much as possible. Mates are told to let mistakes happen and only yell “Hold!” if a student is about to injure someone or damage the boat. No reason is given for yelling “Hold!”, so action does not resume until the JWO or one of their watchmates discovers the problem and corrects it.\n\n![A JWO, wearing the \"JWO Hat,\" plotting the ship's position.](https://images.mirror-media.xyz/publication-images/pw2OQCJQxLevILLX_gG1F.jpeg?height=3024&width=4032)\n\n## A Recipe for Great Learning\n\nThis three phase progression is where the magic happens. All three phases are essential; neither is successful without the other two. Most conventional classrooms never make it past the Spaghetti Phase. Conversely, if we were to skip the Spaghetti Phase, the students would not feel prepared for the greater responsibility asked of them. This progression works because of the learning environment that is very intentionally created by the staff, both in the program’s core design and through staff meetings that happen underway. That environment consists of a few essential ingredients:\n\n1. **Authenticity**. If students feel that their input and time is valued as part of an experience that is not “busy work,” they will invest in it. Since the boat is a real boat sailing on the ocean, everything connected to that objective being completed successfully is very clearly not busy work. There are very real consequences to not doing a job completely or correctly. This element drives home the value of “Seek Excellence.”\n2. **Relevance**. A student could be assigned the authentic task of digging a big hole or meticulously cleaning the interior components of an antique pocket watch but will probably lose interest if the question “why” is not answered. This can sometimes happen with boat checks, which happen every hour on a boat and begin to take on an element of blind routine if their value is not reinforced. When it comes to establishing relevance, the connection can be specific to the student, broad to society, temporal to the moment at hand, or tied to the legacy of the human race 10,000 years from now, but there must be an answer.\n3. **Ownership**. Of all the characteristics here, this is the one we see the most frequently in existing classrooms. High school students are given charge of completing their assignments, showing up to class on time, and discharging a multitude of duties. What I advocate for here is that we create more pathways for the sphere of ownership to keep expanding. We should reward great performance with greater ownership.\n4. **Agency**. This is different from ownership, perhaps even a step up from ownership. Agency combines ownership, relevance, and authenticity to create a moments where the student makes choices that have consequences. As a mate, when I delegate setting a sail to a student, I have given them ownership of that task. Often, the ownership of something means following a script for how that job needs to be done: there is a right way to set a sail and a myriad of wrong ways. Agency means writing the script.\n5. **Ability to Fail**. It is possible to create a learning environment where all of the above are present and yet the lesson still falls short on this final element. A JWO will feel authenticity, relevance, ownership, and agency by the nature of being JWO, but if the mate steps in to answer a tough question or offers an overly revealing hint, the ability to fail dissolves. In some ways, ability to fail creates a deeper layer of fusion between authenticity and the relevance of the experience that generate moments of genuine discomfort for students.\n\n   As a mate, a critical element in creating a successful JWO Phase is to step back and let the student make mistakes, or forget things, or become overwhelmed. This can be hard because I want my students to succeed, but I have come to appreciate that there needs to be a “butterfly emerging from the chrysalis” moment if the value of everything that happened up to that point is going to matter. A student can watch and study something a million times, but then it is their turn to step up and do it. Near the end of the novel *The Alchemist*, the alchemist describes this concept to the protagonist:\n\n> “What you still need to know is this: before a dream is realized, the Soul of the World tests everything that was learned along the way. It does this not because it is evil, but so that we can, in addition to realizing our dreams, master the lessons we’ve learned as we’ve moved toward that dream. That’s the point at which, as we say in the language of the desert, one ‘dies of thirst just when the palm trees have appeared on the horizon.’\n>\n> Every search begins with beginner’s luck. And every search ends with the victor’s being severely tested.”\n\n![](https://images.mirror-media.xyz/publication-images/XFo5fuOKYfz2DwkCXIQz_.jpg?height=447&width=450)\n\nTo be clear, I am not talking about fear of failing as a person. Our classrooms already have this trait to a damaging degree with our modern grading system and the pressure of college admissions. I have frequently seen tears on JWO and while sometimes that is just how a person processes stress, there needs to be a calibration of duties with what a student is ready for, which varies by person. When I debrief with my JWO after the watch is over, a pointer I frequently remind them of is to not be too hard on themself when they fail: accept that you will make a mistake, take a moment to reflect on it, and then give yourself the grace to move past it and you can unpack the lesson later. As a leader, you must move past it or you will be distracted from your job in that moment. I also believe that a student needs, ideally, a minimum of three shifts as JWO to enable them to witness their own progress and internalize lessons. Most often, a student’s first JWO stint is not pretty and having that be their one shot would be unfortunate.\n\n## Beyond Sailing\n\nSailing for weeks at a time is an amazing adventure that makes creating many of these conditions easier, but in some ways it is not ideal. The sleep schedule, seasickness, and risk of burnout for staff and students are the most obvious downsides. Sailing is also an expensive and exclusive opportunity. And do we really need a boat in order to do any of this?\n\nAbsolutely not.\n\n![Planet School terms will begin with 4-5 weeks sailing and then transfer to a land campus, bringing along the ethos developed underway.](https://images.mirror-media.xyz/publication-images/yh6OSBRAKEr2wfgdma3uE.jpeg?height=3024&width=4032)\n\nMy goal with the Planet School is to take this process that I have seen be so effective on sailboats and replicate it in other realms. A three phase progression carried out between a knowledgeable practitioner and a group of students can be done in almost any field: the leader of a “watch” need not be a professional mariner. The expert could be a farmer, an engineer, an economist, or an artist. The task need not be sailing, it could be starting a business, managing a farm, or building a yurt. It could even be building a school.\n\nThe underlying project of the Planet School is to build the school itself. Since a campus is a community, such an undertaking could reasonably include a project in almost any discipline, giving students the chance to explore their passions and be exposed to potential passions they have not experienced before. Some of my most potent memories from high school are from the activities that included role-playing of “real life”: speech and debate, theatre, Model UN, Youth Legislature, and the school newspaper. Through the prevalence of internships, externships, and youth employment as well as the cliche of how teenagers yearn to leave home, the desire for real world experience at that age is evident. We should build our schools to be authentic laboratories for trying out real world solutions. If we are to be better stewards of our planet, then we need to do more than encourage experimentation, bold thinking, and sustainability—we need to create education spaces where we actively train youth in those habits.\n\nI never imagined myself as a teacher. I never imagined myself working in education. Yet I have learned that any systemic reimagining of human civilization must begin with how we equip our future generations. My vision for school is that, whatever the project, students are challenged in an authentic, relevant way where they have agency, feel ownership, and are trusted to be able to fail.", "timestamp": 1653240036, "digest": "SiaaK_sDxGc1-zoy7KhbTktMsmr-WZmS8dSheqQM8Yc", "contributor": "0x505683cF3aDdF5DE8E82AABB9d24763B9A72aAD0"}
{"id": "EmQRGkybTfD-Vjr-i4HBzK844yPiuwJhR5HokNX_OnU", "title": "一文撸完A16z所有投资项目", "body": "May 23th, 2022\n\n**牛市炒币，熊市空投**。这是我从建号时候就提出来的，能够认真执行的人，最近应该不会亏什么钱吧。\n\n过去一周发生了很多事情，熊市已经被Luna正式开启了。别看现在群里还有些欢声笑语，那是现在还没跌够，每次到熊市深处，很多人会真心地怀疑区块链是不是骗局，BTC还能不能起来，在各种市场经历过多次牛熊的我对这个节奏实在太熟悉了。 \n **目前来看，在熊市中里唯一能够不亏钱的方法就是一边做空投一边做一级市场的研究（注意不是投研），耐心等待下一次牛市。**\n\n这次给大家带来的是著名投资机构A16z投资中，那些还未发币，有机会撸空投的项目。A16z投资的AR、SOL、DYDX、FLOW、NEAR、Uniswap都上轮牛市中爆发过了，其投资眼光是想当好的，**所以在熊市中选择背靠大机构投资、更有可能发币的项目撸空投肯定是个不坏的选择。**\n\n其实A16z投资的项目中，能撸的空投不多，有的还需要具备一些专业知识。但是这里十分建议大家从现在开始慢慢学习。**在漫长的熊市中这样的项目还会有很多，一边撸到空投的同时，还能掌握一些区块链世界真正硬核的知识，不管是以后炒币还是吹牛逼都是有用的。**\n\n除了寻找空投项目外，我还顺带把其他不会发币但是值得了解的项目也在本文中做了介绍。虽然不是我们的主业，**但是多了解了解这个市场，多见见世面，长长见识，也能提高眼光，慢慢学会鉴别项目的好坏。**\n\n最后再做一个说明，除非有大量的需求，我一般很少会做那种手把手的教程。一来是我时间不够，写长文的同时也是对自己知识储备的一个扩充和加固；二来我更倾向于多讲讲撸空投的逻辑和方法，以及尽量按照官方的指引去完成操作，提升自己的能力，这样才能在不变中应对万变。\n\n## 一、空投项目\n\n### zkSync\n\n状态：未发币，公开测试\n\n最近大火的zkSync就是由A16z投资的，之前已经详细介绍过了。\n\n顺便一说，同样采用zkrollup技术的stark则是主要由红衫投资。\n\n[史上最长万字长文带你详细了解L2网络和空投方法（ZK-rollup篇）](https://mirror.xyz/yourairdrop.eth/kxkmRkwe_MdCEA9OBb5C3W1Te368Nq8ric8tGNELkU8)\n\n[由于L2的知识繁杂又零碎，所以这篇文章准备将L2剩下的几个网络都做一个汇总，一块来说一下空投的策略。](https://mirror.xyz/yourairdrop.eth/kxkmRkwe_MdCEA9OBb5C3W1Te368Nq8ric8tGNELkU8)\n\n[mirror.xyz](https://mirror.xyz/yourairdrop.eth/kxkmRkwe_MdCEA9OBb5C3W1Te368Nq8ric8tGNELkU8)\n\n### Apotos\n\n状态：未发币，节点测试中\n\n简述：这个有别于普通测试网，需要运行验证节点，建议网上组一个云服务器，比家用电脑更稳定。腾讯云比较便宜、适合新手使用，可以提供基本的功能。 \n 最好配置4核8G内存以上，Ubuntu 20.04系统，可以满足大部分节点测试的需要。\n\n按照这个配置\n\n配置以后按照以下说明部署网络即可\n\n[Introduction | Aptos Labs](https://aptos.dev/tutorials/validator-node/intro)\n\n[This tutorial describes how to run Aptos nodes for the Aptos Incentivized Testnet 1 (AIT1) program. It explains the following:](https://aptos.dev/tutorials/validator-node/intro)\n\n[aptos.dev](https://aptos.dev/tutorials/validator-node/intro)\n\n### Iron Fish\n\n状态：未发币，节点测试中\n\n简述：同上个项目，目前正在节点测试，需要配置服务器参加测试，这种节点测试是肯定会给空投的，而且A16z投资的项目，应该不会小气。\n\n除了节点测试，还有一些其他的任务可以完成，十分推荐。按照下面链接参加即可，谷歌浏览器自带翻译的哦。\n\n[about](https://testnet.ironfish.network/about)\n\n[testnet.ironfish.network](https://testnet.ironfish.network/about)\n\n### Eco\n\n状态：未发币，已上线\n\n简述：一个类似于余额宝的钱包，年收益2.5%（推荐用户后为5%），存款可获得积分，积分以后可能兑换成空投。\n\n[Eco — It’s time for smart money](https://www.eco.com/)\n\n[Eco is one simple balance that lets you spend, send, save and make money at the same time.](https://www.eco.com/)\n\n[www.eco.com](https://www.eco.com/)\n\n### Syndicate\n\n状态：未发币，已上线\n\n简述：Syndicate 允许用户自由创建投资dao，目前还没发币。 \n 比较可能的空投的方式是投资或者自己创建一个dao，可以自己建立一个，然后用几个小号打钱过来“投资”，目前还没研究好怎么“跑路”，大概0.03左右eth就能创建一个dao了。 \n 想撸这个空投的话，一定要加入他的discord获得进一步的资讯。\n\n[Syndicate](https://syndicate.io/)\n\n[A decentralized investing protocol and social network that’s transforming how the world creates value.](https://syndicate.io/)\n\n[syndicate.io](https://syndicate.io/)\n\n此外，syndicate还有一个内测的NFT项目，填表就有机会参加。\n\n[Syndicate Membership NFT Interest Form](http://docs.google.com/forms/d/e/1FAIpQLSf0Ss7TQH5LNWE5DganDox3M5iFXiXsPdzKe9pcIcDKXrQniA/viewform)\n\n[Thank you for your interest in Syndicate membership NFTs! We are currently heads down building our product and running pilots with a handful of groups. We anticipate launching publicly in the next few months. If you are interested in being a part of our pre-release pilot, please fill out the form.…](http://docs.google.com/forms/d/e/1FAIpQLSf0Ss7TQH5LNWE5DganDox3M5iFXiXsPdzKe9pcIcDKXrQniA/viewform)\n\n[docs.google.com](http://docs.google.com/forms/d/e/1FAIpQLSf0Ss7TQH5LNWE5DganDox3M5iFXiXsPdzKe9pcIcDKXrQniA/viewform)\n\n### Forta\n\n状态：未发币，已上线\n\n简述：主要面向商用的安全监测平台，目前来看不会发币。\n\n[Forta Network](https://forta.org/)\n\n[Forta Network](https://forta.org/)\n\n[forta.org](https://forta.org/)\n\n### Spruce\n\n状态：明确不发币，已上线\n\n简述：目前开发了SpruceID 和 Kepler两个产品，面向商用 \n 项目方口口声声说不发币并不可靠，可关注该项目发展。\n\n[Spruce - Decentralized Identity and Storage](https://spruceid.com/spruceid)\n\n[Empowering developers, SpruceID and Kepler let your users collect their data in one place that they control, and show their cards however they want.](https://spruceid.com/spruceid)\n\n[spruceid.com](https://spruceid.com/spruceid)\n\n### World Coin\n\n状态：未发币，未上线\n\n简述：有一个很中二的名字，号称要基于Proof-of-Personhood，给全世界的人发币，不知道要怎么实现，关注着吧\n\n[Worldcoin](https://worldcoin.org/)\n\n[Worldcoin is a digital currency that launches by giving away a piece to every person in the world](https://worldcoin.org/)\n\n[worldcoin.org](https://worldcoin.org/)\n\n### Kosen\n\n状态：未发币，未上线\n\n简述：这是一个为链上做市商提供ai方案的的项目，目前还没项目实体，明确会发币，但方式不明确，可关注\n\n[Kosen Labs](https://www.kosen.ai/)\n\n[AI for the decentralised world.](https://www.kosen.ai/)\n\n[www.kosen.ai](https://www.kosen.ai/)\n\n### MEM\n\n状态：未发币，内测中\n\n简述：这是一个社交协议，目前还没对外公布具体信息，可持续关注\n\n[Mem](https://mem.co/)\n\n[Sign in as you](https://mem.co/)\n\n[mem.co](https://mem.co/)\n\n### Nova labs\n\n状态：未发币，未公布内容\n\n简述：计划今年上线，可持续关注\n\n[Nova Labs (@novalabs_) / Twitter](https://twitter.com/novalabs_)\n\n[Freedom to Connect. Built on the @Helium Network. Coming 2022.](https://twitter.com/novalabs_)\n\n[twitter.com](https://twitter.com/novalabs_)\n\n### EveryRealm\n\n状态：未发币，未开放测试\n\n简述：数字房地产投资公司Republic Realm 已经筹集了6000 万美元的A 轮融资，并宣布更名。\n\n[Leaders in metaverse innovation and development | Everyrealm](https://everyrealm.com/)\n\n[Everyrealm is one of the most active players in the metaverse ecosystem. We invest in, manage, and develop assets including NFTs, metaverse platforms, and more.](https://everyrealm.com/)\n\n[everyrealm.com](https://everyrealm.com/)\n\n## 二、A16z投资的其他项目\n\n仔细研究A16z，你会发现，其投资的项目中NFT相关的项目几乎占了大头，其次是游戏类，虽然不一定能得出结论，但是我们可以有一个推断——或许下一轮牛市游戏和NFT还会继续起飞，当然这需要在漫长的熊市中进一步论证，都是后话了。\n\n### 游戏类\n\n[Home - Core Loop](http://coreloop.ai/)\n\n[Core Loop Games, Inc. Building the next generation MMOs](http://coreloop.ai/)\n\n[coreloop.ai](http://coreloop.ai/)\n\n元宇宙MMO+沙盒游戏\n\n[Mythical Games - Games](http://mythicalgames.com/games)\n\n[We are Mythical Games, a Venture-backed next-generation game technology company at the intersection of video games and economics led by industry veterans.](http://mythicalgames.com/games)\n\n[mythicalgames.com](http://mythicalgames.com/games)\n\n一个游戏工作室，目前开发了游戏[blankos.com](http://blankos.com/)\n\n[Sky Mavis](http://www.skymavis.com/)\n\n[Blockchain: Gamified - We build games with player owned economies – true digital nations.](http://www.skymavis.com/)\n\n[www.skymavis.com](http://www.skymavis.com/)\n\n游戏众多，AXS就是这个项目方开发的\n\n[Battlebound - Building Games Players Love](http://battlebound.io/)\n\n[Our games are built for players to share the value generated by playing video games they love. Where world-class gameplay meets web3.](http://battlebound.io/)\n\n[battlebound.io](http://battlebound.io/)\n\n需完成白名单购买NFT才能参与\n\n### NFT类\n\n[BreederDAO | $BREEDing life into the Metaverse, one game at a time.](https://www.breederdao.io/)\n\n[BreederDAO is the NFT asset factory of blockchain games. We provide high-volume asset production, tailored to specification, for some of the largest guilds in the Metaverse so they can supercharge their play-to-earn economies.](https://www.breederdao.io/)\n\n[www.breederdao.io](https://www.breederdao.io/)\n\n为各项目订制NFT，已发币\n\n[Bitski](http://www.bitski.com/)\n\n[Create, sell, and own NFTs with Bitski](http://www.bitski.com/)\n\n[www.bitski.com](http://www.bitski.com/)\n\nNFT钱包，可以去商店里下载一个自行体验，多参与交易或许有空投，DYOR。\n\n[Home - Forte](http://www.forte.io/)\n\n[www.forte.io](http://www.forte.io/)\n\n提供定制化的NFT工具，主要面向商用，不太可能发币\n\n[Foundation](https://foundation.app/)\n\n[Foundation is a creative playground for artists, curators and collectors to experience the new creative economy.](https://foundation.app/)\n\n[foundation.app](https://foundation.app/)\n\n为NFT创作者提供开发平台和交易市场，也许参与mint和交易会获得空投，DYOR。\n\n[Leaders in metaverse innovation and development | Everyrealm](http://everyrealm.com/)\n\n[Everyrealm is one of the most active players in the metaverse ecosystem. We invest in, manage, and develop assets including NFTs, metaverse platforms, and more.](http://everyrealm.com/)\n\n[everyrealm.com](http://everyrealm.com/)\n\n元宇宙虚拟土地NFT，购买NFT或许有空投，DYOR。\n\n[FingerprintsDAO](https://fingerprintsdao.xyz/)\n\n[NFTs that can be fully recreated from their fingerprints on the blockchain are cultural artefacts that can live as long as the internet exists. The innovation of NFTs is not in linking to an artwork stored elsewhere, but in the token being the artwork itself.](https://fingerprintsdao.xyz/)\n\n[fingerprintsdao.xyz](https://fingerprintsdao.xyz/)\n\n这是一个收藏家组织，已发币但方案似乎还在讨论中，早期参与者和质押相关NFT和代币的人有可能获得空投，DYOR。\n\n[Pleasr](http://pleasr.org/)\n\n[×](http://pleasr.org/)\n\n[pleasr.org](http://pleasr.org/)\n\nPeasrDao也是一个众筹NFT的组织，未发币。参与该组织应该会有空投，DYOR。\n\n[Crypto for Creative Communities](http://rally.io/)\n\n[Rally enables creators to launch independent micro economies for their fan communities via ethereum-powered creator coins.](http://rally.io/)\n\n[rally.io](http://rally.io/)\n\nrally是一个创作者平台，允许创作者、名人、社区和品牌发布他们的公共代币和NFT，已发币。\n\n[VHS | Virtually Human](http://www.vhslab.com/)\n\n[Builders of ZED RUN](http://www.vhslab.com/)\n\n[www.vhslab.com](http://www.vhslab.com/)\n\nNFT开发商，著名的zed run就是他开发的。\n\n[Autograph: The new era of collecting](http://autograph.io/)\n\n[Autograph is an NFT platform that brings together the most iconic brands and legendary names in sports, entertainment and culture to create unique digital collections and experiences.](http://autograph.io/)\n\n[autograph.io](http://autograph.io/)\n\n一个体育类的NFT。\n\n### 音乐NFT\n\n[Sound.xyz](https://sound.xyz/)\n\n[Own A Song, Join A Community](https://sound.xyz/)\n\n[Sound.xyz](https://sound.xyz/)\n\n[Royal - Own your favorite music. | Royal](http://royal.io/)\n\n[Own music and earn royalties alongside artists, on Royal](http://royal.io/)\n\n[royal.io](http://royal.io/)\n\n### 社交类\n\n[Deso | The Decentralized Social Blockchain](http://www.deso.org/)\n\n[www.deso.org](http://www.deso.org/)\n\n可快速订制代币的一个粉丝经济平台，已发币。\n\n### 其他\n\n[Fei Protocol](https://app.fei.money/)\n\n[The Stablecoin for DeFi](https://app.fei.money/)\n\n[app.fei.money](https://app.fei.money/)\n\n稳定币工具，farm的收益还算不错吧\n\n[Home](http://www.trusttoken.com/)\n\n[Last Modified: November 20, 2020](http://www.trusttoken.com/)\n\n[www.trusttoken.com](http://www.trusttoken.com/)\n\nTrustUSD算法稳定币的制造商，没什么可以撸的\n\n[Goldfinch](https://goldfinch.finance/)\n\n[goldfinch.finance](https://goldfinch.finance/)\n\n借贷工具，已发币\n\n[Dapper Labs - Fun and games on the blockchain](http://www.dapperlabs.com/)\n\n[Dapper Labs uses the power of play to deliver blockchain-based experiences that are made for you and ready for the real world.](http://www.dapperlabs.com/)\n\n[www.dapperlabs.com](http://www.dapperlabs.com/)\n\n区块链开发商，Flow和CryptoKitties就是他的作品，值得关注的公司\n\n公司创始人，伊朗出生的温哥华居民，Roham Gharegozlou\n\n### 开发平台/基础设施\n\n这些都是开发者使用的工具，知道有这个项目就行了，不会给用户空投的\n\n[Alchemy - Blockchain APIs and Node Infrastructure](http://www.alchemy.com/)\n\n[Whether you’re a beginner developer, startup, web3 market leader, or a large enterprise, Alchemy makes multichain web3 development easy with reliable and scalable node infrastructure, enhanced APIs, and developer tools. Get started for free!](http://www.alchemy.com/)\n\n[www.alchemy.com](http://www.alchemy.com/)\n\n开发者工具\n\n[CoinSwitch Kuber: Buy Bitcoin and Cryptocurrency at India’s Leading Crypto Exchange](http://coinswitch.co/)\n\n[Made in India, for Indians - CoinSwitch is India’s simplest and most trusted Crypto app. Buy, sell, and trade in Bitcoin and altcoins at the tap of a button](http://coinswitch.co/)\n\n[coinswitch.co](http://coinswitch.co/)\n\n手机上的交易app\n\n[Please Wait... | Cloudflare](http://www.aleo.org/)\n\n[Completing the CAPTCHA proves you are a human and gives you temporary access to the web property.](http://www.aleo.org/)\n\n[www.aleo.org](http://www.aleo.org/)\n\n开发者工具\n\n[OnChain Studios](https://www.onchainstudios.com/)\n\n[www.onchainstudios.com](https://www.onchainstudios.com/)\n\n状态：NFT游戏开发工具，目前开发的项目有cryptoys.com\n\n[Home](http://www.improbable.io/)\n\n[Improbable delivers technology, expertise, creativity and services to help you unleash the full potential of virtual worlds and the metaverse](http://www.improbable.io/)\n\n[www.improbable.io](http://www.improbable.io/)\n\n元宇宙开发工具，1.6亿美元融资，应该不会发币\n\n[Protocol Labs](http://protocol.ai/)\n\n[Protocol Labs is building the next generation of the internet.](http://protocol.ai/)\n\n[protocol.ai](http://protocol.ai/)\n\n2014年就成立协议开发实验室，著名的IPFS就是他们开发的\n\n[Talos - Home](http://talos.com/)\n\n[Home-Talos delivers infrastructure for institutional asset trading to the most sophisticated investors, primes, exchanges & custodians.](http://talos.com/)\n\n[talos.com](http://talos.com/)\n\nDex开发工具\n\n[Valora | A mobile payments app that works worldwide](http://valoraapp.com/)\n\n[The crypto wallet with 25% rewards to buy, send, spend, grow, and collect NFTs on the Celo blockchain.](http://valoraapp.com/)\n\n[valoraapp.com](http://valoraapp.com/)\n\n一个手机上的交易app\n\n## 三、结语\n\n到此为止，A16z所有的项目就介绍完了。最后我提醒一下大家，虽然我一直强调在空投的时候做好项目研究，但千万不要相信项目方的花言巧语入戏太深，随时都想all in。\n\n实际上，目前的币圈并没有任何一个项目是真正产出了任何价值的，即没有一个项目可以不依靠外部投入，像一个工厂一样生产出一件有价值的商品。他既没有提升生产力，也没有改变生产关系，所有人心心念念的去中心化也不见得就实现了，基本上就是一个零和博弈的市场。\n\n随时从一个理性投资人的角度看待这个市场，虽然不一定让你像网上看到的极少数人那样搞搞合约就立刻赚到大钱，但至少可以在很多时候抛弃fomo的情绪，慢慢积累资金，厚积薄发。不断量变的时候在某一个临界点迎来质变，才是让大多数普通人获得成功的正确路径。\n\n[ARWEAVE TX→](https://viewblock.io/arweave/tx/aBG-XueIEsN91bfLifqukCH9dWajLMJq9AvazRAUCVE)\n\n[aBG-XueIEsN91bfLifqukCH9dWajLMJq9AvazRAUCVE](https://viewblock.io/arweave/tx/aBG-XueIEsN91bfLifqukCH9dWajLMJq9AvazRAUCVE)\n\n[ETHEREUM ADDRESS→](https://etherscan.io/address/0x1320d47e264FeA17fC428A95f8A8f94531E7F75f)\n\n[0x1320d47e264FeA17fC428A95f8A8f94531E7F75f](https://etherscan.io/address/0x1320d47e264FeA17fC428A95f8A8f94531E7F75f)\n\nCONTENT DIGEST\n\nw1os2B3WTz-8KUcoCoRQSd65p1q8iadZCVnYtEyxiqA", "timestamp": 1653239898, "digest": "Iun-DO6SI7AyPospFiODVCDsE6WPSy9oX3Ov96bfMik", "contributor": "0x6C40E5BBf4949bdbFDd48e01988CAFb490023cD2"}
{"id": "_ktngwZJ72RXGj0I_4cUM294Ldr98gZkzACwhLcru1c", "title": "常见缩写", "body": "eta（Estimated Time of Arrival） 预计到达时间\n\nimho（In My Humble Opinion）恕我直言\n\ndm（Direct Message） 私信", "timestamp": 1653240217, "digest": "zekP1XQqQpJWS_csjonTt-38GS7aT_-UBroadxDYcx0", "contributor": "0x8e45a27bf4Da9dA4B8B941B69E27107a025D7FC9"}
{"id": "l5UF_vuCanTR12l4OciB1z_OMSvMAAg9N3f18-Up1N4", "title": "ASX Genesis Event", "body": "## Not you usual TGE\n\nThere have been many debates about what the fairest token generation event mechanism would be, but a consensus has yet to be reached. With that in mind, we’ve decided to do things a little differently and base our launch on (possibly) the rarest commodity in this market: awareness. Welcome to our stealth launch.\n\n\n---\n\n*The ASX Genesis Event has arrived. Please read this article carefully to understand the novel mechanics of this event.*\n\n\n---\n\n## TL;DR\n\n*Values in US$ consider ETH priced at $1,925.*\n\n* **Token:** ASX (ERC-20) → Governance Token of the ASX Protocol\n* **Network:** Ethereum Mainnet\n* **Total / Max Supply:** 1,000,000,000 ASX\n* **Genesis Event Allocation:** 800,000,000 ASX\n* **Initial Liquidity Allocation:** 200,000,000 ASX\n* **Mint Rate:** 1 ASX / 0.000004 ETH or 250,000 ASX / 1 ETH\n* **Venue:** Self-hosted at <https://mint.asx.st/>\n* **Mode:** First-come, first-served basis (FCFS)\n* **Start date**: Live now\n* **End date**: 10 days after the soft cap is reached\n* **Soft Cap:** 1000 ETH | 250,000,000 ASX minted\n* **Hard Cap:** 3200 ETH | 800,000,000 ASX minted\n* **Fully Diluted Market Cap / Value (FDV)**\n  * **at Soft Cap:** 312,500,000 ASX \\~ $2,406,250 | 687,500,000 ASX burned\n  * **at Hard Cap:** 1,000,000,000 ASX \\~ $7,700,000 | 0 ASX burned\n* **Initial Liquidity (40% of FDV)**\n  * **at Soft Cap:** 62,500,000 ASX + 250 ETH | \\~ $962,500\n  * **at Hard Cap:** 200,000,000 ASX + 800 ETH | \\~ $3,080,000\n* There's no founders or team allocation, no seed or private sale, no liquidity mining, and no airdrop. The Genesis Event is the first and only place to get ASX tokens before listing.\n* Team and partners are allowed to participate after the progress bar reaches 50%.\n* Participants can claim their ASX tokens once the event is completed. There's no vesting. 100% of the max supply will be unlocked and circulating on day one.\n* Once the soft cap is reached (250,000,000 ASX minted), a countdown of 10 days will start. When it hits zero, the Genesis Event will end, the initial liquidity pool on Uniswap will be created and the remaining ASX will be burned along with the liquidity provider (LP) token.\n* ASX ERC-20 smart contract address: **0x5313235002b9F11698D7B9187Be44f836FEbD6b5**.\n\n\n---\n\n## A unique token launch\n\nAs a community-focused project committed to the ethos and founding principles of the blockchain space, we are pleased to announce the official launch of **ASX**, the governance token of the ASX Protocol.\n\nIn the spirit of equal distribution, fairness, decentralization, and a community-first ideology, the launch event is taking place on our [custom-made platform](https://mint.asx.st/) and it's the first and only opportunity for anyone to get access to the ASX Protocol's native token, **ASX**, which will give holders the power to govern and curate essential infrastructure components of the network.\n\nOur mission is to give everyone in our community an opportunity to become a stakeholder in the ecosystem, and we want to extend that opportunity as fairly as possible. Launching ASX on our own platform, with a mechanism that is fair and transparent for all participants, drastically increases the chances of achieving this mission.\n\nApart from building our own token launch platform, we made sure everyone was on a level playing field. There's no seed or private sale, no liquidity mining, no emission (zero inflation), zero tokens to influencers or promoters, no airdrop, and zero Treasury, Company, Founders, Team, or Partners allocation.\n\n### 1 billion ASX tokens. 800 million to be minted, 200 million for liquidity. That's it.\n\n> *The protocol's revenue will exclusively serve ASX holders and all operations will be funded with ETH or stablecoins.*\n\nThe ASX Genesis Event is open to all interested and qualifying parties. It's a major milestone for the ASX Protocol ecosystem and speaks to the viability of our core technology and business model as we aim to become the ultimate permissionless omnichain liquidity hub for staked assets.\n\nAt ASX Labs, we believe in creating a global staking ecosystem of the people, by the people, for the people, that shall not perish under any threats. The crypto dream has never been about creating an instrument that can easily be put in a box, but about creating global assets that can govern and manage these new decentralized global networks.\n\n## Understanding the mechanics\n\nTo mint 1 ASX you need to contribute 0.000004 ETH. A total of 800,000,000 ASX will be available for minting. Due to the low fully diluted market cap of the project and to ensure as broad a distribution as possible and dramatically soften the potential for a massive gas war, we decided to operate in stealth mode until 50% of the tokens are minted.\n\nThere's a minimum of 1 ASX per mint and no maximum. Setting up a max cap per wallet without KYC is foolish and we're not big fans of KYC in DeFi. For us, privacy and freedom are paramount, and we respect and stand by yours. With that said, there's a cap of 100 ETH per mint on our Interface just to slow things down, if they get a bit crazy.\n\nIf you're lucky enough to hear about the ASX Protocol early, you'll have enough time to participate. Otherwise, you can get ASX tokens on Uniswap, after the Genesis Event is completed.\n\n## How to participate\n\nParticipating in the ASX Genesis Event is simple, quick, and intuitive, and getting prepared is even easier. Here’s what you’ll need:\n\n→ **An Ethereum-compatible web3 browser wallet**, such as MetaMask. You can generate a wallet address from these web3 wallets directly, or use your seeds to import an existing wallet address.\n\n→ **Sufficient ETH**, which you will need in order to contribute and pay for transactions gas fees.\n\nOnce you’ve got your checklist all set, here’s what the process will look like:\n\n1. To get started, head to our custom-made [Launch Platform](https://mint.asx.st/).\n2. You’ll be prompted with a welcome message. Click on \"**PARTICIPATION TERMS**\". Read everything and, if you agree, click on \"**I AGREE**\". Next, click on \"**CONTINUE**\".\n3. The next message will be a TL;DR of the ASX Genesis Event. Carefully read everything and click on \"**CONTINUE**\".\n4. You can now connect your wallet. We support almost any web3 injected wallet, but for a flawless experience, we recommend using MetaMask. Click on \"**CONNECT WALLET**\", either in the center or on the upper right-hand corner of the page.\n5. Once your wallet is connected, the ETH and ASX input fields will become available to you. You may either insert the amount of ASX you would like to receive or the amount of ETH you would like to contribute. Enter the desired amount and click on \"**MINT**\". Please make sure you have enough ETH in your wallet to pay for transaction fees.\n6. You will see a popup from your MetaMask wallet. Confirm the transaction and then wait for it to go through. Once it is validated on the Ethereum blockchain, your ASX balance, on the top of the page, will update and a \"CLAIM\" button will appear. You will be able to claim your ASX tokens once the event is completed.\n7. That's it! You successfully participated in the ASX Genesis Event.\n\n*Once your transaction is validated, a smart contract, that works like an escrow, will receive your ASX tokens and keep them safe until the end of the Genesis Event, when you will be able to claim them. Claimed ASX tokens are not locked and there is no vesting.*\n\n*Team and partners are allowed to participate in the Genesis Event after the progress bar reaches 50%. If the desired amount of ASX that those parties intend to hold can't be fully minted during this event, the remaining amount will be purchased on Uniswap.*\n\n## Liquidity\n\nBy the end of the Genesis Event, the initial liquidity of the ASX token will be immediately provided as a full range position on Uniswap V3. Since the resulting liquidity provider (LP) token will be directly burned, this initial position will be perpetual.\n\nThe liquidity depth will represent 40% of the FDV (Fully Diluted Value) and its absolute value will be based on the total ASX minted.\n\n* At soft cap, 250 ETH will be paired with 62,500,000 ASX, pricing the token at $0.0077 / ASX with $962,500 of liquidity depth.\n* At hard cap, 800 ETH will be paired with 200,000,000 ASX, pricing the token at $0.0077 / ASX with $3,080,000 of liquidity depth.\n\n*The Genesis Event will end in 10 days after the soft cap is reached or when all ASX tokens are minted, whichever comes first. Any unminted ASX will be burned.*\n\n## Security\n\nWe were very careful when deciding the code for the ASX ERC-20 smart contract and, to make it the safest possible, we only allowed the absolutely necessary lines of code. There's no mint function, no pause function and the contract is not upgradeable. It is an immutable token on the Ethereum Mainnet Network.\n\nBoth the ERC-20 and the Genesis Event smart contracts were developed with the highest levels of security, leveraging the battle-tested OpenZeppelin standard. With the entire supply circulating by the end of the Genesis Event plus the immediate burn of the liquidity provider (LP) token, you can rest assured that the ASX token can never be hacked or rugged.\n\n### Important Notes\n\nThe team at ASX Labs will NEVER DM YOU FIRST or ask you for money on any platform. You should be very skeptical of any DMs received by anyone claiming to be from ASX Labs.\n\nOnly trust ASX Protocol's official channels at the bottom of this announcement for information surrounding the event.\n\nThe ASX token will only be available once the Genesis Event is completed. Only then you will be able to trade it on Uniswap. Be sure to always check the smart contract address before trading.\n\n\n---\n\nThis is the first step towards an omnichain yield future. Welcome aboard.\n\n\n---\n\n* Participate in the [ASX Genesis Event →](https://mint.asx.st/)\n* Access our [Interface →](https://asx.st/)\n* Follow us on [Twitter →](https://twitter.com/asxlabs)\n* Join us on [Telegram →](https://t.me/asxprotocol)\n\n\n---\n\n## Legal Disclaimers\n\n*You understand that the ASX tokens have no intrinsic value and are solely tools of governance, and as such have no intrinsic potential for future appreciation in any form whatsoever. You further represent and warrant that you are an active user of blockchain technology and blockchain-based software systems and have the pre-requisite technical knowledge to understand what has been mentioned in this announcement and the risks that follow*.\n\n*The information provided within this announcement is for general informational purposes only pertaining to the governance tool. You understand that the ASX Protocol governance structure is an experiment in the field of decentralization and community governed structures, in which participation via the ASX token and otherwise is entirely at your own risk*.\n\n*Information contained in this announcement should not be relied upon at any time as advice to buy or sell or hold the aforementioned governance tokens and a particular note should be made to emphasize the solely governance-based nature of the ASX tokens and their lack of intrinsic ownership or economic value. This announcement does not take into account nor does it provide any tax, legal, or investment advice or opinion regarding the specific investment objectives or financial situation of any person.*\n\n*ASX Protocol and its associated parties, as appropriate, make no representation or warranties, expressed or implied, as to the accuracy of such information and ASX Protocol expressly disclaims any liability that may be based on such information or errors or omissions thereof. ASX Protocol reserves the right to amend or replace the information contained herein, in part or in its entirety, at any time, and undertakes no obligation to provide the recipient with access to the amended information or to notify the recipient thereof. The information contained in this announcement supersedes any prior representation, post, or conversation whether informal or formal, concerning the same, similar, or related information*.\n\n*This communication is not for distribution to U.S. newswire or similar services or any dissemination in the United States. This communication shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of, ASX tokens to any U.S. person (including, without limitation, any citizen or resident of the United States) or in the United States or in any jurisdiction in which such offer, solicitation, or sale would be unlawful before registration or qualification under the laws of any such jurisdiction*.\n\n*Any reference or mention of the ASX Genesis Event being open or accessible to the “public” should be understood to refer only to qualified individuals and entities under the applicable law.*\n\n*The ASX token is not an investment contract or security and should not be treated as such.*\n\n\n---\n\n## Restricted List of Countries\n\n*The ASX Genesis Event is not available to anyone located, incorporated or otherwise established in, or a citizen or resident of the United States of America, Afghanistan, Albania, American Samoa, Angola, Antigua and Barbuda, Aruba, Bangladesh, Barbados, Belarus, Benin, Bermuda, Bhutan, Bolivia, Bosnia and Herzegovina, Botswana, Brunei Darussalam, Burkina Faso, Burundi, Cabo Verde, Cambodia, Cameroon, Canada, Cayman Islands, Central African Republic, Chad, China, Comoros, Congo, Côte D'ivoire, Crimea and Sevastopol, Cuba, Democratic People's Republic of Korea, Democratic Republic of the Congo, Djibouti, Dominica, Ecuador, Egypt, El Salvador, Equatorial Guinea, Eritrea, Eswatini, Ethiopia, Fiji, Gabon, Gambia, Ghana, Guam, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, Hong Kong, Iran, Iraq, Jamaica, Jordan, Kenya, Kyrgyzstan, Lao People's Democratic Republic, Lebanon, Lesotho, Liberia, Libya, Macao, Madagascar, Malawi, Maldives, Mali, Malta, Mauritania, Mauritius, Micronesia, Moldova, Mongolia, Montenegro, Morocco, Mozambique, Myanmar, Nauru, Nepal, New Caledonia, Nicaragua, Niger, Nigeria, Niue, Northern Mariana Islands, Oman, Pakistan, Palau, Palestine, Panama, Papua New Guinea, Puerto Rico, Russian Federation, Rwanda, Samoa, Sao Tome and Principe, Senegal, Serbia, Seychelles, Sierra Leone, Somalia, South Georgia, South Sudan, Sri Lanka, Sudan, Suriname, Syrian Arab Republic, Tajikistan, Tanzania, Thailand, Timor-Leste, Togo, Tonga, Trinidad and Tobago, Tunisia, Turkey, Turkmenistan, Uganda, Ukraine, United Kingdom, United States Minor Outlying Islands, US Virgin Islands, Uzbekistan, Vanuatu, Venezuela, Western Sahara, Yemen, Zambia, Zimbabwe, or any state, country, or jurisdiction where it would be illegal, according to applicable law, to participate in this event*.", "timestamp": 1653239923, "digest": "SPP24Za2i393DM3Tx2hJqKXW0GYafuXHOu-pvMLcjNg", "contributor": "0x1be3C6a0a7617CE21Ca1765917629629787b48aD"}
{"id": "oDl3S6NLz6jyBZU4S_OERuLb8Pur0FpWyGB5nTiXtME", "title": "Keystone 如何防護供應鏈攻擊——官網真機驗證", "body": "當我們收到心心念念的硬件錢包，應該如何辨別真偽，以防供應鏈攻擊？\n\n供應鏈攻擊是硬件錢包安全性的主要威脅之一。從下單到我們收到包裹的這段时间，不可控因素非常之多，供應鏈攻擊就是发生在物流環節中。\n\n在此給到大家兩個建議，所有硬件錢包通用：\n\n1、不要從非官方渠道購入硬件錢包，如..閑..魚..等；\n\n2、收到硬件錢包後，先不要急於拆開，仔細檢查包裝是否有被拆過。\n\n與其他競品一樣，Keystone 的物流包裹上有防拆貼紙，我們拿到錢包的第一步就是檢查防拆貼紙是否有被撕掉過的痕跡。\n\n但是，防篡改包裝只是增加攻擊成本的一种方式，[不足以完全防住](https://www.youtube.com/watch?v=Y1OBIGslgGM&t=434s)供應鏈攻擊，因為防篡改包裝是可以被仿造的。\n\n## 官網真機驗證原理\n\n為了更好的防止供應鏈攻擊，我們在您初始化 Keystone 時，設備會提示用戶進行[官網真機驗證](https://keyst.one/authentication)。如果運輸過程中設備被篡改，將無法通過官網真機驗證。與比特幣签名算法相同， Keystone 的官網真機驗證也采用了非對稱加密算法，可以實現機密信息的交換和驗證。非對稱加密算法需要兩個密鑰：一個私鑰與一個公鑰（兩者是一一對應關系，我們稱之為“密鑰對”）。私鑰可用於簽名和解密公鑰加密的信息，公鑰可用於驗證私鑰的簽名和加密信息。由於公鑰是私鑰通過不可逆算法派生的，僅持有公鑰無法反推私鑰，所以我們通常將公鑰信息公開，供驗證使用。\n\n在生產環節中，我們在每台 Keystone 的安全芯片內都預錄入了一對專門用於官網真機驗證的密鑰對，這對密鑰對和 Keystone 在初始化期間由安全芯片通過[物理熵](https://blog.keyst.one/secure-elements-harnessing-a-force-of-nature-14a959da7b54)生成的真隨機錢包私鑰無關。\n\nKeystone 官網真機驗證頁面的後端是由 HSM（ Hardware Security Module ）服務器操作，HSM 是由 AWS（ Amazon Web Servce ，也就是大名鼎鼎的亞馬遜雲服務。AWS 是雲服務的鼻祖，相比於大家耳熟能詳的阿里雲，亞馬遜雲的誕生，早了足足九年）提供的高度安全加密服務。HSM 服務器中同樣有一對密鑰對，還同時保存了 Keystone 官網真機驗證密鑰對中的公鑰。Keystone 的[安全芯片](https://blog.keyst.one/secure-elements-the-last-line-of-defense-4669012d4edc)保存官網真機驗證密鑰對的同時，也保存了 HSM 服務器密鑰對的公鑰。\n\n用戶進行官網真機驗證時，系統會提示用戶使用 Keystone 掃描官網真機展示的二維碼。這個二維碼的原始信息是一串由 HSM 生成的8位隨機字符，這個字符串先由 Keystone 的官網真機驗證公鑰進行加密，然後由 HSM 的私鑰簽名，最終以二維碼形式展示在網頁上供 Keystone 掃描。當 Keystone 掃描官網真機驗證二維碼獲得加密信息後，會先用 HSM 公鑰驗證簽名，這一步可以確保用戶是通過 Keystone 官網真機進行官網真機驗證的，而不是釣魚網站。\n\n然後 Keystone 再用官網真機驗證的私鑰對 HSM 服務器加密的信息進行解密，得到原始信息（8位字符）。將 Keystone 解析的數據輸入到官網真機進行驗證，HSM 服務器會將我們輸入的信息與原始數據進行比對，數據一致就會提示驗證成功。如果驗證失敗，就意味著用戶手中的 Keystone 已經被篡改過（替換安全芯片或者修改固件文件，甚至整個硬件錢包都是偽造的），建議立即停止使用。\n\n# 官網真機驗證是否容易被攻破？\n\n黑客需要同時攻破我們的 HMS 服務器和 Keystone 設備的安全芯片。Keystone 使用的 HSM 服務器是由 AWS（亞馬遜雲）提供的安全加密服務，是我們評估的所有同類服務供應商中安全性最高。而且，眾所周知，安全芯片被攻擊的難度也非常大，因此黑客很難同時破壞兩者。所以，Keystone 的官網真機驗證可以有效預防供應鏈攻擊。\n\nKeystone 專業版還增加了[拆機自毀機制](https://mirror.xyz/keystonecn.eth/A5blBF-KWF5sGCm5TzCXpmQj_5xy3wUYYXjUeCInWrM)，試圖打開 Keystone 並篡改內部組件時，會觸發自毀機制，安全芯片內的敏感信息將全部自動擦除，設備也將無法繼續使用。", "timestamp": 1653239884, "digest": "SFGEVsIQOPls5SGV2CBr54tj6KNpCs5hoqXE-WlPa5M", "contributor": "0xaFEF3a80B6A205d1F74aaC7887e96A0F6F6051e0"}
{"id": "unvlAgmTvlRocBCcV7DaNgw1grxQvqJDVTrrs6jy04s", "title": "Exclusive | Tesla's response to the letter of apology was deleted: no clear release deadline was required", "body": "Related news: Wenzhou Tesla lost control of the owner’s apology letter has disappeared", "timestamp": 1653240062, "digest": "F6eOHGF9xlBNOsWe0WFg7qtXTFcFwn11oQO51hthfvE", "contributor": "0xA14377962A351067404A8374d7d4a99A7eD9cc4A"}
{"id": "zgyg4fNCEROuqXP07QAAHOtZxZJNGMi3neWcVAJ9cQY", "title": "The rental of small power charging treasure has been returned in time, but it has been charged 99 yuan", "body": "Home > details\n\nHello, brother duck, charge 177399 yuan in time\n\n17347320179 object of complaint: Xiaodian Technology\n\nSmall power technology complaint requirements: return the amount wrongly deducted and generate the correct order\n\nRefund the wrongly deducted amount and generate the correct order. Litigation amount: 99 yuan\n\n99 yuan complaint progress: the complaint has been completed 1 0 microblog\n\nWeChat\n\nQQ\n\nQQ Zone\n\nHello, little brother. How do you evaluate the service attitude:\n\nProcessing speed:\n\nSatisfaction: timely refund\n\nHello, little brother. Duck, confirm it’s finished\n\nShangxiaodian technology reply has hidden content\n\nSmall power technology has been allocated to merchants in the merchant processing of black cat consumer service platform\n\nBlack cat consumer service platform approved\n\nLittle brother Hello duck initiated a complaint. At about 6:30 p.m. on February 14, Alipay was used by live fish in an village, Beiting lane, Nanjing to rent a small battery charger. The charger was returned at about 7:25 p.m. that night. The card slot was inserted correctly, and the indicator light of the charger was on. At about 7:30 a.m. on February 19, I received the message that Alipay deducted 99 yuan.\n\n1. The above contents only represent the complainants themselves and do not represent the complaint position of black cat.\n2. 2. Without authorization, any reprint of cases on this platform is prohibited, and violators will be investigated for legal responsibility.\n3. 3. No fee will be charged for handling complaints of black cat. Those charged in the name of black cat complaints are acts of impersonation and deception. Please call the police in time and give feedback to the official of black cat. Report Mailbox heimaotousu@vip.sina.com 。\n4. 4. Please choose official channels to solve consumption disputes. Don’t trust third-party institutions or individuals to refund fees to avoid being cheated. Please don’t add strangers through QQ or wechat, and don’t remit money to strangers. Beware of being cheated. In case of fraud, please call the police in time.\n5. ", "timestamp": 1653240241, "digest": "txg1dwXBd9kSiqFe5aT3JUqwmvR4iAETJWNFDRUR7AQ", "contributor": "0xeB7bb78f39c083EBa00b77D7665256920B66FF9A"}
{"id": "4xS_nxRe5b9daVqKi9j_htvPIpxRGJp98bz5Z6gxEPI", "title": "《The Survival Ape 幸存猿》调研简报", "body": "`——TSA 调研组：兔子头 制作`\n\n**// 特别强调：**\n\n1. NFT 项⽬均为⾼⻛险项⽬，流动性较差\n2. 此份研报初衷在于项⽬分享，仅以目前（2022.3.11）的信息归纳分析汇总，情况可能不准确，不作为投资建议。\n\n## 项目链接\n\n`Twitter：`\n\n[https://twitter.com/survival_ape ](https://twitter.com/survival_ape )\n\n`Instagram:` \n\n[https://www.instagram.com/survivalape/ ](https://www.instagram.com/survivalape/ )\n\n`Website:` \n\n[https://www.survivalape.art/](https://www.survivalape.art/)\n\n## 项目亮点\n\n* 发行量6666张，数量并不是很多，holder可以瓜分80个ETH\n* 项目本身有给一些大蓝筹项目发白，持有者将会有一定的钻石手\n* 社区比较活跃，有很多抽奖和活动\n* 有和Women of World旗下的Alpha社区，World of Alpha做英文AMA\n* 有一定的商业路线图，团队来自金融科技，Defi以及NFT领域，并且和设计师有紧密联系\n* Holder不少福利，对未来项目方发行的NFT享有折扣，代币质押额外收益，参与决策和利润分成\n* 团队保证每个季度至少发行一个NFT项目，NFT长期赋能\n* 据传设计师是名牌院校的，有一定的艺术背景，真实身份有待考量\n\n![](https://images.mirror-media.xyz/publication-images/OUcajs2jV2wa-cH4TS1rl.png?height=1332&width=1080)\n\n## 总结简版\n\n项目方本身有一定的计划和想法，但能否按照线路图说的完全做到还有待考量，社区可以通过质押和持续发放二期和三期来保证项目活跃度，但最终呈现效果也是至关重要的。比较有意思的是holder等级制度，不同holder等级享受到的折扣和分成也不一样。本身mint价格有点小贵，是否mint可以观察一下市场，本身猴子项目都会有一些小加分\n\n## 项目背景\n\n项目方背景未公布具体细节\n\n## 项目远景\n\n会有代币系统，但具体经济模型还未公布，不确定以后代币的具体用处，并未说明未来代币发行价和回购价格\n\n![](https://images.mirror-media.xyz/publication-images/7V25LE4xtnrwndDVgmZCt.png?height=3519&width=1080)\n\n## 总结\n\n项目方有想法，有路线图，整体风格和运营方法比较像港台同胞。开盘可以观察地板再考虑是否mint\n\n \n ", "timestamp": 1653240671, "digest": "NQO5o26zDNCmLK7k51VHuAf9wz9WV00mz38tmCxR2kM", "contributor": "0xeF96650E66688D5Fedb995432E28cdadDCcCBF71"}
{"id": "BKQhoh_s1Bdrw5oyCIv0nmMAPkZkFIfdmWH4GWykQJs", "title": "Why are these young people keen to celebrate Internet anniversary?", "body": "Today, let’s take a test and answer a question\\~\n\nIf it’s important to say it again: Send a code - “5g surfer” on the background of wechat to get the answer.\n\nOK, officially enter today’s theme. (the full text is 3588 words and takes about 5 − 10 minutes to read.)\n\nWe mean that as long as we have chased and loved each other, we can have an “Internet anniversary” every day, every year, for this young people to have fun and celebrate. If we are not even, we can also find online confidants. (I really hope that KK’s birthday can also catch this carnival on May 11 next year.)\n\n0406, 0505, seventh and ninth anniversaries… Looking back on these anniversaries this year, it is really more and more lively, and the more lively it is, the more prominent the coldness of the Internet. Youdao is in response to that sentence - busy anniversary, barren Internet.\n\nSo, do the beautiful days that I’ve heard of really exist?\n\n“The reason why we are here today is to celebrate the birthday of our best friend, Gu Li…”\n\nThe standard script for Ms. Gu Li’s birthday, oh, the same day is also her father’s memorial day, or the “rotten and smelly day” of the time sisters. From birthday greetings, birthday entries, birthday posters to outdoor screens, the little rich woman of the times is no less than an artist.\n\nMr. Liu mintao’s “red high heels” is the first direct shot actress in the history of internal entertainment. One must be arranged to commemorate the direct shot.\n\nIn the twinkling of an eye, sister Xun’s “a lot of people” expression bag has been for several years. By the way, it is Lu Fei and crayon Xiaoxin’s birthday on the same day. I wish the two Taurus children a happy birthday.\n\nAs for the grand carnival of “Internet anniversary”, at least not the draft.\n\nFrom 2018 to 2021, we watched the domestic entertainment talent show from the first year to hot and then to quietly end.\n\nThe first year, the day when the limited group ninepercent became a group, announced the arrival of a new era, and many people’s dreams began from this day;\n\nIn the second year, unine, a limited group, successfully promoted the era of draft automation because of its random ranking distribution;\n\nIn the third year, there was no debut night and no group. The building of internal entertainment draft was stopped when it was built to the second floor, which indirectly became a “uncompleted residential building”. Since then, it has become Xiufen’s “Qingming Festival”.\n\n“Youth 3” ixform made its debut quietly in an unnamed music. The debut night of the finals that failed to be broadcast was quietly buried together with the draft, which is sad.\n\nThe internal entertainment talent show has changed for only three or four years. Seeing him rise from a tall building, see his banquet guests, and see his building collapse, now, Xiufen people recall their youth by relying on the pictures of memories and on a special anniversary day.\n\nDo you want this blessing?\n\nA “Legend of Zhen Huan” can be said to have kept LETV I prosperous.\n\nMany years later, there are still a large number of audiences “passing the love pass”. The founder of Hua’er film and television, the producer of the legend of Zhen Huan, said: “the legend of Zhen Huan can bring more than 10 million profits to Hua’er film and television (which has been acquired by LETV) every year.”\n\nWell, why not?\n\nWhether it’s the birthday of ANN bird, the memorial day of Zhen Huan’s return to the palace, or the 300 year anniversary of the legend of Zhen Huan, it’s the audience’s real love for the play,\n\nThe audience is willing to look at a carefully carved work with a magnifying glass and see it again and again, which also shows that the audience has enough patience and appreciation ability for the work with real intention.\n\nFrom the examination questions of level 10 of the legend of Zhen Huan to how many episodes you can live in the palace, a variety of extended topics and challenges are still active on the platform today. This play seems to have become the spice of public life. Every day in the real-time square, people will plead with the creators of the legend of Zhen Huan to abide by the law and discipline, so as not to get the work off the shelves and become a public enemy of the whole people.\n\nSource: microblog screenshot\n\nThis year marks the ninth anniversary of the launch of the legend of Lu Zhen. Looking back on the whole story, Lu Zhen, an outstanding female representative of the Northern Qi Dynasty who was brave and firm and earned the position of Prime Minister for herself under the rule of the imperial power by relying on her own wisdom, is still a unique presence in the current TV series market.\n\nIn the past nine years, the actor himself has been in hot demand since his unknown place of origin. After a rough and hard journey, he finally got to Xintiandi and became the “85 flower” in the front line. I don’t know how ah Zhen, who is parallel to time and space, has also experienced unknown hardships. Is he happy with ah Zhan?\n\nOn the anniversary of another variety show “informal talks”, which has been with you for seven years, Chen Mingfa said that seven years is not a short life journey. His eldest daughter is seven years old. He saw some friends offline and told him that they were accompanying them from junior high school / high school to University / graduate school. He felt very honored to accompany you through your youth. These seven years of unhealthy time are also his youth and his UFO.\n\nThis UFO is straight ahead in any direction. It can take him to any place he wants to go, see the scenery, talk about any topic, and never die. He has been looking forward to seeing you again.\n\n“I can’t live without you.”\n\nLove me, scold me, whatever you want\n\n“Of course, I will be very moved. It shows that my acting skills have been recognized. We believe that there are such people around us. We believe that he (the role) has really come to the world. As an actor, there is nothing happier than this.” This is the true feeling of an actor who once worked with KK.\n\nThe time spent with the character is three months, six months or even longer to enter another person’s life and become this person. Experience his life and experience his joys and sorrows. “Sometimes it’s difficult to say goodbye. The hardest thing is to convince yourself that he doesn’t exist. If someone can remember him except me, at least he’s not so lonely.”\n\nThe audience can remember their own plays and characters, and even celebrate their birthdays and anniversaries outside the play. Remembering his life is a great affirmation for the actors.\n\nAt the most beautiful night BiliBili party in 2021, Zhang Wanyi, the actor of Chen Yannian in the awakening age, played a song “misplaced time and space”.\n\nPicture by network picture by network\n\nWhen the sound of leather shoes and chain rings at the same time, roles and players meet across time and space, maybe I", "timestamp": 1653240614, "digest": "RFaxcNKON4OJ8eGGLNGtFmiAL-IzfYeP6LeOFCsUZM4", "contributor": "0x1a79643D49D2C41D0E17B3Ad0DB838a27F85679a"}
{"id": "ID2VDvxQLTLDX4NJONhVShcga_zvVZ9CWUSq4YmAwjI", "title": "Heroines", "body": "So, we are very excited to announce \"The Heroines\" finally.\n\nBack in October, when we first started working on Heroes of the Metaverse,  one of the first decisions we had to make was how we would deal with the percentages of characters that would be males vs. females.\n\n***Who decides what?***\nHistorically, both in the NFT space and in the RPG/D&D world, women have been infra represented, and we did not want to reproduce the same stereotypes.\n\nThe logical decision was to divide the % of male characters vs. female characters by 50/50, closing the issue. Anything else would have been either negative or positive discrimination.\n\nAnd, of course, we didn’t want to dillute the series unnecessarily.\n\n## The five male founders dilemma\n\nAdditionally, the fact that the five founders are male heroes made us feel highly uncomfortable with the fact of creating Female Characters. Cesar Drawss -our Creative Director and artist- was the first one to raise the voice that he should not be the one designing female characters.\n\nBut in that early stage, the only members of Heroes of the Metaverse were the five founders.\n\nSo, all of these facts made us realize we were not comfortable or ready to launch the Heroines simultaneously as the Heroes.\n\n## Doodles: the inspiration\n\nAs everyone in this space wants to make something lasting and beautiful, we like to learn from everyone. And if there's someone we love about the NFT space is the creativity, the rule-breaking attitude, and the possibility of using technology to disrupt the status quo of what is possible and what's not.\n\n![Space Doodles is a subtle and brilliant innovation](https://doodles.app/images/doodle_plane.gif)\n\nAnd when Doodles announced the Space Doodles, what caught our attention was the technology they used. For us, the wrapped NFTs technology is one of the greatest innovations in the NFT space since the Azuki's ERC721A smart contract.\n\nEven if only a tiny percentage of people realize what this could become in the future, we also see this could be a great way to transform your Male Hero into a Female Hero. And, with it, let the market choose the % of female heroes vs. male heroes.\n\n## The Heroines\n\nAfter learning how the wrapped NFTs work, we decided not to use this technology.\n\nSince the change of sex is a variable and an image, we didn't need it as it does not bring any other value to the user. If we had wanted to use the wrapped NFTs, we would have required a second contract and a utility tool to enable the wrapping for the user. That would represent an unnecessary cost for the holder since the gas fee would have been much higher than how we are doing it.\n\nWe will create the Heroines transformation by ***uploading different JSON and image files to IPFS, and only modifying the file names while retrieving the token URI*.** As if it were two sides of one same coin. There is no tech innovation here, but this will ensure as much gas as possible as no extra code is written in the contract.\n\n![Switch from Hero to Heroine whenever you want. Cost = 0ETH + gas.](https://images.mirror-media.xyz/publication-images/XI7iZg3UIJ-wbq2WqCrte.jpg?height=1080&width=1080)\n\n***These are the essential points of the transformation:***\n\n* You will be able to transform your Hero into a Heroine whenever you want and vice-versa.\n* The Heroines will be available some weeks after the first King's election.\n* The cost for converting your Hero will be 0ETH + gas.\n* Female artists have created our Heroes to ensure they lead the way of \"how a heroine should look like.\"\n* There will be a tool so everyone can see what the counterpart version would look like -even if not visible on marketplaces.", "timestamp": 1653240694, "digest": "rwRckqLH7RZ-zCPspfmfa64oUFMrJ0cwjbSvVT0JJrE", "contributor": "0x3cD877CF87DE6Bfc7f23eB4D0B3C20cb5a6FD080"}
{"id": "SP0amJQRswucseBr26SpAQHMxcEctuc50OFjcAN9AyM", "title": "《The Survival Ape 幸存猿》调研简报", "body": "`——TSA 调研组：兔子头 制作`\n\n**// 特别强调：**\n\n1. NFT 项⽬均为⾼⻛险项⽬，流动性较差\n2. 此份研报初衷在于项⽬分享，仅以目前（2022.3.11）的信息归纳分析汇总，情况可能不准确，不作为投资建议。\n\n## 项目链接\n\n`Twitter：`\n\n[https://twitter.com/survival_ape ](https://twitter.com/survival_ape )\n\n`Instagram:` \n\n[https://www.instagram.com/survivalape/ ](https://www.instagram.com/survivalape/ )\n\n`Website:` \n\n[https://www.survivalape.art/](https://www.survivalape.art/)\n\n## 项目亮点\n\n* 发行量6666张，数量并不是很多，holder可以瓜分80个ETH\n* 项目本身有给一些大蓝筹项目发白，持有者将会有一定的钻石手\n* 社区比较活跃，有很多抽奖和活动\n* 有和Women of World旗下的Alpha社区，World of Alpha做英文AMA\n* 有一定的商业路线图，团队来自金融科技，Defi以及NFT领域，并且和设计师有紧密联系\n* Holder不少福利，对未来项目方发行的NFT享有折扣，代币质押额外收益，参与决策和利润分成\n* 团队保证每个季度至少发行一个NFT项目，NFT长期赋能\n* 据传设计师是名牌院校的，有一定的艺术背景，真实身份有待考量\n\n![](https://images.mirror-media.xyz/publication-images/OUcajs2jV2wa-cH4TS1rl.png?height=1332&width=1080)\n\n## 总结简版\n\n项目方本身有一定的计划和想法，但能否按照线路图说的完全做到还有待考量，社区可以通过质押和持续发放二期和三期来保证项目活跃度，但最终呈现效果也是至关重要的。比较有意思的是holder等级制度，不同holder等级享受到的折扣和分成也不一样。本身mint价格有点小贵，是否mint可以观察一下市场，本身猴子项目都会有一些小加分\n\n## 项目背景\n\n项目方背景未公布具体细节\n\n## 项目远景\n\n会有代币系统，但具体经济模型还未公布，不确定以后代币的具体用处，并未说明未来代币发行价和回购价格\n\n![](https://images.mirror-media.xyz/publication-images/7V25LE4xtnrwndDVgmZCt.png?height=3519&width=1080)\n\n## 总结\n\n项目方有想法，有路线图，整体风格和运营方法比较像港台同胞。开盘可以观察地板再考虑是否mint\n\n \n ", "timestamp": 1653240574, "digest": "NQO5o26zDNCmLK7k51VHuAf9wz9WV00mz38tmCxR2kM", "contributor": "0xeF96650E66688D5Fedb995432E28cdadDCcCBF71"}
{"id": "VlOwH3hRwLpzkf-cM4KI3L5w7VW0V9Bs5aG4iZfOM_U", "title": "How we found our Teddy :)", "body": "Last summer Sam FaceTime'd me & was talking to me about NFT’s. I knew what NFT’s were before we had that conversation but just never paid attention to it. He said : bro this space is perfect for you, don’t ask me why just go on twitter & join any NFT twitter space and you’ll find your journey, I am so excited to see where this story goes from here…\n\nI still remember saying : bro it’s 4 in the morning rn on a Saturday night and you’re telling me to go on twitter space rn and follow some monkey’s??? lol\n\nIn my mind I was like this dude’s lit & out of his right frame of mind. Finishing our sentences he said Teddy trust me, I know you and I am telling you this is a one way ticket to the life you have always dreamed but never lived and opportunities like this are very hard to find. I just laughed at it and I was like I’ll think about it and let you know…\n\nThen after a week I was playing soccer with Shadow in my backyard thinking about what Sam said the other day and the way he said it it was full of light. I could literally feel those good vibes. Btw Sam is a well known artist in the space, and now after spending all this time in this space I get it why he was hyper that day. Anyways, then I went on my twitter and switched my profile form private to public. I joined my first twitter space, It was with @NFTPrince & NFTsquirrels. Both are living legends and I respect them a lot. They shared tons of selfless advice to me on first day without even knowing who I was, what my real name is, or how I looked like. The knowledge was so valuable that basically I’ve never been rugged / scammed in this space till date. \n\nAfter spending some time in different spaces and observing how everything is working in this ecosystem, I focused on the fundamentals, the way people interact and react with certain things, what values they carried, and how do they find their feeling of importance. It was’nt very difficult for me to figure these things out because of my knowledge & experience with Social Media for over 5 years. I grew 36 million+ followers on Instagram via different entertainment pages and a network of over 250 million+ followers via networking in less than 6 months with just 2,000$ to start with from my college dorm.\n\nDuring that time Bored Ape’s were just flying and they still are but the vibes were immaculate last year you can’t deny that. I literally did a PHD on them and I was just astounded by their story but I was able to relate a lot of it to my life, it was so inspiring and fascinating. I was thinking so much about it, that even in my dreams I was seeing NFT’s all around me and my life changed the night of September 30 when i had that one lucid dream, I decided to do a project to share my story so that others can relate to it and be a part of it. \n\n( Note : This was’nt the main reason for me to do a NFT project. My main goal was and is still the same today that I want to leave this NFT space better than how I found it. )\n\nBack to the story, why Teddy? Well obviously. My friend’s call me Teddy and Teddies have been a part of everyone’s childhood and I believe people will hold on to that tradition forever. They provide us the comfort & companionship, a friend to talk to, and it’s not just kids who benefit from the positive effects of a comforting Teddy squeeze. Teddies are just universal and timeless.\n\nI put all of my traits and character and imagination’s in the art, from my expressions to the way I dress. Some of the assets are added for the aesthetics of the collection. I am not an artist but since I was the character I worked with few freelance artist’s to bring my idea on paper. They asked me for a sketch to give an idea of what I wanted and this is what I sent them lmao 😂😂😂😂😂😂\n\n![ That Yu-Gi-Oh and LV belt part has my heart lmaoooo😭😭😭. Tbh this image is still a lot better than my first one. Btw I am not rich lol, I don't have a AP watch or fancy items.](https://images.mirror-media.xyz/publication-images/p7SJwXfpBXm-_G9fiTlu0.jpg?height=1280&width=960)\n\n![This looks decent lol. Lot better than what I came up with.](https://images.mirror-media.xyz/publication-images/Vxl5Z9dogU0G7wxHt-euI.png?height=1280&width=720)\n\n![That's me on the Left! Dw I am doxed to all our past holder's and lot of people in NFT space know me irl. My identity is just not public in the space atm. I'll reveal it when time is right.](https://images.mirror-media.xyz/publication-images/CL1JyGEQS_ynX1v0M1WGn.png?height=1280&width=1280)\n\nBack to the story, so once I got this I reached out to few professional artist’s in my network and I worked with multiple of them to find the perfect Teddy. We wanted to stick with 2D because 3D art is great but the market seemed to be doing well with 2D more than 3D collections. Ofcs art style isn’t the main reason for it but it does play a role. But then I am like let’s take the challenge and create something insane. During the time when I started the project, their were’nt any 3D project’s coming out just yet nor there were any noticeable Teddy Bear collections popping as long as I know. So then we decided to turn this into 3D. During this process one 3D artist reached out to me in my DM’s of one our meme page asking to collab, I am like okay cool lets give it a shot and see what you got. \n\n![This is what he came up with as base model. 💀💀💀](https://images.mirror-media.xyz/publication-images/FcshCcWqBzufElk9puKnW.png?height=772&width=778)\n\nYeah he just lost me on that base model. If ur surprised, I did’nt see this coming either, when I saw it for the first time I was out of words just like you are rn. I seriously had no comments on this image. So yeah I had to say no to that dude and look for another artist. The fact that people fake their LinkedIn and show you proof of work of other artist is just hilarious. So I asked one of my friend on telegram if he knew any artist to connect me and he did. \n\n![Idk tbh, it was just not it.](https://images.mirror-media.xyz/publication-images/Z3yiJzSTaGmqQdaHZroTJ.png?height=1280&width=1280)\n\nIt just did’nt feel right going with the full body at this point, gave pfp style a shot and see how it does. Initially the idea was, we will do pfp collection and in a seperate contract and we will give the holders full body version of their Teddy so they have both and can use it the way they like whether to animate or so with the source file…\n\n![I finally said yes to this one and made a deal with the artist and gave her an upfront amount for her time that we both agreed on. ](https://images.mirror-media.xyz/publication-images/ef-d0SnN5nrZH4EpHIfbn.png?height=1280&width=1280)\n\nThe reason why I paid upfront was because she told me she had financial instability and urgently need of money for rent and expenses so she would’nt be able to work full time on this project and it would take lot longer to complete the collection than what I was expecting. Plus I genuinely wanted to help her regardless of if she would work for the project or not due to her situation.\n\n![My mind, Her skills.](https://images.mirror-media.xyz/publication-images/Q7q8YdENYDP5zDlajLh05.png?height=1280&width=1280)\n\nWe decided to fully render and rigg the collection in the end after all the traits and assets are illustrated and confirmed so that their isn't any confusions and nothing is left out. But unfortunately she died in a car accident 3 days before our launch. I found out about it next day of her death from my friend I was completely devasted but I was more sad for her and her family. I communicated with our community and told them that guys we do not have the collection fully rigged and its in between 2D and 3D so we would have to pause the project for now until we find another artist and see how things go from there. \n\nBut then I was also out of funds because I put everything I had in the project initially. So I communicated this with the community in our discord and 34 people ended up minting 100 regardless of the situation. 10 were minted for team and 1 was minted by me personally to participate in the process just like any other member of community. They knew that mint had zero value and won’t have a secondary market value but yet they still supported. All they asked me was to not quit on my dream and to the challenge to make a come back from this situation. The collection won’t ever be revealed for the respect and honor of our artist. We communicated this with our holders as well and they are okay with it. A small portion of funds from royalties of our new collection will go towards her Family. Here’s the OpenSea link to that collection :\n\n[https://opensea.io/collection/toxicteddyclub](https://opensea.io/collection/toxicteddyclub)\n\nThen after I did an outreach again and managed to find a team of 4 professional 3D artist’s. Their past ventures have involved working with brands like Puma, Bangs and Lulu Lemon. Their Identities are anon as they wish to keep it that way but I have confirmed the veracity of their credentials. When I presented this entire idea and vision of the collection to them, after hearing me they instantly said yes and told be that we’re gonna make the best collection of 2022. We started working on it the same day and even with this team, I worked 1 on 1 with the team over screen shares for every single trait’s and asset’s and outcomes are just fantastic. Look It does’nt matter what people think of it but we do believe it is one of the greatest NFT collections that will ever be deployed on Blockchain. We’ve put our blood, sweat and tears in this collection as a team day in and day out. The collection is timeless & it will age well I can make that one promise for sure. \n\n![This collection is dedicated to someone who does'nt need to own it. ](https://images.mirror-media.xyz/publication-images/wKl-h3xgt9G73xjvxW_7_.png?height=1280&width=1280)\n\nThe story will never have an end to be honest and I am just the captain of the boat as of now but at some point I want to hand the dream over to the community in a position that even if I am not present the story live forever as long as their is imagination left in this world. ", "timestamp": 1653240742, "digest": "jXakHBEnxedF5bMQUOTPHsvphMBn1UFjwFtoIfaSDUo", "contributor": "0x8a2ea19fA95e874BE84Fb2B34Fd6099C71aDD8A8"}
