{"id": "XLHA_5bthPJRkOQwNV1bg2oqQLWGoXHbiyzUUKUwSag", "title": "Social Tokens", "body": "We’ve had an explosion of online communities. Social tokens add a monetary layer to these communities, which can help distribute ownership, improve governance, reward active contributors, and much more. I like an analogy that [Eric Ruleman](https://twitter.com/eric_ruleman) came up with in a conversation - being involved in a social token community feels like running a college club that could scale to nation-state.\n\nSocial tokens are crypto tokens issued by individuals or communities that represent ownership in and value provided by creators and communities. Social tokens are typically [ERC-20](https://ethereum.org/en/developers/docs/standards/tokens/erc-20/) tokens issued on Ethereum. They can be used to gain access to permissioned group chats, content, products, and revenue. They can be used to bet on the potential of a creator or a community. They serve as a badge or social proof that you are a “true believer” in the community. Nadia Eghbal [asked](https://twitter.com/nayafia/status/1329156729221812225), how do top creators build equity, not just salary? Social tokens help creators and communities build equity. You can't build a billion dollar newsletter business, but you can build a billion dollar newsletter community.\n\nMany social tokens start as personal or creator tokens, backed by the reputation of the individuals issuing them. They help the creator establish a relationship with their community and capture some of the value of that relationship. But some of these tokens transition to community tokens, where most of the value comes from the creator’s community. They help the creator’s community members establish relationships with each other and leverage the untapped social capital embedded in groups.\n\n**JAMM: crypto natives experimenting with tokenized community tools**\n\nJAMM is a social token for crypto natives trying to find the signal in the noise. [Brian Flynn](https://twitter.com/Flynnjamm) issued JAMM, which initially represented access to his newsletter and a Telegram chat (now Discord). Early buyers of JAMM bought it because of Brian’s reputation, work, and relationships. But he wanted to decentralize the community, reduce the token’s reliance on him, and distribute JAMM to active community members. So he distributed all his tokens to a community treasury, except 1,000 JAMM for him to access the newsletter and group chat. About 4 million JAMM currently sits in a multisig wallet. Six Jamm members must sign to approve any spending out of this wallet.\n\nI help manage the treasury for JAMM and it’s exciting to see how social token communities explore frameworks to manage a community bank. Some important questions are:\n\n- How do we decide how much to spend every year? What should we spend on?\n\n- How do we make sure that the right type of contributors get more JAMM?\n\n- How do we get inflows into the treasury?\n\n- How do we diversify assets in the treasury beyond JAMM?\n\n- How do we provide incentives to increase the liquidity for the token on Uniswap?\n\nEarly on, Jamm members were concerned that Brian wouldn’t be sufficiently incentivized to contribute if he only had 1,000 JAMM. We agreed that he should have 15% of the token supply vested over 2 years. He will be paid 10,000 JAMM a month like other core contributors and 1.26 million JAMM after 2 years. At the end of each month, the community votes on the salary of core contributors, including that of Brian, so they can decide to change the compensation if needed.\n\nJAMM now represents a community for crypto-natives who are experimenting with tokenized community tools to pave the way for new creator economies. Brian is an important contributor, but the goal is for the value of JAMM to increasingly represent (1) the content and products that community members create, (2) the value of the community as a builder and early adopter for various crypto projects, and (3) the value of the community treasury and governance.\n\n**WHALE: backed by NFT assets, brand, community, and industry leadership**\n\nWHALE is the most successful social token in terms of market cap ($20 million), community size (over 1,000 Discord members), and community engagement. WHALE started off as a tangible asset-backed currency, with one dimension of the token value ascribed to its [NFTs](https://en.wikipedia.org/wiki/Non-fungible_token), i.e. Non-Fungible Tokens that represent Whale’s digital art and collectibles. NFTs are unique digital assets whose ownership can be tracked on a blockchain. Besides the NFT vault, [WhaleShark](https://twitter.com/WhaleShark_Pro) talks about four other factors that drive Whale’s value: Whale’s brand, community size and engagement, industry leadership via the community’s NFT expertise, and various mechanisms for ROI. He has maintained excellent OPSEC to still remain anonymous.\n\nMany tools enable creators to establish a direct relationship with their fans. Whale has created a good model for the creator's fans to have a relationship with each other. Whale’s community hints at what a transition from the passion economy to the Discord economy could look like. Some people spend most of their day on Whale’s Discord. They find ways to make friends, have fun, and make income. Members are tipping each other in WHALE using [CCTip](https://cctip.io/index). They are organizing karaoke, selling art, having poker nights, and introducing new projects. I recently joined a [livestream](https://twitter.com/WhaleShark_Pro/status/1327593974807203840) where WhaleShark introduced a cool [3D sneaker vault](https://twitter.com/RTFKTstudios). We'll see more of the creator's fans/followers have a direct relationship with each other and share some of the social and monetary upside.\n\n**KERMAN: bet on the potential of [Kerman Kohli](https://twitter.com/kermankohli)**\n\nKERMAN is a classic personal token experiment. Owning KERMAN gives you access to Kerman Kohli’s future potential. He writes and creates videos on DeFi. He founded [ARCx](https://arcx.game/), which allows you to issue debt using any token as collateral; in other words, “a MakerDAO for everything”. When Kerman launched ARCx, he announced that 1% of ARC’s supply would go to KERMAN holders. \n\nKERMAN served as a way to back a promising crypto entrepreneur and have your tokens redeemable for crypto tokens in a project that Kerman later starts. It's a crypto version of [Presubscribe](https://www.presubscribe.me/), which lets you support your favorite creators before they go independent. Kerman’s Telegram group is basically inactive. His focus is on creating economic value for KERMAN holders rather than ensuring community engagement. Though I can attest that he is quite accessible for 1-1 conversations with KERMAN holders.\n\n**Where are social tokens headed?**\n\nWe will see a social network on top of existing social tokens. Tokens are a new [social graph](https://makoto-inoue.medium.com/tokens-are-the-new-social-graph-5206f7c4185b). [Makoto](https://twitter.com/makoto_inoue) worked on a version of a social token graph. The chart below shows the overlap of social token holdings among different addresses. What if this graph could be used to connect people and communities, make friends, and exchange ideas?\n\n![image](https://images.mirror-media.xyz/publication-images/8335bd35-e485-42fb-89c5-07a1e998f695.jpeg)\n\nWe will start seeing successful social tokens being accepted as collateral for loans. For example, within the NFT community, I could see WHALE being accepted as collateral to borrow DAI or another stablecoin.\n\nWe will see the creation of guilds or associations that are formed by combining several social token communities. Third-party groups who want to market or sell to the guild will provide discounts and benefits in exchange for acquiring customers.\n\nWe will see more ways to distribute tokens to your followers or subscribers. RAC retroactively [distributed](https://blog.ourzora.com/home/introducing-rac) tokens to fans who supported him on Patreon, Twitch and Bandcamp, as well as those who bought RAC merchandise in the past. Maybe you could [distribute](https://twitter.com/HelloShreyas/status/1306674881782710273) tokens to all your existing Twitter followers and distribute additional tokens pro-rata based on followers who have engaged with you (liked/commented/retweeted). [Unite](https://unite.community/home) is an interesting product for distributing tokens to reward social media engagement.\n\nThere are lots of ways the social token space could evolve. Reach out to me on [Twitter](https://twitter.com/HelloShreyas) if you have any thoughts, feedback, or questions.\n\n...\n\nThanks to [Louis Albert](https://twitter.com/albiverse), [Arjun Balaji](https://twitter.com/arjunblj), [Alex Conway](https://twitter.com/alxcnwy), [Eric Ruleman](https://twitter.com/eric_ruleman), and [Daniel Schlabach](https://twitter.com/DMSchlabach) for reading drafts of this.\n\n...\n\nResponses to this essay:\n\n[Billion Dollar Newsletters, part 1\n](https://betweenthecracks.substack.com/p/12-billion-dollar-newsletters-part)\n\n[Billion Dollar Newsletters, part 2\n](https://betweenthecracks.substack.com/p/13-billion-dollar-newsletter-communities)", "timestamp": 1610346346, "digest": "GBTFkEc-th8l_XJR5GEvQCl_EwN1wZsfLscGwEcaMGU", "contributor": "0x10D6d2e343281D388291A3e02f3293AaEdA67178"}
{"id": "SUyRDsFk6UZ4uTw-9EP67kwTuHEm9hdWU2Ko2s1mP3g", "title": "Crypto Community Treasuries", "body": "Crypto treasuries are typically thought to be transparent. But if a community member needs to spend several hours digging through [Etherscan](https://etherscan.io/), [Snapshot](https://snapshot.page/#/), and [Discourse](https://www.discourse.org/) to get a summary of the treasury’s activities over the past month, is the transparency useful?\n\nA crypto community treasury consists of crypto assets in a wallet owned and operated by the community. It is like a community savings account with assets in crypto (not fiat), typically held in a multisig wallet (not a bank account), managed by the community (not a CFO/CEO), and public (not private).\n\n**Accounting**\n\nWe’re in the early days of documentation for crypto treasuries. It is time-consuming for treasurers or operations members of crypto projects to categorize income and expenses, so many do not do it effectively. There could be several proposals every day or week, which are difficult to track. For the community, there is limited real-time, human-readable transparency of the treasury. Members might feel less informed to make and vote on proposals.\n\nThere are several open problems to solve with crypto treasuries:\n\n- How can a treasurer easily categorize transactions and produce a summary statement?\n- How can community members quickly find details for a specific payment made five months back?\n- How can they see a summary of the treasury’s activities for a particular historical month?\n- How can they filter all the bounties made since the treasury’s inception?\n- How can they see the average salary paid to community managers across all crypto projects?\n- For VC funded projects like Uniswap, how do we [integrate](https://twitter.com/lsukernik/status/1321168174004330497) off-chain expenses made in VC-funded dollars with on-chain income?\n- How do we produce real-time income statements, cash flow statements, and balance sheets that can be accessed by community members, contributors, investors, and outsiders? \n- How can we standardize these statements across crypto projects, similar to the standardization of statements in 10k reports of public companies?\n- How can we rate the financial health of a treasury?\n- For DAOs or other projects that are registered as legal entities, how do we produce statements that can easily be used by accountants and tax people?\n\nThere is a need for a full stack solution that helps communities manage their treasuries ([Stripe Treasury](https://stripe.com/treasury) for crypto) and helps them disclose relevant information (SEC [Edgar](https://www.sec.gov/edgar/search-and-access) but [on-chain](https://twitter.com/lsukernik/status/1335652170792914945)). I’m working on solving some of these problems at [Llama](https://llama.community/#/), a dashboard for crypto communities to manage their treasury. These communities include DeFi protocols, DAOs, and social token communities.\n\nYFI is one of the first protocols that released its self reported [financial statements](https://twitter.com/iearnfinance/status/1336686533701582849) in December 2020. This was a great initiative by YFI community members, but it is difficult to reconcile these statements. It is important for any community to generate such financial statements easily and for outsiders to be able to audit them. Additionally, if communities want to keep certain treasury details private, they should have the option to do that.\n\n**Governance**\n\nAs Fred Ehrsam argued - while governance minimization is important, treasury management is an area where governance will likely be required for the foreseeable future. It is difficult to entirely automate the process of deciding how to allocate funds.\n\nMonetary policy of crypto protocols is discussed a lot, but fiscal policy isn’t. This will change in the next few years. These are some important questions relating to fiscal policy of decentralized communities:\n\n- How should a budget get approved? \n- Who should authorize payments for a treasury?\n- How should grants and bounties be structured?\n- How much should core contributors get paid? What type of vesting schedule is appropriate?\n- How much should be spent on liquidity mining efforts? (This is a monetary and fiscal policy question.)\n- How should the treasury be structured? Is the goal of the treasury to exist in perpetuity, like a university endowment, or to be dissolved after a certain number of years, like the [Gates Foundation](https://www.gatesfoundation.org/Who-We-Are/General-Information/Financials/Foundation-Trust)?\n- How should liquidity of the treasury be managed? What percentage of assets should be in the native protocol token, in ETH/BTC, and in stablecoins like DAI and USDC?\n\nIt is too much to expect the average token holder to vote on small transactions spent by the treasury. Uniswap's grants program [proposal](https://gov.uniswap.org/t/rfc-uniswap-grants-program-v0-1/9081) is an example of a thoughtful approach to a protocol's fiscal policy. A committee of six members will be responsible for allocating up to $750,000 every quarter towards Uniswap's ecosystem development efforts. Every committee has a term of two quarters. Budgets and caps will be re-assessed every six months.\n\nSynthetix recently created the [Spartan Council](https://blog.synthetix.io/spartan-council-proposal/), which is a group of members elected by SNX token holders responsible for approving changes to the Synthetix protocol. Elections take place every three months. Such a council could potentially be used to make day-to-day treasury decisions, while the community approves larger budgets.\n\nIn certain cases, a governance proposal in crypto can function as an invoice. Take for example the [proposal](https://snapshot.page/#/jamm/proposal/QmdEH5prtD5nRzLT8PLLXtx1wLGwsqBw8KEu2zcS95VBvh) to pay Michael Arnold for developing the [website](https://www.jammpad.com/) for JAMM's social token. It contains the necessary details for an invoice: proposer name and contact info, seller name and contact info, date of invoice, description of services, seller payment details, and terms for payment.\n\nWhy does documentation like this matter? Besides helping the treasurer and other community members, documentation can be useful in the future for auditing and rating.\n\n**Auditing & Rating**\n\nWhile accounting involves recording transactions and producing financial statements, auditing involves verifying and evaluating those statements. An external auditor must be able to easily go through each transaction initiated by the community treasury and verify if it is legitimate.\n\nEach transaction should have a corresponding governance proposal, transaction hash, budget category, and other notes. An auditor should be able to track a transaction from a year ago and check if any fraud has been committed. Just like smart contracts need to be audited, treasuries need to be audited. We will eventually have some type of rating system to evaluate the financial health of different crypto treasuries. To do that, we need to organize the raw data in a useful way.\n\n![image](https://images.mirror-media.xyz/publication-images/0bbe82c4-ad25-427d-956f-f2cd9f6f778a.jpeg)\n\n**Conclusion**\n\nCrypto treasuries offer the promise of transparency and community empowerment. But to realize this promise, we need to build tools and frameworks to organize treasury data, produce real-time financial statements, audit those statements, and rate the treasury’s financial health.", "timestamp": 1610358331, "digest": "ztqMIwxBolqqID8y_70Bte3F6uRfEMJoIDEShZYNwJE", "contributor": "0x10D6d2e343281D388291A3e02f3293AaEdA67178"}
{"id": "f0cQYmLcDuhWTPE1GXS6vaxiRu9ktg1IOeJ2_K7Re6k", "title": "Crypto Community Treasuries", "body": "Crypto treasuries are typically thought to be transparent. But if a community member needs to spend several hours digging through [Etherscan](https://etherscan.io/), [Snapshot](https://snapshot.page/#/), and [Discourse](https://www.discourse.org/) to get a summary of the treasury’s activities over the past month, is the transparency useful?\n\nA crypto community treasury consists of crypto assets in a wallet owned and operated by the community. It is like a community savings account with assets in crypto (not fiat), typically held in a multisig wallet (not a bank account), managed by the community (not a CFO/CEO), and public (not private).\n\n**Accounting**\n\nWe’re in the early days of documentation for crypto treasuries. It is time-consuming for treasurers or operations members of crypto projects to categorize income and expenses, so many do not do it effectively. There could be several proposals every day or week, which are difficult to track. For the community, there is limited real-time, human-readable transparency of the treasury. Members might feel less informed to make and vote on proposals.\n\nThere are several open problems to solve with crypto treasuries:\n\n- How can a treasurer easily categorize transactions and produce a summary statement?\n- How can community members quickly find details for a specific payment made five months back?\n- How can they see a summary of the treasury’s activities for a particular historical month?\n- How can they filter all the bounties made since the treasury’s inception?\n- How can they see the average salary paid to community managers across all crypto projects?\n- For VC funded projects like Uniswap, how do we [integrate](https://twitter.com/lsukernik/status/1321168174004330497) off-chain expenses made in VC-funded dollars with on-chain income?\n- How do we produce real-time income statements, cash flow statements, and balance sheets that can be accessed by community members, contributors, investors, and outsiders? \n- How can we standardize these statements across crypto projects, similar to the standardization of statements in 10k reports of public companies?\n- How can we rate the financial health of a treasury?\n- For DAOs or other projects that are registered as legal entities, how do we produce statements that can easily be used by accountants and tax people?\n\nThere is a need for a full stack solution that helps communities manage their treasuries ([Stripe Treasury](https://stripe.com/treasury) for crypto) and helps them disclose relevant information (SEC [Edgar](https://www.sec.gov/edgar/search-and-access) but [on-chain](https://twitter.com/lsukernik/status/1335652170792914945)). I’m working on solving some of these problems at [Llama](https://llama.community/#/), a dashboard for crypto communities to manage their treasury. These communities include DeFi protocols, DAOs, and social token communities.\n\nYFI is one of the first protocols that released its self reported [financial statements](https://twitter.com/iearnfinance/status/1336686533701582849) in December 2020. This was a great initiative by YFI community members, but it is difficult to reconcile these statements. It is important for any community to generate such financial statements easily and for outsiders to be able to audit them. Additionally, if communities want to keep certain treasury details private, they should have the option to do that.\n\n**Governance**\n\nAs Fred Ehrsam argued - while governance minimization is important, treasury management is an area where governance will likely be required for the foreseeable future. It is difficult to entirely automate the process of deciding how to allocate funds.\n\nMonetary policy of crypto protocols is discussed a lot, but fiscal policy isn’t. This will change in the next few years. These are some important questions relating to fiscal policy of decentralized communities:\n\n- How should a budget get approved? \n- Who should authorize payments for a treasury?\n- How should grants and bounties be structured?\n- How much should core contributors get paid? What type of vesting schedule is appropriate?\n- How much should be spent on liquidity mining efforts? (This is a monetary and fiscal policy question.)\n- How should the treasury be structured? Is the goal of the treasury to exist in perpetuity, like a university endowment, or to be dissolved after a certain number of years, like the [Gates Foundation](https://www.gatesfoundation.org/Who-We-Are/General-Information/Financials/Foundation-Trust)?\n- How should liquidity of the treasury be managed? What percentage of assets should be in the native protocol token, in ETH/BTC, and in stablecoins like DAI and USDC?\n\nIt is too much to expect the average token holder to vote on small transactions spent by the treasury. Uniswap's grants program [proposal](https://gov.uniswap.org/t/rfc-uniswap-grants-program-v0-1/9081) is an example of a thoughtful approach to a protocol's fiscal policy. A committee of six members will be responsible for allocating up to $750,000 every quarter towards Uniswap's ecosystem development efforts. Every committee has a term of two quarters. Budgets and caps will be re-assessed every six months.\n\nSynthetix recently created the [Spartan Council](https://blog.synthetix.io/spartan-council-proposal/), which is a group of members elected by SNX token holders responsible for approving changes to the Synthetix protocol. Elections take place every three months. Such a council could potentially be used to make day-to-day treasury decisions, while the community approves larger budgets.\n\nIn certain cases, a governance proposal in crypto can function as an invoice. Take for example the [proposal](https://snapshot.page/#/jamm/proposal/QmdEH5prtD5nRzLT8PLLXtx1wLGwsqBw8KEu2zcS95VBvh) to pay Michael Arnold for developing the [website](https://www.jammpad.com/) for JAMM's social token. It contains the necessary details for an invoice: proposer name and contact info, seller name and contact info, date of invoice, description of services, seller payment details, and terms for payment.\n\nWhy does documentation like this matter? Besides helping the treasurer and other community members, documentation can be useful in the future for auditing and rating.\n\n**Auditing & Rating**\n\nWhile accounting involves recording transactions and producing financial statements, auditing involves verifying and evaluating those statements. An external auditor must be able to easily go through each transaction initiated by the community treasury and verify if it is legitimate.\n\nEach transaction should have a corresponding governance proposal, transaction hash, budget category, and other notes. An auditor should be able to track a transaction from a year ago and check if any fraud has been committed. Just like smart contracts need to be audited, treasuries need to be audited. We will eventually have some type of rating system to evaluate the financial health of different crypto treasuries. To do that, we need to organize the raw data in a useful way.\n\n![Transaction history on [Llama](https://llama.community/#/jamm/)](https://images.mirror-media.xyz/publication-images/0bbe82c4-ad25-427d-956f-f2cd9f6f778a.jpeg)\n\n**Conclusion**\n\nCrypto treasuries offer the promise of transparency and community empowerment. But to realize this promise, we need to build tools and frameworks to organize treasury data, produce real-time financial statements, audit those statements, and rate the treasury’s financial health.", "timestamp": 1610358507, "digest": "ztqMIwxBolqqID8y_70Bte3F6uRfEMJoIDEShZYNwJE", "contributor": "0x10D6d2e343281D388291A3e02f3293AaEdA67178"}
{"id": "WkLObxeJoWzoEM1sube-yCQKYoTGdtRuH-uWJkLUT1w", "title": "Pseudonymous Identity", "body": "\"If we are going to pursue biological longevity, we should allow a diversity of lives to be lived.\" - [GPT3](https://minutes.substack.com/p/longevity-and-resets).\n\nI am many people. I’m funny with some, quiet with some, bold with some, nerdy with some, restless with some. We play a different role in different environments. That’s why new places and new friends are valuable. A part of yourself is completely unexplored till you meet a particular person or go to a particular place. What about online? [Pseudonymous](https://en.wikipedia.org/wiki/Pseudonym) identities let you traverse the internet (and soon the [metaverse](https://en.wikipedia.org/wiki/Metaverse)) and create or find parts of yourself that cannot be discovered with a single identity.\n\nIn a terrific [talk](https://www.youtube.com/watch?v=Dur918GqDIw) on the pseudonymous economy, Balaji Srinivasan says that pseudonymity is as important as decentralization. Decentralization meant that you couldn’t shut down the Bitcoin network; pseudonymity meant that you couldn’t go after the person(s) who built the network. Pseudonymity is a continuum. With [33](https://www.wsj.com/articles/BL-DGB-16975) independent bits of information on someone, you can de-anonymize them. An identity with 5 independent bits is more pseudonymous than one with 15 independent bits, which is more pseudonymous than one with 30 independent bits.\n\n\nThere is a practical reason for pseudonymity: you don’t want your employer to fire you because of a spicy tweet. But I find the other reason more attractive: exploring yourself. [Derek Parfit](https://en.wikipedia.org/wiki/Reasons_and_Persons#Personal_identity), [David Hume](https://en.wikipedia.org/wiki/Bundle_theory), and [Buddha](https://en.wikipedia.org/wiki/Skandha) have argued that your identity doesn’t persist. There is no “you” that is the same person from birth to death. You have a long life. You should play around with many you’s.\n\nPseudonymity can help with something grand: aspiration. [Agnes Callard](https://www.econtalk.org/agnes-callard-on-aspiration/) describes aspiration as the process of acquiring values. Most things you value now - hobbies, children, career, political views - weren't valued by you at some point. Aspiration involves valuing something new; e.g. valuing fashion when you didn’t before. This is different from ambition, which is satisfying a value you already have; e.g. starting a company to make money (you already value money). Valuing something new is difficult because it involves identity change. Our real world identities are tied to the people and places we are surrounded by. But pseudonymous identities can help us evolve into people we want to be. If you want to be someone who values boldness, create a pseudonymous Twitter account and tweet a bunch of bold takes and... become a person who is bold.\n\nWhy do many creators, authors, and musicians use pseudonyms? It helped Satoshi Nakamoto (fully pseudonymous) escape persecution. It helped Snoop Dogg (partly pseudonymous) sound cooler. An overlooked reason is that it helps many adopt a new identity. Lady Gaga and Stefani Germanotta are not the same person. Lady Gaga is creative, uninhibited, and outrageous; I don’t know much about Stefani Germanotta. Kobe Bryant [gave](https://www.newyorker.com/magazine/2014/03/31/the-fourth-quarter) himself the nickname Black Mamba to separate his identity on and off the court. On the court, he was a deadly assassin. Off the court, we don’t know.\n\nThere is popular appeal to identities like Jekyll and Hyde or [Walter White](https://en.wikipedia.org/wiki/Walter_White_(Breaking_Bad)) and Heisenberg. We’re shocked that Walter, this boring and loving father, could run a multi-million dollar drug empire and ruthlessly murder people. In reality, many drug lords are actually loving fathers and husbands.\n\nYour habits change when your identity changes. James Clear writes that if you want to quit smoking, you shouldn’t say, “I’m trying to quit smoking” when someone offers you a cigarette. You should say, “I’m not a smoker.” Pseudonymous identities should be liberating - like moving to another continent. What constrains us most times is our identity. If your identity doesn’t persist, you can be whoever you want.\n\nWe have a bias to assume continuance of identity. If you ask a founder of a B2B logistics company about how they started the company, they’ll search for and cite all the inane examples in their life that have anything to do with B2B or logistics. There is some truth in continuance of identity. Einstein was probably doing thought experiments when he was five that have some relationship with the thought experiments he was doing when he was twenty six. But there are also big periods of change - change in values, identity, and aspiration - that aren’t captured by connecting all the dots. Some dots are truly disconnected. Einstein at twenty six (his [miracle year](https://en.wikipedia.org/wiki/Annus_Mirabilis_papers)) was a very different person from Einstein at five.\n\nSteve Jobs said that we should connect the [dots backwards](https://www.youtube.com/watch?v=UF8uR6Z6KLc&t=4m58s). I like this advice. But sometimes this advice is taken the wrong way. Some dots cannot be connected. When you want to change what you value, you will be disappointed if you search for things in the past that show evidence of this value. If you want to start valuing beauty and aesthetics, you won’t find evidence in the past of beauty and aesthetics because you didn’t value it then. You just have to start valuing beauty and aesthetics. In the real world, this might be hard because your existing identity of “not caring about beautiful things” gets in the way. In the virtual world, you can create a pseudonymous Instagram account and post pictures everyday of beautiful things and… ta-da you become a person who values beauty!\n\nPseudonymous identity is the first step. The next step is building reputation with that identity, porting that reputation across different identities, and making a livelihood with that identity. Then, can we use these pseudonymous identities to creatively [repurpose](https://nadiaeghbal.com/notes/) our physical bodies? If we have alts in our online world, can we have alts in the physical world? If we have a community or country of pseudonymous identities, how do we provide recourse if a pseudonym harms someone else? How do we provide pseudonymous justice?\n", "timestamp": 1610359244, "digest": "HzILo78wQKwHQZ-DNP5JCAuJery2lYnMfPQWQmpKHQ8", "contributor": "0x10D6d2e343281D388291A3e02f3293AaEdA67178"}
