{"id": "B4_25axIfOV6kesQtZ6hFRHT-F4H0k5uRMGuhGqhGj0", "title": "Test Edition Airdrop", "body": "Testing\n\n[edition-airdrop://0xdC3FedB303c128ce82b28CE42841466B99c9Fc64?editionId=137](edition-airdrop://0xdC3FedB303c128ce82b28CE42841466B99c9Fc64?editionId=137)\n\nHello world", "timestamp": 1630541619, "digest": "0tXdgbhoHwKRw4PoiaBrcMYumOwNsC8VZ_n3bCORvBI", "contributor": "0x5FE6C3F8d12D5Ad1480F6DC01D8c7864Aa58C523"}
{"id": "_VK-rCTm9js5GDYDRANG7SvLUb185xDeEqhl4-cM3yU", "title": "Test Edition Airdrop", "body": "Use the code below to create the airdrop embed:\n\n```\nedition-airdrop://0xdC3FedB303c128ce82b28CE42841466B99c9Fc64?editionId=137\n```\n\n[edition-airdrop://0xdC3FedB303c128ce82b28CE42841466B99c9Fc64?editionId=137](edition-airdrop://0xdC3FedB303c128ce82b28CE42841466B99c9Fc64?editionId=137)\n\n", "timestamp": 1630541822, "digest": "0tXdgbhoHwKRw4PoiaBrcMYumOwNsC8VZ_n3bCORvBI", "contributor": "0x5FE6C3F8d12D5Ad1480F6DC01D8c7864Aa58C523"}
{"id": "oEbvVdRrraeLfjVldOHDyR9SNpwRtRMsPeF6nr3pVOE", "title": "Test NFT Airdrop", "body": "[edition-airdrop://0xdC3FedB303c128ce82b28CE42841466B99c9Fc64?editionId=137](edition-airdrop://0xdC3FedB303c128ce82b28CE42841466B99c9Fc64?editionId=137)\n\n", "timestamp": 1630548370, "digest": "qrtZOH0-2W50F-z7tyFrZpyUqefr1S9Jxfpl-DJCWrs", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "3LIgZwgrKGme4CVEit18CyuOMdRxxc6bYTV6JVuDGcA", "title": "Scarcity Networks: Social Networks on Web3", "body": "The power of web3 is what originally got me into crypto. I analyzed the web2 platforms as an equity research analyst at Barclays, and immediately recognized the potential of web3 to fix much of what I thought was broken in web2 social networks. \n\nEarly conversations about blockchain-based social networks were mostly focused on what could be accomplished by leveraging a different data structure, centering the conversation on “data ownership,” privacy, and digital identity. The switching argument was values-based and not compelling enough for most to deal with any degree of friction on decentralized networks.\n\nNow, as social networks begin to blend with DeFi, the switching argument is about economic incentives, rather than moral imperatives, and the novel functionality they offer: publicly trade and display cultural symbols; invest with and in your friends; earn your way into exclusive social circles; connect directly with your favorite creators; prove ownership of digital assets. Eventually, activity on these networks will create an open social graph that is used to offer better DeFi rates and/or lower collateralization ratios. These new social networks combine social and financial capital, making them approachable to the mainstream in a way that DeFi wasn’t. Everyone understands social capital. \n\n![ https://twitter.com/StaniKulechov/status/1427681957291376643](https://images.mirror-media.xyz/publication-images/2216d27b-e790-4ff8-8183-0a5591d18205.jpg?height=472&width=890)\n\nArguing about whether DeFi is more important than NFTs or whether NFTs, DAOs, or Social Tokens will reign as the dominant social networks of web3 misses the point. Their interconnectedness is what makes web3 so powerful. NFTs create an impetus for people to quickly spin up DAOs, which then serve as NFT market makers. NFTs will act as keys to DAOs, governed according to social token ownership. The metaverse is comprised of the combination of these things, which, in turn, only increase the importance of being able to prove digital ownership. DeFi makes these networks possible and all the activity on these networks will be used to amplify DeFi. Save the tribalism for Punks vs. Apes. \n\n![https://twitter.com/ianIDEO/status/1429156970645233670](https://images.mirror-media.xyz/publication-images/0b513658-579e-43d1-b0d3-68eaf606b76b.png?height=390&width=890)\n\n### Web3 is Not a Protest, it’s Closer to a Cultural Movement\n\nTo understand what’s happening with web3, we need to quickly revisit the shortcomings of web2 social networks. In short, web2 platforms own your online identity and social graph and hold all the power, the business model is extractive to the user and the incentives create a terrible user experience (low signal engagement, disinformation, high ad load, etc.) Web2 social networks suffered as they scaled, weakly connecting people within an increasingly less exclusive network. Web2 lost any sense of belonging. \n\nSocial networks combined with elements of DeFi flip many of the web2 incentives but they’ll still be subject to the worst of human nature (after all social networks are built on human interactions.) They’ll still revolve around status and image, but should be much higher signal as web3 is built around ownership rather than indication. Web3 still requires you to be part of a club/clique to participate, but it clearly specifies the process and cost of joining. Web3’s immutable ledger creates accountability where web2 has none, and on-chain interaction encourages less noise and higher quality engagement. It’s still signaling, but it’s more costly and, therefore, more credible.\n\nWe originally thought web3 would be built on trust, but turns out it’s actually built on scarcity. The downside is that scarcity networks create FOMO by design, are exclusive by definition, and encourage impulsive behavior as being late carries the risk of being shut out entirely. The benefit is that scarcity will also allow web3 social networks to more effectively scale. The ability to easily spin up DAOs in web3 means that the number of communities can scale rather than the size of the network. Since these communities reward early adopters, gradually converting social capital into financial capital, they offer compounding benefits as they grow.³ An open social graph describing all of this activity would be more powerful than anything that could be built on web2.\n\n![https://twitter.com/TrustlessState/status/142989905163517958](https://images.mirror-media.xyz/publication-images/cdbc74df-c2c0-4b82-818f-b26e57e1f684.jpg?height=205&width=908)\n\nWeb3 social networks should also be better at continuously reinventing themselves,² since they determine their own outcomes, in contrast to web2 platforms which lost relevance with many of their users years ago. Web3 participants are (literally) invested in the communities they join, which should help maintain quality over time. The best creators and contributors will migrate to web3, rather than stay on on rent-seeking web2 platforms. Web2 platforms and corporate brands will continue to try, but they cannot reverse engineer these dynamics. This revolution has to occur at the protocol layer. \n\n![https://twitter.com/ianIDEO/status/1403753637633875968](https://images.mirror-media.xyz/publication-images/9adda92f-2df8-469f-92de-db8507482034.png?height=464&width=877)\n\nWe originally thought web3 would be a protest against web2 monopolies but it looks more like a cultural movement. While culture may be the hook that draws new people into the ecosystem, most of the activity currently occurring on these networks is only partially about culture, at best. \n\n> ***If the mantra of web2 was “come for the tool, stay for the network”, the mantra of web3 is probably closer to “come for the culture, stay for the returns.” And the returns are why most people are involved right now.*** \n\n![](https://images.mirror-media.xyz/publication-images/8dcef255-12b3-4a05-b0e3-345ddf4d2082.jpg?height=475&width=1165)\n\n\n---\n\nEach social component of web3 represents a slightly different value system, but they’re all built on the same principle: scarcity. \n\n## NFTs: The Content Layer - Not Just a Status Symbol \n\n*Web2 analog: NFTs combine elements of Instagram (influence and image) and LinkedIn (status and prestige.) Depending who you ask, owning a Punk is either like owning a Ferrari or [having gone to Harvard](https://twitter.com/Iiterature/status/1423657661162311686).*\n\n![https://twitter.com/HarryBTC/status/1416435920061018119](https://images.mirror-media.xyz/publication-images/dad8812a-f4b3-42b9-a757-718b56262ec8.jpg?height=1080&width=1920)\n\nMost people attribute the recent NFT mania to two things 1.) NFTs as a store of value 2.) NFTs as a status symbol. I think it’s true that the market is at least partially driven by people looking for non-$ denominated stores of value in an inflationary environment. Afterall, [Visa bought a cryptopunk before they bought bitcoin](https://www.cnbc.com/2021/08/23/visa-buys-cryptopunk-nft-for-150000.html). But NFTs are also about status (sorry if you thought this was about art). Wealthy people have always used expensive items to signal status, whether it be fine art, yachts, private jets, or handbags.¹ NFTs just make ownership of those items verifiable and public. \n\n> ***It’s not really socially acceptable to have a profile picture (PFP) of your Lambo, but you’re encouraged to display your Punk. MTV Cribs existed to solve this exact problem— how do I flex my otherwise hidden wealth? NFTs.*** \n\nPublic display of these status symbols actually drives more demand for them, playing to our natural [mimetic desires](https://en.m.wikipedia.org/wiki/Mimetic_theory). A public ledger also creates bragging rights in that we now have proof that someone got in early, spotted that trend before everyone else, is a die hard fan. Immutable proof that you’re cool. How much would you pay for that? \n\nBut there is something more going on with NFTs. It’s not just about status anymore than they’re just a store of value. People held Punks long before they were a flex, and if you ask anyone trading NFTs, they’ll tell you that selling them is the worst part. Maybe that’s because when you sell your NFT, you also lose your tribe. An NFT bonds you with your fellow Apes and communicates to everyone that you belong to a certain group. The public ledger also ties you to a lineage of everyone who has ever owned that NFT. This not only adds [a whole new dimension of value to digital art](https://twitter.com/santiagoroel/status/1431731996607275010), it elevates you into a new social standing and even ensures your legacy in a way (you’re now an unforgettable part of history.)  \n\n![https://twitter.com/0xSisyphus/status/1429193578664837121](https://images.mirror-media.xyz/publication-images/4071ec44-3db3-45f8-bdbd-01a569cf858d.jpg?height=465&width=923)\n\n### No Real-time Feedback Loop \n\nA huge tenet of web2 platforms is that they support real-time feedback loops (Reddit, Discord, Twitter, Tik Tok, etc.) NFTs do not right now. NFT markets are illiquid and price discovery is still inefficient. In other words, NFTs aren’t good at conveying real-time information yet, meaning status is mostly inferred. We know it’s worth something, but we don’t really know what. \n\nThis won’t last for long. Almost every CeFi exchange is building an NFT marketplace and there are many startups working on the “financialization of NFTs.” However, these inefficiencies are part of what enables outsized financial returns. While DeFi maximalists love to hate NFTs, the NFT market feels pretty degen. \n\n## Social Tokens: The Social Graph - Exclusivity \n\n*Web2 analog: Social Tokens are similar to TikTok, in that they allow anyone to go viral. They also represent the web2 shift away from crowded networks to private messaging groups, discord servers, etc.*\n\n*NFTs have utility beyond collection. One of the things they can be used for is as keys that unlock access to creators and communities.*\n\n![Ihttps://future.a16z.com/creator-before-community/](https://images.mirror-media.xyz/publication-images/e8d95ead-e8cd-492c-a139-7e74762f7066.jpg?height=464&width=885)\n\nSocial tokens are digital assets backed by the reputation of a brand, individual or community.3 They can be fungible or non-fungible. Supply can be fixed or determined by a bonding curve (so that price increases along with distribution of the token.) They fall into two categories: personal tokens (fan clubs) and community tokens (social circles.) Both give holders exclusive access to a person or community. Personal tokens can be launched more quickly versus community tokens, which require coordinating a group towards a shared vision. However, community tokens may benefit from broader distribution, which has proven important in web2. As of Dec 2020, the total marketcap of all social tokens was $81M, now the marketcap of $FWB (one of the most prominent community tokens) alone is $180M.\n\nAll of these tokens rely on the belief that a creator or community will become more valuable tomorrow than it is today. Some represent Income Sharing Agreements (ISA), but others grant access to a newsletter, a private chat, or even a voting system that lets people[ dictate a creator’s daily habits](https://www.coindesk.com/man-who-sells-himself-now-wants-buyers-to-control-his-life) ($ALEX). The artist[ Connie Digital](https://twitter.com/conniedigital?lang=en) rewarded $HUE holders with a shout-out on a virtual billboard. The rapper Lil Yachty issued surprise boxes and virtual parties exclusively to $YACHTY holders. $WHALE issued a social token, backed by top NFTs, that holders can use as a payment method on OpenSea.7 Grammy-award winning musician RAC and NBA point guard Spencer Dinwiddie have also introduced tokens to give fans a stake in their success.⁶ Community tokens often grant access to an exclusive newsletter, discord server, and token-gated IRL events. \n\n### A Different Type of Walled Garden? \n\nScarcity is a double edged sword for social tokens as it means as membership grows, entry becomes inaccessible to most ($FWB membership is now priced at +$14,000). These communities will need to experiment with tiered models, in which entry level membership is lower cost and higher levels of membership can be earned through more active participation. Most token communities are introducing the concept of seasons and performance-based systems to avoid free-rider problems anyway. \n\n> ***While scarcity improves scalability, if it comes at the expense of accessibility, we’ll just end up with a different type of walled garden.*** \n\nOne way to reduce this tendency could be to build these communities on a combination of both fungible and non-fungible tokens. An NFT could serve as the key to a community (and even different cohorts, tiers, or functions within that community) and then social tokens could be used to determine ownership and influence (via governance stake) within that community. \n\nSocial tokens have many potential benefits but they also run the greatest risk of amplifying the more toxic dynamics of web2. These risks will be magnified with social tokens that are purely speculative (don’t grant any access or non-financial rewards to holders.) Creators or influencers should have full autonomy over their tokens, or at least be required to opt-in. After all, social tokens invite the public to openly speculate on a person or group’s worth. I can’t think of a scenario in which being able to short a personal social token wouldn’t be problematic. Social tokens quantify popularity and create an in-group. Membership should probably be earned rather than bought. \n\n## Social DAOs: The Aggregation Layer - Social Circles \n\n*Web2 analog: DAOs, literally and figuratively, are a Discord. DAOs also enable Wall Street Bets (partybids) to actually win against Wall Street sharks (whales) and turn web3 into a MMORPG.* \n\n*Amidst this explosion of NFTs and social tokens, DAOs will play the role of aggregator. Aggregators accrued most of the value in web2 and, in web3, DAOs will aggregate by collecting, curating, and moderating.* \n\n![https://coopahtroopa.mirror.xyz/_EDyn4cs9tDoOxNGZLfKL7JjLo5rGkkEfRa_a-6VEWw](https://images.mirror-media.xyz/publication-images/4e0459c1-39ab-432b-87ca-db12d1c9ed5f.jpg?height=596&width=1071)\n\nDecentralized autonomous organizations are internet-native collectives that share resources, build products, and work together toward common goals.5 DAOs aren’t new (remember The DAO circa 2016?) but they’ve seen a recent resurgence. In 2019, DeepDAO only recorded 10 DAOs. That number is now 133. This increase was driven by a variety of factors including the launch of DeFi protocol governance tokens, some legal frameworks out of Wyoming and Delaware (series LLCs), and the rise of the NFT market, which created an impetus for the quick formation of DAOs to pool capital together in pursuit of an otherwise unobtainable NFT. Who knows, maybe DAOs become the social clubs of the metaverse. \n\nSocial DAOs are the most explicit mechanism by which to combine both social and financial capital. They create digital social circles and can also empower a collective of individuals to flip power dynamics against wealthy individuals. In NFT bidding wars, they can empower a group of individuals to overtake an individual whale (sometimes causing them to switch sides and join the DAO). They also enable co-creation and collective participation in a way that isn’t really possible on web2. \n\n> ***Yes, DAOs are more about community than scarcity. However, they are still scarcity networks as you either have to be asked to join or buy your way in (usually at an increasingly expensive price).*** \n\n### We Have the Network, but Not the Tools \n\n![](https://images.mirror-media.xyz/publication-images/5627c193-3d71-44a8-bcd0-4ad52d494af2.jpg?height=665&width=1151)\n\nDAOs are not really DAOs yet, meaning most are not actually decentralized, autonomous, or organized. In theory, DAOs reduce coordination costs. In practice, they might even increase them. Common pain points include: lack of regulatory clarity, keeping up with communications and proposals, treasury management, division of labor, allocating payments to members, (semi)-centralized operations, and community selection and engagement. This last point is becoming more important as DAOs mature and people realize the importance of carefully curating a committed community. \n\n## A Social Protocol: The Reputation Layer - Credibility \n\n*Web2 analog: Twitter + Facebook, but built on Ethereum. On-chain interactions (NFTs, social tokens, and DAOs) create an open social graph that can be leveraged by social protocols.* \n\nAll social networks start with identity, create a graph between identities, and then attempt to infer things from that graph (reputation, for example.) In web3, ENS + MetaMask replaces SSO as the de facto log-in, allowing web3 identity to integrate with applications beyond a given identity provider’s ecosystem. Eventually wallets will become more like profiles, with native NFT integration for profile pictures, Rabbithole integration for on-chain resumes, and mirror + NFT marketplaces for on-chain portfolios. Interactions between identities will be combined to create an open social graph. Of course, not all interactions will be on chain, but what settles on-chain will allow developers to:\n\n* Create friend-matching mechanisms based on NFT ownership, DAO membership, social token ownership, and protocol usage \n* Better curate communities \n* Establish community-based delegated credit based on proven membership in particular DAOs \n* Develop a[ web of trust](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3375436), the ultimate path towards decentralized reputation and un/undercollateralized lending which ties all of the activity on web3 social networks right back to DeFi again. Social tokens could be used as collateral to bootstrap reputation until we have a full web of trust \n\n![https://twitter.com/jbrukh/status/141977301042540135 ](https://images.mirror-media.xyz/publication-images/a728bfe9-30ea-4542-b51d-702f5b4f5acc.jpg?height=333&width=877)\n\n### It’s Always about Identity \n\nThe non-persistence of online identity is probably the biggest obstacle to effectively utilizing this open social graph. As web2 evolved, users moved away from using their real identities. Finsta, anon, and alt accounts became the norm. On web3 people have public .eth addresses complemented by many other private addresses. Identity is important to social protocols, though, because it creates social accountability, which is totally missing in web2 and DeFi. Incentives (different levels of access or better DeFi rates) could be offered for higher levels of attestation, which could include Proof of Humanity, POAP, and Proof of Participation. Incorporating zero-knowledge proofs into these solutions could help balance verification and privacy. Personal social tokens could also be used as a sort of identity proxy, providing an alternative to hardcoding identity on-chain for those that value privacy more highly. \n\n![Based on https://twitter.com/thattallguy/status/1413631784135192576](https://images.mirror-media.xyz/publication-images/7da1ebba-59e7-4624-80c3-983a21f785d0.jpg?height=356&width=1026)\n\n### Web3 Will Not Fix Everything \n\nSocial exchange theory totally broke down on web2.[ Key concepts of social exchange theory](https://start-thinking.com/sm-and-comm-theories) include reciprocity, fairness and negotiated rules, with information, approval, respect, power, group gain and personal satisfaction among the rewards in successful transactions. Web3 restores critical elements of social exchange. \n\n> ***That said, technology doesn’t eliminate natural human instincts and, therefore, technology alone won’t prevent some of the toxic elements of web2 from creeping into web3.*** \n\nWeb3 will still be about brand and status, cliques and clubs, and one-upping everyone else*.* Web3 is still addicting — just ask anyone on OpenSea at 4am. Nobody really knows the consequences of day-trading culture and scarcity networks that reward status and profit above all else. People who can’t afford to will lose millions trying to fit in.⁴ This system of in-groups will exacerbate the industry’s lack of diversity. \n\n> ***If web3 really is about culture, then we should ask ourselves how representative the culture we’re talking about is and if these networks are actually open or designed to reinforce [preferential attachment models](https://en.m.wikipedia.org/wiki/Preferential_attachment). ***\n\n![https://twitter.com/StaniKulechov/status/1430997412756262914](https://images.mirror-media.xyz/publication-images/154e310d-974e-4af2-b346-10f99aa0dbe2.jpg?height=457&width=912)\n\nThe biggest opportunity web3 has relative to web2, is that web3 doesn’t have to be zero-sum. It’s multi-player and participants literally have a vested interest in each other and the quality of the communities they build. The value generated by web3 should at least accrue to those creating art, contributing content, and building lasting communities rather than siloed monopolies. Participants will finally have a voice and a vote. \n\nIt feels like we are at a web3 inflection point, but we are nowhere near mainstream yet. NFT users are in the lower double digit millions relative to the roughly 4 billion users of web2 social networks. Web2 social networks have generated trillions in marketcap…. imagine what web3 can generate and then consider that it more effectively scales. \n\nPeter Thiel has[ a theory](https://sacks.substack.com/p/your-startup-is-a-movement?r=5eprj&utm_campaign=post&utm_medium=email&utm_source=twitter%20Looks%20rare.) that the best startups are like cults that believe something true. Web3 certainly feels like a cult and whether we believe it’s about culture, status, or scarcity, the value it’s creating is undeniably true. \n\nWeb3. Looks rare 👀\n\n\n---\n\nI used to be a professional ballerina. Then I was a banker. Now I do crypto. I don’t know if I’m doing this right. [Get in touch!](https://twitter.com/j_humenansky) I probably want to join your DAO.  \n\nThank you to the following for generous feedback: Dylan Hunzeker, [Chris Kurdziel](https://twitter.com/ckurdziel), [Medha Kothari](https://twitter.com/medhakothari), and [Matt Stephenson](https://twitter.com/stephensonhmatt). \n\n1. [Status Monkeys](https://www.notboring.co/p/status-monkeys)\n2. [Jesse Walden](https://twitter.com/jessewldn/status/1424909172940886018\\])\n3. [Coophatroopa](https://twitter.com/Cooopahtroopa)\n4. [Proof of Passion](https://tals.substack.com/p/proof-of-passion)\n5.  [Chris Dixon](https://mobile.twitter.com/cdixon/status/1427452469303418899)\n6. [Bankless](https://newsletter.banklesshq.com/p/the-bull-case-for-social-tokens.) \n7. [Individual Before Community: Why Creator Tokens Will Precede Community Tokens](https://future.a16z.com/creator-before-community/)", "timestamp": 1630564878, "digest": "dQtmHWtUcUsb_-rUtOgc8fzCn5z6lw1cLoMcswykV3I", "contributor": "0xeD11c993Cae7Fc4aAb522c9e3986B233657efc66"}
{"id": "6hosyIiKKMbWf_tGT_6oVoYMPRGmWObnug0mC0AfAUY", "title": "The Evolution of DeFi Across Four Financial Primitives", "body": "![Photo by Hello I’m Nik on Unsplash](https://miro.medium.com/max/1400/0\\*zHy-hDv8Eu4dviMc)\n\nWhile still experimental, DeFi has matured enormously since I first [wrote about it](https://medium.com/coinmonks/defi-what-it-is-and-isnt-part-1-f7d7e7afee16) in June 2019. As DeFi protocols roll out v2s and v3s, I took a fresh look at the industry and how it is evolving. \\*\\*After many years in finance, I’ve realized most of what moves markets comes down to four financial primitives: liquidity, leverage, risk, and arbitrage. \\*\\*This article outlines the evolution of DeFi through the lens of each.\n\n\\*This article outlines \\*\\*\\*\\*financial \\*\\*\\**primitives, or the core building blocks of financial markets, which are distinct from software or cryptographic primitives. This article assumes some knowledge of finance, crypto, and DeFi and is not comprehensive in its coverage of protocols.*\n\n## Financial Primitive 1: Liquidity\n\n*Almost everything comes down to [liquidity](https://www.investopedia.com/terms/l/liquidity.asp)*, but we consistently underestimate its importance. Higher liquidity results in tighter spreads and greater *[market efficiency](https://www.investopedia.com/terms/m/marketefficiency.asp#:\\~:text=Market%20efficiency%20refers%20to%20the,undervalued%20or%20overvalued%20securities%20available.)*. Lower liquidity exaggerates market movements and amplifies sell-offs. It creates a flywheel on the way up but a cliff on the way down.\n\nv1 DeFi was a liquidity vacuum that relied on captive capital. The term captive capital refers to underutilized capital locked in protocols or inefficiently allocated within them. It results in opportunity costs as this capital could otherwise earn higher returns, either inside or outside of the protocol. The first DeFi protocols depended on captive capital: [MakerDAO ](https://makerdao.com/en/)required a minimum 150% collateralization ratio, lending protocols had not yet embraced [superfluid collateral](https://tokeneconomy.co/superfluid-collateral-in-open-finance-8c3db15efac) (a v2 innovation led by [Compound](https://compound.finance/)), and [Uniswap](https://uniswap.org/)’s liquidity was inefficiently distributed across a \\*\\*-∞ \\*\\*to \\*\\*∞ \\*\\*price curve.\n\n> The opportunity cost of captive capital scaled along with DeFi and now v2s and v3s are fighting to achieve greater capital efficiency.\n\n## Collateral as Liquidity\n\nStablecoins play an enormous role in DeFi. Fiat-backed stablecoins are problematic (centralization, regulation\\*\\*, \\*\\*potential competition from CBDCs) and cryptocollateralized stablecoins present the most viable alternative. However, v1s relied on overcollateralization to maintain their peg and haven’t been able to scale. Purely algorithmic, uncollateralized stablecoins have never performed as intended and v2 attempts seem subject to the same shortcomings (incentive mechanisms that perform well above the peg, but not below).\n\nMany of the latest iterations of stablecoins ([FEI](https://fei.money/), [OHM](https://olympusdao.eth.link/#/), [FLOAT](https://www.floatprotocol.com/#/stake)\\*\\*, **[FRAX](https://frax.finance/)**) \\*\\*leverage protocol controlled value (PCV). This is a concept in which the collateral backing a stablecoin is not redeemable by users but rather is owned by the protocol (which decides whether/how to invest it, can use it to restore the peg, etc.) This is similar to a treasury or insurance fund, but is distinct in that PCV can be immediately converted into liquidity (an [AMM](https://www.gemini.com/cryptopedia/amm-what-are-automated-market-makers) pool). Launch issues aside, [FEI](https://fei.money/)’s PCV enabled it to become the largest liquidity provider (LP) on [Uniswap](http://uniswap.org/). [Aave](https://docs.aave.com/faq/swap-and-repay-with-collateral-v2#:\\~:text=In%20Aave%20V2%20you%20have,loans%20with%20your%20deposited%20collateral.) v2 similarly blurs the line between collateral and liquidity by allowing borrowers to pay off their debt with existing collateral. [Proof of Liquidity](https://www.placeholder.vc/blog/2020/5/22/proof-of-liquidity) creates a similar dynamic for staking derivatives, which are covered in more detail below.\n\n> DeFi v1 figured out how to use liquidity as collateral (LP tokens). v2 and v3 protocols are figuring out how to convert collateral into liquidity.\n\nUnfortunately, liquidity alone does not result in stability. The real reason stablecoins collapse is a crisis of confidence below the peg. Addressing captive capital is not sufficient\\*\\*. \\*\\*Sound economic mechanisms are required to keep the stablecoin near its peg over time, and mechanism design is hard. Purely algorithmic stablecoins ([Basis Cash](https://basis.cash/), [Empty Set Dollar](https://www.emptyset.finance/)) have struggled with mechanisms that require confidence in the future peg exactly when the present peg is failing. So-called [Direct Incentives](https://medium.com/fei-protocol/what-you-should-know-about-fei-3ccffd4a4bb6), which penalize trades away from the peg and reward trades towards the peg, end up pulling liquidity out of the system at the exact moment it’s most needed.¹⁰ Severe sell penalties mimic constrained liquidity and keep more capital captive, which is the problem we’re trying to solve in the first place. Other models attempt to solve for confidence first and improve capital efficiency over time, beginning with a fully collateralized token and letting the market adjust the collateralization ratio dynamically. As confidence goes up, so does capital efficiency. [FRAX](https://frax.finance/) uses this model, but is currently backed by a basket of fiat-backed stablecoins. While the mechanism appears to be working, it’s unclear how it would hold up were it exclusively collateralized by uncensorable assets.\n\n> While the newest generation of stablecoins are focused on lowering collateralization requirements, we need to solve for confidence in the peg (effective mechanism design) before capital efficiency.\n\n## Liquidity as a Liability\n\nWe can’t talk about liquidity without talking about [Uniswap](https://uniswap.org/), the dominant AMM. Uniswap played an important role in the rise of [yield farming](https://www.coindesk.com/defi-yield-farming-comp-token-explained) and [liquidity mining](https://medium.com/bollinger-investment-group/liquidity-mining-a-user-centric-token-distribution-strategy-1d05c5174641#:\\~:text=Liquidity%20mining%20is%20a%20network,for%20that%20protocol%27s%20native%20token.), which, in turn, played an important role in Uniswap’s trajectory. After we learned ([the hard way](https://thedefiant.substack.com/p/sushiswaps-vampire-scheme-hours-away)) that [liquidity is not a moat](https://www.delphidigital.io/reports/fork-defense-strategies-in-defi/), the focus moved from acquiring it to retaining it. Competing AMMs began moving up the stack to add higher moat/margin services like lending ([Kashi Lending](https://medium.com/sushiswap-org/introducing-kashi-lending-margin-trading-on-sushiswaps-bentobox-eb91286f6910)), borrowing a page from traditional fintech: acquire users cheaply and upsell credit products. Instead, Uniswap fundamentally rethought the AMM liquidity mechanism, resulting in a v3 that improves capital efficiency by up to 4000x, in special cases.⁷\n\nWhile v1 AMMs were a [0 to 1 innovation](https://medium.com/bollinger-investment-group/constant-function-market-makers-defis-zero-to-one-innovation-968f77022159), they were also inefficient since they required liquidity for prices that might never be reached. For example, if ETH were in the $200 range, and there was $10M in an ETH/DAI pool, up to 25% of the liquidity pool might exist for buying ETH below $10 or above $5,000.⁵ In this example, it is highly unlikely that liquidity would be needed at those levels. Maintaining this constant price curve resulted in low turnover (\\~20%) as $5B in locked capital translates to only $1B in volume.¹\\*\\* \\*\\*The even spread of liquidity over the entire range also means that very little liquidity is concentrated where a pair does most of its trading. [Curve](https://curve.fi/) recognized this early on, creating an AMM specifically for stablecoins, which are designed to trade in a tight range.\n\nUniswap v3 addresses these issues and, in the process, moves closer to a limit order book in that\\*\\* LPs can now specify a price range over which to provide liquidity (ie. ETH/USDC from $1800 to $2200). This change should result in almost all trading occurring in a few buckets around the mid-market price, improving liquidity where it’s most needed. More concentrated liquidity should also reduce inventory risk, which results in both wasted capital and exposure to assets that LPs don’t want to hold. For example, if an LP posts $500 for an ETH/DAI pair but is confident that the ETH price will go up, then they’ve taken on exposure to an asset (DAI) that they don’t want to hold (ETH opportunity cost) and are holding $500 of DAI only to buy ETH as it falls, which they think is unlikely. Uniswap v3’s concentrated liquidity provision reduces this risk by enabling LPs to significantly increase their exposure to preferred assets.¹³ \\*\\*[Balancer](https://balancer.finance/) v2 also attempts to reduce inventory risk by introducing [Asset Managers](https://medium.com/balancer-protocol/balancer-partners-with-aave-to-build-the-first-v2-asset-manager-d9c173330151), which allow LPs to lend out one side of a pair when it’s not being used as swap liquidity. [Yearn](https://yearn.finance/)’s [Stablecredit](https://docs.yearn.finance/r-and-d/stablecredit) utilizes a similar functionality.\n\n> The next generation of AMMs require less capital but result in more liquidity.\n\n## **Liquidity Trade-offs**\n\n[Superfluid collateral](https://tokeneconomy.co/superfluid-collateral-in-open-finance-8c3db15efac) is a v1 concept that refers to the ability to tokenize locked capital (collateral or liquidity) in order to access liquidity or gain leverage on that capital. Staking derivatives extend this concept to staked assets (assets that secure [proof-of-stake](https://www.investopedia.com/terms/p/proof-stake-pos.asp) networks) via stake tokens ([stETH](https://lido.fi/), [rtokens](https://www.stafi.io/rToken)) that essentially allow staked capital to be deployed more productively elsewhere. Proponents of staking derivatives argue that without them, network token liquidity will suffer as a large portion of outstanding supply will remain captive. There are also concerns that validators won’t be incentivized to stake if/when they can earn higher returns on capital deposited elsewhere (DeFi protocols). In theory, staking derivatives could increase the percentage of ETH staked from 15–30% to 80–100%, since it removes the additional costs of staking compared to not staking.¹⁴\n\nStaking derivatives also allow for the creation of new financial instruments. For example, the cash flows “guaranteed” by proof-of-stake rewards can enable products that look similar to coupon-bearing bonds ([Terra](https://terra.money/)’s bAssets, [Blockswap](https://www.blockswap.network/)). These instruments can be used to generate sustainable, stable, and relatively high yields (as in [Anchor Protocol](https://anchorprotocol.com/)), which may onboard more mainstream users to DeFi.\n\nHowever, staked assets are unique from collateral in that they are not just a promise to pay, but rather they are a security mechanism. I would like to see more research on the associated security costs, but it’s clear that design matters. Some designs, particularly those that enable staking derivatives to move cross-chain, allow for a transformation of risk (from [endogenous](https://www.investopedia.com/terms/e/endogenous-variable.asp) to [exogenous](https://www.investopedia.com/terms/e/endogenous-variable.asp)) that could impact the underlying game theory that helps secure public networks.¹¹ In contrast, [Proof of Liquidity](https://www.placeholder.vc/blog/2020/5/22/proof-of-liquidity) converts staked capital into liquidity for the underlying network token in a way that balances capital efficiency and network security, which should be the main priority.\n\n## Financial Primitive 2: Leverage\n\n*[Leverage](https://www.investopedia.com/terms/l/leverage.asp)*\\* amplifies gains (it’s the ultimate in capital efficiency) but also dramatically accelerates losses. Creating leverage is easy, controlling it is hard. We love it, until we hate it.\\*\n\nThere have been countless TradFi market crashes due to excessive and/or hidden leverage. In the last six months alone, we saw the market impact of [Archegos](https://www.bloomberg.com/news/articles/2021-04-01/leveraged-blowout-how-hwang-s-archegos-blindsided-global-banks) (which was highly levered) and the Gamestop levered short squeeze ([140% of Gamestop’s float was sold short](https://www.institutionalinvestor.com/article/b1qjp3jmnxyf73/Short-Sellers-Still-Love-to-Hate-GameStop#:\\~:text=About%2033%20percent%20of%20GSX%27s,added%20during%20the%20past%20week.)). In the crypto markets, we recently saw [$10B in liquidations in 24 hours](https://www.coindesk.com/crypto-futures-saw-record-10b-worth-of-liquidations-on-sunday#:\\~:text=31%20a.m.%20PDT-,Crypto%20Futures%20Saw%20Record%20%2410B%20Worth%20of%20Liquidations%20on,caught%20overleveraged%20traders%20off%20guard.), in part due to [cascading liquidations](https://twitter.com/SBF_Alameda/status/1238306312229761025) of leveraged long positions. This served as a sort of stress test for the crypto markets, and some DeFi protocols were [pretty stressed](https://twitter.com/lawmaster/status/1383655305058217988).\n\n> Leverage is easy in DeFi , controlling it is still hard.\n\n## Creating Leverage\n\nMuch of the frenzied activity during the DeFi Summer of 2020 was driven by active leverage strategies that relied on recursive [yield farming](https://www.coindesk.com/defi-yield-farming-comp-token-explained) and [liquidity mining](https://medium.com/bollinger-investment-group/liquidity-mining-a-user-centric-token-distribution-strategy-1d05c5174641). While this activity has died down since then, we are starting to see new leverage mechanisms emerge. [Element](https://element.fi/)’s [Yield Token Compounding](https://medium.com/element-finance/unlocking-capital-efficiency-a-defi-users-journey-through-element-d0a689f2a894) is one example. When a user deposits collateral via Element, two tokens are minted: a principal token and a yield token. Let’s say a user deposited principal of 10 ETH at 20% APY. The token holder can sell the principal token at a discount. At a fixed rate yield of 10%, they would receive 9 ETH while maintaining exposure to the interest paid on all 10 ETH over time via the yield token. The user could then open a new position with the remaining 9 ETH and repeat, achieving up to 6.5x leverage.³ The ability to earn interest on the \\*full \\*principal amount, while being able to access the loan’s [NPV](https://www.investopedia.com/terms/n/npv.asp), is unique relative to earlier lending protocols.\n\nWhile there have been several protocols that aimed to achieve undercollateralized lending in DeFi, it remains mostly conceptual. While [CREAM](https://app.cream.finance/) v2 strives to achieve zero-collateral protocol-to-protocol lending via the [Iron Bank](https://creamdotfinance.medium.com/introducing-the-iron-bank-bab9417c9a), it’s only available to whitelisted partners and parameters will be determined directly by the CREAM team, highlighting current limitations. Instead, [Alchemix](https://alchemix.fi/) approaches the problem from a completely different angle, allowing borrowers to benefit from overcollateralization. For example, a user that deposits 1000 DAI can access 500 alUSD. The 1000 DAI is put into a Yearn vault to earn yield, which is used to pay down the loan over time. The alternative would be to make an upfront purchase of $500 and then invest the unspent $500, which will obviously earn less yield than $1000 would ($280 less, assuming a 25% APY over 2 years).¹⁵ Again, borrowers benefit from earning interest on the \\*full \\*principal amount while still being able to access a discounted portion of the principal.\n\n> New lending protocols utilize the time value of money and the separation of principal and yield to allow users to benefit from (over)collateralization.\n\n## **Cross-Collateral Complexity**\n\nWhile the early DeFi ecosystem relied mostly on recursive loops denominated in one asset (ETH), v2s expanded the complexity of lending protocols by allowing for multi-collateral systems, in which *n* assets can be borrowed against *m* collateral. Single-Collateral Dai evolved into Multi-Collateral Dai, [Compound](https://compound.finance/) supported cross-collateral money markets, which [Aave](https://aave.com/) and [CREAM](https://app.cream.finance/) expanded on by supporting more and more assets. [Yearn](https://yearn.finance/)’s [StableCredit](https://medium.com/iearn/introducing-stablecredit-a-new-protocol-for-decentralized-lending-stablecoins-and-amms-7252a43ee56) protocol allows users to mint synthetic debt positions to essentially swap collateral ([functionality](https://docs.aave.com/faq/swap-and-repay-with-collateral-v2#:\\~:text=In%20Aave%20V2%20you%20have,loans%20with%20your%20deposited%20collateral.) which Aave v2 supports via [flash loans](https://www.coindesk.com/what-is-a-flash-loan)). Some protocols take it a step further and pool exposure to all of these assets, spreading counterparty risk across users. On [Synthetix](https://synthetix.io/), when the value of any synthetic asset minted on the protocol increases, it raises the value of total debt in the system, while a user’s ownership of the total debt pool remains constant. This can result in outcomes where a user’s debt balance increases due to a price increase of an asset to which they have no direct exposure.² This cross-collateral complexity and cross-asset exposure improves functionality but also increases the likelihood of market contagion, whereby a sell-off in one asset causes a sell-off in others.\n\n## Controlling Leverage\n\nComposability enables rapid innovation, but it also means that money legos can quickly become money dominos. Despite on-chain transparency, the difficulty of creating a cohesive view of leverage compounded across protocols means there is currently no easy way to understand how much credit is\\*\\* \\*\\*[commodity credit versus circulation credit](https://mises.org/wire/mises-explains-difference-between-circulation-credit-and-commodity-credit),⁹ which has implications for the solvency of the system. Solvency is particularly important in a system that, by design, has no lender of last resort. Additionally, while centralized venues liquidate underwater collateral themselves, avoiding counterparty risk, decentralized protocols rely on third-party liquidators to remove underwater debt from their balance sheets. These liquidators can choose to purchase underwater collateral from the protocol at a discount, but they can also choose not to, due to volatility, network congestion, and/or other market factors.¹² [Liquity](https://www.liquity.org/) attempts to overcome this issue by creating a pool of funds that can be used for liquidations. In this model, LPs agree in advance that their liquidity will be used to buy collateral at a discount during liquidation periods. While this enables the protocol to lower loan collateralization ratios to 110% and offer a fixed rate of 0% interest, LPs could end up buying collateral as prices are falling, which could come at a much higher cost.\n\n## Financial Primitive 3: Risk\n\n*There is one ratio that is nearly inescapable in finance: risk/reward. The idea is simple: higher returns require more risk. With one exception (financial primitive 4), it is extremely difficult, if not impossible, to break this ratio.*\n\nWhen markets are new, risk is mostly expressed in binary terms: [risk-on or risk-off](https://www.investopedia.com/terms/r/risk-on-risk-off.asp). As markets evolve, and the composition of risk is better understood, risk transfer mechanisms develop, as does a sliding scale of risk that allows market participants to express individual risk tolerance.\n\n## Binary Risk\n\nVolatility products allow market participants to take a binary view on market risk and are a critical piece of market infrastructure. The [VIX](https://www.investopedia.com/terms/v/vix.asp), an index representing the market’s estimate of future volatility, is a cornerstone of traditional financial markets. CeFi markets already offer some vol products ([FTX ](https://about.ftx.com/)[MOVE](https://help.ftx.com/hc/en-us/articles/360033136331-MOVE-contracts)),\\*\\* \\*\\*but DeFi markets have few equivalents. Protocols like [Volmex](https://volmex.finance/) are working to create a volatility index while [Benchmark Protocol](https://benchmarkprotocol.finance/)’s stablecoin uses the VIX as an input to its stability mechanism. [INDEX Coop](https://www.indexcoop.com/) seems like a natural candidate for a DeFi native volatility index and [Opyn](https://www.opyn.co/#/trade?options=eth) [has expressed interest](https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5zaW1wbGVjYXN0LmNvbS9sS21RREc5Ug/episode/YjEzNDIzMGEtY2JkYi00OTQ2LTkzMDctZjM5NzlmODg2NTQ4?hl=en&ved=2ahUKEwjDiaX984rwAhUITawKHWA3B6AQjrkEegQIAxAL&ep=6) in creating a “DeFi VIX” as well.\n\n## Risk on a Sliding Scale\n\nEmerging DeFi protocols are developing “risk-matching engines” to pair market participants that prefer less risk with those that prefer more. Most are approaching this via multi-token systems that separate speculative versus non-speculative aspects of a protocol and redistribute cash flows accordingly ([Saffron](https://saffron.finance/), [BarnBridge](https://barnbridge.com/), [Element](https://element.fi/)). For example, [Element](https://element.fi/) splits principal and yield, allowing users to purchase the NPV of the principal (basically a zero-coupon bond) or take up to 10x leveraged exposure to the yield.⁸ [BarnBridge](https://barnbridge.com/) splits cash flows into fixed yield and variable yield. Variable yield holders get upside above a fixed rate but subsidize the fixed yield token holders in the case of a shortfall. Similarly, [Saffron](https://saffron.finance/) splits risk into senior and junior tranches. Senior tranches except lower yields in exchange for coverage from junior tranches in the event that things go south. More yield = more risk.\n\nThese programmable risk protocols enable peer-to-peer risk transfer and allow users to bet on different parts of the capital structure. Risk-averse capital (like corporate treasuries) may prefer to buy the senior tranche, while [Degens](https://www.coingecko.com/en/glossary/degen) chasing yield may prefer junior tranches. Greater expressivity of risk tolerance is a positive development for DeFi markets and there is nothing inherently dangerous about tranching.\n\n> Risk tranches have become toxic in the past, namely when they’ve tried to circumvent the risk/reward ratio. The [CDO²](https://www.investopedia.com/terms/c/cdo2.asp) will forever be my favorite example of clever financial engineering, packaged to look like a riskless instrument when it was actually full of risk.\n\n## Financial Primitive 4: Arbitrage\n\n*There is one important exception to the risk/reward ratio and that is [arbitrage](https://www.investopedia.com/terms/a/arbitrage.asp)*. Arbitrage creates (theoretically) riskless profit opportunities and it plays a critical role in price discovery\\*\\*\\*, **which** \\*\\*\\**is one of the things smart contract platforms are best suited for.⁴ The [Kimchi premium](https://www.investopedia.com/terms/k/kimchi-premium.asp)* is a perfect example. Buy an asset for $55,000 in the U.S. and sell the same asset for $65,000 in South Korea. Riskless profit.\n\nArbitrage is required for many DeFi protocols to function properly and needs to be considered in the design of any protocol. [Uniswap ](https://uniswap.org/)is heavily reliant on arbitrageurs to maintain price discovery. Arbitrageurs rebalance portfolios on [Balancer](https://balancer.finance/). Some [argu](https://medium.com/@hasufly/maker-dai-stable-but-not-scalable-3107ba730484)e that [MakerDAO’s ](https://makerdao.com/en/)scale is limited due to the infeasibility of arbitraging [CDP](https://coinmarketcap.com/alexandria/glossary/collateralized-debt-position-cdp)s. Miners on [Stacks](https://www.stacks.co/) are incentivized to mine on the chain by arbitraging the BTC-STX rate.⁶ [Yearn](https://yearn.finance/)’s [StableCredit](https://docs.yearn.finance/r-and-d/stablecredit) relies on arbitrage rather than governance to maintain stability in the system. [1inch](https://app.1inch.io/), [Yearn](https://yearn.finance/), [ParaSwap](https://paraswap.io/#/), and [Rari](https://rari.capital/) can all be used as vehicles for arbitrage. [ThorChain](https://thorchain.org/) and [Serum](https://dex.projectserum.com/#/market/AtNnsY1AyRERWJ8xCskfz38YdvruWVJQUVXgScC1iPb) will be crucial to enabling cross-chain arbitrage as DeFi protocols launch across Layer 1s\\*\\*. **As** \\*\\*DeFi struggles to scale, avoidance of gas costs will present a temporary arbitrage opportunity, which is increasingly shaping v2/v3 design ([Aave](https://aave.com/) v2 [collateral swaps](https://medium.com/aave/the-aave-protocol-v2-f06f299cee04), [dydx](https://dydx.exchange/)’s gasless order book, [Balancer](https://balancer.finance/) v2s pooled assets, [Sushiswap](https://sushi.com/)’s [BentoBox](https://medium.com/sushiswap-org/introducing-kashi-lending-margin-trading-on-sushiswaps-bentobox-eb91286f6910)).\n\n> v1s focused on cross-protocol arbitrage, v2s/v3s are focusing on chain-cross arbitrage\n\nArbitrage increases [market efficiency](https://www.investopedia.com/terms/m/marketefficiency.asp) (the degree to which market prices reflect all available, relevant information) but it also results in narrower spreads and normalized yields, eliminating temporary advantages between protocols. As market efficiency increases, so does competition. True protocol innovation, and not just incrementalism, will be required to maintain dominance in this environment.\n\nv2 and v3 DeFi protocols will need to innovate across all four financial primitives, as their interconnected nature is what drives markets. Without arbitrage, stablecoins can’t scale. Without liquidity, there is no ability to arbitrage. Leverage lets you take more risk, and risk transfer can let you take on more leverage. Importantly, DeFi enables entirely new financial primitives, such as flash loans, that have no traditional counterpart. Protocols that solve for all of these primitives, and/or that create novel ones, will lead the way for the next generation of DeFi. I can’t wait to see v4 and v5.", "timestamp": 1630565118, "digest": "re5hZ47QfpEsaeEWqNYXDSpEeCiVCwMOvfJtgUgWsDc", "contributor": "0xeD11c993Cae7Fc4aAb522c9e3986B233657efc66"}
{"id": "-4uqAw5_QjnPFXetGlqc8TLBfX73M1_5PgSQhCA8GEs", "title": "On Governance & The SuperRare DAO", "body": "Ok, so by now you're probably asking yourself - what's the point of all this governance talk? Is this really something I need to concern myself with? And if so, then how does it work?\n\nTo unpack these questions a bit further, let's take a step back and recap how we got to where we are today and why community governance is such an important concept for the digital economy in the 21st century.\n\n### The Purpose of Governance\n\n*“The Nation that makes a great distinction between its scholars and its warriors will have its thinking done by cowards and its fighting done by fools.” – Thucydides*\n\nIf you strip away all the lofty rhetoric, ***governance*** really just means that you have ***agency*** as a participant in a social network you care about. Whether that social network is your local town council, a national government or even a Fortnite guild; the core idea is that being able to express your voice and influence the rules of a network gives you agency in that network - and provides you with a sense of ownership in the outcomes.\n\nAgency is such a powerful human need that in the 20th century, millions around the world took up arms and struggled mightily for the right to political agency and self-governance. While not everyone cares to exercise these hard-fought rights on a daily basis - what matters most is that a small group of dedicated individuals CAN make their voices heard, influence the terms of public debate, and ultimately catalyze systemic change on behalf of the whole population if their ideas are sufficiently popular.\n\nNever doubt that a small, dedicated minority can change the course of human history. Indeed, historians believe only 20-30% of the colonial population in North America supported the American Revolution when it began...and how lucky we are for that intransigent minority!\n\n### Crypto-networks to the rescue!\n\nTwo decades into the digital revolution we find ourselves at a cross-roads. On the one hand, we enjoy being connected to billions of friends & family on Facebook, and being able to order anything and see it arrive to our door in 48hrs. On the other hand, we see the unparalleled concentration of power into the hands of centralized platforms like Twitter or Amazon, unaccountable to their users, who strip-mine our data and unilaterally decide whether certain products are 'worthy' of being sold, or which opinions are deemed 'acceptable' for public consumption. These business models - while economically powerful - systematically disempower their users, looking more and more totalitarian as the years click by.\n\nReconciling this lack of individual agency with the political traditions of western democracy was becoming increasingly untenable until the invention of blockchain technology twelve years ago. Unlike the centralized business models of old, in blockchain networks (aka 'token-governance' networks) decision-making and rule enforcement is left to individual users of the network, rather than placed in control of a centralized authority. This model not only up-ends the tyranny of such centralized systems - it allows for broader distribution of the value created inside such networks to those very users. In sum, blockchains are a revolution in our models for both social AND economic organization.\n\nToken governance is revolutionary because it allows for incentive alignment and coordination among large groups of strangers AND because it allows for more open and meritocratic platforms than any centralized competitor could ever be. While the cost of this model is that all token holders share equal responsibility for rule-making in such networks, the benefit is that they also share equally in the value created through their collective governance efforts. As in any democracy, greater individual responsibility and noisier town squares are the cost we pay for real agency and the ability for a lone voice to shake the temple walls.\n\n### How this relates to SuperRare\n\nAs big believers in the token governance model, we've always felt the tension between doing what was necessary to survive (even centralized startups are hard!), and our ideological roots as disciples of the crypto revolution. This tension was made even more difficult by some of the uncomfortable realities intrinsic to the art market; namely that art is inherently subjective, and without curators/moderators to establish context - more art ≠ better art.\n\nSaid differently - to appreciate the historical, social and/or cultural value of an artwork (or artist!), the viewer needs more context than that which could be expected from a completely permissionless content network. To make CryptoArt enjoyable and accessible to the masses, it was necessary that SuperRare play the role of a trusted curator, lest the importance of CryptoArt as a cultural movement be lost amidst the din of collectables and volume-focused marketplaces.\n\nTake YouTube: without humans to sift through and curate the best content (which then informs ranking algorithms), how could anyone ever hope to find the diamonds of content amid the firehose of a million daily uploads?\n\nThis problem is significantly more complex when it comes to art, since much of the context around an artwork isn't communicated directly in the piece itself - but is often grounded in the historical and cultural zeitgeist from which that piece was produced. Take this painting:\n\n![Guernica by Pablo Picasso](https://images.mirror-media.xyz/publication-images/22c4aa96-8ca2-4947-b47f-8d08bf11a80f.png?height=575&width=1024)\n\nTo the lay observer this piece looks like a random jumble of discontinuous body parts with an eccentric cubist/post-modern style. If you're unfamiliar with the artist, you could be forgiven for having no idea what you're looking at - or even the sense that this work was historic in any way. But with appropriate context: painted by Picasso in 1937 following the carpet bombing of Guernica in the midst of the Spanish Civil War, revealed at the Paris International Exhibition as a political statement on the eve of Nazi invasion and occupation - this piece assumes its rightful place as one of (if not the most) important pieces of anti-war artwork ever produced. Its cultural impact + memetic value becomes significantly more powerful once that context is shared equally among all observers.\n\nThus curation is proper, and often necessary, for the broad enjoyment of fine art - whether that art is expressed with oil on canvas or with pixels anchored in a blockchain. By expanding the range of curation available on SuperRare and decentralizing this control to holders of $RARE we believe we've discovered an elegant way of 'threading the needle' between each of these concepts.\n\n### What it means to be $RARE\n\nSuccessful tribes / movements are always built on shared values, common lore and a unifying vision of the future. America is an idea, not a place. And America *the idea* functions best when there is broad alignment (\"rough consensus\") amongst its people about their purpose in the world, and the values around which they ought to organize. Focus brings clarity of purpose, and clarity of purpose brings efficacy to collective action - whether for a group of 100 or 100 million.\n\nSuperRare was founded on a simple, yet powerful vision of the future: What if every artist could become their own creative & economic sovereign? In three short years we've made enormous strides toward making that vision a reality. But we've only just scratched the surface of what now seems possible. The time grows near for a digital renaissance, the likes of which we believe could transform art and culture all over the world.\n\nThe purpose of the new SuperRare Network is to accelerate this digital renaissance by making artists everywhere truly sovereign for the first time in history. Like the venetian traders of old, we believe artists could become a new digital merchant class, ushering in another golden era of artistic creation and cultural vibrancy.\n\nWhile we expect the SuperRare DAO to become increasingly more diverse, decentralized and heterodox as time goes on - our earnest hope is that all members of the DAO will take seriously the responsibility to engage with one another on the basis of shared values and common purpose. And that by doing so we can overcome the division and rancor that has afflicted so many online communities. The SuperRare DAO has the potential to lead by example and prove that with the right values, the right technology and the right shared vision of the future - we are capable of changing the world by empowering each other, both creatively and economically, utilizing blockchains and self-governance.\n\nLet us never forget why we're here: it's not about the money...*it's about the revolution.*\n\nFor art. For culture. And for the history yet to be written.\n\nOur time is now.\n\nPower to the artists ✊", "timestamp": 1630600430, "digest": "M9A9TbTMBkDD_No3Q0-LPjnq4OZxfDgxXKqBVLYRVDA", "contributor": "0x60E912290431D877489CDb74FA3C75A51575f57a"}
{"id": "PmBRbeFMcMNMAwLZwIaBQXN-aYfHIaavbb5n7UNbhn4", "title": "Community DAOs", "body": "In crypto land, 2020 was all about DeFi. So far, 2021 has been about NFTs (hot [jpeg summer](https://superrare.com/artwork-v2/summer.jpg-26722) anyone?)\n\n2022 will be all about Community DAOs.\n\n[https://twitter.com/Cooopahtroopa/status/1430694594753097728](https://twitter.com/Cooopahtroopa/status/1430694594753097728)\n\n> *Community DAOs = DeFi infrastructure + NFT business models + Creative Humans*\n\nCrypto isn’t just a technology, it’s an [internet-native economy](https://p.mirror.xyz/1EpvJwUpx_KlRcHOKLNqADEkwHL_Z1ZYKobF2uLwgBg). Revenue is tracked in ETH. Key decisions are made with community governance. Transactions are enforced on-chain through smart contracts. Treasuries are controlled via multi-sigs. And value is captured with tokens.\n\nDAOs are the native corporate structure of these crypto economies.\n\nInstead of being incorporated in Delaware or the Cayman Islands, DAOs are incorporated in Discord servers and blockchains. DAOs provide an internet-native way of pooling capital, making collective decisions, and capturing value.\n\nThe org structure of DAOs looks like modern day [cooperatives](https://en.wikipedia.org/wiki/Cooperative), but over the next decade I believe their scale and impact will rival some of the world’s largest public companies.\n\nThese days, it seems like there’s a DAO for pretty much everything; [Collecting NFTs](https://flamingodao.xyz/collection). [Socializing](https://www.fwb.help/). [Building software](https://twitter.com/prtyDAO). [E sports](https://twitter.com/blvkhvnd). [Musicians](https://songcamp.mirror.xyz/mkb-m9GWUCLByETAvCigJ0JIpz4XH8bwNDBtUJBPeFc). [Media](https://twitter.com/forefront__). [Education](https://twitter.com/seedclubhq). [Funding public goods](https://twitter.com/gitcoin).\n\nBut what makes a “DAO” a *DAO?*\n\n[https://twitter.com/josephdelong/status/1432728441481318410](https://twitter.com/josephdelong/status/1432728441481318410)\n\nAlthough the purpose, scale, and sophistication of DAOs can vary, most include the same core components:\n\n* **Group chat.** DAOs usually start off with someone saying “wouldn’t it be cool if…” and then adding a few frens to a Telegram group or Discord server.\n* **Treasury.** The most common type of Community DAO collects blue-chip NFTs and stores them in a multi-sig. As we’ve seen with [Party Bid](https://www.partybid.app/), people love aping into NFTs with their frens. It’s an experience. Community DAOs can also bootstrap their treasury through a [tokenized crowdfund](https://songcamp.mirror.xyz/mkb-m9GWUCLByETAvCigJ0JIpz4XH8bwNDBtUJBPeFc). This enables the DAO to fill their treasury with ETH to spend on operations and growth.\n* **Token.** As word gets out about how much fun your Community DAO is having, people start blowing up your DM’s begging you to let them in. At this point, many Community DAOs issue an ERC-20 token as a way to gate membership. Depending on the exclusivity of the Community DAO, membership can cost anywhere from a few dollars worth of ETH to a few mil.\n* **Governance.** Community DAOs with valuable treasuries and hundreds of members need a way to make collective decisions. Usually, rough consensus is reached in the group chat (with emojis, ofc) and the governance vote is just a formality. But it’s fun to see who voted, how much voting power they have, and what they voted for. Also, most Community DAOs empower small, focused teams of 5 to 10 members to own specific workstreams instead of requiring a governance proposal for every smol decision.\n* **On-chain cash flow**. This is the most nascent component of Community DAOs but also the most interesting. On-chain cash flow turns a fun group chat with your frens into a sustainable business. So far, the most common way to generate on-chain cash flow has been through NFT drops.\n\n**So, are these Community DAOs *actually* working?**\n\nOver the past few months, DAOs like [Fingerprints](https://fingerprintsdao.gitbook.io/fingerprints-dao/) and [Flamingo](https://twitter.com/FLAMINGODAO) have amassed five and six figure NFT collections.\n\n[https://twitter.com/awrigh01/status/1431778270727610371](https://twitter.com/awrigh01/status/1431778270727610371)\n\nDAOs like [Bright Moments](https://twitter.com/brtmoments) have sold millions worth of NFTs in minutes.\n\n[https://twitter.com/cryptovenetians/status/1427703534561206273](https://twitter.com/cryptovenetians/status/1427703534561206273)\n\n[Rabbithole](https://rabbithole.gg/), [Seed Club](https://twitter.com/seedclubhq), [Forefront](https://twitter.com/forefront__), and [FWB](https://twitter.com/FWBtweets) are becoming the premier on-ramps for the next wave of active contributors in crypto.\n\n[https://twitter.com/thattallguy/status/1422577245671936000](https://twitter.com/thattallguy/status/1422577245671936000)\n\nSome DAOs like [NounsDAO](https://nouns.wtf/) just leave you thinking WTF.\n\n[https://twitter.com/yossihasson/status/1430815200354111488?s=20](https://twitter.com/yossihasson/status/1430815200354111488?s=20)\n\nAnd don’t even get me started on [Loot](https://twitter.com/lootproject)…\n\n[https://twitter.com/john_c_palmer/status/1432606797186179072](https://twitter.com/john_c_palmer/status/1432606797186179072)\n\nMultiple [top](https://snapshot.org/#/friendswithbenefits.eth/proposal/QmUFFkMER4R54dnBRJXL3WTLsktfUTK8KrdTwBbZmRTjSn) [tier](https://www.usv.com/writing/2021/08/bright-moments-dao/) [VC](https://www.mechanism.capital/pleasrdao-thesis/) [funds](https://club.mirror.xyz/a5PQAwU0CuHJ90lEOmzq545nlC4qqNoTVTeHEGRrqow) have invested in these DAOs and I think they’ll end up becoming some of the best performers in their portfolios over the next decade.\n\n[https://twitter.com/FingerprintsDAO/status/1433171214969737219](https://twitter.com/FingerprintsDAO/status/1433171214969737219)\n\nIn the rest of this post, we’ll take a closer look at Community DAOs - how DAOs can become sustainable businesses, what the risks are, and what they may look like in the future.\n\n# Growing Community DAOs\n\nUnlike traditional startups, the *initial* purpose of most Community DAOs isn’t to maximize shareholder value. It’s about the vibes. People want to be surrounded by like minded individuals, make collective decisions, and move the community’s purpose forward.\n\n![thanks drizzy for the quick vibe check](https://images.mirror-media.xyz/publication-images/3c93cf33-7d15-44bd-b977-8d9d0b13a961.jpeg?height=500&width=625)\n\nBut given the growth of the broader crypto market, many of these Community DAOs are finding themselves sitting on [treasuries worth millions](https://etherscan.io/address/0x0BC3807Ec262cB779b38D65b38158acC3bfedE10) and ERC-20 tokens with [$100M+](https://coinmarketcap.com/currencies/friends-with-benefits-pro/) market caps. In just the past few months, they’ve gone from group chats to real businesses.\n\nOne of the keys to growing these Community DAOs will be recurring on-chain cash flow. There’s other important factors like community engagement, governance, tokenomics, etc. but generating on-chain cash flow gives Community DAOs capital to reward contributors, hire full time staff, and grow their treasury.\n\nBack in college, I studied Finance and one of the most boring things we learned was how to analyze a balance sheet. Turns out, it’s actually kinda useful.\n\nThere’s two types of assets on a Community DAO’s balance sheet:\n\n1. **Equity** (Blue-chip NFTs, Community DAO tokens, Crypto protocol tokens)\n2. **Cash** (ETH, USDC, DAI)\\*\n\n![FWB June 2021 Financials by Llama. Source: https://www.scribd.com/document/514782942/FWB-June-2021-Financials-by-Llama](https://images.mirror-media.xyz/publication-images/cb003939-eecf-4e09-acba-83e466da4d54.png?height=1090&width=1960)\n\n*\\*Technically ETH could be considered equity in the Ethereum network but for simplicity, let’s classify ETH as cash on the balance sheet since it’s the primary medium of exchange for DAOs*\n\nSo what can Community DAOs do with the cash and equity on their balance sheets? For many, crypto feels like a massively multiplayer [online game](https://www.notboring.co/p/the-great-online-game).\n\n[https://twitter.com/thattallguy/status/1432117673467416580](https://twitter.com/thattallguy/status/1432117673467416580)\n\nFor Community DAOs, the game is to increase the value of the treasury while maintaining the strong vibes that got the community going in the first place.\n\n[https://twitter.com/strangechances/status/1427454307339706389](https://twitter.com/strangechances/status/1427454307339706389)\n\nThere’s a few ways Community DAOs can put themselves in a position to win this game:\n\n* Collect blue-chip NFTs\n* Earn membership fees\n* Release NFT drops\n* Launch a tokenized NFT gallery\n* Build a media company\n* Sell SaaS tools\n* Invest in tokens (in DeFi protocols, NFT protocols, and other DAOs)\n\nLet’s take a closer look at each.\n\n***Collecting Blue-Chip NFTs***\n\nThis is the most common way Community DAOs get started.\n\nA group of frens want to collect blue-chips like [Punks](https://www.larvalabs.com/cryptopunks), [Autoglyphs](https://www.larvalabs.com/autoglyphs), [DEAFBEEF](https://www.deafbeef.com/), [Fidenzas](https://tylerxhobbs.com/fidenza), [Ringers](https://artblocks.io/project/13), etc. but don’t want to put all the capital up themselves. Instead, they pool their funds to purchase a portfolio of blue-chips.\n\nHowever, in practice, storing these NFTs in a vault is *illiquid.* It doesn’t directly generate revenue. As a result, some of these DAOs issue ERC-20 tokens as a way to let people speculate on the value of the underlying NFTs, earn trading fees, and decide when to sell. [PleasrDAO](https://twitter.com/PleasrDAO), one of the largest NFT Collector DAOs, [recently announced](https://pleasr.mirror.xyz/7hpdJOWRzQx2pmCA16MDxN2FiA3eY6dwcrnEtXKnCJw) a similar liquidity strategy for their 1 of 1 Doge NFT.\n\n[https://twitter.com/business/status/1432723721521876998](https://twitter.com/business/status/1432723721521876998)\n\nThis kinda ends up being like storing gold in a vault and issuing paper certificates against it ([sound familiar?](https://en.wikipedia.org/wiki/Gold_standard)). You can redeem your paper certificate for the underlying asset but you need to trust that the asset will be available and worth something when you want to redeem. But instead of gold and paper certificates we have blue-chip NFTs and ERC-20 tokens.\n\nTo be fair, some of these vaults are *extremely* valuable and have a damn good chance of being worth billions some day. So maybe instead of being like storing gold in a vault, maybe it’s more like owning equity in [iconic](https://very.auction/doge/doge) [internet](https://foundation.app/@NyanCat/nyan-cat-219) [culture](https://foundation.app/@DisasterGirl/disaster-girl-25046) and some of the most [valuable IP](https://www.hollywoodreporter.com/business/digital/uta-cryptopunks-nft-film-tv-vieo-games-1235005392/) in the world. But the reality is that in the near term, these vaults alone don’t generate recurring on-chain cash flow.\n\nInstead of near-term cash flow, these blue-chip NFTs serve as a focal point (or as crypto people would say: [“schelling point”](https://nav.al/schelling-point)) for top collectors, artists, founders, investors, and operators to get involved in the community.\n\nAs we’ll see in the next few sections, the most valuable aspect of these vaults stuffed with blue-chip NFTs is that *they attract human capital* that converts illiquid jpegs into cash on the balance sheet.\n\n***Membership Fees***\n\n[https://twitter.com/patrickxrivera/status/1427330975227330565](https://twitter.com/patrickxrivera/status/1427330975227330565)\n\nIdk about you, but the terms “follower” and “subscriber” feel weird to me. They imply a unilateral relationship. *I* follow *you*. *You* subscribe to *me*.\n\nBut the terms “member” and “owner” hit different.\n\n*We* are *members*.\n\n*We* are *owners*.\n\nIn web3, membership and ownership are encapsulated in tokens. Balances are stored on the blockchain. And your assets are controlled by your private key.\n\nIf the vibes are off in the community or you need liquidity after getting rekt by yet another degenerate yield farm, you can sell your tokens on an [AMM](https://coinmarketcap.com/alexandria/glossary/automated-market-maker-amm) or head over to the #otc channel in Discord to negotiate a fair rate. No questions asked.\n\nBut as the Community DAO increases the value of the treasury and demand for membership increases, the value of the underlying membership token increases.\n\nIf you were an early member of the community or earned a large allocation through your contributions, this can turn into meaningful wealth.\n\n![Membership in $FWB went from being worth $1,000 to $12,000 over the past month](https://images.mirror-media.xyz/publication-images/b906bb8e-f5f7-4fcb-971c-744a35cd59de.jpg?height=2138&width=1169)\n\nHowever, membership tokens aren’t just about “nUmBeR gO uP”. At a deeper level, the token is a coordination mechanism to help online communities *create*, *capture*, and *redistribute* value.\n\nAnd because token holders are also community members, they don’t need to fire up an Excel spreadsheet and make resource allocation decisions based on a DCF analysis. Unless they want to.\n\nInstead, Community DAOs invest in whatever they want. Sometimes that’s [donating to charities](https://nouns.wtf/vote/1). Other times that’s [popping bottles in Paris](https://gallery.fwb.help/fwb-paris).\n\n***NFT drops***\n\nThis is the most common way Community DAOs generate on-chain cash flow. Some of these drops post serious numbers. This past weekend, Bored Ape Yacht Club sold $92M worth of [Mutant Ape NFTs](https://opensea.io/collection/mutant-ape-yacht-club) in one hour.\n\n[https://twitter.com/Dogetoshi/status/1431792801751183363](https://twitter.com/Dogetoshi/status/1431792801751183363)\n\n[https://twitter.com/richerd/status/1431999591176572934](https://twitter.com/richerd/status/1431999591176572934)\n\nAnother one of my favorite drops recently was a collab between [Arihz](https://twitter.com/framergence) (an anonymous Brazilian computer scientist / NFT artist) and [FingerprintsDAO](https://twitter.com/FingerprintsDAO) (one of the leading collector DAOs for smart contracts as art). The drop was called [Avid Lines](https://avidlines.art/) and in the first 30 days, it’s done almost $10M in trading volume.\n\n[https://twitter.com/AvidLines/status/1430215479277146113](https://twitter.com/AvidLines/status/1430215479277146113)\n\nMore importantly, the drop was a great example of how to remix NFT IP in a fun and interesting way. It was a derivative of [Autoglyphs](https://www.larvalabs.com/autoglyphs), which is the most valuable collection in the FingerprintsDAO treasury.\n\nHere’s how it worked:\n\n* Minters chose an Autoglyph to use as the base input for the generative algorithm\n* Autoglyph holders could whitelist their Autoglyphs to receive 10% of primary sales for mints that used their Autoglyph as the base input\n* The generative algorithm combined the base Autoglyph input with Arihz’s randomization code and the output was a remix called Avid Lines (and they’re fvcking beautiful)\n\n[https://twitter.com/dgntec/status/1417936546079072256](https://twitter.com/dgntec/status/1417936546079072256)\n\nSome of the most popular NFT drops are derivative projects that take blue-chip NFT IP and remix them in a way that’s fun, game-like, and visually appealing. These derivative projects are interesting because *they take illiquid jpegs* stored in a vault and *turn them into productive assets*. Some Autoglyph holders earned $40k worth of ETH by simply calling a whitelist function on a smart contract.\n\nAs DAOs look for new ways to increase the value of the NFTs in their treasury, we’ll continue seeing more derivative drops like these that enhance the value of the core IP while also turning NFTs into productive assets.\n\n***Tokenized NFT Gallery***\n\nMost Community DAOs don’t have their own tokenized NFT gallery yet. But in the near future I think it’ll become one of the most popular ways for Community DAOs to generate on-chain cash flow.\n\n[https://twitter.com/andy8052/status/1430715288622936066](https://twitter.com/andy8052/status/1430715288622936066)\n\nThe basic idea is:\n\n* Members use the Community DAO token to vote on which artists / drops can mint on their site\n* Multiple drop mechanisms are supported (reserve auctions, dutch auctions, editions, raffles, airdrops, generative, etc.) by letting devs register smart contracts with the DAO’s NFT gallery registry\n* Revenue from primary and secondary sales is shared between the artist, dev team, and DAO treasury\n* Artists, collectors, dev teams, and other contributors receive Community DAO tokens\n* Token holders get access to members-only features like exclusive drops, NFT badges, discounts, physical prints, merch, and more\n\nThis allows Community DAOs to build their own NFT marketplaces while rewarding token holders, artists, collectors, and devs with a mix of cash and equity. The curation abilities of top Community DAOs will eventually turn these NFT galleries into incubators for emerging artists.\n\nFor example, if you’re a generative artist and FingerprintsDAO votes you into the their gallery, it’s basically like being a fashion designer and getting your latest clothing line in Vogue. This creates a reflexive feedback loop where the top Community DAOs build status by curating high-quality NFT collections and then help the next generation of artists get distribution while earning fees.\n\nIt’s kinda like [CAA](https://en.wikipedia.org/wiki/Creative_Artists_Agency) or a [record label](https://jarroddicker.medium.com/?p=e14b695c43b) for internet culture. But now the agents are fans, builders, and creatives.\n\n***Owned Media***\n\nBuilding media properties isn’t as sexy as a tokenized NFT gallery, but they work. Start a podcast and / or newsletter, find some sponsors, and boom. There ya go.\n\nThe top Community DAOs should have a pretty easy time finding sponsors given their community is filled with progressive individuals with cash to spend on random stuff like digital pet rocks.\n\n[https://twitter.com/LoganPaul/status/1431242146309238791](https://twitter.com/LoganPaul/status/1431242146309238791)\n\n[Club Top Shot](https://twitter.com/clubtopshot) is one of my favorite examples of a media company being built around an NFT collection.\n\n[https://twitter.com/ClubTopShot/status/1430519333613096964](https://twitter.com/ClubTopShot/status/1430519333613096964)\n\n[UTA](https://en.wikipedia.org/wiki/United_Talent_Agency), one of the premier Hollywood talent agencies, [recently signed](https://www.hollywoodreporter.com/business/digital/uta-cryptopunks-nft-film-tv-vieo-games-1235005392/) Larva Labs (creator of CryptoPunks, Autoglyphs, and Meebits) and will represent them across film, TV, video games, publishing, and licensing. Imagine Kevin Hart being the voiceover for a CryptoPunk or Meebit in a Netflix show lmfao. I’d watch that in a heartbeat.\n\n[https://twitter.com/punk4156/status/1432764961227481089](https://twitter.com/punk4156/status/1432764961227481089)\n\n***SaaS Tools***\n\nMost Community DAOs go through the following cycle pretty much every week:\n\n* A problem surfaces that needs to be solved\n* Somebody does research on the existing tools\n* Turns out none of the tools do exactly what the community needs\n* *\\*Ugh\\**\n\nFWB is one of the most active DAOs in building custom tooling for their community. When they needed a way to token-gate IRL events, [they built it](https://fwb.mirror.xyz/XU5_RYsow8fDbbckryr2snNyfrMV8HTJ0N39Cjkfy3s). When they needed a dashboard to highlight key information about the community, [they built it](https://fwb.mirror.xyz/KhvEi3kHy6rBJX9Lm4DI-iMkbzebEyNdM05uAB_StGY) (and it’s [vibey af](https://www.fwb.help/pulse)).\n\nA key thing FWB got right early on was seeding the community with high-quality members. Then, token-gating membership was a kind of “proof-of-work” to ensure that only the most committed people would join the community and renew each season. This created a positive feedback loop where talented people get in, those people started building and shipping products, more talented people got interested and joined, more problems surfaced, and more problems got solved.\n\nAs Community DAOs become aggregators for top talent in crypto, we’ll see more custom tooling built to serve the broader community. And similar to how YC startups usually get initial distribution from other startups in their batch, Community DAOs will get their initial distribution from the other DAOs and projects their community is involved with.\n\n***Tokens (DeFi protocols, NFT protocols, and other DAOs)***\n\nIt’s been interesting to see DAOs align incentives by investing in each other. A few months ago FWB and WHALE did a [token swap](https://snapshot.org/#/friendswithbenefits.eth/proposal/QmWnifY3KD5ECJNtQ23m9GHt2oQ1McA3T4DEEpFarPy9jW) where the stake in $FWB was valued at $100k. Today, that stake is worth $1.5M.\n\nGiven the amount of human capital inside these DAOs, most crypto protocols will probably have a few DAOs on their cap table as strategic investors helping with distribution, connections, and domain expertise. As the crypto market grows, these DAO-to-DAO stakes could end up being very, very large. These stakes will also create a new type of mutual alignment at a level we haven’t seen before in the competitive world of business.\n\n# Risks\n\nLike any investable asset, Community DAOs live along a risk-reward spectrum.\n\nSome of the main risks of Community DAOs include:\n\n* **Bad OpSec.** A DAO’s assets (NFTs, ETH, and ERC-20s) are stored in a smart contract that lives on the blockchain. Usually, the contract is a multi-sig wallet controlled by a trusted group of community members. To withdraw assets, a threshold needs to be reached where multiple people sign a transaction with their crypto wallet to authorize it. This prevents one of the signers from going rogue and rugging the community. Or in case one signer loses access to their private key, there should be enough redundancy in the system that transactions can still be signed and submitted. Ideally, we remove the need for any trusted parties and integrate governance with trustless transaction execution through something like [SafeSnap](https://blog.gnosis.pm/introducing-safesnap-the-first-in-a-decentralized-governance-tool-suite-for-the-gnosis-safe-ea67eb95c34f). But in practice, most communities will require some level of trust in a select group of community members to ensure assets are stored and managed securely.\n* **Potential ETH / NFT crash.** Are NFTs in a bubble? Probably. The recent run up in prices mimics the boom and bust nature of [most technology cycles](http://lao8n.com/blog/2015/12/3/carlota-perez-technology-revolutions-financial-capital). If ETH prices crash, Community DAOs will have less cash on the balance sheet and will need to mark down the book value of their NFT assets. It’s a real risk. Many DAOs implement treasury diversification strategies with the help of domain experts like [Llama](https://www.llama.xyz/) to ensure they’re able to weather a bear market. DAOs can convert ETH to stables like USDC or DAI to protect against ETH volatility. The best DAOs will have recurring on-chain cash flow and efficient cost structures that enable them to weather a bear market.\n* **Lack of community engagement.** People are the heartbeat of any community. DAO or otherwise. The best Community DAOs have a mission that goes much deeper than “nUmBeR gO uP”. Collective action towards this mission is what keeps the core contributors and active community members coming back every day. But when people get distracted by token prices, or the core team loses interest, culture deteriorates. The magic of these Community DAOs are the people. The Discord mods that stay up all night answering questions. The volunteers that write documentation to help new members. A lot of the most valuable work in communities goes unnoticed and unrewarded. Community members need [intrinsic motivation](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5364176/) to drive the community forward. Otherwise, the community will slowly devolve into just another inactive group chat.\n* **Poorly designed tokenomics.** The two biggest risks with tokenomics are: 1) the core team not having a large enough stake to keep them incentivized and 2) adversarial whales accumulating too many tokens and using them to manipulate the network through governance and / or negative price action. We’re still in the early stages of understanding best practices for Community DAO tokenomics. Many communities bring on experts like [Fire Eyez](https://medium.com/fire-eyes-dao), [Delphi Digital](https://twitter.com/Delphi_Digital), and [Gauntlet](https://twitter.com/GauntletNetwork) to help develop a robust token strategy.\n\n# Future of Community DAOs\n\nHere’s a few predictions on the future of Community DAOs:\n\n* **There will be many billion dollar Community DAOs.** This probably isn’t controversial amongst crypto-natives but if you take a moment to think about it, it’s pretty wild. Online communities live across Discord servers, Telegram chats, Twitter DM’s, FB groups, Patreon, etc. A DAO structure gives these online communities the ability to coordinate capital, make collective decisions, and capture value with an internet-native currency. The canonical example of a community that could’ve used this functionality is [r/wallstreetbets](https://www.reddit.com/r/wallstreetbets/) during the [GME short squeeze](https://en.wikipedia.org/wiki/GameStop_short_squeeze). Aside from just investing, I think there will be billion dollar community DAOs across gaming, publishing, music, education, art, software development, and more.\n* **Community tokens > Social tokens.** For the past couple years, social tokens were a hot topic when discussing the future of crypto-native consumer apps. The thought went, *“wouldn’t it be cool if you could invest in people the same way you can invest in stocks?”* [Bitclout’s](https://bitclout.com/) initial traction was a sign that there’s demand for this type of product. But social tokens focused on one person can lead to burnout, mental health issues, and regulatory risk. So instead of social tokens focused on individual people, I think *community tokens* focused on the *collective efforts* of groups of people will become the dominant model. Investing in the Mr. Beast token is boring. Being a member in the Mr. Beast community is fun. Social tokens feel like a top-down approach. A creator and their management team retains full control over creative decisions and IP. But as we’re seeing with [BAYC](https://boredapeyachtclub.com/) and [Loot](https://twitter.com/lootproject), bottoms-up decentralized communities with the right incentives have the potential to create much more value than a centrally coordinated effort. In the previous, open source projects like Android and Linux didn’t have a native business model. But now ERC-20 tokens and NFTs give open source software a business model. And not just open source software, but also open source IP. To me, social tokens are imply a top-down centrally coordinated effort whereas community tokens imply a bottoms-up decentralized community with full access to the underlying IP. The latter is much more crypto-native and paves the way for a level of combinatorial creativity that we haven’t really seen before.\n* **Service DAOs will play a key role in scaling Community DAOs.** In crypto, there’s a whole new set of specialized skills needed to build a successful project. Things like tokenomics, treasury management, community management, onboarding, governance, smart contract development, data science, protocol security, OpSec, etc. Because there aren’t many experts in these areas yet, we’re already seeing crypto-native agencies (i.e., “Service DAOs”) that aggregate the best talent for a specialized skill and provide services to other DAOs. There’s [Llama](https://www.llama.xyz/) for treasury management, [Fire Eyez](https://medium.com/fire-eyes-dao) for tokenomics, and [Vector](https://twitter.com/VectorDAO) for designing crypto apps. Service DAOs combine the flexibility of freelancing with the upside of startups. Most get paid in a combination of ETH and ERC20-tokens so there’s skin-in-the-game and aligned incentives. As these Service DAOs build out their processes, hire more talent, and build software to automate their services, it’ll be much easier for Community DAOs to solve some of their toughest problems and help them scale.\n\n# Closing Thoughts\n\nCommunity DAOs are the next evolution in online communities. It’s like if subreddits had a shared bank account, a token, and governance mechanisms. They’ll become the [new social networks](https://www.notboring.co/p/status-monkeys). And the best way to learn is by actively contributing.\n\nHere’s what I usually share with friends interested in contributing to Community DAOs:\n\n* Join 3 to 5 Discord servers to get a sense of the different vibes\n* Introduce yourself in the #introductions channel and read the other intros to get an understanding of who’s in the community\n* Find two or three channels that are most relevant to you and check them multiple times a day. Ask questions. Answer questions. Offer encouragement.\n* Read the governance forum to understand what the top priorities are for the community and how they make decisions\n* Attend voice chats to build relationships with the most active contributors\n* Now, after this initial research phase, choose the top one or two Community DAOs you vibe with and *double down* on them\n* Find a committee you can help with and work on a project. As you get more comfortable, take on a leadership role\n* Try to get rewarded with the Community DAO’s token to align incentives and truly become an owner in the community\n* Iterate and repeat\n\nThe DAO maestro himself [Coopahtroopa](https://twitter.com/Cooopahtroopa) recently published [an article](https://coopahtroopa.mirror.xyz/_EDyn4cs9tDoOxNGZLfKL7JjLo5rGkkEfRa_a-6VEWw) with a bunch of DAOs you can contribute to as well as a list of people to follow.\n\n[https://twitter.com/Cooopahtroopa/status/1432403329422741504](https://twitter.com/Cooopahtroopa/status/1432403329422741504)\n\nThe demand for talent in the space far exceeds supply so if you’re at all interested, don’t hesitate to jump in and start contributing.\n\nUntil next time ✌️\n\n\n---\n\n*Shoutout to [Coopahtroopa](https://twitter.com/Cooopahtroopa), [Elena](https://twitter.com/VirtualElena), [Chase](https://twitter.com/chaserchapman), [Dame](https://twitter.com/jacksondame), [Nir](https://twitter.com/nir_III), [Li](https://twitter.com/ljin18), [Jarrod](https://twitter.com/jarroddicker), and [Louis](https://twitter.com/albiverse) for their feedback on this post. And to the Mirror team for many conversations on Community DAOs.*\n\n*Feel free to DM me on Twitter with any questions, comments, or memes [@patrickxrivera](https://twitter.com/patrickxrivera).*", "timestamp": 1630600270, "digest": "cVN3KOss0uqpZwxHQKtC4Syvn1RfXaxofFKHJuKLWS4", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "6HPMr6KUNMQdbO0xZVuxveZeGrU8h3wNYK_Dkb_VWgQ", "title": "Scarcity Networks: Social Networks on Web3", "body": "The power of web3 is what originally got me into crypto. I analyzed the web2 platforms as an equity research analyst at Barclays, and immediately recognized the potential of web3 to fix much of what I thought was broken in web2 social networks.\n\nEarly conversations about blockchain-based social networks were mostly focused on what could be accomplished by leveraging a different data structure, centering the conversation on “data ownership,” privacy, and digital identity. The switching argument was values-based and not compelling enough for most to deal with any degree of friction on decentralized networks.\n\nNow, as social networks begin to blend with DeFi, the switching argument is about economic incentives, rather than moral imperatives, and the novel functionality they offer: publicly trade and display cultural symbols; invest with and in your friends; earn your way into exclusive social circles; connect directly with your favorite creators; prove ownership of digital assets. Eventually, activity on these networks will create an open social graph that is used to offer better DeFi rates and/or lower collateralization ratios. These new social networks combine social and financial capital, making them approachable to the mainstream in a way that DeFi wasn’t. Everyone understands social capital.\n\n[https://twitter.com/StaniKulechov/status/1427681957291376643](https://twitter.com/StaniKulechov/status/1427681957291376643)\n\nArguing about whether DeFi is more important than NFTs or whether NFTs, DAOs, or Social Tokens will reign as the dominant social networks of web3 misses the point. Their interconnectedness is what makes web3 so powerful. NFTs create an impetus for people to quickly spin up DAOs, which then serve as NFT market makers. NFTs will act as keys to DAOs, governed according to social token ownership. The metaverse is comprised of the combination of these things, which, in turn, only increase the importance of being able to prove digital ownership. DeFi makes these networks possible and all the activity on these networks will be used to amplify DeFi. Save the tribalism for Punks vs. Apes.\n\n[https://twitter.com/ianIDEO/status/1429156970645233670](https://twitter.com/ianIDEO/status/1429156970645233670)\n\n## Web3 is Not a Protest, it’s Closer to a Cultural Movement\n\nTo understand what’s happening with web3, we need to quickly revisit the shortcomings of web2 social networks. In short, web2 platforms own your online identity and social graph and hold all the power, the business model is extractive to the user and the incentives create a terrible user experience (low signal engagement, disinformation, high ad load, etc.) Web2 social networks suffered as they scaled, weakly connecting people within an increasingly less exclusive network. Web2 lost any sense of belonging.\n\nSocial networks combined with elements of DeFi flip many of the web2 incentives but they’ll still be subject to the worst of human nature (after all social networks are built on human interactions.) They’ll still revolve around status and image, but should be much higher signal as web3 is built around ownership rather than indication. Web3 still requires you to be part of a club/clique to participate, but it clearly specifies the process and cost of joining. Web3’s immutable ledger creates accountability where web2 has none, and on-chain interaction encourages less noise and higher quality engagement. It’s still signaling, but it’s more costly and, therefore, more credible.\n\nWe originally thought web3 would be built on trust, but turns out it’s actually built on scarcity. The downside is that scarcity networks create FOMO by design, are exclusive by definition, and encourage impulsive behavior as being late carries the risk of being shut out entirely. The benefit is that scarcity will also allow web3 social networks to more effectively scale. The ability to easily spin up DAOs in web3 means that the number of communities can scale rather than the size of the network. Since these communities reward early adopters, gradually converting social capital into financial capital, they offer compounding benefits as they grow.³ An open social graph describing all of this activity would be more powerful than anything that could be built on web2.\n\n[https://twitter.com/TrustlessState/status/1429890905163517958](https://twitter.com/TrustlessState/status/1429890905163517958)\n\nWeb3 social networks should also be better at continuously reinventing themselves,² since they determine their own outcomes, in contrast to web2 platforms which lost relevance with many of their users years ago. Web3 participants are (literally) invested in the communities they join, which should help maintain quality over time. The best creators and contributors will migrate to web3, rather than stay on on rent-seeking web2 platforms. Web2 platforms and corporate brands will continue to try, but they cannot reverse engineer these dynamics. This revolution has to occur at the protocol layer.\n\n[https://twitter.com/ianIDEO/status/1403753637633875968](https://twitter.com/ianIDEO/status/1403753637633875968)\n\nWe originally thought web3 would be a protest against web2 monopolies but it looks more like a cultural movement. While culture may be the hook that draws new people into the ecosystem, most of the activity currently occurring on these networks is only partially about culture, at best.\n\n> ***If the mantra of web2 was “come for the tool, stay for the network”, the mantra of web3 is probably closer to “come for the culture, stay for the returns.” And the returns are why most people are involved right now.***\n\n![](https://images.mirror-media.xyz/publication-images/8dcef255-12b3-4a05-b0e3-345ddf4d2082.jpg?height=475&width=1165)\n\nEach social component of web3 represents a slightly different value system, but they’re all built on the same principle: scarcity.\n\n## NFTs: The Content Layer - Not Just a Status Symbol\n\n*Web2 analog: NFTs combine elements of Instagram (influence and image) and LinkedIn (status and prestige.) Depending who you ask, owning a Punk is either like owning a Ferrari or [having gone to Harvard](https://twitter.com/Iiterature/status/1423657661162311686).*\n\n![https://twitter.com/HarryBTC/status/1416435920061018119](https://images.mirror-media.xyz/publication-images/dad8812a-f4b3-42b9-a757-718b56262ec8.jpg?height=1080&width=1920)\n\nMost people attribute the recent NFT mania to two things 1.) NFTs as a store of value 2.) NFTs as a status symbol. I think it’s true that the market is at least partially driven by people looking for non-$ denominated stores of value in an inflationary environment. Afterall, [Visa bought a cryptopunk before they bought bitcoin](https://www.cnbc.com/2021/08/23/visa-buys-cryptopunk-nft-for-150000.html). But NFTs are also about status (sorry if you thought this was about art). Wealthy people have always used expensive items to signal status, whether it be fine art, yachts, private jets, or handbags.¹ NFTs just make ownership of those items verifiable and public.\n\n> ***It’s not really socially acceptable to have a profile picture (PFP) of your Lambo, but you’re encouraged to display your Punk. MTV Cribs existed to solve this exact problem— how do I flex my otherwise hidden wealth? NFTs.***\n\nPublic display of these status symbols actually drives more demand for them, playing to our natural [mimetic desires](https://en.m.wikipedia.org/wiki/Mimetic_theory). A public ledger also creates bragging rights in that we now have proof that someone got in early, spotted that trend before everyone else, is a die hard fan. Immutable proof that you’re cool. How much would you pay for that?\n\nBut there is something more going on with NFTs. It’s not just about status anymore than they’re just a store of value. People held Punks long before they were a flex, and if you ask anyone trading NFTs, they’ll tell you that selling them is the worst part. Maybe that’s because when you sell your NFT, you also lose your tribe. An NFT bonds you with your fellow Apes and communicates to everyone that you belong to a certain group. The public ledger also ties you to a lineage of everyone who has ever owned that NFT. This not only adds [a whole new dimension of value to digital art](https://twitter.com/santiagoroel/status/1431731996607275010), it elevates you into a new social standing and even ensures your legacy in a way (you’re now an unforgettable part of history.)\n\n[https://twitter.com/0xSisyphus/status/1429193578664837121](https://twitter.com/0xSisyphus/status/1429193578664837121)\n\n### No Real-time Feedback Loop\n\nA huge tenet of web2 platforms is that they support real-time feedback loops (Reddit, Discord, Twitter, Tik Tok, etc.) NFTs do not right now. NFT markets are illiquid and price discovery is still inefficient. In other words, NFTs aren’t good at conveying real-time information yet, meaning status is mostly inferred. We know it’s worth something, but we don’t really know what.\n\nThis won’t last for long. Almost every CeFi exchange is building an NFT marketplace and there are many startups working on the “financialization of NFTs.” However, these inefficiencies are part of what enables outsized financial returns. While DeFi maximalists love to hate NFTs, the NFT market feels pretty degen.\n\n## Social Tokens: The Social Graph - Exclusivity\n\n*Web2 analog: Social Tokens are similar to TikTok, in that they allow anyone to go viral. They also represent the web2 shift away from crowded networks to private messaging groups, discord servers, etc.*\n\n*NFTs have utility beyond collection. One of the things they can be used for is as keys that unlock access to creators and communities.*\n\n![Ihttps://future.a16z.com/creator-before-community/](https://images.mirror-media.xyz/publication-images/e8d95ead-e8cd-492c-a139-7e74762f7066.jpg?height=464&width=885)\n\nSocial tokens are digital assets backed by the reputation of a brand, individual or community.3 They can be fungible or non-fungible. Supply can be fixed or determined by a bonding curve (so that price increases along with distribution of the token.) They fall into two categories: personal tokens (fan clubs) and community tokens (social circles.) Both give holders exclusive access to a person or community. Personal tokens can be launched more quickly versus community tokens, which require coordinating a group towards a shared vision. However, community tokens may benefit from broader distribution, which has proven important in web2. As of Dec 2020, the total marketcap of all social tokens was $81M, now the marketcap of $FWB (one of the most prominent community tokens) alone is $180M.\n\nAll of these tokens rely on the belief that a creator or community will become more valuable tomorrow than it is today. Some represent Income Sharing Agreements (ISA), but others grant access to a newsletter, a private chat, or even a voting system that lets people[ dictate a creator’s daily habits](https://www.coindesk.com/man-who-sells-himself-now-wants-buyers-to-control-his-life) ($ALEX). The artist[ Connie Digital](https://twitter.com/conniedigital?lang=en) rewarded $HUE holders with a shout-out on a virtual billboard. The rapper Lil Yachty issued surprise boxes and virtual parties exclusively to $YACHTY holders. $WHALE issued a social token, backed by top NFTs, that holders can use as a payment method on OpenSea.7 Grammy-award winning musician RAC and NBA point guard Spencer Dinwiddie have also introduced tokens to give fans a stake in their success.⁶ Community tokens often grant access to an exclusive newsletter, discord server, and token-gated IRL events.\n\n### A Different Type of Walled Garden?\n\nScarcity is a double edged sword for social tokens as it means as membership grows, entry becomes inaccessible to most ($FWB membership is now priced at +$14,000). These communities will need to experiment with tiered models, in which entry level membership is lower cost and higher levels of membership can be earned through more active participation. Most token communities are introducing the concept of seasons and performance-based systems to avoid free-rider problems anyway.\n\n> ***While scarcity improves scalability, if it comes at the expense of accessibility, we’ll just end up with a different type of walled garden.***\n\nOne way to reduce this tendency could be to build these communities on a combination of both fungible and non-fungible tokens. An NFT could serve as the key to a community (and even different cohorts, tiers, or functions within that community) and then social tokens could be used to determine ownership and influence (via governance stake) within that community.\n\nSocial tokens have many potential benefits but they also run the greatest risk of amplifying the more toxic dynamics of web2. These risks will be magnified with social tokens that are purely speculative (don’t grant any access or non-financial rewards to holders.) Creators or influencers should have full autonomy over their tokens, or at least be required to opt-in. After all, social tokens invite the public to openly speculate on a person or group’s worth. I can’t think of a scenario in which being able to short a personal social token wouldn’t be problematic. Social tokens quantify popularity and create an in-group. Membership should probably be earned rather than bought.\n\n## Social DAOs: The Aggregation Layer - Social Circles\n\n*Web2 analog: DAOs, literally and figuratively, are a Discord. DAOs also enable Wall Street Bets (partybids) to actually win against Wall Street sharks (whales) and turn web3 into a MMORPG.*\n\n*Amidst this explosion of NFTs and social tokens, DAOs will play the role of aggregator. Aggregators accrued most of the value in web2 and, in web3, DAOs will aggregate by collecting, curating, and moderating.*\n\n![https://coopahtroopa.mirror.xyz/_EDyn4cs9tDoOxNGZLfKL7JjLo5rGkkEfRa_a-6VEWw](https://images.mirror-media.xyz/publication-images/4e0459c1-39ab-432b-87ca-db12d1c9ed5f.jpg?height=596&width=1071)\n\nDecentralized autonomous organizations are internet-native collectives that share resources, build products, and work together toward common goals.5 DAOs aren’t new (remember The DAO circa 2016?) but they’ve seen a recent resurgence. In 2019, DeepDAO only recorded 10 DAOs. That number is now 133. This increase was driven by a variety of factors including the launch of DeFi protocol governance tokens, some legal frameworks out of Wyoming and Delaware (series LLCs), and the rise of the NFT market, which created an impetus for the quick formation of DAOs to pool capital together in pursuit of an otherwise unobtainable NFT. Who knows, maybe DAOs become the social clubs of the metaverse.\n\nSocial DAOs are the most explicit mechanism by which to combine both social and financial capital. They create digital social circles and can also empower a collective of individuals to flip power dynamics against wealthy individuals. In NFT bidding wars, they can empower a group of individuals to overtake an individual whale (sometimes causing them to switch sides and join the DAO). They also enable co-creation and collective participation in a way that isn’t really possible on web2.\n\n> ***Yes, DAOs are more about community than scarcity. However, they are still scarcity networks as you either have to be asked to join or buy your way in (usually at an increasingly expensive price).***\n\n### We Have the Network, but Not the Tools\n\n![](https://images.mirror-media.xyz/publication-images/5627c193-3d71-44a8-bcd0-4ad52d494af2.jpg?height=665&width=1151)\n\nDAOs are not really DAOs yet, meaning most are not actually decentralized, autonomous, or organized. In theory, DAOs reduce coordination costs. In practice, they might even increase them. Common pain points include: lack of regulatory clarity, keeping up with communications and proposals, treasury management, division of labor, allocating payments to members, (semi)-centralized operations, and community selection and engagement. This last point is becoming more important as DAOs mature and people realize the importance of carefully curating a committed community.\n\n## A Social Protocol: The Reputation Layer - Credibility\n\n*Web2 analog: Twitter + Facebook, but built on Ethereum. On-chain interactions (NFTs, social tokens, and DAOs) create an open social graph that can be leveraged by social protocols.*\n\nAll social networks start with identity, create a graph between identities, and then attempt to infer things from that graph (reputation, for example.) In web3, ENS + MetaMask replaces SSO as the de facto log-in, allowing web3 identity to integrate with applications beyond a given identity provider’s ecosystem. Eventually wallets will become more like profiles, with native NFT integration for profile pictures, Rabbithole integration for on-chain resumes, and mirror + NFT marketplaces for on-chain portfolios. Interactions between identities will be combined to create an open social graph. Of course, not all interactions will be on chain, but what settles on-chain will allow developers to:\n\n* Create friend-matching mechanisms based on NFT ownership, DAO membership, social token ownership, and protocol usage\n* Better curate communities\n* Establish community-based delegated credit based on proven membership in particular DAOs\n* Develop a[ web of trust](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3375436), the ultimate path towards decentralized reputation and un/undercollateralized lending which ties all of the activity on web3 social networks right back to DeFi again. Social tokens could be used as collateral to bootstrap reputation until we have a full web of trust\n\n  [https://twitter.com/jbrukh/status/1419773010425401353](https://twitter.com/jbrukh/status/1419773010425401353)\n\n\n### It’s Always about Identity\n\nThe non-persistence of online identity is probably the biggest obstacle to effectively utilizing this open social graph. As web2 evolved, users moved away from using their real identities. Finsta, anon, and alt accounts became the norm. On web3 people have public .eth addresses complemented by many other private addresses. Identity is important to social protocols, though, because it creates social accountability, which is totally missing in web2 and DeFi. Incentives (different levels of access or better DeFi rates) could be offered for higher levels of attestation, which could include Proof of Humanity, POAP, and Proof of Participation. Incorporating zero-knowledge proofs into these solutions could help balance verification and privacy. Personal social tokens could also be used as a sort of identity proxy, providing an alternative to hardcoding identity on-chain for those that value privacy more highly.\n\n![Based on https://twitter.com/thattallguy/status/1413631784135192576](https://images.mirror-media.xyz/publication-images/7da1ebba-59e7-4624-80c3-983a21f785d0.jpg?height=356&width=1026)\n\n## Web3 Will Not Fix Everything\n\nSocial exchange theory totally broke down on web2.[ Key concepts of social exchange theory](https://start-thinking.com/sm-and-comm-theories) include reciprocity, fairness and negotiated rules, with information, approval, respect, power, group gain and personal satisfaction among the rewards in successful transactions. Web3 restores critical elements of social exchange.\n\n> ***That said, technology doesn’t eliminate natural human instincts and, therefore, technology alone won’t prevent some of the toxic elements of web2 from creeping into web3.***\n\nWeb3 will still be about brand and status, cliques and clubs, and one-upping everyone else. Web3 is still addicting — just ask anyone on OpenSea at 4am. Nobody really knows the consequences of day-trading culture and scarcity networks that reward status and profit above all else. People who can’t afford to will lose millions trying to fit in.⁴ This system of in-groups will exacerbate the industry’s lack of diversity.\n\n> If web3 really is about culture, then we should ask ourselves how representative the culture we’re talking about is and if these networks are actually open or designed to reinforce [preferential attachment models](https://en.m.wikipedia.org/wiki/Preferential_attachment).\n\n[https://twitter.com/StaniKulechov/status/1430997412756262914](https://twitter.com/StaniKulechov/status/1430997412756262914)\n\nThe biggest opportunity web3 has relative to web2, is that web3 doesn’t have to be zero-sum. It’s multi-player and participants literally have a vested interest in each other and the quality of the communities they build. The value generated by web3 should at least accrue to those creating art, contributing content, and building lasting communities rather than siloed monopolies. Participants will finally have a voice and a vote.\n\nIt feels like we are at a web3 inflection point, but we are nowhere near mainstream yet. NFT users are in the lower double digit millions relative to the roughly 4 billion users of web2 social networks. Web2 social networks have generated trillions in marketcap…. imagine what web3 can generate and then consider that it more effectively scales.\n\nPeter Thiel has[ a theory](https://sacks.substack.com/p/your-startup-is-a-movement?r=5eprj&utm_campaign=post&utm_medium=email&utm_source=twitter%20Looks%20rare.) that the best startups are like cults that believe something true. Web3 certainly feels like a cult and whether we believe it’s about culture, status, or scarcity, the value it’s creating is undeniably true.\n\nWeb3. Looks rare 👀\n\n\n---\n\nI used to be a professional ballerina. Then I was a banker. Now I do crypto. I don’t know if I’m doing this right. [Get in touch!](https://twitter.com/j_humenansky) I probably want to join your DAO.\n\nThank you to the following for generous feedback: Dylan Hunzeker, [Chris Kurdziel](https://twitter.com/ckurdziel), [Medha Kothari](https://twitter.com/medhakothari), and [Matt Stephenson](https://twitter.com/stephensonhmatt).\n\n1. [Status Monkeys](https://www.notboring.co/p/status-monkeys)\n2. [Jesse Walden](https://twitter.com/jessewldn/status/1424909172940886018%5D)\n3. [Coophatroopa](https://twitter.com/Cooopahtroopa)\n4. [Proof of Passion](https://tals.substack.com/p/proof-of-passion)\n5. [Chris Dixon](https://mobile.twitter.com/cdixon/status/1427452469303418899)\n6. [Bankless](https://newsletter.banklesshq.com/p/the-bull-case-for-social-tokens.)\n7. [Individual Before Community: Why Creator Tokens Will Precede Community Tokens](https://future.a16z.com/creator-before-community/)", "timestamp": 1630602516, "digest": "dQtmHWtUcUsb_-rUtOgc8fzCn5z6lw1cLoMcswykV3I", "contributor": "0xeD11c993Cae7Fc4aAb522c9e3986B233657efc66"}
{"id": "nqyCmRGifY03f1VTKdU0AsYCtG4qJRySM14qC69SObg", "title": "Test NFT Airdrop", "body": "[edition-airdrop://0x63bE2DE3906AEbA2DA3B843a52258753E51EDd7B?editionId=0](edition-airdrop://0x63bE2DE3906AEbA2DA3B843a52258753E51EDd7B?editionId=0)\n\n", "timestamp": 1630603640, "digest": "qrtZOH0-2W50F-z7tyFrZpyUqefr1S9Jxfpl-DJCWrs", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "falefA5gIz9Ba5DAaztbORb47_U7fzAvgXymAqVkShc", "title": "How to attract high-quality talent for your DAO?", "body": "*Hey there! [Coinvise](https://www.coinvise.co/) is a web3 platform that helps creators & communities build and manage their Social Tokens. You can join the [community here](https://discord.gg/GQNx6HpW). If you find this essay interesting, make sure to follow Coinvise on [Twitter](https://twitter.com/CoinviseCo). Enjoy! 🔥*\n\n![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F326254dd-ea46-4fdb-9b64-2c134563bb21_3001x1501.png)\n\nCreator DAOs are on the rise, and we're seeing more and more creators building tokenized communities.\n\nWhile in Web2 creators mostly have an audience, Web3 and new crypto mechanisms allow them to create a strong community towards a joint project. While an audience is passive, a community is engaged, creating a complete paradigm shift in the way creators interact with fans.\n\nIndeed, while in Web2, it mainly was a creator and its fans, in Web3, it's much more a leader that achieves a broader goal by leveraging its community toward a joint project. With high-quality members keen to help a project grow, a singer could leverage its community to create an album, incentivizing its fan to create designs, helping them with marketing, etc.. The creator could them reward fans with Social Tokens, that, if the project succeeds, will gain in financial value. Aligning incentives is everything, and the power of a community can truly be outstanding.\n\nIt is, however, not a small task to attract high-quality talents as there are hundreds of exciting projects going on. So how to attract those top talents to help you achieve broader goals?\n\nThree mains parameters have shown their efficiency in previous DAO experiments: Having a strong culture, a well-designed onboarding flow, and creating good incentives.\n\nIn this essay, we will go through those three parameters and try to guide you on how to attract top talents to your DAO.\n\n### 1 - Having a strong culture\n\nCulture in a Creator DAO is the most important asset you can hope for. Culture is the reason why high-quality talents will provide support over a sustained period for your DAO. **There's only so much you can motivate someone with financial rewards, but with a strong culture, community members will actively contribute, intrinsically motivated by the values you have and the desire to be assimilated with the project you're creating.** High-quality talents are the ones who invest their time instead of capital, the ones who truly believe in the project and are keen to do whatever it takes to make it grow. Those are the most valuable and rarest contributors.\n\nPeople in the Web3/crypto space often display exclusive NFT avatars as their profile pictures and display such or such community in their Twitter bio. The reasons they are doing that are Culture and Social Status. With a strong culture, people are keen to assimilate their personal brand with your community. Culture is the glue of crypto. Without culture (meaning, story, community, memes…), NFTs wouldn't cost such an astronomical amount. What people are buying when purchasing a high-value NFT is not really the piece in itself. They buy the right to be part of a broader project in which they truly believe and want to be assimilated. NFTs don't cost their price for their utility but for the social signal and the culture they have shaped around it.\n\nWhen people are displaying in their Twitter bio that they are contributors to such a community, they signal that the DAO they are displaying has created a strong culture that has values and goals worth the time of the person. We're all [\"status-seeking monkeys,\"](https://twitter.com/packyM/status/1424715346976595972) and we're always on the hunt for things to enhance our identities. The goal of a Creator DAO is to create a culture so strong that people will promote it and work for it for free, for the social value it provides. Members of a community share a piece of their identity. **Thiscollective identity is one of your most vital selling points**.\n\n***Right, So how to create a strong culture?***\n\n* \\*\\*Share a common vision - \\*\\*Culture for every community is that one theme that people are aligned with, and that brings people together beyond your content. Any creator should seek this common thing, this right activity, which resonates with their audience and is better done as a group. This is how you create a strong culture. By creating a place where people with common interests can come and find their tribe, learn and grow together. Your goal as a community builder is to have community members engage with each other.\n* \\*\\*Know your community - \\*\\*You need to understand your typical \"community member persona deeply.\" As described by the [interaction design foundation](https://www.interaction-design.org/literature/topics/personas), \"\\*Personas are fictional characters, which you create based upon your research to represent the different user types that might use your service, product, site, or brand similarly. Creating personas helps the designer to understand users' needs, experiences, behaviors, and goals.\" \\*In our case, by understanding what kind of profile you have in your community, it will be easier to design incentives, develop values, create specific group chats and find that common thing that speaks to your audience.\n* \\*\\*Have a clear mission and strong values - \\*\\*The clearer you will be on what you want to achieve, and the values you have, the easier it will be to incentivize people to work with you. People will contribute in the long term only if they intrinsically believe in the project and gain social status by contributing.\n* **Provide Ownership** - You have to make the contributors feel accountable for the success of the project and the culture. By giving ownership and by showing strong leadership (by actions and decisions), you'll not only make sure to attract the best talents, but you will also assure good retention of your best contributors.\n* **Create trust -** Creating a strong culture is also creating trust. You need to build trust between members but also with people outside of the community. Having a public face behind the project has shown its efficiency to create trust. Hiring a scribe to facilitate the communication between team is also essential to create a healthy and sustainable trust culture.\n\nTo build a strong community, you have to find a “Why.” It’s all about having a common goal and a true belief. As a community leader, building a community with a strong culture is a long journey.\n\nBuilding a strong culture is only the first step to attract quality talents to your DAO. With a strong culture, potential contributors will probably notice you and try to understand better what you’re doing. Once in your community, the next step is to incentivize them to participate and help the DAO grow..\n\n### 2 - Design great incentives\n\nThe main interest of creating a Token for your community is to incentivize potential contributors to participate and give their time to make your project grow. There are [three primary types of incentives](https://coinvise.substack.com/p/how-to-design-great-incentives):\n\n* **Social incentives -** It's more of a social, collectible value that people are proud to own. Social Tokens create status within a community. Think of Airline miles that generate status within a specific sphere (Airline lounge, first to enter the plane, etc..) or special perks in Discord servers\n* **Vision Incentives -** members aren't participating \"for-profit\" (aka economic incentives) but are driven by a specific ideology. Community members will exchange your Token without a monetary value because they sincerely believed in the vision.\n* **Economic Incentives -** it doesn't require a particular strategy, and you can simply ask community members to achieve a mission in exchange for economic value. By creating a pay-for-performance incentive scheme, anyone can provide their skills and help grow the project.\n\nWell-designed incentives are essentials to attract quality talents for your DAO. Economic incentives are a great way to onboard new people to your project, but sustaining a community only based on financial incentives in the long term can be complicated. You should try to design bounties and rewards contributors that are here for the vision of the project and its social aspect, not for speculation. By giving ownership and rewarding high-quality talents with well-designed incentives, you'll make sure to create a sustainable and healthy community that can thrive in the long run.\n\nBounties and rewards can take many forms but should always fit into the broader goal of your community. A great example of an incentive that can be applied in almost all communities is a \"Referral bounty.\" Leveraging its community to attract qualified people by rewarding existing contributors when they refer people they know has shown to be an efficient way to attract top talents in the past.\n\nWith a strong culture and effective incentives, you should already be able to attract high-quality members for your Creator DAO. However, to make sure those talents contribute actively and provide value, you'll need a well-design onboarding process.\n\n### 3 - Having a well-design onboarding process\n\nBeing a member of a couple of DAOs myself, I've found it very time-consuming to browse the many channels of a Discord server and understand where I can provide value. There is a lot of confusion and plenty of non-relevant information to sift through, and it can be scary and demotivating for new potential contributors. To attract top talents, it's essential to make sure the onboarding process is straightforward. You should think about the user journey and create an onboarding process that makes it easy for anyone to participate.\n\nAn example of a great onboarding process could be [BanklessDAO](https://www.bankless.community/). Their [Wiki](https://www.notion.so/bankless/BanklessDAO-Wiki-82ba81e7da1c42adb7c4ab67a4f22e8f) is organized to participate even though you don't have much time to provide to the DAO. By doing that, they are making sure that no one feels intimidated and therefore are making sure to receive help from the maximum of people.\n\nThey also have clear documentation about the different guilds of the DAO and their respective missions, making it easy for anyone to see where they think they could provide the most value.\n\nFinally, once you've identified the guild you could bring the most value to, they are making the process of contacting someone from this guild easy. It's still rare to see a well-designed onboarding process in DAOs today, and potential contributors often still have to DM one (or several) community leaders (s) and ask how they can provide value, making the whole process longer and less effective. By creating a well-designed onboarding process (clearly explaining what you need help for, what your DAO is doing, and making it easy for potential contributors to reach out to a qualified member), you'll have a competitive advantage compared to other DAOs.\n\n### Conclusion\n\nAttracting quality talents for your DAO is not an easy task, but by making sure to have a strong culture, a well-designed onboarding process, and good incentives, you should be able to work with high-quality contributors and successfully grow your project. The most successful DAOs tend to lower entry barriers and combine a strong culture with a sense of ownership for every contributor.\n\n\n---\n\n**Want more?**\n\nFollow us on **[Twitter](https://twitter.com/CoinviseCo)**,  [Instagram ](https://www.instagram.com/coinvise/?hl=en)and join us on **[Discord](https://discord.gg/8jaQB5CZ) 🔥**\n\n\n---\n\n**Further resources:**\n\n* [Growing A Tokenized Community](https://club.mirror.xyz/hUCOZNvJ7uQI7DXOAmz3Rr-yt82o9gTiJx5T5srD5tc)\n* [Issue #26: How You DAO](https://30000feet.substack.com/p/issue-26-how-you-dao)", "timestamp": 1630605224, "digest": "_8nlEhI13gz8hbwF-fFwFFFw8tsm_c3uKNtpSzpmldU", "contributor": "0xC0241e384dB48C35E7b3FEded3BfEcd29A3E73e3"}
{"id": "pq2-olcE-QLgbLGR7jsQgWJ-evWL8MTQL8MxkA43FPQ", "title": "Sparking the Dirt NFT Market", "body": "![Dirty S1 Holo (25/25)](https://images.mirror-media.xyz/publication-images/4067d646-36d4-4a1c-a7ed-b04f5411cb95.gif?height=500&width=500)\n\nA few months ago, we [sold NFT editions](https://air.mirror.xyz/lmV9Dxeos9HvKSu0BKY9pqARK2vAlPXhrNMt68E4GkI) to raise around $30,000 to fund the [newsletter Dirt](https://dirt.substack.com), the first newsletter run on NFTs. We then used that money for a successful two-month-long season of content, paying writers and editors a great rate for great newsletters. During that time, the subscribers grew almost 50% and Dirt was shared by influential media figures and publications. Plus, we have over 100 holders for our 131 original NFTs.\n\n![Dirty NFTs so far](https://images.mirror-media.xyz/publication-images/3d09ab8b-3b30-46a7-a7d0-442458dba533.png?height=858&width=1882)\n\nToday is the first step beyond that initial launch. We’ve now created the Dirty S1 Holo, a combination of our sold-out Pea Green and Pearl Pink NFT editions. The Holo is an edition of 25, but there are two ways to get it:\n\n**1. If you have two or more of our pre-existing NFTs, you’ll get it airdropped for free**.\n\n**2.** **Buy it for 0.3 ETH** **here on Mirror.**\n\nHolo owners will also get an extra 50 $DIRT-S1 tokens from Dirt’s own stash.\n\n![Dirt's growth during season 1](https://images.mirror-media.xyz/publication-images/be8b0ee2-39d4-431e-baca-b9cd2177a125.png?height=1168&width=1518)\n\nIf you have two Dirt NFTs already, we got you; if you want to buy Dirt NFTs [check OpenSea here](https://opensea.io/assets?search%5Bquery%5D=%22dirty%20s1%22&search%5BsortAscending%5D=true&search%5BsortBy%5D=PRICE). When you get two, email / tweet us at newsletterdirt@gmail.com or @dirtyxyz. **The first 25 double holders will get the Holo.**\n\n## Buy Dirty S1 Holo:\n\n**UPDATE 9/2/2021:** The Dirty S1 Holos have all been sold or swapped. Please [check on OpenSea](https://opensea.io/assets?search\\[query\\]=%22dirty%20s1%20holo%22) for any being offered for sale. \n\n***(There are 10 out of 25 available for direct sale right now; we’re reserving the other 15 to send to double-holders.)***\n\n## Post-Holo Plans\n\nYou can read more about the Holo launch in our newsletter, which includes instructions for selling and buying on OpenSea, or continue below for the business-y details.\n\nWhy do you want the Holo? Well, it’s cool, obviously. It looks rare, as they say — our rarest Dirt NFT besides the [1/1 Rainbow Wave](https://opensea.io/assets/0xabefbc9fd2f806065b4f3c237d4b59d9a97bcac7/3309). But it plays into our longer experiment to run a media company using NFTs. By launching Holo, we’re stimulating the secondary market in Dirt NFTs, helping early holders cash out (if they want) and bringing in new users. Like all good NFT projects, we just [launched a Discord](https://t.co/vyyw9NGRg9) that anyone can join; we want an active community of people buying and selling NFTs.\n\nAll Dirt NFT holders will have access to the private token-gated part of our Discord. And **proceeds from the Holo sale will go toward funding season two of Dirt**. We’ll also launch another NFT edition in the next few weeks, chosen by our subscribers, to raise more funding.\n\nBut the real goal is creating DirtDAO, a full-fledged media DAO built around the Dirt newsletter. After season two finishes, that will be the third phase of Dirt as a publication and brand. We’ll launch a funding round with an entirely new set of NFTs, designed with rare traits and new themes. We’ll distribute final $DIRT tokens, and all $DIRT-S1 token holders will be airdropped twice as many.\n\nThe DAO will run Dirt as a media company, helping to choose which coverage areas to invest in and which stories to commission. We’ll also launch a Dirt NFT collection, commissioning essays and curation around other NFT projects. Finally, DirtDAO will be a hub for developing new crypto-first media projects, building on our community’s interests and expertise.\n\nDirtDAO is being built with our original NFT holders first in mind, with bonuses and benefits distributed constantly. We think you’ll want to be a part of it. [Subscribe to Dirt newsletter here](https://dirt.substack.com).", "timestamp": 1630614460, "digest": "EWT5_r51nQaMXh6gf6MUS27CQKv9DsSafklvzZmCeuo", "contributor": "0x25cbCFA16e43e58517f80D583087Ea89241293E6"}
{"id": "y0kQDKuyaIjqUfyaHRXcJHjudPpC8JUvdpjBxYYZyD4", "title": "An NFT Launch Experiment Using $WRITE Race Oracle", "body": "The $WRITE Race Oracle is a contract that enables creators to make Sybil-resistant, fair-launch NFTs. Imagine if Loot, for example, could only have been minted once per person.\n\nThe oracle we deployed is an attempt to explore models with fair distribution, to build games that everyone can play - where a single address cannot mint a large percentage of the NFTs that drop.\n\nIt accomplishes Sybil resistance by validating that an account has participated in the $WRITE race, which requires Twitter authentication. The list of participants is ordered by the number of votes they have received by the Mirror community; the higher they are on this list, the less likely they are to be a Sybil attack. Developers can use an account's place in the list (their index) to prevent Sybil attacks by limiting minting if the index is too low.\n\n## Introducing Heroes\n\nWe made the first example of using this method, creating a metaverse identity generator that we call Heroes. It allows anyone who participated in the $WRITE Race to mint an identity, which they can use as a pen-name or character identity.\n\n![](https://images.mirror-media.xyz/publication-images/7eaf4d13-6773-46b6-b316-98edfb2af51e.jpg?height=1142&width=2284&&&&&size=medium)\n\nLike Loot, these can have prefixes like \"Captain\" and suffixes like \"the Brilliant\" - but we used name generation instead of adventurer gear.\n\nThere is exactly one NFT available per account that registered; it is free to mint and can be traded afterward to allow people to get the names they think suit them the best and provide a market for the interesting ones that *look rare*.\n\n### How to Claim a Hero\n\n* Get proof that you entered the $WRITE race. You can find this in the data we published [here](https://write-race-oracle.s3.us-west-2.amazonaws.com/write-race-proofs.json). Copy your address, index, and proof.\n* Head over to the [Etherscan](https://etherscan.io/address/0x1283ff14fb1de447955af429af05eafe959d2639#writeContract) page to mint your NFT.\n* Open up the `claim` method, and paste in the data that you just copied. Submit the transaction, and you will receive a randomly generated name. \n* We hope you get something rare!\n\nYou can find the [collection on OpenSea](https://opensea.io/collection/heroes-waiwbtnarp).\n\n## Oracle Details\n\nTo generate the $WRITE Race Oracle, we took a snapshot of all accounts participating in the $WRITE race and created a Merkle Tree with their address and current spot. We then deployed a contract that holds the Merkle Root and exposes a function that, given a Merkle Proof, verifies if a particular account has participated in the race.\n\nWe have used Merkle Trees before for our splits implementation; if you want a more in-depth look into it works, see our previous [Engineering Splits](https://dev.mirror.xyz/V_7Jp1hy_g8bz-J1B4Wb5KYSmj5Lt4W7q7cw0noxJsU) post.\n\nThe proof data has been uploaded [here](https://write-race-oracle.s3.us-west-2.amazonaws.com/write-race-proofs.json) for anyone to use. On there, you will find the three inputs necessary to verify that you have entered the $WRITE race: account, index, and proofs. You can try it out on [Etherscan](https://etherscan.io/address/0x6a6893cb59a559458d61618300598394743f0747#readContract), copy and paste the arguments:\n\n![Check that your identity is verified](https://images.mirror-media.xyz/publication-images/dbd3c3c0-577e-4021-b3b4-d7b97ae152b7.png?height=852&width=2694&&&&&size=medium)\n\nThe contracts and scripts we used to generate the proofs have been published on the Mirror Github; see this [repository](https://github.com/mirror-xyz/write-race-oracle).\n\n## Disclaimer\n\n*The oracle is an experiment, and we do not guarantee that we will update the root often or at all. Currently, only accounts that entered the $WRITE race before September 1st will be valid on the deployed oracle.*", "timestamp": 1630626112, "digest": "bYFbDWRdCnrFn8gh_5vPav5vtNArFanPgkWVzIInQQ4", "contributor": "0xC09D3402515676B81a2F768C365146ea3faa5605"}
{"id": "9_Rw8KEPD63iUqqgYiGSEjT4-aodpApU-6WWL9I3Fa4", "title": "HVND OF AFFLUENCE [SE] AIRDROP", "body": "Last week, we launched the [“Heavy is the HVND”](https://blvkhvnd.mirror.xyz/crowdfunds/0x320d83769Eb64096Ea74B686Eb586E197997f930) crowdfund to raise capital for our decentralized gaming community and competitive teams. To great success, we raised over 337 ETH ($1M\\~) through a combination of NFTs and contributions. For the backers that purchased our NFT tiers, “HVND OF AFFLUENCE”, we wanted to reward them with a special edition version that is not only more trackable within secondary markets like OpenSea, but is deployed with our own custom smart contract.\n\nLast Sunday, we captured a snapshot of 236 addresses that owned the original HVND OF AFFLUENCE and wanted to do batch airdrops through our multisig. At the same time, there were a multitude (and a continued wave) of NFT drops from The Hundreds, to LOOT, and everything in between causing a huge sustained spike in gas cost. We thought about what to do, and decided to delay the airdrop in the hopes things would calm down significantly enough for us to deploy our airdrop.  \\\\n  \\\\n At the same time, in collaboration with Mirror, we worked to build a custom contract with their platform that would allow folks to claim the airdrop—it would just take a few more days. Now, that it’s Thursday, post hurricane for us northeast folks (NYC, Philadelphia, etc), we have the token ready to be claimed.  \\\\n  \\\\n Your NFTs should be viewable on OpenSea shortly after receiving them. We are currently updating the metadata on our contract’s profile page.\n\n[edition://0xb6B1e733639b4E5218bd1115c28C2eE473467663?editionId=0](edition://0xb6B1e733639b4E5218bd1115c28C2eE473467663?editionId=0)\n\n\n---\n\n**Learn more about the HVND:**\n\n[Website](https://blvkhvnd.com) | [Blog](https://blvkhvnd.mirror.xyz) | [Discord](https://discord.gg/fVRWE3C) | [Twitter](https://twitter.com/blvkhvnd) | [Telegram](https://t.me/hvndhaus)", "timestamp": 1630626465, "digest": "DAi5ba40cVemKMzN2yCXJHA_OqBWQ7SbOzbWRn12IbM", "contributor": "0xEB95ff72EAb9e8D8fdb545FE15587AcCF410b42E"}
{"id": "ot0Uf3c3Q4N9MTebg7xgaz8EMsNWrX8mve1ZIeGdf1c", "title": "An NFT Launch Experiment Using $WRITE Race Oracle", "body": "The $WRITE Race Oracle is a contract that enables creators to make Sybil-resistant, fair-launch NFTs. Imagine if Loot, for example, could only have been minted once per person.\n\nThe oracle we deployed is an attempt to explore models with fair distribution, to build games that everyone can play - where a single address cannot mint a large percentage of the NFTs that drop.\n\nIt accomplishes Sybil resistance by validating that an account has participated in the $WRITE race, which requires Twitter authentication. The list of participants is ordered by the number of votes they have received by the Mirror community; the higher they are on this list, the less likely they are to be a Sybil attack. Developers can use an account's place in the list (their index) to prevent Sybil attacks by limiting minting if the index is too low.\n\n## Introducing Heroes\n\nWe made the first example of using this method, creating a metaverse identity generator that we call Heroes. It allows anyone who participated in the $WRITE Race to mint an identity, which they can use as a pen-name or character identity.\n\n![](https://images.mirror-media.xyz/publication-images/7eaf4d13-6773-46b6-b316-98edfb2af51e.jpg?height=1142&width=2284&&&&size=medium)\n\nLike Loot, these can have prefixes like \"Captain\" and suffixes like \"the Brilliant\" - but we used name generation instead of adventurer gear.\n\nThere is exactly one NFT available per account that registered; it is free to mint and can be traded afterward to allow people to get the names they think suit them the best and provide a market for the interesting ones that *look rare*.\n\n### How to Claim a Hero\n\nFirst, you need to get proof that you entered the $WRITE race. You can find this in the data we published [here](https://write-race-oracle.s3.us-west-2.amazonaws.com/write-race-proofs.json).\n\nCopy your address, index, and proof. Then head over to the [Etherscan](https://etherscan.io/address/0x1283ff14fb1de447955af429af05eafe959d2639#code) page to mint your NFT.\n\nOpen up the `claim` method, and paste in the data that you just copied. Submit the transaction, and you will receive a randomly generated name. We hope you get something rare!\n\nYou can find the [collection on OpenSea](https://opensea.io/collection/heroes-waiwbtnarp).\n\n## Oracle Details\n\nTo generate the $WRITE Race Oracle, we took a snapshot of all accounts participating in the $WRITE race and created a Merkle Tree with their address and current spot. We then deployed a contract that holds the Merkle Root and exposes a function that, given a Merkle Proof, verifies if a particular account has participated in the race.\n\nWe have used Merkle Trees before for our splits implementation; if you want a more in-depth look into it works, see our previous [Engineering Splits](https://dev.mirror.xyz/V_7Jp1hy_g8bz-J1B4Wb5KYSmj5Lt4W7q7cw0noxJsU) post.\n\nThe proof data has been uploaded [here](https://write-race-oracle.s3.us-west-2.amazonaws.com/write-race-proofs.json) for anyone to use. On there, you will find the three inputs necessary to verify that you have entered the $WRITE race: account, index, and proofs. You can try it out on [Etherscan](https://etherscan.io/address/0x6a6893cb59a559458d61618300598394743f0747#readContract), copy and paste the arguments:\n\n![Check that your identity is verified](https://images.mirror-media.xyz/publication-images/dbd3c3c0-577e-4021-b3b4-d7b97ae152b7.png?height=852&width=2694&&&&size=medium)\n\nThe contracts and scripts we used to generate the proofs have been published on the Mirror Github; see this [repository](https://github.com/mirror-xyz/write-race-oracle).\n\n## Disclaimer\n\n*The oracle is an experiment, and we do not guarantee that we will update the root often or at all. Currently, only accounts that entered the $WRITE race before September 1st will be valid on the deployed oracle.*", "timestamp": 1630624685, "digest": "bYFbDWRdCnrFn8gh_5vPav5vtNArFanPgkWVzIInQQ4", "contributor": "0xC09D3402515676B81a2F768C365146ea3faa5605"}
{"id": "u6ExtNigPBwR4-kS3sZEaB7nMiVspvTfEGzznGCJOjE", "title": "如何打造一款吸引公会的链游：Dark Forest 的另一种解读", "body": "***说明：***\n\n*本文是我8月29日在元宇宙资本和纯白矩阵主办的 Metaverse 主题活动中分享的主要内容，分享时间有限，文本内容有所补充，不完全和分享内容一致。*\n\n*同时，建议大家去关注分享的回放，主题是游戏性的策划，另外两位分享者，周衍老师和宋阳老师，他们分享的内容都是非常专业的干货，能够为想要投身链游研发的朋友提供直接且有效的帮助。*\n\n我是来自 RhizomeDAO 和DAppChaser 的 Erica，同时是一位科幻创作者。接触这个行业比较早，还是刚刚读大学的时候，在全身心投入加密世界之前，我从事的是行业研究相关的工作，四年前开始写区块链相关的科普作品，参与过一些区块链项目的孵化。\n\n小学时，我开始玩网络游戏，是一些网游中公会战的积极玩家。在《天堂Ⅱ》的时代，我参与了个人游戏生涯中第一个公会；后来，担任过《飞飞》某个服务器最大公会的元老，记得那时最爱打的职业是巫师，升学期间，不幸终止于盗号。\n\n兴趣使然，对于链游，我一直保持着比较密切的关注。\n\n印象中，最早的「链游」，应该是2015到2016年，是一款卡牌对战游戏，算是古董级的链游，募集的是BTC，游戏币也不是Token，而是Coin。这个游戏有自己的链，现在已经彻底消失了，行情网站找不到任何信息，它的游戏道具是中心化的设定，和现在很火的 NFT 也没有任何关联。*（补充：这段是临时提到的，今天重新确认，这个游戏似乎已转手，成为了以太坊生态的 NFT 项目，但暂无起色。）*\n\n今天要讲的主题是关于 Dark Forest 黑暗森林，一款灵感源于《三体》三部曲的去中心化区块链游戏，并由此出发，去谈谈链游如何从游戏机制上吸引公会，实现比较长期主义的良性发展。\n\n![](https://images.mirror-media.xyz/publication-images/4760e6cc-5532-4e12-8bdc-c06983c79651.png?height=416&width=607)\n\n## Dark Forest 是什么？\n\nDark Forest 是一款基于零知识证明的去中心化实时战略游戏，是一个非常重数值的游戏。玩家所在的宇宙会一直生成和扩大，地图信息存储在玩家浏览器本地，需要用算力进行探图；如果你没有探索出攻击一方的领地，那么你无法知道到底是谁正在攻击你，敌人实力究竟如何。\n\n![](https://images.mirror-media.xyz/publication-images/99032f65-c091-42b1-ba29-79689b06407b.png?height=389&width=661)\n\n目前，黑暗森林仍处于测试阶段，更像是限时的链上电竞赛事和黑客松。以下是从0.5 到现在的每一轮赛事的规则，我们留到后面的部分具体举例。\n\n![](https://images.mirror-media.xyz/publication-images/0e82b573-277d-422e-bcdf-a6160e9e9749.png?height=297&width=1653)\n\n下图是我在 v 0.6 第二轮时截的数据，大家可以看到，一旦黑暗森林开始新的一轮，整个 XDAI 网络的 GAS 消耗会突然提升，而且占比最大的就是黑暗森林的合约交互。\n\n![](https://images.mirror-media.xyz/publication-images/8b089415-7d6a-4cc3-88df-dcbf71625cd1.png?height=452&width=1280)\n\n因为 Dark Forest 是开放式的去中心化状态，大部分玩家会使用社区开源和自己制作的插件，链上交互非常高频，排名靠前的玩家每轮游戏可能会消耗上百 XDAI 。\n\n提醒：做链游，选择的链，会直接影响玩家的体验，需要考虑链的性能是否能支持游戏正常运转，链的生态是否能和游戏实现共赢。\n\n### 如何开始玩 Dark Forest?\n\n想要开始玩 Dark Forest，需要准备邀请码和充足的 XDAI。\n\n因为游戏行为都是链上交互，每笔交易需要消耗 XDAI；\n\n每一轮的邀请码并不互通，通常会根据上一轮游戏是否获得积分发放下一轮的邀请码，新玩家以通过邮箱登记获取 → [zkga.me](http://zkga.me)，或是在 Dark Forest 官方的 Discord、Twitter 等渠道，等待社区其他成员分享邀请码。\n\n![DF Discord 设置了一个 #ask-for-keys 频道，群组成员在这里分享他们多出的邀请码](https://images.mirror-media.xyz/publication-images/f779166f-1c9c-4fd4-8a83-f618f92dbfa2.png?height=964&width=1214)\n\n如果你是新玩家，尚不知如何开始游戏，那么你可以阅读以下三篇由中文社区成员 FlakesGG 发布的游戏攻略：\n\n《[Dark Forest 完全攻略（入门篇）](https://www.dappchaser.com/dark-forest-guide1/)》\n\n《[Dark Forest 完全攻略（进阶篇-神器和插件指南）](https://www.dappchaser.com/dark-forest-guide2/)》\n\n《[Dark Forest 完全攻略（技术篇）](https://www.dappchaser.com/dark-forest-guide3/)》\n\n（游戏演示）\n\n## 为什么链游需要公会？\n\n在不少人眼中，游戏公会并不是一个特别正面的词，它很多时候和占有垄断地位、影响游戏可玩性的打金工作室联系在一起；即使是在链游领域，也经常有游戏团队直接封掉用脚本打金的用户地址。\n\n在此，我们不妨回顾一下国内早期网游中的游戏公会历史。\n\n**（1）无奖惩机制的早期网游和公会**\n\n最早的网络游戏，奖惩机制不明确。比如，有一款古董级的网游 UO，中文名是《网络创世纪》，游戏的 PK 既无奖励，又无惩罚；当时，有一批玩家热衷于恶意PK，导致另一些玩家形成了反恶意PK联盟；一些游戏文化研究论文认为，UO 中的这些联盟，是最早的游戏公会雏形。\n\n当时，有一个叫做 Sunny Land 的游戏公会，中文名是阳光大陆，后来逐渐发展成跨游戏公会。对于一些很早期的中国网游玩家来说，他们最早接触的公会可能就是 UO 里的这些公会。\n\n**（2）跨游戏公会和社交**\n\n随着游戏行业的发展，**游戏公会和工作室逐渐成为既能连接游戏内的玩家、增加游戏的社交属性、留存用户，又能影响游戏秩序的存在**。共识足够强的游戏公会，甚至会吸引游戏官方团队成员反向加入。\n\n1998年左右，有一个叫“网络十字军”的公会，最早起源于《笑傲江湖》，后来这批人又去玩了很多别的游戏，比如《万王之王》，靠这个游戏发展到数千人；后来的 17173 游戏门户网站，也是这个公会的核心成员和外部合作制作的。这个游戏公会几乎玩了那个时候所有的游戏，盛极一时。\n\n![](https://images.mirror-media.xyz/publication-images/030186b5-73d3-4245-b371-3e797a6e110f.png?height=394&width=751)\n\n**（3）自带公会系统，帮助玩家凝聚共识的游戏机制**\n\n后来的一些游戏，通常自带公会系统，让玩家更方便地在游戏内自建有明确等级划分的公会，并通过游戏机制来帮助这些公会凝聚共识。例如，《传奇》中的攻占沙巴克城设定，谁攻占了沙巴克城，谁就控制了所在服务器的经济命脉；沙巴克城就是于权力和地位的象征。这个设定，直接刺激了玩家为公会贡献，也让不同公会之间相互斗争。\n\n![](https://images.mirror-media.xyz/publication-images/43150202-e29a-4066-9b7c-e47f97286199.jpg?height=361&width=642)\n\n链游中，Dark Forest 有过类似的设定。在刚刚结束的一轮中，游戏团队发布了类似的规则，让所有玩家都冲向宇宙的中心。如下图所示，游戏结束前，所有玩家都在往最中心发射能量。\n\n![](https://images.mirror-media.xyz/publication-images/2c315bdc-447e-401a-9492-199829453d40.png?height=410&width=777)\n\n与此同时，一些开发者玩家创建了识别公会成员的插件，让同一个成员能够互相辨别。\n\n![这张图是 Guild W 微信群的玩家 Network 创建的成员识别插件效果](https://images.mirror-media.xyz/publication-images/a8dbea9f-26da-4e8c-a399-436730a645aa.jpg?height=410&width=433)\n\n这种机制，促进了玩家对于游戏道具的消耗需求，从而支撑道具的市场价格，让所有玩家都劳有所得。\n\n![](https://images.mirror-media.xyz/publication-images/ff527025-5ee3-4bf3-b3f7-4cdb1a2187dd.jpg?height=720&width=752)\n\n**（4）早期公会常见盈利模式：带新人、点卡 OTC、地推返点**\n\n再往后，更多年轻朋友也熟悉的《魔兽世界》，同样创造了网络游戏公会的一个高峰。\n\n当时的游戏主要是消耗点卡的模式，所以公会也出现了给加速器打广告、OTC 点卡之类的盈利模式，同时带新人玩家，比如带刷声望、赠送道具，甚至全程跟随等等，但这些都非常松散。\n\n当时的公会更主要的收益，源于地推的作用：即游戏公会频繁和新游戏合作，获取返点收益。然而，随着地推公会越来越多，内卷降临，一些新的公会为了争取玩家，会把返点直接给会员，导致所有公会整体收益越来越低。\n\n**（5）打金工作室和反打金机制的兴起**\n\n到了2004年的《天堂Ⅱ》，玩家可以参与代打，向打金公会缴纳游戏币换取法币工资，国内一些打金公会逐渐覆盖海外服务器，服务国外玩家，甚至形成垄断优势。\n\n![](https://images.mirror-media.xyz/publication-images/aec7e132-b1ce-4ee2-92fa-1b8c79a197ac.jpg?height=375&width=500)\n\n虽然2008年，有一家游戏代练工作室获得了武汉工商局颁发的营业执照，但整体上，一些工作室使用外挂辅助打金的行为被游戏公司所排斥，暴雪和腾讯都有过封禁打金工作室账号、联合警方捣毁实体工作室等行为。\n\n总而言之，几乎所有游戏都需要去考虑如何和公会之间达成和谐发展的目的。\n\n**链游团队不仅要从游戏性上考虑公会机制，还要从代币经济模型上和头部的公会达成平衡。**\n\n在我看来，Dark Forest 目前在这个方面做的比较理想，它能够收获更多陪着游戏不断迭代的长期玩家，而且**大部分都是非常原生的开发者，他们更愿意为游戏生态做建设，而不是投机玩家**。\n\n## 我们可以从 Dark Forest 学到什么？\n\n最后，还是回到一个我们想要探讨的主题：我们可以从 Dark Forest 学到什么？从游戏策划层面，想要创建吸引公会的链游，到底需要做什么样的努力。\n\n简单来说，仍是两个词——激励和约束——之间的平衡。\n\n黑暗森林虽好，但不是所有团队处境都相同，不可能盲目模仿。\n\n### 团队定位：可行性和创新性的平衡\n\n个人觉得，在设计游戏机制之前，首先应该明确，你要做，以及你能做的，到底是哪一种类型的链游。\n\n第一种是通过兑换结合 Token 的中心化游戏，如上一轮的链游，虽然省心，但很难发挥链游的优势；\n\n第二种是去中心化程度有限的链游，如CryptoZoon、Axie Infinity，相对更常见，但团队需要谨慎选择早期公会合作方，建议重视真实玩家数量多、愿意长期投入的公会；\n\n第三种是去中心化链游，如 Dark Forest，团队可以调整游戏机制，约束技术公会的权限，并且通过游戏外的插件激励，引导社区开发者专注于游戏生态建设，鼓励开发者对插件进行开源，而不是把全部心思花在输赢上。\n\n### 游戏机制：平衡玩家需求，凝聚共识\n\n游戏机制上，主要是平衡玩家需求，凝聚共识。\n\n玩家主要以公会为中心聚拢，大部分链游公会是跨游戏公会，玩家之间的情谊会让他们继续去成就不同的链游。比如YGG，虽然他们因为 Axie Infinity 出名，但实际上他们还有Sub DAO 机制，同时投入了其他的链游。\n\n链游团队无法改变这个从网络游戏时代就存在的现装，最好的应对方式是顺应它，满足玩家需求，尽可能提高游戏可玩性，留存用户。\n\n从黑暗森林中，我们可以学到一些平衡玩家需求的技巧。\n\n**（1）收益性-游戏经济：用好 NFT，避免限于传统游戏思路**\n\n首先是收益性方面， Dark Forest 没有发币，但它活用了NFT，也就是非同质化货币，按照获得形式，可以将其分为三类：\n\n一是位于 XDAI 网络的游戏道具——也就是神器，能够在每一轮游戏中为星球增加 BUFF，玩家通过在宇宙中寻找铸造厂，开启神器，这个过程和随机开盲盒非常类似，能够满足一部分玩家的收集欲，让所有玩家在探索宇宙的过程中，持续不断地获得满足感，不至于无聊，而公会则成为托底神器价格、在战争中调配神器的存在；\n\n![DF v0.5 中的神器，图片由 Flakegg 提供](https://images.mirror-media.xyz/publication-images/e9923cf6-6c59-49bb-be44-00812f0d2af1.png?height=482&width=849)\n\n二是从0.6版本出现的，奖励每一轮游戏前63名的主网 NFT，第一名的 NFT 就像是电竞冠军奖杯一样的存在；随着游戏玩家的增多，仅凭一人之力很难获得第一名，第一名的 NFT 已经成为公会集体荣誉的象征，无价的存在。\n\n![](https://images.mirror-media.xyz/publication-images/b1f7a772-f7be-4827-b647-0ee0eaa4d44c.png?height=479&width=1050)\n\n三是 Dark Forest  游戏之外的社区荣誉 NFT，虽然和主网 NFT 属于同一个合约铸造，但主要是奖励给为游戏生态贡献的玩家，这鼓励了开发者开源插件给普通玩家使用，避免公会过度垄断游戏，导致个人玩家无法融入。\n\n![](https://images.mirror-media.xyz/publication-images/56bcaa4f-cfb0-4281-8ca5-4fe13b29f878.png?height=539&width=880)\n\n比较经典的案例，就是刚刚过去的 0.6 版本第三轮中， Dark Forest  中现存的三大公会先后推出了神器交易市场，Guild W 最早在官方推特发布，Orden 和 DF DAO 紧随其后；公会的竞争不仅存在于游戏内，还存在于开发者之间的效率对决，个别开发者会主动帮忙找社区开源合约的问题，某种程度上发挥了早期安全审计的作用。\n\n![](https://images.mirror-media.xyz/publication-images/8cf4fd24-e80e-4821-99af-568a7552a399.png?height=787&width=1403)\n\n**（2）参与度-社交属性：一些 GameFi，同时也是 SocialFi**\n\n其次，是游戏的社交属性，我很认同曹寅老师的一个看法，也就是很大一部分吸引人的 GameFi，本质上也是 SocialFi，会去考虑玩家与玩家之间的连接。就像前面我们提到的“十字军”公会，成员能够跨游戏玩下去，本质上是游戏中友情的维系。\n\nDark Forest  虽然没有官方的公会体系，但团队一直在创造社交连接点，比如玩家可以选择绑定推特，和邻居商议和平共处，后来又增加了星球表情功能，让玩家通过表情交流，在关键时刻避免开战。\n\n有了这些人的链接，才可能建起有共识的公会。\n\n![](https://images.mirror-media.xyz/publication-images/e6ae415f-dde5-487b-84c0-13376ed315a6.png?height=361&width=1190)\n\n就像有一位国外玩家说的，**“我们在这里交的朋友，才是最珍贵的 NFT。”**\n\n如果无法做出特别硬核的链游，那么可以思考如何增加游戏的社交属性，很可能收获意想不到的效果，推动玩家在你的游戏中建立公会的雏形\n\n**（3）增加测试阶段，重视二次策划**\n\n因为链游较于传统游戏受经济模型影响更大，所以非常不建议跳过测试阶段，直接上线正式版。Dark Forest  到目前的版本，仍然是测试版，每个版本都在迭代，不断增加新的功能。\n\n比如，从 Dark Forest  v 0.5到 v 0.6的优化中，着重调整了游戏的平衡性，例如，星球的防御数值。\n\n如果大家玩过0.5版本的 Dark Forest  ，你会发现一旦星球被其他玩家占领，能量恢复满，几乎没多少可能再被攻占，这是因为它的防御数值非常高，已经到了影响可玩性的程度。0.6 版本中，这个数值被修改，增加了游戏的可玩性。\n\n如果做的是去中心化程度较高的链游，最好能够倾听社区开发者的建议，游戏创新较高的前提下，可以吸收社区开发者参与优化。\n\n![](https://images.mirror-media.xyz/publication-images/c8e7b995-7ea2-4ebd-ae9f-88e586aaa95f.png?height=469&width=1277)\n\n**（4）重视链上行为分析，活用数据分析工具**\n\n可能对于一些刚刚进入区块链世界的游戏团队来说，有一定的困难，因为既需要团队有数值策划的经验，又需要团队掌握一定的区块链技术基础。\n\n例如，你可以通过The Graph 自己写 Sub Graph，或者使用其他开发者写的 Sub Graph，去制作需要的数据分析图表，帮助自己的游戏团队针对性地理解游戏玩家的相关行为。\n\n在 Dark Forest 社区中，不少社区开发者做出了数据分析的贡献。 比如，在 v0.6 第一轮游戏中，一些玩家通过 The Graph 和 Infura，写了他们内部使用的数据分析平台，只需要输入玩家的地址，即可分析对方所有星球的信息，比如几级的行星占比更高，直接从链上推演敌方的实力，进行策略优化。\n\n刚刚结束的 0.6 第三轮，因为三大公会都创建了神器交易市场，让很多数据分析玩家开始关注这个轮次中的神器总数量、已被挖掘数量，由此去推测大部分玩家的游戏行为，推演下一轮大部分人的玩法。\n\n如果团队做不到这一点，降维版本的处理方案就是耐心倾听玩家建议，收集反馈，不断调整。\n\n### 题外话：选择公会就像是选择投后服务\n\n最后，想补充的一点是：链游选择吸引什么样的早期公会，就像是选择投后服务。\n\n头部公会和链游之间的关系，就像是头部机构和他们投资组合里的项目一样；比起传统游戏公会，链游公会可以是把氪金和耗时两种属性拉到满点的极端存在，与主要支持的链游共同成长，公会成员的构成，直接决定了公会主要支持的链游是否能获得长期且有力的支撑——因此，可以将这些支撑，视为投后服务，长期主义的链游公会不仅会投入大量资金，还会投入海量时间参与游戏生态建设。\n\n这里，还是以 Dark Forest 中的公会为例：\n\nGuild W，水滴公会，一部分早期成员来自一个节点运维组成的DAO，其他早期成员大部分是效率非常高的开发者，比较资深的链游玩家（全都是从2018年，甚至更早关注链游方向），有过游戏领域投资经验的机构朋友等等，目前专注 Dark Forest，兼具玩家俱乐部和生态建设的职责，核心成员帮助游戏维护中文社区，将中文玩家的建议转达给社区中关注游戏策划和分析的成员。\n\nDF DAO，主要成员是美国一些项目的开发者和运营，比如 Coinbase、Zapper、MyCrypto 等等，虽然工会人数不多，但和 Guild W 一样，主动承担游戏生态建设的责任，优点是成员在区块链行业内的工作经验丰富，专业背景较强，输出内容偏研究属性。\n\nOrden Guild 的核心成员是来自乌克兰的区块链开发者和链游玩家，他们同时玩 AAVEGOTCHI，开发效率也相对不错。 \n\n虽然玩家在游戏中大部分时候是竞争关系，但在游戏外，一些成员已经成为了不错的线上好友，会互相交流如何将游戏生态建设得更好，手里的 NFT 会如何去使用，未来或许有可能创造出黑暗森林之外的东西。比如，我和分形艺术家 Fractist 在合作一部分人物都是 NFT 的实验性科幻小说，其中的世界观和黑暗森林有部分重叠，来自 DF DAO 的玩家和其他非公会玩家都参与了我们的讨论，提出了一些自己的看法。\n\n总而言之，长期主义的链游，应倾向于有建设能力、同样秉持长期主义的链游公会，从最早期的利益分配到最终的退出机制，都能与这些公会达成平衡，互利共赢。\n\n感谢你看到最后\\~ :)\n\n( 作者：K Erica）", "timestamp": 1630651813, "digest": "Jr9eTcteVz83d924S0lsMuMfDFs4YTkiLyUYXupm8bw", "contributor": "0x84da37133a088Fbf4e21D80Aec2CC260B52eA116"}
{"id": "mYBzbvE2IV2nQZn_RPAOOEaxkYCZAaYhaUER2T3M9Gw", "title": "如何打造一款吸引公会的链游：Dark Forest 的另一种解读", "body": "***说明：***\n\n*本文是我8月29日在元宇宙资本和纯白矩阵主办的 Metaverse 主题活动中分享的主要内容，分享时间有限，文本内容有所补充，不完全和分享内容一致。*\n\n*同时，建议大家去关注分享的回放，主题是游戏性的策划，另外两位分享者，周衍老师和宋阳老师，他们分享的内容都是非常专业的干货，能够为想要投身链游研发的朋友提供直接且有效的帮助。*\n\n我是来自 RhizomeDAO 和DAppChaser 的 Erica，同时是一位科幻创作者。接触这个行业比较早，还是刚刚读大学的时候，在全身心投入加密世界之前，我从事的是行业研究相关的工作，四年前开始写区块链相关的科普作品，参与过一些区块链项目的孵化。\n\n小学时，我开始玩网络游戏，是一些网游中公会战的积极玩家。在《天堂Ⅱ》的时代，我参与了个人游戏生涯中第一个公会；后来，担任过《飞飞》某个服务器最大公会的元老，记得那时最爱打的职业是巫师，升学期间，不幸终止于盗号。\n\n兴趣使然，对于链游，我一直保持着比较密切的关注。\n\n印象中，最早的「链游」，应该是2015到2016年，是一款卡牌对战游戏，算是古董级的链游，募集的是BTC，游戏币也不是Token，而是Coin。这个游戏有自己的链，现在已经彻底消失了，行情网站找不到任何信息，它的游戏道具是中心化的设定，和现在很火的 NFT 也没有任何关联。*（补充：这段是临时提到的，今天重新确认，这个游戏似乎已转手，成为了以太坊生态的 NFT 项目，但暂无起色。）*\n\n今天要讲的主题是关于 Dark Forest 黑暗森林，一款灵感源于《三体》三部曲的去中心化区块链游戏，并由此出发，去谈谈链游如何从游戏机制上吸引公会，实现比较长期主义的良性发展。\n\n![](https://images.mirror-media.xyz/publication-images/4760e6cc-5532-4e12-8bdc-c06983c79651.png?height=416&width=607)\n\n## Dark Forest 是什么？\n\nDark Forest 是一款基于零知识证明的去中心化实时战略游戏，是一个非常重数值的游戏。玩家所在的宇宙会一直生成和扩大，地图信息存储在玩家浏览器本地，需要用算力进行探图；如果你没有探索出攻击一方的领地，那么你无法知道到底是谁正在攻击你，敌人实力究竟如何。\n\n![](https://images.mirror-media.xyz/publication-images/99032f65-c091-42b1-ba29-79689b06407b.png?height=389&width=661)\n\n目前，黑暗森林仍处于测试阶段，更像是限时的链上电竞赛事和黑客松。以下是从0.5 到现在的每一轮赛事的规则，我们留到后面的部分具体举例。\n\n![](https://images.mirror-media.xyz/publication-images/0e82b573-277d-422e-bcdf-a6160e9e9749.png?height=297&width=1653)\n\n下图是我在 v 0.6 第二轮时截的数据，大家可以看到，一旦黑暗森林开始新的一轮，整个 XDAI 网络的 GAS 消耗会突然提升，而且占比最大的就是黑暗森林的合约交互。\n\n![](https://images.mirror-media.xyz/publication-images/8b089415-7d6a-4cc3-88df-dcbf71625cd1.png?height=452&width=1280)\n\n因为 Dark Forest 是开放式的去中心化状态，大部分玩家会使用社区开源和自己制作的插件，链上交互非常高频，排名靠前的玩家每轮游戏可能会消耗上百 XDAI 。\n\n提醒：做链游，选择的链，会直接影响玩家的体验，需要考虑链的性能是否能支持游戏正常运转，链的生态是否能和游戏实现共赢。\n\n### 如何开始玩 Dark Forest?\n\n想要开始玩 Dark Forest，需要准备邀请码和充足的 XDAI。\n\n因为游戏行为都是链上交互，每笔交易需要消耗 XDAI；\n\n每一轮的邀请码并不互通，通常会根据上一轮游戏是否获得积分发放下一轮的邀请码，新玩家以通过邮箱登记获取 → [zkga.me](http://zkga.me)，或是在 Dark Forest 官方的 Discord、Twitter 等渠道，等待社区其他成员分享邀请码。\n\n![DF Discord 设置了一个 #ask-for-keys 频道，群组成员在这里分享他们多出的邀请码](https://images.mirror-media.xyz/publication-images/f779166f-1c9c-4fd4-8a83-f618f92dbfa2.png?height=964&width=1214)\n\n如果你是新玩家，尚不知如何开始游戏，那么你可以阅读以下三篇由中文社区成员 FlakesGG 发布的游戏攻略：\n\n《[Dark Forest 完全攻略（入门篇）](https://www.dappchaser.com/dark-forest-guide1/)》\n\n《[Dark Forest 完全攻略（进阶篇-神器和插件指南）](https://www.dappchaser.com/dark-forest-guide2/)》\n\n《[Dark Forest 完全攻略（技术篇）](https://www.dappchaser.com/dark-forest-guide3/)》\n\n（游戏演示）\n\n## 为什么链游需要公会？\n\n在不少人眼中，游戏公会并不是一个特别正面的词，它很多时候和占有垄断地位、影响游戏可玩性的打金工作室联系在一起；即使是在链游领域，也经常有游戏团队直接封掉用脚本打金的用户地址。\n\n在此，我们不妨回顾一下国内早期网游中的游戏公会历史。\n\n**（1）无奖惩机制的早期网游和公会**\n\n最早的网络游戏，奖惩机制不明确。比如，有一款古董级的网游 UO，中文名是《网络创世纪》，游戏的 PK 既无奖励，又无惩罚；当时，有一批玩家热衷于恶意PK，导致另一些玩家形成了反恶意PK联盟；一些游戏文化研究论文认为，UO 中的这些联盟，是最早的游戏公会雏形。\n\n当时，有一个叫做 Sunny Land 的游戏公会，中文名是阳光大陆，后来逐渐发展成跨游戏公会。对于一些很早期的中国网游玩家来说，他们最早接触的公会可能就是 UO 里的这些公会。\n\n**（2）跨游戏公会和社交**\n\n随着游戏行业的发展，**游戏公会和工作室逐渐成为既能连接游戏内的玩家、增加游戏的社交属性、留存用户，又能影响游戏秩序的存在**。共识足够强的游戏公会，甚至会吸引游戏官方团队成员反向加入。\n\n1998年左右，有一个叫“网络十字军”的公会，最早起源于《笑傲江湖》，后来这批人又去玩了很多别的游戏，比如《万王之王》，靠这个游戏发展到数千人；后来的 17173 游戏门户网站，也是这个公会的核心成员和外部合作制作的。这个游戏公会几乎玩了那个时候所有的游戏，盛极一时。\n\n![](https://images.mirror-media.xyz/publication-images/030186b5-73d3-4245-b371-3e797a6e110f.png?height=394&width=751)\n\n**（3）自带公会系统，帮助玩家凝聚共识的游戏机制**\n\n后来的一些游戏，通常自带公会系统，让玩家更方便地在游戏内自建有明确等级划分的公会，并通过游戏机制来帮助这些公会凝聚共识。例如，《传奇》中的攻占沙巴克城设定，谁攻占了沙巴克城，谁就控制了所在服务器的经济命脉；沙巴克城就是于权力和地位的象征。这个设定，直接刺激了玩家为公会贡献，也让不同公会之间相互斗争。\n\n![](https://images.mirror-media.xyz/publication-images/43150202-e29a-4066-9b7c-e47f97286199.jpg?height=361&width=642)\n\n链游中，Dark Forest 有过类似的设定。在刚刚结束的一轮中，游戏团队发布了类似的规则，让所有玩家都冲向宇宙的中心。如下图所示，游戏结束前，所有玩家都在往最中心发射能量。\n\n![](https://images.mirror-media.xyz/publication-images/2c315bdc-447e-401a-9492-199829453d40.png?height=410&width=777)\n\n与此同时，一些开发者玩家创建了识别公会成员的插件，让同一个成员能够互相辨别。\n\n![这张图是 Guild W 微信群的玩家 Network 创建的成员识别插件效果](https://images.mirror-media.xyz/publication-images/a8dbea9f-26da-4e8c-a399-436730a645aa.jpg?height=410&width=433)\n\n这种机制，促进了玩家对于游戏道具的消耗需求，从而支撑道具的市场价格，让所有玩家都劳有所得。\n\n![](https://images.mirror-media.xyz/publication-images/ff527025-5ee3-4bf3-b3f7-4cdb1a2187dd.jpg?height=720&width=752)\n\n**（4）早期公会常见盈利模式：带新人、点卡 OTC、地推返点**\n\n再往后，更多年轻朋友也熟悉的《魔兽世界》，同样创造了网络游戏公会的一个高峰。\n\n当时的游戏主要是消耗点卡的模式，所以公会也出现了给加速器打广告、OTC 点卡之类的盈利模式，同时带新人玩家，比如带刷声望、赠送道具，甚至全程跟随等等，但这些都非常松散。\n\n当时的公会更主要的收益，源于地推的作用：即游戏公会频繁和新游戏合作，获取返点收益。然而，随着地推公会越来越多，内卷降临，一些新的公会为了争取玩家，会把返点直接给会员，导致所有公会整体收益越来越低。\n\n**（5）打金工作室和反打金机制的兴起**\n\n到了2004年的《天堂Ⅱ》，玩家可以参与代打，向打金公会缴纳游戏币换取法币工资，国内一些打金公会逐渐覆盖海外服务器，服务国外玩家，甚至形成垄断优势。\n\n![](https://images.mirror-media.xyz/publication-images/aec7e132-b1ce-4ee2-92fa-1b8c79a197ac.jpg?height=375&width=500)\n\n虽然2008年，有一家游戏代练工作室获得了武汉工商局颁发的营业执照，但整体上，一些工作室使用外挂辅助打金的行为被游戏公司所排斥，暴雪和腾讯都有过封禁打金工作室账号、联合警方捣毁实体工作室等行为。\n\n总而言之，几乎所有游戏都需要去考虑如何和公会之间达成和谐发展的目的。\n\n**链游团队不仅要从游戏性上考虑公会机制，还要从代币经济模型上和头部的公会达成平衡。**\n\n在我看来，Dark Forest 目前在这个方面做的比较理想，它能够收获更多陪着游戏不断迭代的长期玩家，而且**大部分都是非常原生的开发者，他们更愿意为游戏生态做建设，而不是投机玩家**。\n\n## 我们可以从 Dark Forest 学到什么？\n\n最后，还是回到一个我们想要探讨的主题：我们可以从 Dark Forest 学到什么？从游戏策划层面，想要创建吸引公会的链游，到底需要做什么样的努力。\n\n简单来说，仍是两个词——激励和约束——之间的平衡。\n\n黑暗森林虽好，但不是所有团队处境都相同，不可能盲目模仿。\n\n### 团队定位：可行性和创新性的平衡\n\n个人觉得，在设计游戏机制之前，首先应该明确，你要做，以及你能做的，到底是哪一种类型的链游。\n\n第一种是通过兑换结合 Token 的中心化游戏，如上一轮的链游，虽然省心，但很难发挥链游的优势；\n\n第二种是去中心化程度有限的链游，如CryptoZoon、Axie Infinity，相对更常见，但团队需要谨慎选择早期公会合作方，建议重视真实玩家数量多、愿意长期投入的公会；\n\n第三种是去中心化链游，如 Dark Forest，团队可以调整游戏机制，约束技术公会的权限，并且通过游戏外的插件激励，引导社区开发者专注于游戏生态建设，鼓励开发者对插件进行开源，而不是把全部心思花在输赢上。\n\n### 游戏机制：平衡玩家需求，凝聚共识\n\n游戏机制上，主要是平衡玩家需求，凝聚共识。\n\n玩家主要以公会为中心聚拢，大部分链游公会是跨游戏公会，玩家之间的情谊会让他们继续去成就不同的链游。比如YGG，虽然他们因为 Axie Infinity 出名，但实际上他们还有Sub DAO 机制，同时投入了其他的链游。\n\n链游团队无法改变这个从网络游戏时代就存在的现装，最好的应对方式是顺应它，满足玩家需求，尽可能提高游戏可玩性，留存用户。\n\n从黑暗森林中，我们可以学到一些平衡玩家需求的技巧。\n\n**（1）收益性-游戏经济：用好 NFT，避免限于传统游戏思路**\n\n首先是收益性方面， Dark Forest 没有发币，但它活用了NFT，也就是非同质化货币，按照获得形式，可以将其分为三类：\n\n一是位于 XDAI 网络的游戏道具——也就是神器，能够在每一轮游戏中为星球增加 BUFF，玩家通过在宇宙中寻找铸造厂，开启神器，这个过程和随机开盲盒非常类似，能够满足一部分玩家的收集欲，让所有玩家在探索宇宙的过程中，持续不断地获得满足感，不至于无聊，而公会则成为托底神器价格、在战争中调配神器的存在；\n\n![DF v0.5 中的神器，图片由 Flakegg 提供](https://images.mirror-media.xyz/publication-images/e9923cf6-6c59-49bb-be44-00812f0d2af1.png?height=482&width=849)\n\n二是从0.6版本出现的，奖励每一轮游戏前63名的主网 NFT，第一名的 NFT 就像是电竞冠军奖杯一样的存在；随着游戏玩家的增多，仅凭一人之力很难获得第一名，第一名的 NFT 已经成为公会集体荣誉的象征，无价的存在。\n\n![](https://images.mirror-media.xyz/publication-images/b1f7a772-f7be-4827-b647-0ee0eaa4d44c.png?height=479&width=1050)\n\n三是 Dark Forest  游戏之外的社区荣誉 NFT，虽然和主网 NFT 属于同一个合约铸造，但主要是奖励给为游戏生态贡献的玩家，这鼓励了开发者开源插件给普通玩家使用，避免公会过度垄断游戏，导致个人玩家无法融入。\n\n![](https://images.mirror-media.xyz/publication-images/56bcaa4f-cfb0-4281-8ca5-4fe13b29f878.png?height=539&width=880)\n\n比较经典的案例，就是刚刚过去的 0.6 版本第三轮中， Dark Forest  中现存的三大公会先后推出了神器交易市场，Guild W 最早在官方推特发布，Orden 和 DF DAO 紧随其后；公会的竞争不仅存在于游戏内，还存在于开发者之间的效率对决，个别开发者会主动帮忙找社区开源合约的问题，某种程度上发挥了早期安全审计的作用。\n\n![](https://images.mirror-media.xyz/publication-images/8cf4fd24-e80e-4821-99af-568a7552a399.png?height=787&width=1403)\n\n**（2）参与度-社交属性：一些 GameFi，同时也是 SocialFi**\n\n其次，是游戏的社交属性，我很认同曹寅老师的一个看法，也就是很大一部分吸引人的 GameFi，本质上也是 SocialFi，会去考虑玩家与玩家之间的连接。就像前面我们提到的“十字军”公会，成员能够跨游戏玩下去，本质上是游戏中友情的维系。\n\nDark Forest  虽然没有官方的公会体系，但团队一直在创造社交连接点，比如玩家可以选择绑定推特，和邻居商议和平共处，后来又增加了星球表情功能，让玩家通过表情交流，在关键时刻避免开战。\n\n有了这些人的链接，才可能建起有共识的公会。\n\n![](https://images.mirror-media.xyz/publication-images/e6ae415f-dde5-487b-84c0-13376ed315a6.png?height=361&width=1190)\n\n就像有一位国外玩家说的，**“我们在这里交的朋友，才是最珍贵的 NFT。”**\n\n如果无法做出特别硬核的链游，那么可以思考如何增加游戏的社交属性，很可能收获意想不到的效果，推动玩家在你的游戏中建立公会的雏形\n\n**（3）增加测试阶段，重视二次策划**\n\n因为链游较于传统游戏受经济模型影响更大，所以非常不建议跳过测试阶段，直接上线正式版。Dark Forest  到目前的版本，仍然是测试版，每个版本都在迭代，不断增加新的功能。\n\n比如，从 Dark Forest  v 0.5到 v 0.6的优化中，着重调整了游戏的平衡性，例如，星球的防御数值。\n\n如果大家玩过0.5版本的 Dark Forest  ，你会发现一旦星球被其他玩家占领，能量恢复满，几乎没多少可能再被攻占，这是因为它的防御数值非常高，已经到了影响可玩性的程度。0.6 版本中，这个数值被修改，增加了游戏的可玩性。\n\n如果做的是去中心化程度较高的链游，最好能够倾听社区开发者的建议，游戏创新较高的前提下，可以吸收社区开发者参与优化。\n\n![](https://images.mirror-media.xyz/publication-images/c8e7b995-7ea2-4ebd-ae9f-88e586aaa95f.png?height=469&width=1277)\n\n**（4）重视链上行为分析，活用数据分析工具**\n\n可能对于一些刚刚进入区块链世界的游戏团队来说，有一定的困难，因为既需要团队有数值策划的经验，又需要团队掌握一定的区块链技术基础。\n\n例如，你可以通过The Graph 自己写 Sub Graph，或者使用其他开发者写的 Sub Graph，去制作需要的数据分析图表，帮助自己的游戏团队针对性地理解游戏玩家的相关行为。\n\n在 Dark Forest 社区中，不少社区开发者做出了数据分析的贡献。 比如，在 v0.6 第一轮游戏中，一些玩家通过 The Graph 和 Infura，写了他们内部使用的数据分析平台，只需要输入玩家的地址，即可分析对方所有星球的信息，比如几级的行星占比更高，直接从链上推演敌方的实力，进行策略优化。\n\n刚刚结束的 0.6 第三轮，因为三大公会都创建了神器交易市场，让很多数据分析玩家开始关注这个轮次中的神器总数量、已被挖掘数量，由此去推测大部分玩家的游戏行为，推演下一轮大部分人的玩法。\n\n如果团队做不到这一点，降维版本的处理方案就是耐心倾听玩家建议，收集反馈，不断调整。\n\n### 题外话：选择公会就像是选择投后服务\n\n最后，想补充的一点是：链游选择吸引什么样的早期公会，就像是选择投后服务。\n\n头部公会和链游之间的关系，就像是头部机构和他们投资组合里的项目一样；比起传统游戏公会，链游公会可以是把氪金和耗时两种属性拉到满点的极端存在，与主要支持的链游共同成长，公会成员的构成，直接决定了公会主要支持的链游是否能获得长期且有力的支撑——因此，可以将这些支撑，视为投后服务，长期主义的链游公会不仅会投入大量资金，还会投入海量时间参与游戏生态建设。\n\n这里，还是以 Dark Forest 中的公会为例：\n\nGuild W，水滴公会，一部分早期成员来自一个节点运维组成的DAO，其他早期成员大部分是效率非常高的开发者，比较资深的链游玩家（全都是从2018年，甚至更早关注链游方向），有过游戏领域投资经验的机构朋友等等，目前专注 Dark Forest，兼具玩家俱乐部和生态建设的职责，核心成员帮助游戏维护中文社区，将中文玩家的建议转达给社区中关注游戏策划和分析的成员。\n\nDF DAO，主要成员是美国一些项目的开发者和运营，比如 Coinbase、Zapper、MyCrypto 等等，虽然工会人数不多，但和 Guild W 一样，主动承担游戏生态建设的责任，优点是成员在区块链行业内的工作经验丰富，专业背景较强，输出内容偏研究属性。\n\nOrden Guild 的核心成员是来自乌克兰的区块链开发者和链游玩家，他们同时玩 AAVEGOTCHI，开发效率也相对不错。 \n\n虽然玩家在游戏中大部分时候是竞争关系，但在游戏外，一些成员已经成为了不错的线上好友，会互相交流如何将游戏生态建设得更好，手里的 NFT 会如何去使用，未来或许有可能创造出黑暗森林之外的东西。比如，我和分形艺术家 Fractist 在合作一部分人物都是 NFT 的实验性科幻小说，其中的世界观和黑暗森林有部分重叠，来自 DF DAO 的玩家和其他非公会玩家都参与了我们的讨论，提出了一些自己的看法。\n\n总而言之，长期主义的链游，应倾向于有建设能力、同样秉持长期主义的链游公会，从最早期的利益分配到最终的退出机制，都能与这些公会达成平衡，互利共赢。\n\n感谢你看到最后\\~ :)\n\n( 作者：K Erica）", "timestamp": 1630651800, "digest": "Jr9eTcteVz83d924S0lsMuMfDFs4YTkiLyUYXupm8bw", "contributor": "0x84da37133a088Fbf4e21D80Aec2CC260B52eA116"}
{"id": "_k4AhBReF8iNWZF7JuVFYeG4haVAbfiYX95pbwiqOSI", "title": "如何打造一款吸引公会的链游：Dark Forest 的另一种解读", "body": "***说明：***\n\n*本文是我8月29日在元宇宙资本和纯白矩阵主办的 Metaverse 主题活动中分享的主要内容，分享时间有限，文本内容有所补充，不完全和分享内容一致。*\n\n*同时，建议大家去关注分享的回放，主题是游戏性的策划，另外两位分享者，周衍老师和宋阳老师，他们分享的内容都是非常专业的干货，能够为想要投身链游研发的朋友提供直接且有效的帮助。*\n\n我是来自 RhizomeDAO 和DAppChaser 的 Erica，同时是一位科幻创作者。接触这个行业比较早，还是刚刚读大学的时候，在全身心投入加密世界之前，我从事的是行业研究相关的工作，四年前开始写区块链相关的科普作品，参与过一些区块链项目的孵化。\n\n小学时，我开始玩网络游戏，是一些网游中公会战的积极玩家。在《天堂Ⅱ》的时代，我参与了个人游戏生涯中第一个公会；后来，担任过《飞飞》某个服务器最大公会的元老，记得那时最爱打的职业是巫师，升学期间，不幸终止于盗号。\n\n兴趣使然，对于链游，我一直保持着比较密切的关注。\n\n印象中，最早的「链游」，应该是2015到2016年，是一款卡牌对战游戏，算是古董级的链游，募集的是BTC，游戏币也不是Token，而是Coin。这个游戏有自己的链，现在已经彻底消失了，行情网站找不到任何信息，它的游戏道具是中心化的设定，和现在很火的 NFT 也没有任何关联。*（补充：这段是临时提到的，今天重新确认，这个游戏似乎已转手，成为了以太坊生态的 NFT 项目，但暂无起色。）*\n\n本次分享的主题是关于 Dark Forest 黑暗森林，一款灵感源于《三体》三部曲的去中心化区块链游戏，并由此出发，去谈谈链游如何从游戏机制上吸引公会，实现比较长期主义的良性发展。\n\n![](https://images.mirror-media.xyz/publication-images/617c0260-b34c-42d8-94b2-53c75cb86c14.png?height=416&width=607)\n\n## Dark Forest 是什么？\n\nDark Forest 是一款基于零知识证明的去中心化实时战略游戏，是一个非常重数值的游戏。玩家所在的宇宙会一直生成和扩大，地图信息存储在玩家浏览器本地，需要用算力进行探图；如果你没有探索出攻击一方的领地，那么你无法知道到底是谁正在攻击你，敌人实力究竟如何。\n\n![](https://images.mirror-media.xyz/publication-images/c0bfd070-6179-4512-82a4-228478346037.png?height=389&width=661)\n\n目前， Dark Forest  仍处于测试阶段，更像是限时的链上电竞赛事和黑客松。以下是从0.5 到现在的每一轮赛事的规则，我们留到后面的部分具体举例。\n\n![](https://images.mirror-media.xyz/publication-images/2f05a345-191c-4047-b31b-ed253db2eb92.png?height=413&width=1173)\n\n下图是我在 v 0.6 第二轮时截的数据，大家可以看到，一旦  Dark Forest 开始新的一轮，整个 XDAI 网络的 GAS 消耗会突然提升，而且占比最大的就是 Dark Forest 的合约交互。\n\n![](https://images.mirror-media.xyz/publication-images/2fbfc97b-62c3-4586-9a6c-b5c7c013b9a4.png?height=452&width=1280)\n\n因为 Dark Forest 是开放式的去中心化状态，大部分玩家会使用社区开源和自己制作的插件，链上交互非常高频，排名靠前的玩家每轮游戏可能会消耗上百 XDAI 。\n\n提醒：做链游，选择的链，会直接影响玩家的体验，需要考虑链的性能是否能支持游戏正常运转，链的生态是否能和游戏实现共赢。\n\n### 如何开始玩 Dark Forest?\n\n想要开始玩 Dark Forest，需要准备邀请码和充足的 XDAI。\n\n因为游戏行为都是链上交互，每笔交易需要消耗 XDAI；\n\n每一轮的邀请码并不互通，通常会根据上一轮游戏是否获得积分发放下一轮的邀请码，新玩家以通过邮箱登记获取 → [zkga.me](http://zkga.me/)，或是在 Dark Forest 官方的 Discord、Twitter 等渠道，等待社区其他成员分享邀请码。\n\n![](https://images.mirror-media.xyz/publication-images/6b0f29d4-8580-4c79-874b-fda5ad2df9e3.png?height=964&width=1214)\n\nDF Discord 设置了一个 #ask-for-keys 频道，群组成员在这里分享他们多出的邀请码\n\n如果你是新玩家，尚不知如何开始游戏，那么你可以阅读以下三篇由中文社区成员 FlakesGG 发布的游戏攻略：\n\n《[Dark Forest 完全攻略（入门篇）](https://www.dappchaser.com/dark-forest-guide1/)》\n\n《[Dark Forest 完全攻略（进阶篇-神器和插件指南）](https://www.dappchaser.com/dark-forest-guide2/)》\n\n《[Dark Forest 完全攻略（技术篇）](https://www.dappchaser.com/dark-forest-guide3/)》\n\n（游戏演示）\n\n## 为什么链游需要公会？\n\n在不少人眼中，游戏公会并不是一个特别正面的词，它很多时候和占有垄断地位、影响游戏可玩性的打金工作室联系在一起；即使是在链游领域，也经常有游戏团队直接封掉用脚本打金的用户地址。\n\n在此，我们不妨回顾一下国内早期网游中的游戏公会历史。\n\n**（1）无奖惩机制的早期网游和公会**\n\n最早的网络游戏，奖惩机制不明确。比如，有一款古董级的网游 UO，中文名是《网络创世纪》，游戏的 PK 既无奖励，又无惩罚；当时，有一批玩家热衷于恶意PK，导致另一些玩家形成了反恶意PK联盟；一些游戏文化研究论文认为，UO 中的这些联盟，是最早的游戏公会雏形。\n\n当时，有一个叫做 Sunny Land 的游戏公会，中文名是阳光大陆，后来逐渐发展成跨游戏公会。对于一些很早期的中国网游玩家来说，他们最早接触的公会可能就是 UO 里的这些公会。\n\n**（2）跨游戏公会和社交**\n\n随着游戏行业的发展，**游戏公会和工作室逐渐成为既能连接游戏内的玩家、增加游戏的社交属性、留存用户，又能影响游戏秩序的存在**。共识足够强的游戏公会，甚至会吸引游戏官方团队成员反向加入。\n\n1998年左右，有一个叫“网络十字军”的公会，最早起源于《笑傲江湖》，后来这批人又去玩了很多别的游戏，比如《万王之王》，靠这个游戏发展到数千人；后来的 17173 游戏门户网站，也是这个公会的核心成员和外部合作制作的。这个游戏公会几乎玩了那个时候所有的游戏，盛极一时。\n\n![](https://images.mirror-media.xyz/publication-images/304c7a9d-8345-4f1b-9d76-c0111e6a80ea.png?height=394&width=751)\n\n**（3）自带公会系统，帮助玩家凝聚共识的游戏机制**\n\n后来的一些游戏，通常自带公会系统，让玩家更方便地在游戏内自建有明确等级划分的公会，并通过游戏机制来帮助这些公会凝聚共识。例如，《传奇》中的攻占沙巴克城设定，谁攻占了沙巴克城，谁就控制了所在服务器的经济命脉；沙巴克城就是于权力和地位的象征。这个设定，直接刺激了玩家为公会贡献，也让不同公会之间相互斗争。\n\n![](https://images.mirror-media.xyz/publication-images/8ba33dff-fba5-4e65-9010-a5616747e932.png?height=361&width=642)\n\n链游中，Dark Forest 有过类似的设定。在刚刚结束的一轮中，游戏团队发布了类似的规则，让所有玩家都冲向宇宙的中心。如下图所示，游戏结束前，所有玩家都在往最中心发射能量。\n\n![](https://images.mirror-media.xyz/publication-images/6f88615f-095f-4068-bc90-4e41239e5257.png?height=330&width=627)\n\n与此同时，一些开发者玩家创建了识别公会成员的插件，让同一个成员能够互相辨别。\n\n这张图是 Guild W 微信群的玩家 Network 创建的成员识别插件效果。\n\n![](https://images.mirror-media.xyz/publication-images/aa72d82e-a162-41b4-83c5-ef4883c251bc.png?height=410&width=433)\n\n这种机制，促进了玩家对于游戏道具的消耗需求，从而支撑道具的市场价格，让所有玩家都劳有所得。\n\n![](https://images.mirror-media.xyz/publication-images/b12e8e7f-8f11-476b-9e05-8caaa4923e23.png?height=720&width=752)\n\n**（4）早期公会常见盈利模式：带新人、点卡 OTC、地推返点**\n\n再往后，更多年轻朋友也熟悉的《魔兽世界》，同样创造了网络游戏公会的一个高峰。\n\n当时的游戏主要是消耗点卡的模式，所以公会也出现了给加速器打广告、OTC 点卡之类的盈利模式，同时带新人玩家，比如带刷声望、赠送道具，甚至全程跟随等等，但这些都非常松散。\n\n当时的公会更主要的收益，源于地推的作用：即游戏公会频繁和新游戏合作，获取返点收益。然而，随着地推公会越来越多，内卷降临，一些新的公会为了争取玩家，会把返点直接给会员，导致所有公会整体收益越来越低。\n\n**（5）打金工作室和反打金机制的兴起**\n\n到了2004年的《天堂Ⅱ》，玩家可以参与代打，向打金公会缴纳游戏币换取法币工资，国内一些打金公会逐渐覆盖海外服务器，服务国外玩家，甚至形成垄断优势。\n\n![](https://images.mirror-media.xyz/publication-images/6acc063b-cae0-4430-bd3c-151767e5ef33.png?height=375&width=500)\n\n虽然2008年，有一家游戏代练工作室获得了武汉工商局颁发的营业执照，但整体上，一些工作室使用外挂辅助打金的行为被游戏公司所排斥，暴雪和腾讯都有过封禁打金工作室账号、联合警方捣毁实体工作室等行为。\n\n总而言之，几乎所有游戏都需要去考虑如何和公会之间达成和谐发展的目的。\n\n**链游团队不仅要从游戏性上考虑公会机制，还要从代币经济模型上和头部的公会达成平衡。**\n\n在我看来，Dark Forest 目前在这个方面做的比较理想，它能够收获更多陪着游戏不断迭代的长期玩家，而且**大部分都是非常原生的开发者，他们更愿意为游戏生态做建设，而不是投机玩家**。\n\n## 我们可以从 Dark Forest 学到什么？\n\n最后，还是回到一个我们想要探讨的主题：我们可以从 Dark Forest 学到什么？从游戏策划层面，想要创建吸引公会的链游，到底需要做什么样的努力。\n\n简单来说，仍是两个词——激励和约束——之间的平衡。\n\n黑暗森林虽好，但不是所有团队处境都相同，不可能盲目模仿。\n\n### 团队定位：可行性和创新性的平衡\n\n个人觉得，在设计游戏机制之前，首先应该明确，你要做，以及你能做的，到底是哪一种类型的链游。\n\n第一种是通过兑换结合 Token 的中心化游戏，如上一轮的链游，虽然省心，但很难发挥链游的优势；\n\n第二种是去中心化程度有限的链游，如CryptoZoon、Axie Infinity，相对更常见，但团队需要谨慎选择早期公会合作方，建议重视真实玩家数量多、愿意长期投入的公会；\n\n第三种是去中心化链游，如 Dark Forest，团队可以调整游戏机制，约束技术公会的权限，并且通过游戏外的插件激励，引导社区开发者专注于游戏生态建设，鼓励开发者对插件进行开源，而不是把全部心思花在输赢上。\n\n### 游戏机制：平衡玩家需求，凝聚共识\n\n游戏机制上，主要是平衡玩家需求，凝聚共识。\n\n玩家主要以公会为中心聚拢，大部分链游公会是跨游戏公会，玩家之间的情谊会让他们继续去成就不同的链游。比如YGG，虽然他们因为 Axie Infinity 出名，但实际上他们还有Sub DAO 机制，同时投入了其他的链游。\n\n链游团队无法改变这个从网络游戏时代就存在的现装，最好的应对方式是顺应它，满足玩家需求，尽可能提高游戏可玩性，留存用户。\n\n从黑暗森林中，我们可以学到一些平衡玩家需求的技巧。\n\n**（1）收益性-游戏经济：用好 NFT，避免限于传统游戏思路**\n\n首先是收益性方面， Dark Forest 没有发币，但它活用了NFT，也就是非同质化货币，按照获得形式，可以将其分为三类：\n\n一是位于 XDAI 网络的游戏道具——也就是神器，能够在每一轮游戏中为星球增加 BUFF，玩家通过在宇宙中寻找铸造厂，开启神器，这个过程和随机开盲盒非常类似，能够满足一部分玩家的收集欲，让所有玩家在探索宇宙的过程中，持续不断地获得满足感，不至于无聊，而公会则成为托底神器价格、在战争中调配神器的存在；\n\n![DF v0.5 中的神器，图片由 Flakegg 提供](https://images.mirror-media.xyz/publication-images/da5244a5-8657-4926-96a4-dc68f41b0b11.png?height=482&width=849)\n\n二是从0.6版本出现的，奖励每一轮游戏前63名的主网 NFT，第一名的 NFT 就像是电竞冠军奖杯一样的存在；随着游戏玩家的增多，仅凭一人之力很难获得第一名，第一名的 NFT 已经成为公会集体荣誉的象征，无价的存在。\n\n![](https://images.mirror-media.xyz/publication-images/e5b440b0-11ac-4a0b-92f6-401bca89abcf.png?height=479&width=1050)\n\n三是 Dark Forest 游戏之外的社区荣誉 NFT，虽然和主网 NFT 属于同一个合约铸造，但主要是奖励给为游戏生态贡献的玩家，这鼓励了开发者开源插件给普通玩家使用，避免公会过度垄断游戏，导致个人玩家无法融入。\n\n![](https://images.mirror-media.xyz/publication-images/5d1bed02-c501-4a6c-840d-df5bd7ab85f4.png?height=539&width=880)\n\n比较经典的案例，就是刚刚过去的 0.6 版本第三轮中， Dark Forest 中现存的三大公会先后推出了神器交易市场，Guild W 最早在官方推特发布，Orden Guild 和 DF DAO 紧随其后；公会的竞争不仅存在于游戏内，还存在于开发者之间的效率对决，个别开发者会主动帮忙找社区开源合约的问题，某种程度上发挥了早期安全审计的作用。\n\n![](https://images.mirror-media.xyz/publication-images/493afc52-221e-41e1-b04a-7f4b25a93438.png?height=787&width=1403)\n\n**（2）参与度-社交属性：一些 GameFi，同时也是 SocialFi**\n\n其次，是游戏的社交属性，我很认同曹寅老师的一个看法，也就是很大一部分吸引人的 GameFi，本质上也是 SocialFi，会去考虑玩家与玩家之间的连接。就像前面我们提到的“十字军”公会，成员能够跨游戏玩下去，本质上是游戏中友情的维系。\n\nDark Forest 虽然没有官方的公会体系，但团队一直在创造社交连接点，比如玩家可以选择绑定推特，和邻居商议和平共处，后来又增加了星球表情功能，让玩家通过表情交流，在关键时刻避免开战。\n\n有了这些人的链接，才可能建起有共识的公会。\n\n就像有一位国外玩家说的，**“我们在这里交的朋友，才是最珍贵的 NFT。”**\n\n![](https://images.mirror-media.xyz/publication-images/37a31237-1420-4ee6-940e-b52d50eadbbf.png?height=361&width=1190)\n\n如果无法做出特别硬核的链游，那么可以思考如何增加游戏的社交属性，很可能收获意想不到的效果，推动玩家在你的游戏中建立公会的雏形\n\n**（3）增加测试阶段，重视二次策划**\n\n因为链游较于传统游戏受经济模型影响更大，所以非常不建议跳过测试阶段，直接上线正式版。Dark Forest 到目前的版本，仍然是测试版，每个版本都在迭代，不断增加新的功能。\n\n比如，从 Dark Forest v 0.5到 v 0.6的优化中，着重调整了游戏的平衡性，例如，星球的防御数值。\n\n如果大家玩过0.5版本的 Dark Forest ，你会发现一旦星球被其他玩家占领，能量恢复满，几乎没多少可能再被攻占，这是因为它的防御数值非常高，已经到了影响可玩性的程度。0.6 版本中，这个数值被修改，增加了游戏的可玩性。\n\n如果做的是去中心化程度较高的链游，最好能够倾听社区开发者的建议，游戏创新较高的前提下，可以吸收社区开发者参与优化。\n\n![](https://images.mirror-media.xyz/publication-images/466d39f9-f9d3-4e90-8fe7-cfdadc65b8b8.png?height=469&width=1277)\n\n**（4）重视链上行为分析，活用数据分析工具**\n\n可能对于一些刚刚进入区块链世界的游戏团队来说，有一定的困难，因为既需要团队有数值策划的经验，又需要团队掌握一定的区块链技术基础。\n\n例如，你可以通过The Graph 自己写 Sub Graph，或者使用其他开发者写的 Sub Graph，去制作需要的数据分析图表，帮助自己的游戏团队针对性地理解游戏玩家的相关行为。\n\n在 Dark Forest 社区中，不少社区开发者做出了数据分析的贡献。 比如，在 v0.6 第一轮游戏中，一些玩家通过 The Graph 和 Infura，写了他们内部使用的数据分析平台，只需要输入玩家的地址，即可分析对方所有星球的信息，比如几级的行星占比更高，直接从链上推演敌方的实力，进行策略优化。\n\n刚刚结束的 0.6 第三轮，因为三大公会都创建了神器交易市场，让很多数据分析玩家开始关注这个轮次中的神器总数量、已被挖掘数量，由此去推测大部分玩家的游戏行为，推演下一轮大部分人的玩法。\n\n如果团队做不到这一点，降维版本的处理方案就是耐心倾听玩家建议，收集反馈，不断调整。\n\n### 题外话：选择公会就像是选择投后服务\n\n最后，想补充的一点是：链游选择吸引什么样的早期公会，就像是选择投后服务。\n\n头部公会和链游之间的关系，就像是头部机构和他们投资组合里的项目一样；比起传统游戏公会，链游公会可以是把氪金和耗时两种属性拉到满点的极端存在，与主要支持的链游共同成长，公会成员的构成，直接决定了公会主要支持的链游是否能获得长期且有力的支撑——因此，可以将这些支撑，视为投后服务，长期主义的链游公会不仅会投入大量资金，还会投入海量时间参与游戏生态建设。\n\n这里，还是以 Dark Forest 中的公会为例：\n\nGuild W，水滴公会，一部分早期成员来自一个节点运维组成的DAO，其他早期成员大部分是效率非常高的开发者，比较资深的链游玩家（全都是从2018年，甚至更早关注链游方向），有过游戏领域投资经验的机构朋友等等，目前专注 Dark Forest，兼具玩家俱乐部和生态建设的职责，核心成员帮助游戏维护中文社区，将中文玩家的建议转达给社区中关注游戏策划和分析的成员。\n\nDF DAO，主要成员是美国一些项目的开发者和运营，比如 Coinbase、Zapper、MyCrypto 等等，虽然工会人数不多，但和 Guild W 一样，主动承担游戏生态建设的责任，优点是成员在区块链行业内的工作经验丰富，专业背景较强，输出内容偏研究属性。\n\nOrden Guild 的核心成员是来自乌克兰的区块链开发者和链游玩家，他们同时玩 AAVEGOTCHI，开发效率也相对不错。\n\n虽然玩家在游戏中大部分时候是竞争关系，但在游戏外，一些成员已经成为了不错的线上好友，会互相交流如何将游戏生态建设得更好，手里的 NFT 会如何去使用，未来或许有可能创造出黑暗森林之外的东西。比如，我和分形艺术家 fractist 在合作一部分人物都是 NFT 的实验性科幻小说，其中的世界观和黑暗森林有部分重叠，来自 DF DAO 的玩家和其他非公会玩家都参与了我们的讨论，提出了一些自己的看法。\n\n总而言之，长期主义的链游，应倾向于有建设能力、同样秉持长期主义的链游公会，从最早期的利益分配到最终的退出机制，都能与这些公会达成平衡，互利共赢。\n\n感谢你看到最后\\~ :)\n\n( 作者：K Erica）", "timestamp": 1630658911, "digest": "buscA768adxMAmrORx5XS4sJjQHhAFGxT1bxTR-GInw", "contributor": "0x84da37133a088Fbf4e21D80Aec2CC260B52eA116"}
{"id": "z3pa-r7tRYWaWHTZFhNoWMLpkhH19N0PKpUPdF0rmdc", "title": "I'm Quitting Web2 (And So Should You)", "body": "👀 🚨 C*ollect your “I QUIT ~~WEB2~~” NFT at the bottom of the page* 🚨 *👀*\n\n## Something important is happening: The birth of a new economy\n\n[https://twitter.com/rafathebuilder/status/1433708946196418593?s=20](https://twitter.com/rafathebuilder/status/1433708946196418593?s=20)\n\nMy personal journey over the last year has led me through the artisan landscape of Puerto Rico, nascent online organizations on Discord, and through this unlikely intersection, to the [future of work](https://gnosisguild.mirror.xyz/t4F5rItMw4-mlpLZf5JQhElbDfQ2JRVKAzEpanyxW1Q).\n\nBarely a month after publishing my [first article](https://creators.mirror.xyz/862A5rBtKX3BC8eEircDnGwPIJJTJ33hn-MvnukByPc) on web3, I realize that my employer is not prepared to prevent the upcoming wave of [resignations](https://www.wired.co.uk/article/great-resignation-quit-job).\n\nThe competing backdrop is bullying its way to the forefront with a monumental offer: inspiration, a pathway to philanthropy, and [real ownership of work](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/). And the company's counteroffer? Predictability at the expense of my individual production [scale](https://store.legal.thomsonreuters.com/law-products/news-views/corporate-counsel/employer-and-employee-ownership-of-intellectual-property-not-as-easy-as-you-think), time with family, and creativity. Hmmm.\n\n[https://twitter.com/rafathebuilder/status/1399383928880963584?s=20](https://twitter.com/rafathebuilder/status/1399383928880963584?s=20)\n\n\n---\n\n## a BIG MOOD\n\nIt turns out many of us are having doubts about work. Is it the pandemic? The endless months in hibernation and [dangerous introspection](https://time.com/5925218/covid-19-pandemic-life-decisions/)? Or maybe the realization that once the noise of the office dies down, what's left is rise and grind? Either way, this feeling of dissatisfaction with the current working environments is rampant.\n\n\n***\n\n> *In a report called The Next Great Disruption Is Hybrid Work – [Are We Ready?](https://www.microsoft.com/en-us/worklab/work-trend-index), Microsoft found that as much as 54% of Generation Z workers and 41% of the entire global workforce could be considering handing in their resignation.*\n>\n> *Similarly, a UK and Ireland survey found that [38%](https://hr.personio.de/hubfs/EN_Downloads/202104_HRStudy_UKI.pdf) of employees were planning to leave their jobs in the next six months to a year, while a US survey reported that [42%](https://news.prudential.com/presskits/pulse-american-worker-survey-is-this-working.htm) of employees would quit if their company didn’t offer remote working options long term.*\n>\n> Source: World Economic Forum\n\n[https://twitter.com/rafathebuilder/status/1433501296422801411?s=20](https://twitter.com/rafathebuilder/status/1433501296422801411?s=20)\n\n\n---\n\nI was too embarrassed to tell my manager I was going into [web3](https://ethereum.org/en/developers/docs/web2-vs-web3/) directly when I spoke with them.\n\nI told them a half-truth instead: \"This is not the right role for me. I think the team needs folks who want to manage tech-support tickets and enjoy catering to customers on a daily basis. You need a team that feels challenged managing accounts...”\n\n***The better and more important half of the story has two parts:***\n\n1. The company is building technology for an age that is coming to an end, and\n2. I am no longer OK selling my personal work to any company, stealing my ability to scale expertise and wealth.\n\n[https://twitter.com/agorismlabs/status/1427009765075570696?s=20](https://twitter.com/agorismlabs/status/1427009765075570696?s=20)\n\n\n---\n\n## Note 1: Hear thee, yo, the hype is fr. Your tech is for the yesteryears.\n\nI joined this job last year. It was very near my dream job: tech startup, employee #22, remote, in an industry that I'm passionate about, and with cutting-edge API-first technology for its industry.\n\nAnd yet, I have quit for the uncertainty of web3 a bare 9 months later. Or might I say, I have succumbed to the certainty of participating in something bigger, more important, at a pivotal point in our collective history.\n\n![It's about to get weird. (Source: waitbutwhy.com)](https://images.mirror-media.xyz/publication-images/c9fa7760-4700-42b6-b6fe-65fce6ff6fc5.png?height=900&width=1265)\n\n\n---\n\nSpending any amount of time on[ crypto twitter](https://twitter.com/search?q=web3&src=typed_query) (CT) will, at first glance, suggest that there are many people overhyping the tech. It's cultish, weird, and colorful. But as you dig deeper, into the Discord servers of [avatar-specific](https://boredapeyachtclub.com/#/) communities for example, you'll find that the hype is real.\n\nBy real, I mean millions upon millions of dollars of investment by [top VC firms](https://a16z.com/crypto/) and personal wealth into tight-knit [pseudonymous](https://thehub.ca/in-the-know/2021-06-10/what-is-the-pseudonymous-economy-balaji-srinivasan/) communities, [fun](https://rainbow.me/) technology, and [micro-economies](https://coopahtroopa.mirror.xyz/gWY6Kfebs9wHdfoZZswfiLTBVzfKiyFaIwNf2q8JpgI). The folks working in this space have glassy eyes, looking beyond the horizon to something larger than themselves.\n\n![A new \"American West\" (Source: https://www.americanwest.amdigital.co.uk/)](https://images.mirror-media.xyz/publication-images/f637a315-997b-4b2a-a878-732235dd596d.png?height=362&width=980)\n\n[https://twitter.com/rafathebuilder/status/1424458503922536455?s=20](https://twitter.com/rafathebuilder/status/1424458503922536455?s=20)\n\n\n---\n\nAs I became enveloped in this new ecosystem (shoutout to[ @creatorcabins](https://twitter.com/creatorcabins) and [@forefront__](https://twitter.com/forefront__)), it became increasingly clear that the technology my company is building is outdated. Specifically, the company is automating outdated enterprise operations.\n\n> *\"Am I going to spend my time, energy, focus, and life building something for outdated methods of collaboration?\"*\n\nThe company will no doubt be very successful: they will disrupt the current market and become an enterprise leader. However, it is focusing on dominating an industry from a previous generation.\n\n[https://twitter.com/stefdelev/status/1431870223305658368?s=21](https://twitter.com/stefdelev/status/1431870223305658368?s=21)\n\nOnce I became aware of this, it became impossible to sit by the sidelines. New [digital-native organizations](https://www.notboring.co/p/the-dao-of-daos) are forming, maturing, and growing — and this is where the future of the global economy is being defined.\n\nMy enthusiasm can’t be contained any longer. If you’re a bit of an internet nerd like me, here are [some](https://sotonye.substack.com/p/if-einstein-had-the-internet-an-interview) [excellent](https://otherinter.net/squad-wealth/) [articles](https://ath.mirror.xyz/mDu_nGsWpjvF-KaPLADwxeAMfze3UJOtTAQi2CwPwWc) that might inspire you.\n\n\n---\n\n## Note 2: From employee to free agent\n\nHype aside, there is a larger second reason I am quitting [web2](https://dev.to/dabit3/the-new-creator-economy-daos-community-ownership-and-cryptoeconomics-lnl).\n\nTraditional organizations offer a trade-off for employees: You get paid a fixed capped amount (hourly, salary, bonus, equity), and the company retains your [intellectual property in perpetuity](https://www.uschamber.com/co/start/strategy/can-employees-own-intellectual-property#:\\~:text=If%20that%20worker%20is%20directly,or%20product%20for%20the%20business.). A fair exchange?\n\nPrior to the web, [I strongly believed this was a good bargain](https://en.wikipedia.org/wiki/The_Nature_of_the_Firm) due to transaction costs. Corporations and businesses paid you (on average) more than your ability to market and scale work across your lifespan. In other words, the payment was worth it. If you tried to create, market, sell, and scale individually, it would be too expensive (and you'd likely fail).\n\nNow, as with all things, the internet has [changed the trade-off](https://passion.io/blog/passion-economy-future-of-work#:\\~:text=The%20Passion%20Economy%20is%20a,exponentially%20and%20earn%20passive%20income.&text=The%20gig%20economy%20demands%20participants,horizon%20for%20their%20next%20one.)) dynamics. Individuals will slowly, and then suddenly, realize that their knowledge, craft, passion has accessible, monetizable niches. Companies are struggling to internalize this and, as a result, will have a great wave of [resignations](https://twitter.com/JoshuaOgundu/status/1429959048024125484?s=20) just like mine.\n\nMany companies think that increasing salaries or giving out larger bonuses will fix this, but it won't. Why? Because it is a question about ownership, [belonging](https://www.notboring.co/p/the-cooperation-economy-), and self-worth. It is not a question about take-home cash. The next-generation organizations understand this intuitively and emerge accordingly.\n\n[https://twitter.com/rafathebuilder/status/1421909057053597698?s=20](https://twitter.com/rafathebuilder/status/1421909057053597698?s=20)\n\n\n---\n\nTo better visualize the impact on organization dynamics, consider this 2x2 grid. On one axis, we have transaction costs (x-axis), and on the other we have organization group size (y-axis).\n\n![A 2x2, because I'm a consultant. (Source: @rafathebuilder)](https://images.mirror-media.xyz/publication-images/5b4dbddd-8fe7-4337-9e6f-6f8499ca492b.png?height=1174&width=1968)\n\nIn short: As transaction costs decrease (e.g. access to information, raw material for production, coordination and communication), the less need for central oversight and control (e.g. structured corporate entities). New organisms emerge, and participation pathways become possible.\n\nIn a traditional setting, you would need an interview and then a defined role to offset the cost of onboarding and coordination.\n\nBut now, I can write a single article as part of CabinDAO with no permission, get people to consent to the publication, and publish in a matter of days. No one requested this work, but these new organizations provided the space for me to express my creativity and passion. And beyond, the organization rewarded me with connections, work opportunities, and compensation. \\\\n\n\n[https://twitter.com/rafathebuilder/status/1422216770400751627?s=20](https://twitter.com/rafathebuilder/status/1422216770400751627?s=20)\n\n\n---\n\n## A digital artisan emerges\n\nOver the next year(s), I'll likely transform from a career professional into a pseudonymous agent across a variety of projects.\n\nTo start, I've joined [Forefront](http://forefront.news) in the Writers Guild, am supporting local creators at [CabinDAO](https://www.creatorcabins.com/), and have begun working as a freelancer on digital-native organization design (send me a message on Twitter [@rafathebuilder](https://twitter.com/rafathebuilder) if you’d like to speak).\n\nMost importantly, I'll continue my soul's passion: documenting the oral history of[ 100 local artisans of Puerto Rico](https://www.obrasdelpais.com/) and exploring a new, emerging generation of digital workers. I invite you to follow our journey at[ folklore.mirror.xyz](http://folklore.mirror.xyz) and support the mission.\n\nI'm not sure how this journey into web3 will turn out. However, I am sure that the exposure to this new economy will help me understand the future of work better. With some time, I might even reach the goal of becoming something more than a contributor: **A Digital Artisan.**\n\n![Personal vibe ambitions: Don Rafa, Puerto Rico Artisan (Source: obrasdelpais.com)](https://images.mirror-media.xyz/publication-images/0525b0c1-e503-40d4-8025-b14eb7bc5a1f.jpg?height=4000&width=6000)\n\n\n---\n\n## Finding your craft\n\nIf you're curious about the space and inspired, I'd recommend dipping a toe (or a leg) into the strange new organizations that are emerging today.\n\n**First off, sign up to the [Forefront newsletter](https://forefront.news/newsletter) and start learning about the space.**\n\nSecond, start building out your digital identity:\n\n1. Get some magic internet money into a wallet ([Rainbow.me](https://rainbow.me/), [Metamask](https://metamask.io/), or [others](https://ethereum.org/en/wallets/))\n2. Earn your first coins by completing quests on [rabbithole](https://rabbithole.gg/) ([More bounties here](https://www.coinvise.co/))\n3. Find your online squad by joining a DAO ([what is a DAO?](https://pet3rpan.medium.com/an-introduction-to-daos-782e3817e2cd)) ([Here is a list](https://forefront.market/market))\n4. Embrace the pseudonymous economy and buy your first Profile Picture NFT ([what is an NFT?](https://www.notion.so/cab150b9cbcc4b7fb6090fc77881a95d)) (Here is an example[ marketplace](https://opensea.io/))\n\nAnd lastly… and watch out for [gas fees](https://medium.com/geekculture/what-is-gwei-ethereum-gas-explained-c766330c2250)\n\n\n---\n\n***All funds from this NFT are in support of local Puerto Rico artisans through the [non-profit Obras del País](http://obrasdelpais.com). 100% of the proceeds will be used to promote their works online and build a digital gallery of their stories and artisanal techniques.***\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=238](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=238)\n\n", "timestamp": 1630659392, "digest": "bZ8GAWV25WkuRwe1Tftqgy0xV-7Y7VHeRUWbDcpuQVo", "contributor": "0xe62d071Ea99A63798Fec7222c483c53e87F2A32E"}
{"id": "9tdg3Ef6HcTVPOIYVhMyLcfgjTeo2_e8Dfr9o0_hjoo", "title": "如何打造一款吸引公会的链游：Dark Forest 的另一种解读", "body": "***说明：***\n\n*本文是我8月29日在元宇宙资本和纯白矩阵主办的 Metaverse 主题活动中分享的主要内容，分享时间有限，文本内容有所补充，不完全和分享内容一致。*\n\n*同时，建议大家去关注分享的回放，主题是游戏性的策划，另外两位分享者，周衍老师和宋阳老师，他们分享的内容都是非常专业的干货，能够为想要投身链游研发的朋友提供直接且有效的帮助。*\n\n我是来自 RhizomeDAO 和DAppChaser 的 Erica，同时是一位科幻创作者。接触这个行业比较早，还是刚刚读大学的时候，在全身心投入加密世界之前，我从事的是行业研究相关的工作，四年前开始写区块链相关的科普作品，参与过一些区块链项目的孵化。\n\n小学时，我开始玩网络游戏，是一些网游中公会战的积极玩家。在《天堂Ⅱ》的时代，我参与了个人游戏生涯中第一个公会；后来，担任过《飞飞》某个服务器最大公会的元老，记得那时最爱打的职业是巫师，升学期间，不幸终止于盗号。\n\n兴趣使然，对于链游，我一直保持着比较密切的关注。\n\n印象中，最早的「链游」，应该是2015到2016年，是一款卡牌对战游戏，算是古董级的链游，募集的是BTC，游戏币也不是Token，而是Coin。这个游戏有自己的链，现在已经彻底消失了，行情网站找不到任何信息，它的游戏道具是中心化的设定，和现在很火的 NFT 也没有任何关联。*（补充：这段是临时提到的，今天重新确认，这个游戏似乎已转手，成为了以太坊生态的 NFT 项目，但暂无起色。）*\n\n本次分享的主题是关于 Dark Forest 黑暗森林，一款灵感源于《三体》三部曲的去中心化区块链游戏，并由此出发，去谈谈链游如何从游戏机制上吸引公会，实现比较长期主义的良性发展。\n\n![](https://images.mirror-media.xyz/publication-images/617c0260-b34c-42d8-94b2-53c75cb86c14.png?height=416&width=607)\n\n## Dark Forest 是什么？\n\nDark Forest 是一款基于零知识证明的去中心化实时战略游戏，是一个非常重数值的游戏。玩家所在的宇宙会一直生成和扩大，地图信息存储在玩家浏览器本地，需要用算力进行探图；如果你没有探索出攻击一方的领地，那么你无法知道到底是谁正在攻击你，敌人实力究竟如何。\n\n![](https://images.mirror-media.xyz/publication-images/c0bfd070-6179-4512-82a4-228478346037.png?height=389&width=661)\n\n目前， Dark Forest  仍处于测试阶段，更像是限时的链上电竞赛事和黑客松。以下是从0.5 到现在的每一轮赛事的规则，我们留到后面的部分具体举例。\n\n![](https://images.mirror-media.xyz/publication-images/2f05a345-191c-4047-b31b-ed253db2eb92.png?height=413&width=1173)\n\n下图是我在 v 0.6 第二轮时截的数据，大家可以看到，一旦  Dark Forest 开始新的一轮，整个 XDAI 网络的 GAS 消耗会突然提升，而且占比最大的就是 Dark Forest 的合约交互。\n\n![](https://images.mirror-media.xyz/publication-images/2fbfc97b-62c3-4586-9a6c-b5c7c013b9a4.png?height=452&width=1280)\n\n因为 Dark Forest 是开放式的去中心化状态，大部分玩家会使用社区开源和自己制作的插件，链上交互非常高频，排名靠前的玩家每轮游戏可能会消耗上百 XDAI 。\n\n提醒：做链游，选择的链，会直接影响玩家的体验，需要考虑链的性能是否能支持游戏正常运转，链的生态是否能和游戏实现共赢。\n\n### 如何开始玩 Dark Forest?\n\n想要开始玩 Dark Forest，需要准备邀请码和充足的 XDAI。\n\n因为游戏行为都是链上交互，每笔交易需要消耗 XDAI；\n\n每一轮的邀请码并不互通，通常会根据上一轮游戏是否获得积分发放下一轮的邀请码，新玩家以通过邮箱登记获取 → [zkga.me](http://zkga.me/)，或是在 Dark Forest 官方的 Discord、Twitter 等渠道，等待社区其他成员分享邀请码。\n\n![](https://images.mirror-media.xyz/publication-images/6b0f29d4-8580-4c79-874b-fda5ad2df9e3.png?height=964&width=1214)\n\nDF Discord 设置了一个 #ask-for-keys 频道，群组成员在这里分享他们多出的邀请码\n\n如果你是新玩家，尚不知如何开始游戏，那么你可以阅读以下三篇由中文社区成员 FlakesGG 发布的游戏攻略：\n\n《[Dark Forest 完全攻略（入门篇）](https://www.dappchaser.com/dark-forest-guide1/)》\n\n《[Dark Forest 完全攻略（进阶篇-神器和插件指南）](https://www.dappchaser.com/dark-forest-guide2/)》\n\n《[Dark Forest 完全攻略（技术篇）](https://www.dappchaser.com/dark-forest-guide3/)》\n\n（游戏演示）\n\n## 为什么链游需要公会？\n\n在不少人眼中，游戏公会并不是一个特别正面的词，它很多时候和占有垄断地位、影响游戏可玩性的打金工作室联系在一起；即使是在链游领域，也经常有游戏团队直接封掉用脚本打金的用户地址。\n\n在此，我们不妨回顾一下国内早期网游中的游戏公会历史。\n\n**（1）无奖惩机制的早期网游和公会**\n\n最早的网络游戏，奖惩机制不明确。比如，有一款古董级的网游 UO，中文名是《网络创世纪》，游戏的 PK 既无奖励，又无惩罚；当时，有一批玩家热衷于恶意PK，导致另一些玩家形成了反恶意PK联盟；一些游戏文化研究论文认为，UO 中的这些联盟，是最早的游戏公会雏形。\n\n当时，有一个叫做 Sunny Land 的游戏公会，中文名是阳光大陆，后来逐渐发展成跨游戏公会。对于一些很早期的中国网游玩家来说，他们最早接触的公会可能就是 UO 里的这些公会。\n\n**（2）跨游戏公会和社交**\n\n随着游戏行业的发展，**游戏公会和工作室逐渐成为既能连接游戏内的玩家、增加游戏的社交属性、留存用户，又能影响游戏秩序的存在**。共识足够强的游戏公会，甚至会吸引游戏官方团队成员反向加入。\n\n1998年左右，有一个叫“网络十字军”的公会，最早起源于《笑傲江湖》，后来这批人又去玩了很多别的游戏，比如《万王之王》，靠这个游戏发展到数千人；后来的 17173 游戏门户网站，也是这个公会的核心成员和外部合作制作的。这个游戏公会几乎玩了那个时候所有的游戏，盛极一时。\n\n![](https://images.mirror-media.xyz/publication-images/304c7a9d-8345-4f1b-9d76-c0111e6a80ea.png?height=394&width=751)\n\n**（3）自带公会系统，帮助玩家凝聚共识的游戏机制**\n\n后来的一些游戏，通常自带公会系统，让玩家更方便地在游戏内自建有明确等级划分的公会，并通过游戏机制来帮助这些公会凝聚共识。例如，《传奇》中的攻占沙巴克城设定，谁攻占了沙巴克城，谁就控制了所在服务器的经济命脉；沙巴克城就是于权力和地位的象征。这个设定，直接刺激了玩家为公会贡献，也让不同公会之间相互斗争。\n\n![](https://images.mirror-media.xyz/publication-images/8ba33dff-fba5-4e65-9010-a5616747e932.png?height=361&width=642)\n\n链游中，Dark Forest 有过类似的设定。在刚刚结束的一轮中，游戏团队发布了类似的规则，让所有玩家都冲向宇宙的中心。如下图所示，游戏结束前，所有玩家都在往最中心发射能量。\n\n![](https://images.mirror-media.xyz/publication-images/6f88615f-095f-4068-bc90-4e41239e5257.png?height=330&width=627)\n\n与此同时，一些开发者玩家创建了识别公会成员的插件，让同一个成员能够互相辨别。\n\n这张图是 Guild W 微信群的玩家 Network 创建的成员识别插件效果。\n\n![](https://images.mirror-media.xyz/publication-images/aa72d82e-a162-41b4-83c5-ef4883c251bc.png?height=410&width=433)\n\n这种机制，促进了玩家对于游戏道具的消耗需求，从而支撑道具的市场价格，让所有玩家都劳有所得。\n\n![](https://images.mirror-media.xyz/publication-images/b12e8e7f-8f11-476b-9e05-8caaa4923e23.png?height=720&width=752)\n\n**（4）早期公会常见盈利模式：带新人、点卡 OTC、地推返点**\n\n再往后，更多年轻朋友也熟悉的《魔兽世界》，同样创造了网络游戏公会的一个高峰。\n\n当时的游戏主要是消耗点卡的模式，所以公会也出现了给加速器打广告、OTC 点卡之类的盈利模式，同时带新人玩家，比如带刷声望、赠送道具，甚至全程跟随等等，但这些都非常松散。\n\n当时的公会更主要的收益，源于地推的作用：即游戏公会频繁和新游戏合作，获取返点收益。然而，随着地推公会越来越多，内卷降临，一些新的公会为了争取玩家，会把返点直接给会员，导致所有公会整体收益越来越低。\n\n**（5）打金工作室和反打金机制的兴起**\n\n到了2004年的《天堂Ⅱ》，玩家可以参与代打，向打金公会缴纳游戏币换取法币工资，国内一些打金公会逐渐覆盖海外服务器，服务国外玩家，甚至形成垄断优势。\n\n![](https://images.mirror-media.xyz/publication-images/6acc063b-cae0-4430-bd3c-151767e5ef33.png?height=375&width=500)\n\n虽然2008年，有一家游戏代练工作室获得了武汉工商局颁发的营业执照，但整体上，一些工作室使用外挂辅助打金的行为被游戏公司所排斥，暴雪和腾讯都有过封禁打金工作室账号、联合警方捣毁实体工作室等行为。\n\n总而言之，几乎所有游戏都需要去考虑如何和公会之间达成和谐发展的目的。\n\n**链游团队不仅要从游戏性上考虑公会机制，还要从代币经济模型上和头部的公会达成平衡。**\n\n在我看来，Dark Forest 目前在这个方面做的比较理想，它能够收获更多陪着游戏不断迭代的长期玩家，而且**大部分都是非常原生的开发者，他们更愿意为游戏生态做建设，而不是投机玩家**。\n\n## 我们可以从 Dark Forest 学到什么？\n\n最后，还是回到一个我们想要探讨的主题：我们可以从 Dark Forest 学到什么？从游戏策划层面，想要创建吸引公会的链游，到底需要做什么样的努力。\n\n简单来说，仍是两个词——激励和约束——之间的平衡。\n\n黑暗森林虽好，但不是所有团队处境都相同，不可能盲目模仿。\n\n### 团队定位：可行性和创新性的平衡\n\n个人觉得，在设计游戏机制之前，首先应该明确，你要做，以及你能做的，到底是哪一种类型的链游。\n\n第一种是通过兑换结合 Token 的中心化游戏，如上一轮的链游，虽然省心，但很难发挥链游的优势；\n\n第二种是去中心化程度有限的链游，如CryptoZoon、Axie Infinity，相对更常见，但团队需要谨慎选择早期公会合作方，建议重视真实玩家数量多、愿意长期投入的公会；\n\n第三种是去中心化链游，如 Dark Forest，团队可以调整游戏机制，约束技术公会的权限，并且通过游戏外的插件激励，引导社区开发者专注于游戏生态建设，鼓励开发者对插件进行开源，而不是把全部心思花在输赢上。\n\n### 游戏机制：平衡玩家需求，凝聚共识\n\n游戏机制上，主要是平衡玩家需求，凝聚共识。\n\n玩家主要以公会为中心聚拢，大部分链游公会是跨游戏公会，玩家之间的情谊会让他们继续去成就不同的链游。比如YGG，虽然他们因为 Axie Infinity 出名，但实际上他们还有Sub DAO 机制，同时投入了其他的链游。\n\n链游团队无法改变这个从网络游戏时代就存在的现装，最好的应对方式是顺应它，满足玩家需求，尽可能提高游戏可玩性，留存用户。\n\n从黑暗森林中，我们可以学到一些平衡玩家需求的技巧。\n\n**（1）收益性-游戏经济：用好 NFT，避免限于传统游戏思路**\n\n首先是收益性方面， Dark Forest 没有发币，但它活用了NFT，也就是非同质化货币，按照获得形式，可以将其分为三类：\n\n一是位于 XDAI 网络的游戏道具——也就是神器，能够在每一轮游戏中为星球增加 BUFF，玩家通过在宇宙中寻找铸造厂，开启神器，这个过程和随机开盲盒非常类似，能够满足一部分玩家的收集欲，让所有玩家在探索宇宙的过程中，持续不断地获得满足感，不至于无聊，而公会则成为托底神器价格、在战争中调配神器的存在；\n\n![DF v0.5 中的神器，图片由 Flakegg 提供](https://images.mirror-media.xyz/publication-images/da5244a5-8657-4926-96a4-dc68f41b0b11.png?height=482&width=849)\n\n二是从0.6版本出现的，奖励每一轮游戏前63名的主网 NFT，第一名的 NFT 就像是电竞冠军奖杯一样的存在；随着游戏玩家的增多，仅凭一人之力很难获得第一名，第一名的 NFT 已经成为公会集体荣誉的象征，无价的存在。\n\n![](https://images.mirror-media.xyz/publication-images/e5b440b0-11ac-4a0b-92f6-401bca89abcf.png?height=479&width=1050)\n\n三是 Dark Forest 游戏之外的社区荣誉 NFT，虽然和主网 NFT 属于同一个合约铸造，但主要是奖励给为游戏生态贡献的玩家，这鼓励了开发者开源插件给普通玩家使用，避免公会过度垄断游戏，导致个人玩家无法融入。\n\n![](https://images.mirror-media.xyz/publication-images/5d1bed02-c501-4a6c-840d-df5bd7ab85f4.png?height=539&width=880)\n\n比较经典的案例，就是刚刚过去的 0.6 版本第三轮中， Dark Forest 中现存的三大公会先后推出了神器交易市场，Guild W 最早在官方推特发布，Orden Guild 和 DF DAO 紧随其后；公会的竞争不仅存在于游戏内，还存在于开发者之间的效率对决，个别开发者会主动帮忙找社区开源合约的问题，某种程度上发挥了早期安全审计的作用。\n\n![](https://images.mirror-media.xyz/publication-images/493afc52-221e-41e1-b04a-7f4b25a93438.png?height=787&width=1403)\n\n**（2）参与度-社交属性：一些 GameFi，同时也是 SocialFi**\n\n其次，是游戏的社交属性，我很认同曹寅老师的一个看法，也就是很大一部分吸引人的 GameFi，本质上也是 SocialFi，会去考虑玩家与玩家之间的连接。就像前面我们提到的“十字军”公会，成员能够跨游戏玩下去，本质上是游戏中友情的维系。\n\nDark Forest 虽然没有官方的公会体系，但团队一直在创造社交连接点，比如玩家可以选择绑定推特，和邻居商议和平共处，后来又增加了星球表情功能，让玩家通过表情交流，在关键时刻避免开战。\n\n有了这些人的链接，才可能建起有共识的公会。\n\n就像有一位国外玩家说的，**“我们在这里交的朋友，才是最珍贵的 NFT。”**\n\n![](https://images.mirror-media.xyz/publication-images/37a31237-1420-4ee6-940e-b52d50eadbbf.png?height=361&width=1190)\n\n如果无法做出特别硬核的链游，那么可以思考如何增加游戏的社交属性，很可能收获意想不到的效果，推动玩家在你的游戏中建立公会的雏形\n\n**（3）增加测试阶段，重视二次策划**\n\n因为链游较于传统游戏受经济模型影响更大，所以非常不建议跳过测试阶段，直接上线正式版。Dark Forest 到目前的版本，仍然是测试版，每个版本都在迭代，不断增加新的功能。\n\n比如，从 Dark Forest v 0.5到 v 0.6的优化中，着重调整了游戏的平衡性，例如，星球的防御数值。\n\n如果大家玩过0.5版本的 Dark Forest ，你会发现一旦星球被其他玩家占领，能量恢复满，几乎没多少可能再被攻占，这是因为它的防御数值非常高，已经到了影响可玩性的程度。0.6 版本中，这个数值被修改，增加了游戏的可玩性。\n\n如果做的是去中心化程度较高的链游，最好能够倾听社区开发者的建议，游戏创新较高的前提下，可以吸收社区开发者参与优化。\n\n![](https://images.mirror-media.xyz/publication-images/466d39f9-f9d3-4e90-8fe7-cfdadc65b8b8.png?height=469&width=1277)\n\n**（4）重视链上行为分析，活用数据分析工具**\n\n可能对于一些刚刚进入区块链世界的游戏团队来说，有一定的困难，因为既需要团队有数值策划的经验，又需要团队掌握一定的区块链技术基础。\n\n例如，你可以通过The Graph 自己写 Sub Graph，或者使用其他开发者写的 Sub Graph，去制作需要的数据分析图表，帮助自己的游戏团队针对性地理解游戏玩家的相关行为。\n\n在 Dark Forest 社区中，不少社区开发者做出了数据分析的贡献。 比如，在 v0.6 第一轮游戏中，一些玩家通过 The Graph 和 Infura，写了他们内部使用的数据分析平台，只需要输入玩家的地址，即可分析对方所有星球的信息，比如几级的行星占比更高，直接从链上推演敌方的实力，进行策略优化。\n\n刚刚结束的 0.6 第三轮，因为三大公会都创建了神器交易市场，让很多数据分析玩家开始关注这个轮次中的神器总数量、已被挖掘数量，由此去推测大部分玩家的游戏行为，推演下一轮大部分人的玩法。\n\n如果团队做不到这一点，降维版本的处理方案就是耐心倾听玩家建议，收集反馈，不断调整。\n\n### 题外话：选择公会就像是选择投后服务\n\n最后，想补充的一点是：链游选择吸引什么样的早期公会，就像是选择投后服务。\n\n头部公会和链游之间的关系，就像是头部机构和他们投资组合里的项目一样；比起传统游戏公会，链游公会可以是把氪金和耗时两种属性拉到满点的极端存在，与主要支持的链游共同成长，公会成员的构成，直接决定了公会主要支持的链游是否能获得长期且有力的支撑——因此，可以将这些支撑，视为投后服务，长期主义的链游公会不仅会投入大量资金，还会投入海量时间参与游戏生态建设。\n\n这里，还是以 Dark Forest 中的公会为例：\n\nGuild W，水滴公会，一部分早期成员来自一个节点运维组成的DAO，其他早期成员大部分是效率非常高的开发者，比较资深的链游玩家（全都是从2018年，甚至更早关注链游方向），有过游戏领域投资经验的机构朋友等等，目前专注 Dark Forest，兼具玩家俱乐部和生态建设的职责，核心成员帮助游戏维护中文社区，将中文玩家的建议转达给社区中关注游戏策划和分析的成员。\n\nDF DAO，主要成员是美国一些项目的开发者和运营，比如 Coinbase、Zapper、MyCrypto 等等，虽然工会人数不多，但和 Guild W 一样，主动承担游戏生态建设的责任，优点是成员在区块链行业内的工作经验丰富，专业背景较强，输出内容偏研究属性。\n\nOrden Guild 的核心成员是来自乌克兰的区块链开发者和链游玩家，他们同时玩 AAVEGOTCHI，开发效率也相对不错。\n\n虽然玩家在游戏中大部分时候是竞争关系，但在游戏外，一些成员已经成为了不错的线上好友，会互相交流如何将游戏生态建设得更好，手里的 NFT 会如何去使用，未来或许有可能创造出黑暗森林之外的东西。比如，我和分形艺术家 fractist 在合作一部分人物都是 NFT 的实验性科幻小说，其中的世界观和黑暗森林有部分重叠，来自 DF DAO 的玩家和其他非公会玩家都参与了我们的讨论，提出了一些自己的看法。\n\n总而言之，长期主义的链游，应倾向于有建设能力、同样秉持长期主义的链游公会，从最早期的利益分配到最终的退出机制，都能与这些公会达成平衡，互利共赢。\n\n感谢你看到最后\\~ :)\n\n( 作者：K Erica）", "timestamp": 1630658727, "digest": "buscA768adxMAmrORx5XS4sJjQHhAFGxT1bxTR-GInw", "contributor": "0x84da37133a088Fbf4e21D80Aec2CC260B52eA116"}
{"id": "4l4iQY8XC_pHnoBVjBXeU60ntv1pI9tOjgcAXPbUfAo", "title": "如何打造一款吸引公会的链游：Dark Forest 的另一种解读", "body": "***说明：***\n\n*本文是我8月29日在元宇宙资本和纯白矩阵主办的 Metaverse 主题活动中分享的主要内容，分享时间有限，文本内容有所补充，不完全和分享内容一致。*\n\n*同时，建议大家去关注分享的回放，主题是游戏性的策划，另外两位分享者，周衍老师和宋阳老师，他们分享的内容都是非常专业的干货，能够为想要投身链游研发的朋友提供直接且有效的帮助。*\n\n我是来自 RhizomeDAO 和DAppChaser 的 Erica，同时是一位科幻创作者。接触这个行业比较早，还是刚刚读大学的时候，在全身心投入加密世界之前，我从事的是行业研究相关的工作，四年前开始写区块链相关的科普作品，参与过一些区块链项目的孵化。\n\n小学时，我开始玩网络游戏，是一些网游中公会战的积极玩家。在《天堂Ⅱ》的时代，我参与了个人游戏生涯中第一个公会；后来，担任过《飞飞》某个服务器最大公会的元老，记得那时最爱打的职业是巫师，升学期间，不幸终止于盗号。\n\n兴趣使然，对于链游，我一直保持着比较密切的关注。\n\n印象中，最早的「链游」，应该是2015到2016年，是一款卡牌对战游戏，算是古董级的链游，募集的是BTC，游戏币也不是Token，而是Coin。这个游戏有自己的链，现在已经彻底消失了，行情网站找不到任何信息，它的游戏道具是中心化的设定，和现在很火的 NFT 也没有任何关联。*（补充：这段是临时提到的，今天重新确认，这个游戏似乎已转手，成为了以太坊生态的 NFT 项目，但暂无起色。）*\n\n本次分享的主题是关于 Dark Forest 黑暗森林，一款灵感源于《三体》三部曲的去中心化区块链游戏，并由此出发，去谈谈链游如何从游戏机制上吸引公会，实现比较长期主义的良性发展。\n\n![](https://images.mirror-media.xyz/publication-images/617c0260-b34c-42d8-94b2-53c75cb86c14.png?height=416&width=607)\n\n## Dark Forest 是什么？\n\nDark Forest 是一款基于零知识证明的去中心化实时战略游戏，是一个非常重数值的游戏。玩家所在的宇宙会一直生成和扩大，地图信息存储在玩家浏览器本地，需要用算力进行探图；如果你没有探索出攻击一方的领地，那么你无法知道到底是谁正在攻击你，敌人实力究竟如何。\n\n![](https://images.mirror-media.xyz/publication-images/c0bfd070-6179-4512-82a4-228478346037.png?height=389&width=661)\n\n目前， Dark Forest  仍处于测试阶段，更像是限时的链上电竞赛事和黑客松。以下是从0.5 到现在的每一轮赛事的规则，我们留到后面的部分具体举例。\n\n![](https://images.mirror-media.xyz/publication-images/2f05a345-191c-4047-b31b-ed253db2eb92.png?height=413&width=1173)\n\n下图是我在 v 0.6 第二轮时截的数据，大家可以看到，一旦  Dark Forest 开始新的一轮，整个 XDAI 网络的 GAS 消耗会突然提升，而且占比最大的就是 Dark Forest 的合约交互。\n\n![](https://images.mirror-media.xyz/publication-images/2fbfc97b-62c3-4586-9a6c-b5c7c013b9a4.png?height=452&width=1280)\n\n因为 Dark Forest 是开放式的去中心化状态，大部分玩家会使用社区开源和自己制作的插件，链上交互非常高频，排名靠前的玩家每轮游戏可能会消耗上百 XDAI 。\n\n提醒：做链游，选择的链，会直接影响玩家的体验，需要考虑链的性能是否能支持游戏正常运转，链的生态是否能和游戏实现共赢。\n\n### 如何开始玩 Dark Forest?\n\n想要开始玩 Dark Forest，需要准备邀请码和充足的 XDAI。\n\n因为游戏行为都是链上交互，每笔交易需要消耗 XDAI；\n\n每一轮的邀请码并不互通，通常会根据上一轮游戏是否获得积分发放下一轮的邀请码，新玩家以通过邮箱登记获取 → [zkga.me](http://zkga.me/)，或是在 Dark Forest 官方的 Discord、Twitter 等渠道，等待社区其他成员分享邀请码。\n\n![](https://images.mirror-media.xyz/publication-images/6b0f29d4-8580-4c79-874b-fda5ad2df9e3.png?height=964&width=1214)\n\nDF Discord 设置了一个 #ask-for-keys 频道，群组成员在这里分享他们多出的邀请码\n\n如果你是新玩家，尚不知如何开始游戏，那么你可以阅读以下三篇由中文社区成员 FlakesGG 发布的游戏攻略：\n\n《[Dark Forest 完全攻略（入门篇）](https://www.dappchaser.com/dark-forest-guide1/)》\n\n《[Dark Forest 完全攻略（进阶篇-神器和插件指南）](https://www.dappchaser.com/dark-forest-guide2/)》\n\n《[Dark Forest 完全攻略（技术篇）](https://www.dappchaser.com/dark-forest-guide3/)》\n\n（游戏演示）\n\n## 为什么链游需要公会？\n\n在不少人眼中，游戏公会并不是一个特别正面的词，它很多时候和占有垄断地位、影响游戏可玩性的打金工作室联系在一起；即使是在链游领域，也经常有游戏团队直接封掉用脚本打金的用户地址。\n\n在此，我们不妨回顾一下国内早期网游中的游戏公会历史。\n\n**（1）无奖惩机制的早期网游和公会**\n\n最早的网络游戏，奖惩机制不明确。比如，有一款古董级的网游 UO，中文名是《网络创世纪》，游戏的 PK 既无奖励，又无惩罚；当时，有一批玩家热衷于恶意PK，导致另一些玩家形成了反恶意PK联盟；一些游戏文化研究论文认为，UO 中的这些联盟，是最早的游戏公会雏形。\n\n当时，有一个叫做 Sunny Land 的游戏公会，中文名是阳光大陆，后来逐渐发展成跨游戏公会。对于一些很早期的中国网游玩家来说，他们最早接触的公会可能就是 UO 里的这些公会。\n\n**（2）跨游戏公会和社交**\n\n随着游戏行业的发展，**游戏公会和工作室逐渐成为既能连接游戏内的玩家、增加游戏的社交属性、留存用户，又能影响游戏秩序的存在**。共识足够强的游戏公会，甚至会吸引游戏官方团队成员反向加入。\n\n1998年左右，有一个叫“网络十字军”的公会，最早起源于《笑傲江湖》，后来这批人又去玩了很多别的游戏，比如《万王之王》，靠这个游戏发展到数千人；后来的 17173 游戏门户网站，也是这个公会的核心成员和外部合作制作的。这个游戏公会几乎玩了那个时候所有的游戏，盛极一时。\n\n![](https://images.mirror-media.xyz/publication-images/304c7a9d-8345-4f1b-9d76-c0111e6a80ea.png?height=394&width=751)\n\n**（3）自带公会系统，帮助玩家凝聚共识的游戏机制**\n\n后来的一些游戏，通常自带公会系统，让玩家更方便地在游戏内自建有明确等级划分的公会，并通过游戏机制来帮助这些公会凝聚共识。例如，《传奇》中的攻占沙巴克城设定，谁攻占了沙巴克城，谁就控制了所在服务器的经济命脉；沙巴克城就是于权力和地位的象征。这个设定，直接刺激了玩家为公会贡献，也让不同公会之间相互斗争。\n\n![](https://images.mirror-media.xyz/publication-images/8ba33dff-fba5-4e65-9010-a5616747e932.png?height=361&width=642)\n\n链游中，Dark Forest 有过类似的设定。在刚刚结束的一轮中，游戏团队发布了类似的规则，让所有玩家都冲向宇宙的中心。如下图所示，游戏结束前，所有玩家都在往最中心发射能量。\n\n![](https://images.mirror-media.xyz/publication-images/6f88615f-095f-4068-bc90-4e41239e5257.png?height=330&width=627)\n\n与此同时，一些开发者玩家创建了识别公会成员的插件，让同一个成员能够互相辨别。\n\n这张图是 Guild W 微信群的玩家 Network 创建的成员识别插件效果。\n\n![](https://images.mirror-media.xyz/publication-images/aa72d82e-a162-41b4-83c5-ef4883c251bc.png?height=410&width=433)\n\n这种机制，促进了玩家对于游戏道具的消耗需求，从而支撑道具的市场价格，让所有玩家都劳有所得。\n\n![](https://images.mirror-media.xyz/publication-images/b12e8e7f-8f11-476b-9e05-8caaa4923e23.png?height=720&width=752)\n\n**（4）早期公会常见盈利模式：带新人、点卡 OTC、地推返点**\n\n再往后，更多年轻朋友也熟悉的《魔兽世界》，同样创造了网络游戏公会的一个高峰。\n\n当时的游戏主要是消耗点卡的模式，所以公会也出现了给加速器打广告、OTC 点卡之类的盈利模式，同时带新人玩家，比如带刷声望、赠送道具，甚至全程跟随等等，但这些都非常松散。\n\n当时的公会更主要的收益，源于地推的作用：即游戏公会频繁和新游戏合作，获取返点收益。然而，随着地推公会越来越多，内卷降临，一些新的公会为了争取玩家，会把返点直接给会员，导致所有公会整体收益越来越低。\n\n**（5）打金工作室和反打金机制的兴起**\n\n到了2004年的《天堂Ⅱ》，玩家可以参与代打，向打金公会缴纳游戏币换取法币工资，国内一些打金公会逐渐覆盖海外服务器，服务国外玩家，甚至形成垄断优势。\n\n![](https://images.mirror-media.xyz/publication-images/6acc063b-cae0-4430-bd3c-151767e5ef33.png?height=375&width=500)\n\n虽然2008年，有一家游戏代练工作室获得了武汉工商局颁发的营业执照，但整体上，一些工作室使用外挂辅助打金的行为被游戏公司所排斥，暴雪和腾讯都有过封禁打金工作室账号、联合警方捣毁实体工作室等行为。\n\n总而言之，几乎所有游戏都需要去考虑如何和公会之间达成和谐发展的目的。\n\n**链游团队不仅要从游戏性上考虑公会机制，还要从代币经济模型上和头部的公会达成平衡。**\n\n在我看来，Dark Forest 目前在这个方面做的比较理想，它能够收获更多陪着游戏不断迭代的长期玩家，而且**大部分都是非常原生的开发者，他们更愿意为游戏生态做建设，而不是投机玩家**。\n\n## 我们可以从 Dark Forest 学到什么？\n\n最后，还是回到一个我们想要探讨的主题：我们可以从 Dark Forest 学到什么？从游戏策划层面，想要创建吸引公会的链游，到底需要做什么样的努力。\n\n简单来说，仍是两个词——激励和约束——之间的平衡。\n\n黑暗森林虽好，但不是所有团队处境都相同，不可能盲目模仿。\n\n### 团队定位：可行性和创新性的平衡\n\n个人觉得，在设计游戏机制之前，首先应该明确，你要做，以及你能做的，到底是哪一种类型的链游。\n\n第一种是通过兑换结合 Token 的中心化游戏，如上一轮的链游，虽然省心，但很难发挥链游的优势；\n\n第二种是去中心化程度有限的链游，如CryptoZoon、Axie Infinity，相对更常见，但团队需要谨慎选择早期公会合作方，建议重视真实玩家数量多、愿意长期投入的公会；\n\n第三种是去中心化链游，如 Dark Forest，团队可以调整游戏机制，约束技术公会的权限，并且通过游戏外的插件激励，引导社区开发者专注于游戏生态建设，鼓励开发者对插件进行开源，而不是把全部心思花在输赢上。\n\n### 游戏机制：平衡玩家需求，凝聚共识\n\n游戏机制上，主要是平衡玩家需求，凝聚共识。\n\n玩家主要以公会为中心聚拢，大部分链游公会是跨游戏公会，玩家之间的情谊会让他们继续去成就不同的链游。比如YGG，虽然他们因为 Axie Infinity 出名，但实际上他们还有Sub DAO 机制，同时投入了其他的链游。\n\n链游团队无法改变这个从网络游戏时代就存在的现装，最好的应对方式是顺应它，满足玩家需求，尽可能提高游戏可玩性，留存用户。\n\n从黑暗森林中，我们可以学到一些平衡玩家需求的技巧。\n\n**（1）收益性-游戏经济：用好 NFT，避免限于传统游戏思路**\n\n首先是收益性方面， Dark Forest 没有发币，但它活用了NFT，也就是非同质化货币，按照获得形式，可以将其分为三类：\n\n一是位于 XDAI 网络的游戏道具——也就是神器，能够在每一轮游戏中为星球增加 BUFF，玩家通过在宇宙中寻找铸造厂，开启神器，这个过程和随机开盲盒非常类似，能够满足一部分玩家的收集欲，让所有玩家在探索宇宙的过程中，持续不断地获得满足感，不至于无聊，而公会则成为托底神器价格、在战争中调配神器的存在；\n\n![DF v0.5 中的神器，图片由 Flakegg 提供](https://images.mirror-media.xyz/publication-images/da5244a5-8657-4926-96a4-dc68f41b0b11.png?height=482&width=849)\n\n二是从0.6版本出现的，奖励每一轮游戏前63名的主网 NFT，第一名的 NFT 就像是电竞冠军奖杯一样的存在；随着游戏玩家的增多，仅凭一人之力很难获得第一名，第一名的 NFT 已经成为公会集体荣誉的象征，无价的存在。\n\n![](https://images.mirror-media.xyz/publication-images/e5b440b0-11ac-4a0b-92f6-401bca89abcf.png?height=479&width=1050)\n\n三是 Dark Forest 游戏之外的社区荣誉 NFT，虽然和主网 NFT 属于同一个合约铸造，但主要是奖励给为游戏生态贡献的玩家，这鼓励了开发者开源插件给普通玩家使用，避免公会过度垄断游戏，导致个人玩家无法融入。\n\n![](https://images.mirror-media.xyz/publication-images/5d1bed02-c501-4a6c-840d-df5bd7ab85f4.png?height=539&width=880)\n\n比较经典的案例，就是刚刚过去的 0.6 版本第三轮中， Dark Forest 中现存的三大公会先后推出了神器交易市场，Guild W 最早在官方推特发布，Orden Guild 和 DF DAO 紧随其后；公会的竞争不仅存在于游戏内，还存在于开发者之间的效率对决，个别开发者会主动帮忙找社区开源合约的问题，某种程度上发挥了早期安全审计的作用。\n\n![](https://images.mirror-media.xyz/publication-images/493afc52-221e-41e1-b04a-7f4b25a93438.png?height=787&width=1403)\n\n**（2）参与度-社交属性：一些 GameFi，同时也是 SocialFi**\n\n其次，是游戏的社交属性，我很认同曹寅老师的一个看法，也就是很大一部分吸引人的 GameFi，本质上也是 SocialFi，会去考虑玩家与玩家之间的连接。就像前面我们提到的“十字军”公会，成员能够跨游戏玩下去，本质上是游戏中友情的维系。\n\nDark Forest 虽然没有官方的公会体系，但团队一直在创造社交连接点，比如玩家可以选择绑定推特，和邻居商议和平共处，后来又增加了星球表情功能，让玩家通过表情交流，在关键时刻避免开战。\n\n有了这些人的链接，才可能建起有共识的公会。\n\n就像有一位国外玩家说的，**“我们在这里交的朋友，才是最珍贵的 NFT。”**\n\n![](https://images.mirror-media.xyz/publication-images/37a31237-1420-4ee6-940e-b52d50eadbbf.png?height=361&width=1190)\n\n如果无法做出特别硬核的链游，那么可以思考如何增加游戏的社交属性，很可能收获意想不到的效果，推动玩家在你的游戏中建立公会的雏形\n\n**（3）增加测试阶段，重视二次策划**\n\n因为链游较于传统游戏受经济模型影响更大，所以非常不建议跳过测试阶段，直接上线正式版。Dark Forest 到目前的版本，仍然是测试版，每个版本都在迭代，不断增加新的功能。\n\n比如，从 Dark Forest v 0.5到 v 0.6的优化中，着重调整了游戏的平衡性，例如，星球的防御数值。\n\n如果大家玩过0.5版本的 Dark Forest ，你会发现一旦星球被其他玩家占领，能量恢复满，几乎没多少可能再被攻占，这是因为它的防御数值非常高，已经到了影响可玩性的程度。0.6 版本中，这个数值被修改，增加了游戏的可玩性。\n\n如果做的是去中心化程度较高的链游，最好能够倾听社区开发者的建议，游戏创新较高的前提下，可以吸收社区开发者参与优化。\n\n![](https://images.mirror-media.xyz/publication-images/466d39f9-f9d3-4e90-8fe7-cfdadc65b8b8.png?height=469&width=1277)\n\n**（4）重视链上行为分析，活用数据分析工具**\n\n可能对于一些刚刚进入区块链世界的游戏团队来说，有一定的困难，因为既需要团队有数值策划的经验，又需要团队掌握一定的区块链技术基础。\n\n例如，你可以通过The Graph 自己写 Sub Graph，或者使用其他开发者写的 Sub Graph，去制作需要的数据分析图表，帮助自己的游戏团队针对性地理解游戏玩家的相关行为。\n\n在 Dark Forest 社区中，不少社区开发者做出了数据分析的贡献。 比如，在 v0.6 第一轮游戏中，一些玩家通过 The Graph 和 Infura，写了他们内部使用的数据分析平台，只需要输入玩家的地址，即可分析对方所有星球的信息，比如几级的行星占比更高，直接从链上推演敌方的实力，进行策略优化。\n\n刚刚结束的 0.6 第三轮，因为三大公会都创建了神器交易市场，让很多数据分析玩家开始关注这个轮次中的神器总数量、已被挖掘数量，由此去推测大部分玩家的游戏行为，推演下一轮大部分人的玩法。\n\n如果团队做不到这一点，降维版本的处理方案就是耐心倾听玩家建议，收集反馈，不断调整。\n\n### 题外话：选择公会就像是选择投后服务\n\n最后，想补充的一点是：链游选择吸引什么样的早期公会，就像是选择投后服务。\n\n头部公会和链游之间的关系，就像是头部机构和他们投资组合里的项目一样；比起传统游戏公会，链游公会可以是把氪金和耗时两种属性拉到满点的极端存在，与主要支持的链游共同成长，公会成员的构成，直接决定了公会主要支持的链游是否能获得长期且有力的支撑——因此，可以将这些支撑，视为投后服务，长期主义的链游公会不仅会投入大量资金，还会投入海量时间参与游戏生态建设。\n\n这里，还是以 Dark Forest 中的公会为例：\n\nGuild W，水滴公会，一部分早期成员来自一个节点运维组成的DAO，其他早期成员大部分是效率非常高的开发者，比较资深的链游玩家（全都是从2018年，甚至更早关注链游方向），有过游戏领域投资经验的机构朋友等等，目前专注 Dark Forest，兼具玩家俱乐部和生态建设的职责，核心成员帮助游戏维护中文社区，将中文玩家的建议转达给社区中关注游戏策划和分析的成员。\n\nDF DAO，主要成员是美国一些项目的开发者和运营，比如 Coinbase、Zapper、MyCrypto 等等，虽然工会人数不多，但和 Guild W 一样，主动承担游戏生态建设的责任，优点是成员在区块链行业内的工作经验丰富，专业背景较强，输出内容偏研究属性。\n\nOrden Guild 的核心成员是来自乌克兰的区块链开发者和链游玩家，他们同时玩 AAVEGOTCHI，开发效率也相对不错。\n\n虽然玩家在游戏中大部分时候是竞争关系，但在游戏外，一些成员已经成为了不错的线上好友，会互相交流如何将游戏生态建设得更好，手里的 NFT 会如何去使用，未来或许有可能创造出黑暗森林之外的东西。比如，我和分形艺术家 fractist 在合作一部分人物都是 NFT 的实验性科幻小说，其中的世界观和黑暗森林有部分重叠，来自 DF DAO 的玩家和其他非公会玩家都参与了我们的讨论，提出了一些自己的看法。\n\n总而言之，长期主义的链游，应倾向于有建设能力、同样秉持长期主义的链游公会，从最早期的利益分配到最终的退出机制，都能与这些公会达成平衡，互利共赢。\n\n感谢你看到最后\\~ :)\n\n( 作者：K Erica）", "timestamp": 1630659097, "digest": "oAFPZSQohqF3qlTBbk4Mati9FWm9F6YlkaNVUq_cJuI", "contributor": "0x84da37133a088Fbf4e21D80Aec2CC260B52eA116"}
{"id": "_rbnRaftpEMnvWAi1M31qwViW3uB7bOj_Cuwd4ixgEk", "title": "I'm Quitting Web2 (And So Should You)", "body": "## Something important is happening: The birth of a new economy\n\n👀 🚨 C*ollect your “I QUIT ~~WEB2~~” NFT at the bottom of the page* 🚨 *👀*\n\n[https://twitter.com/rafathebuilder/status/1433708946196418593?s=20](https://twitter.com/rafathebuilder/status/1433708946196418593?s=20)\n\nMy personal journey over the last year has led me through the artisan landscape of Puerto Rico, nascent online organizations on Discord, and through this unlikely intersection, to the [future of work](https://gnosisguild.mirror.xyz/t4F5rItMw4-mlpLZf5JQhElbDfQ2JRVKAzEpanyxW1Q).\n\nBarely a month after publishing my [first article](https://creators.mirror.xyz/862A5rBtKX3BC8eEircDnGwPIJJTJ33hn-MvnukByPc) on web3, I realize that my employer is not prepared to prevent the upcoming wave of [resignations](https://www.wired.co.uk/article/great-resignation-quit-job).\n\nThe competing backdrop is bullying its way to the forefront with a monumental offer: inspiration, a pathway to philanthropy, and [real ownership of work](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/). And the company's counteroffer? Predictability at the expense of my individual production [scale](https://store.legal.thomsonreuters.com/law-products/news-views/corporate-counsel/employer-and-employee-ownership-of-intellectual-property-not-as-easy-as-you-think), time with family, and creativity. Hmmm.\n\n[https://twitter.com/rafathebuilder/status/1399383928880963584?s=20](https://twitter.com/rafathebuilder/status/1399383928880963584?s=20)\n\n\n---\n\n## a BIG MOOD\n\nIt turns out many of us are having doubts about work. Is it the pandemic? The endless months in hibernation and [dangerous introspection](https://time.com/5925218/covid-19-pandemic-life-decisions/)? Or maybe the realization that once the noise of the office dies down, what's left is rise and grind? Either way, this feeling of dissatisfaction with the current working environments is rampant.\n\n\n***\n\n> *In a report called The Next Great Disruption Is Hybrid Work – [Are We Ready?](https://www.microsoft.com/en-us/worklab/work-trend-index), Microsoft found that as much as 54% of Generation Z workers and 41% of the entire global workforce could be considering handing in their resignation.*\n>\n> *Similarly, a UK and Ireland survey found that [38%](https://hr.personio.de/hubfs/EN_Downloads/202104_HRStudy_UKI.pdf) of employees were planning to leave their jobs in the next six months to a year, while a US survey reported that [42%](https://news.prudential.com/presskits/pulse-american-worker-survey-is-this-working.htm) of employees would quit if their company didn’t offer remote working options long term.*\n>\n> Source: World Economic Forum\n\n[https://twitter.com/rafathebuilder/status/1433501296422801411?s=20](https://twitter.com/rafathebuilder/status/1433501296422801411?s=20)\n\n\n---\n\nI was too embarrassed to tell my manager I was going into [web3](https://ethereum.org/en/developers/docs/web2-vs-web3/) directly when I spoke with them.\n\nI told them a half-truth instead: \"This is not the right role for me. I think the team needs folks who want to manage tech-support tickets and enjoy catering to customers on a daily basis. You need a team that feels challenged managing accounts...”\n\n***The better and more important half of the story has two parts:***\n\n1. The company is building technology for an age that is coming to an end, and\n2. I am no longer OK selling my personal work to any company, stealing my ability to scale expertise and wealth.\n\n[https://twitter.com/agorismlabs/status/1427009765075570696?s=20](https://twitter.com/agorismlabs/status/1427009765075570696?s=20)\n\n\n---\n\n## Note 1: Hear thee, yo, the hype is fr. Your tech is for the yesteryears.\n\nI joined this job last year. It was very near my dream job: tech startup, employee #22, remote, in an industry that I'm passionate about, and with cutting-edge API-first technology for its industry.\n\nAnd yet, I have quit for the uncertainty of web3 a bare 9 months later. Or might I say, I have succumbed to the certainty of participating in something bigger, more important, at a pivotal point in our collective history.\n\n![It's about to get weird. (Source: waitbutwhy.com)](https://images.mirror-media.xyz/publication-images/c9fa7760-4700-42b6-b6fe-65fce6ff6fc5.png?height=900&width=1265)\n\n\n---\n\nSpending any amount of time on[ crypto twitter](https://twitter.com/search?q=web3&src=typed_query) (CT) will, at first glance, suggest that there are many people overhyping the tech. It's cultish, weird, and colorful. But as you dig deeper, into the Discord servers of [avatar-specific](https://boredapeyachtclub.com/#/) communities for example, you'll find that the hype is real.\n\nBy real, I mean millions upon millions of dollars of investment by [top VC firms](https://a16z.com/crypto/) and personal wealth into tight-knit [pseudonymous](https://thehub.ca/in-the-know/2021-06-10/what-is-the-pseudonymous-economy-balaji-srinivasan/) communities, [fun](https://rainbow.me/) technology, and [micro-economies](https://coopahtroopa.mirror.xyz/gWY6Kfebs9wHdfoZZswfiLTBVzfKiyFaIwNf2q8JpgI). The folks working in this space have glassy eyes, looking beyond the horizon to something larger than themselves.\n\n![A new \"American West\" (Source: https://www.americanwest.amdigital.co.uk/)](https://images.mirror-media.xyz/publication-images/f637a315-997b-4b2a-a878-732235dd596d.png?height=362&width=980)\n\n[https://twitter.com/rafathebuilder/status/1424458503922536455?s=20](https://twitter.com/rafathebuilder/status/1424458503922536455?s=20)\n\n\n---\n\nAs I became enveloped in this new ecosystem (shoutout to[ @creatorcabins](https://twitter.com/creatorcabins) and [@forefront__](https://twitter.com/forefront__)), it became increasingly clear that the technology my company is building is outdated. Specifically, the company is automating outdated enterprise operations.\n\n> *\"Am I going to spend my time, energy, focus, and life building something for outdated methods of collaboration?\"*\n\nThe company will no doubt be very successful: they will disrupt the current market and become an enterprise leader. However, it is focusing on dominating an industry from a previous generation.\n\n[https://twitter.com/stefdelev/status/1431870223305658368?s=21](https://twitter.com/stefdelev/status/1431870223305658368?s=21)\n\nOnce I became aware of this, it became impossible to sit by the sidelines. New [digital-native organizations](https://www.notboring.co/p/the-dao-of-daos) are forming, maturing, and growing — and this is where the future of the global economy is being defined.\n\nMy enthusiasm can’t be contained any longer. If you’re a bit of an internet nerd like me, here are [some](https://sotonye.substack.com/p/if-einstein-had-the-internet-an-interview) [excellent](https://otherinter.net/squad-wealth/) [articles](https://ath.mirror.xyz/mDu_nGsWpjvF-KaPLADwxeAMfze3UJOtTAQi2CwPwWc) that might inspire you.\n\n\n---\n\n## Note 2: From employee to free agent\n\nHype aside, there is a larger second reason I am quitting [web2](https://dev.to/dabit3/the-new-creator-economy-daos-community-ownership-and-cryptoeconomics-lnl).\n\nTraditional organizations offer a trade-off for employees: You get paid a fixed capped amount (hourly, salary, bonus, equity), and the company retains your [intellectual property in perpetuity](https://www.uschamber.com/co/start/strategy/can-employees-own-intellectual-property#:\\~:text=If%20that%20worker%20is%20directly,or%20product%20for%20the%20business.). A fair exchange?\n\nPrior to the web, [I strongly believed this was a good bargain](https://en.wikipedia.org/wiki/The_Nature_of_the_Firm) due to transaction costs. Corporations and businesses paid you (on average) more than your ability to market and scale work across your lifespan. In other words, the payment was worth it. If you tried to create, market, sell, and scale individually, it would be too expensive (and you'd likely fail).\n\nNow, as with all things, the internet has [changed the trade-off](https://passion.io/blog/passion-economy-future-of-work#:\\~:text=The%20Passion%20Economy%20is%20a,exponentially%20and%20earn%20passive%20income.&text=The%20gig%20economy%20demands%20participants,horizon%20for%20their%20next%20one.)) dynamics. Individuals will slowly, and then suddenly, realize that their knowledge, craft, passion has accessible, monetizable niches. Companies are struggling to internalize this and, as a result, will have a great wave of [resignations](https://twitter.com/JoshuaOgundu/status/1429959048024125484?s=20) just like mine.\n\nMany companies think that increasing salaries or giving out larger bonuses will fix this, but it won't. Why? Because it is a question about ownership, [belonging](https://www.notboring.co/p/the-cooperation-economy-), and self-worth. It is not a question about take-home cash. The next-generation organizations understand this intuitively and emerge accordingly.\n\n[https://twitter.com/rafathebuilder/status/1421909057053597698?s=20](https://twitter.com/rafathebuilder/status/1421909057053597698?s=20)\n\n\n---\n\nTo better visualize the impact on organization dynamics, consider this 2x2 grid. On one axis, we have transaction costs (x-axis), and on the other we have organization group size (y-axis).\n\n![A 2x2, because I'm a consultant. (Source: @rafathebuilder)](https://images.mirror-media.xyz/publication-images/5b4dbddd-8fe7-4337-9e6f-6f8499ca492b.png?height=1174&width=1968)\n\nIn short: As transaction costs decrease (e.g. access to information, raw material for production, coordination and communication), the less need for central oversight and control (e.g. structured corporate entities). New organisms emerge, and participation pathways become possible.\n\nIn a traditional setting, you would need an interview and then a defined role to offset the cost of onboarding and coordination.\n\nBut now, I can write a single article as part of CabinDAO with no permission, get people to consent to the publication, and publish in a matter of days. No one requested this work, but these new organizations provided the space for me to express my creativity and passion. And beyond, the organization rewarded me with connections, work opportunities, and compensation. \\\\n\n\n[https://twitter.com/rafathebuilder/status/1422216770400751627?s=20](https://twitter.com/rafathebuilder/status/1422216770400751627?s=20)\n\n\n---\n\n## A digital artisan emerges\n\nOver the next year(s), I'll likely transform from a career professional into a pseudonymous agent across a variety of projects.\n\nTo start, I've joined [Forefront](http://forefront.news) in the Writers Guild, am supporting local creators at [CabinDAO](https://www.creatorcabins.com/), and have begun working as a freelancer on digital-native organization design (send me a message on Twitter [@rafathebuilder](https://twitter.com/rafathebuilder) if you’d like to speak).\n\nMost importantly, I'll continue my soul's passion: documenting the oral history of[ 100 local artisans of Puerto Rico](https://www.obrasdelpais.com/) and exploring a new, emerging generation of digital workers. I invite you to follow our journey at[ folklore.mirror.xyz](http://folklore.mirror.xyz) and support the mission.\n\nI'm not sure how this journey into web3 will turn out. However, I am sure that the exposure to this new economy will help me understand the future of work better. With some time, I might even reach the goal of becoming something more than a contributor: **A Digital Artisan.**\n\n![Personal vibe ambitions: Don Rafa, Puerto Rico Artisan (Source: obrasdelpais.com)](https://images.mirror-media.xyz/publication-images/0525b0c1-e503-40d4-8025-b14eb7bc5a1f.jpg?height=4000&width=6000)\n\n\n---\n\n## Finding your craft\n\nIf you're curious about the space and inspired, I'd recommend dipping a toe (or a leg) into the strange new organizations that are emerging today.\n\n**First off, sign up to the [Forefront newsletter](https://forefront.news/newsletter) and start learning about the space.**\n\nSecond, start building out your digital identity:\n\n1. Get some magic internet money into a wallet ([Rainbow.me](https://rainbow.me/), [Metamask](https://metamask.io/), or [others](https://ethereum.org/en/wallets/))\n2. Earn your first coins by completing quests on [rabbithole](https://rabbithole.gg/) ([More bounties here](https://www.coinvise.co/))\n3. Find your online squad by joining a DAO ([what is a DAO?](https://pet3rpan.medium.com/an-introduction-to-daos-782e3817e2cd)) ([Here is a list](https://forefront.market/market))\n4. Embrace the pseudonymous economy and buy your first Profile Picture NFT ([what is an NFT?](https://www.notion.so/cab150b9cbcc4b7fb6090fc77881a95d)) (Here is an example[ marketplace](https://opensea.io/))\n\nAnd lastly… and watch out for [gas fees](https://medium.com/geekculture/what-is-gwei-ethereum-gas-explained-c766330c2250)\n\n\n---\n\n***All funds from this NFT are in support of local Puerto Rico artisans through the [non-profit Obras del País](http://obrasdelpais.com). 100% of the proceeds will be used to promote their works online and build a digital gallery of their stories and artisanal techniques.***\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=238](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=238)\n\n", "timestamp": 1630664301, "digest": "bZ8GAWV25WkuRwe1Tftqgy0xV-7Y7VHeRUWbDcpuQVo", "contributor": "0xe62d071Ea99A63798Fec7222c483c53e87F2A32E"}
{"id": "zIMzHK_zKt3wB6b3ZG8iMrUUBQQJ9PqPItxpHTD48e8", "title": "I'm Quitting Web2 (And So Should You)", "body": "## Something important is happening: The birth of a new economy\n\n[https://twitter.com/rafathebuilder/status/1433708946196418593?s=20](https://twitter.com/rafathebuilder/status/1433708946196418593?s=20)\n\nMy personal journey over the last year has led me through the artisan landscape of Puerto Rico, nascent online organizations on Discord, and through this unlikely intersection, to the [future of work](https://gnosisguild.mirror.xyz/t4F5rItMw4-mlpLZf5JQhElbDfQ2JRVKAzEpanyxW1Q).\n\nBarely a month after publishing my [first article](https://creators.mirror.xyz/862A5rBtKX3BC8eEircDnGwPIJJTJ33hn-MvnukByPc) on web3, I realize that my employer is not prepared to prevent the upcoming wave of [resignations](https://www.wired.co.uk/article/great-resignation-quit-job).\n\nThe competing backdrop is bullying its way to the forefront with a monumental offer: inspiration, a pathway to philanthropy, and [real ownership of work](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/). And the company's counteroffer? Predictability at the expense of my individual production [scale](https://store.legal.thomsonreuters.com/law-products/news-views/corporate-counsel/employer-and-employee-ownership-of-intellectual-property-not-as-easy-as-you-think), time with family, and creativity. Hmmm.\n\n[https://twitter.com/rafathebuilder/status/1399383928880963584?s=20](https://twitter.com/rafathebuilder/status/1399383928880963584?s=20)\n\n\n---\n\n## a BIG MOOD\n\nIt turns out many of us are having doubts about work. Is it the pandemic? The endless months in hibernation and [dangerous introspection](https://time.com/5925218/covid-19-pandemic-life-decisions/)? Or maybe the realization that once the noise of the office dies down, what's left is rise and grind? Either way, this feeling of dissatisfaction with the current working environments is rampant.\n\n\n***\n\n> *In a report called The Next Great Disruption Is Hybrid Work – [Are We Ready?](https://www.microsoft.com/en-us/worklab/work-trend-index), Microsoft found that as much as 54% of Generation Z workers and 41% of the entire global workforce could be considering handing in their resignation.*\n>\n> *Similarly, a UK and Ireland survey found that [38%](https://hr.personio.de/hubfs/EN_Downloads/202104_HRStudy_UKI.pdf) of employees were planning to leave their jobs in the next six months to a year, while a US survey reported that [42%](https://news.prudential.com/presskits/pulse-american-worker-survey-is-this-working.htm) of employees would quit if their company didn’t offer remote working options long term.*\n>\n> Source: World Economic Forum\n\n[https://twitter.com/rafathebuilder/status/1433501296422801411?s=20](https://twitter.com/rafathebuilder/status/1433501296422801411?s=20)\n\n\n---\n\nI was too embarrassed to tell my manager I was going into [web3](https://ethereum.org/en/developers/docs/web2-vs-web3/) directly when I spoke with them.\n\nI told them a half-truth instead: \"This is not the right role for me. I think the team needs folks who want to manage tech-support tickets and enjoy catering to customers on a daily basis. You need a team that feels challenged managing accounts...”\n\n***The better and more important half of the story has two parts:***\n\n1. The company is building technology for an age that is coming to an end, and\n2. I am no longer OK selling my personal work to any company, stealing my ability to scale expertise and wealth.\n\n[https://twitter.com/agorismlabs/status/1427009765075570696?s=20](https://twitter.com/agorismlabs/status/1427009765075570696?s=20)\n\n\n---\n\n## Note 1: Hear thee, yo, the hype is fr. Your tech is for the yesteryears.\n\nI joined this job last year. It was very near my dream job: tech startup, employee #22, remote, in an industry that I'm passionate about, and with cutting-edge API-first technology for its industry.\n\nAnd yet, I have quit for the uncertainty of web3 a bare 9 months later. Or might I say, I have succumbed to the certainty of participating in something bigger, more important, at a pivotal point in our collective history.\n\n![It's about to get weird. (Source: waitbutwhy.com)](https://images.mirror-media.xyz/publication-images/c9fa7760-4700-42b6-b6fe-65fce6ff6fc5.png?height=900&width=1265)\n\n\n---\n\nSpending any amount of time on[ crypto twitter](https://twitter.com/search?q=web3&src=typed_query) (CT) will, at first glance, suggest that there are many people overhyping the tech. It's cultish, weird, and colorful. But as you dig deeper, into the Discord servers of [avatar-specific](https://boredapeyachtclub.com/#/) communities for example, you'll find that the hype is real.\n\nBy real, I mean millions upon millions of dollars of investment by [top VC firms](https://a16z.com/crypto/) and personal wealth into tight-knit [pseudonymous](https://thehub.ca/in-the-know/2021-06-10/what-is-the-pseudonymous-economy-balaji-srinivasan/) communities, [fun](https://rainbow.me/) technology, and [micro-economies](https://coopahtroopa.mirror.xyz/gWY6Kfebs9wHdfoZZswfiLTBVzfKiyFaIwNf2q8JpgI). The folks working in this space have glassy eyes, looking beyond the horizon to something larger than themselves.\n\n![A new \"American West\" (Source: https://www.americanwest.amdigital.co.uk/)](https://images.mirror-media.xyz/publication-images/f637a315-997b-4b2a-a878-732235dd596d.png?height=362&width=980)\n\n[https://twitter.com/rafathebuilder/status/1424458503922536455?s=20](https://twitter.com/rafathebuilder/status/1424458503922536455?s=20)\n\n\n---\n\nAs I became enveloped in this new ecosystem (shoutout to[ @creatorcabins](https://twitter.com/creatorcabins) and [@forefront__](https://twitter.com/forefront__)), it became increasingly clear that the technology my company is building is outdated. Specifically, the company is automating outdated enterprise operations.\n\n> *\"Am I going to spend my time, energy, focus, and life building something for outdated methods of collaboration?\"*\n\nThe company will no doubt be very successful: they will disrupt the current market and become an enterprise leader. However, it is focusing on dominating an industry from a previous generation.\n\n[https://twitter.com/stefdelev/status/1431870223305658368?s=21](https://twitter.com/stefdelev/status/1431870223305658368?s=21)\n\nOnce I became aware of this, it became impossible to sit by the sidelines. New [digital-native organizations](https://www.notboring.co/p/the-dao-of-daos) are forming, maturing, and growing — and this is where the future of the global economy is being defined.\n\nMy enthusiasm can’t be contained any longer. If you’re a bit of an internet nerd like me, here are [some](https://sotonye.substack.com/p/if-einstein-had-the-internet-an-interview) [excellent](https://otherinter.net/squad-wealth/) [articles](https://ath.mirror.xyz/mDu_nGsWpjvF-KaPLADwxeAMfze3UJOtTAQi2CwPwWc) that might inspire you.\n\n\n---\n\n## Note 2: From employee to free agent\n\nHype aside, there is a larger second reason I am quitting [web2](https://dev.to/dabit3/the-new-creator-economy-daos-community-ownership-and-cryptoeconomics-lnl).\n\nTraditional organizations offer a trade-off for employees: You get paid a fixed capped amount (hourly, salary, bonus, equity), and the company retains your [intellectual property in perpetuity](https://www.uschamber.com/co/start/strategy/can-employees-own-intellectual-property#:\\~:text=If%20that%20worker%20is%20directly,or%20product%20for%20the%20business.). A fair exchange?\n\nPrior to the web, [I strongly believed this was a good bargain](https://en.wikipedia.org/wiki/The_Nature_of_the_Firm) due to transaction costs. Corporations and businesses paid you (on average) more than your ability to market and scale work across your lifespan. In other words, the payment was worth it. If you tried to create, market, sell, and scale individually, it would be too expensive (and you'd likely fail).\n\nNow, as with all things, the internet has [changed the trade-off](https://passion.io/blog/passion-economy-future-of-work#:\\~:text=The%20Passion%20Economy%20is%20a,exponentially%20and%20earn%20passive%20income.&text=The%20gig%20economy%20demands%20participants,horizon%20for%20their%20next%20one.)) dynamics. Individuals will slowly, and then suddenly, realize that their knowledge, craft, passion has accessible, monetizable niches. Companies are struggling to internalize this and, as a result, will have a great wave of [resignations](https://twitter.com/JoshuaOgundu/status/1429959048024125484?s=20) just like mine.\n\nMany companies think that increasing salaries or giving out larger bonuses will fix this, but it won't. Why? Because it is a question about ownership, [belonging](https://www.notboring.co/p/the-cooperation-economy-), and self-worth. It is not a question about take-home cash. The next-generation organizations understand this intuitively and emerge accordingly.\n\n[https://twitter.com/rafathebuilder/status/1421909057053597698?s=20](https://twitter.com/rafathebuilder/status/1421909057053597698?s=20)\n\n\n---\n\nTo better visualize the impact on organization dynamics, consider this 2x2 grid. On one axis, we have transaction costs (x-axis), and on the other we have organization group size (y-axis).\n\n![A 2x2, because I'm a consultant. (Source: @rafathebuilder)](https://images.mirror-media.xyz/publication-images/5b4dbddd-8fe7-4337-9e6f-6f8499ca492b.png?height=1174&width=1968)\n\nIn short: As transaction costs decrease (e.g. access to information, raw material for production, coordination and communication), the less need for central oversight and control (e.g. structured corporate entities). New organisms emerge, and participation pathways become possible.\n\nIn a traditional setting, you would need an interview and then a defined role to offset the cost of onboarding and coordination.\n\nBut now, I can write a single article as part of CabinDAO with no permission, get people to consent to the publication, and publish in a matter of days. No one requested this work, but these new organizations provided the space for me to express my creativity and passion. And beyond, the organization rewarded me with connections, work opportunities, and compensation. \\\\n\n\n[https://twitter.com/rafathebuilder/status/1422216770400751627?s=20](https://twitter.com/rafathebuilder/status/1422216770400751627?s=20)\n\n\n---\n\n## A digital artisan emerges\n\nOver the next year(s), I'll likely transform from a career professional into a pseudonymous agent across a variety of projects.\n\nTo start, I've joined [Forefront](http://forefront.news) in the Writers Guild, am supporting local creators at [CabinDAO](https://www.creatorcabins.com/), and have begun working as a freelancer on digital-native organization design (send me a message on Twitter [@rafathebuilder](https://twitter.com/rafathebuilder) if you’d like to speak).\n\nMost importantly, I'll continue my soul's passion: documenting the oral history of[ 100 local artisans of Puerto Rico](https://www.obrasdelpais.com/) and exploring a new, emerging generation of digital workers. I invite you to follow our journey at[ folklore.mirror.xyz](http://folklore.mirror.xyz) and support the mission.\n\nI'm not sure how this journey into web3 will turn out. However, I am sure that the exposure to this new economy will help me understand the future of work better. With some time, I might even reach the goal of becoming something more than a contributor: **A Digital Artisan.**\n\n![Personal vibe ambitions: Don Rafa, Puerto Rico Artisan (Source: obrasdelpais.com)](https://images.mirror-media.xyz/publication-images/0525b0c1-e503-40d4-8025-b14eb7bc5a1f.jpg?height=4000&width=6000)\n\n\n---\n\n## Finding your craft\n\nIf you're curious about the space and inspired, I'd recommend dipping a toe (or a leg) into the strange new organizations that are emerging today.\n\n**First off, sign up to the [Forefront newsletter](https://forefront.news/newsletter) and start learning about the space.**\n\nSecond, start building out your digital identity:\n\n1. Get some magic internet money into a wallet ([Rainbow.me](https://rainbow.me/), [Metamask](https://metamask.io/), or [others](https://ethereum.org/en/wallets/))\n2. Earn your first coins by completing quests on [rabbithole](https://rabbithole.gg/) ([More bounties here](https://www.coinvise.co/))\n3. Find your online squad by joining a DAO ([what is a DAO?](https://pet3rpan.medium.com/an-introduction-to-daos-782e3817e2cd)) ([Here is a list](https://forefront.market/market))\n4. Embrace the pseudonymous economy and buy your first Profile Picture NFT ([what is an NFT?](https://www.notion.so/cab150b9cbcc4b7fb6090fc77881a95d)) (Here is an example[ marketplace](https://opensea.io/))\n\nAnd lastly… and watch out for [gas fees](https://medium.com/geekculture/what-is-gwei-ethereum-gas-explained-c766330c2250)\n\n\n---\n\n***All funds from this NFT are in support of local Puerto Rico artisans through the [non-profit Obras del País](http://obrasdelpais.com). 100% of the proceeds will be used to promote their works online and build a digital gallery of their stories and artisanal techniques.***\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=238](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=238)\n\n", "timestamp": 1630664259, "digest": "bZ8GAWV25WkuRwe1Tftqgy0xV-7Y7VHeRUWbDcpuQVo", "contributor": "0xe62d071Ea99A63798Fec7222c483c53e87F2A32E"}
{"id": "43F79zDre6h1nBSdEbPOv8IS3rCq4fW8rd6G5TpabHY", "title": "I'm Quitting Web2 (And So Should You)", "body": "## Something important is happening: The birth of a new economy\n\n👀 🚨 C*ollect your “I QUIT ~~WEB2~~” NFT at the bottom of the page* 🚨 *👀*\n\n[https://twitter.com/rafathebuilder/status/1433708946196418593?s=20](https://twitter.com/rafathebuilder/status/1433708946196418593?s=20)\n\nMy personal journey over the last year has led me through the artisan landscape of Puerto Rico, nascent online organizations on Discord, and through this unlikely intersection, to the [future of work](https://gnosisguild.mirror.xyz/t4F5rItMw4-mlpLZf5JQhElbDfQ2JRVKAzEpanyxW1Q).\n\nBarely a month after publishing my [first article](https://creators.mirror.xyz/862A5rBtKX3BC8eEircDnGwPIJJTJ33hn-MvnukByPc) on web3, I realize that my employer is not prepared to prevent the upcoming wave of [resignations](https://www.wired.co.uk/article/great-resignation-quit-job).\n\nThe competing backdrop is bullying its way to the forefront with a monumental offer: inspiration, a pathway to philanthropy, and [real ownership of work](https://variant.fund/the-ownership-economy-crypto-and-consumer-software/). And the company's counteroffer? Predictability at the expense of my individual production [scale](https://store.legal.thomsonreuters.com/law-products/news-views/corporate-counsel/employer-and-employee-ownership-of-intellectual-property-not-as-easy-as-you-think), time with family, and creativity. Hmmm.\n\n[https://twitter.com/rafathebuilder/status/1399383928880963584?s=20](https://twitter.com/rafathebuilder/status/1399383928880963584?s=20)\n\n\n---\n\n## a BIG MOOD\n\nIt turns out many of us are having doubts about work. Is it the pandemic? The endless months in hibernation and [dangerous introspection](https://time.com/5925218/covid-19-pandemic-life-decisions/)? Or maybe the realization that once the noise of the office dies down, what's left is rise and grind? Either way, this feeling of dissatisfaction with the current working environments is rampant.\n\n\n***\n\n> *In a report called The Next Great Disruption Is Hybrid Work – [Are We Ready?](https://www.microsoft.com/en-us/worklab/work-trend-index), Microsoft found that as much as 54% of Generation Z workers and 41% of the entire global workforce could be considering handing in their resignation.*\n>\n> *Similarly, a UK and Ireland survey found that [38%](https://hr.personio.de/hubfs/EN_Downloads/202104_HRStudy_UKI.pdf) of employees were planning to leave their jobs in the next six months to a year, while a US survey reported that [42%](https://news.prudential.com/presskits/pulse-american-worker-survey-is-this-working.htm) of employees would quit if their company didn’t offer remote working options long term.*\n>\n> Source: World Economic Forum\n\n[https://twitter.com/rafathebuilder/status/1433501296422801411?s=20](https://twitter.com/rafathebuilder/status/1433501296422801411?s=20)\n\n\n---\n\nI was too embarrassed to tell my manager I was going into [web3](https://ethereum.org/en/developers/docs/web2-vs-web3/) directly when I spoke with them.\n\nI told them a half-truth instead: \"This is not the right role for me. I think the team needs folks who want to manage tech-support tickets and enjoy catering to customers on a daily basis. You need a team that feels challenged managing accounts...”\n\n***The better and more important half of the story has two parts:***\n\n1. The company is building technology for an age that is coming to an end, and\n2. I am no longer OK selling my personal work to any company, stealing my ability to scale expertise and wealth.\n\n[https://twitter.com/agorismlabs/status/1427009765075570696?s=20](https://twitter.com/agorismlabs/status/1427009765075570696?s=20)\n\n\n---\n\n## Note 1: Hear thee, yo, the hype is fr. Your tech is for the yesteryears.\n\nI joined this job last year. It was very near my dream job: tech startup, employee #22, remote, in an industry that I'm passionate about, and with cutting-edge API-first technology for its industry.\n\nAnd yet, I have quit for the uncertainty of web3 a bare 9 months later. Or might I say, I have succumbed to the certainty of participating in something bigger, more important, at a pivotal point in our collective history.\n\n![It's about to get weird. (Source: waitbutwhy.com)](https://images.mirror-media.xyz/publication-images/c9fa7760-4700-42b6-b6fe-65fce6ff6fc5.png?height=900&width=1265)\n\n\n---\n\nSpending any amount of time on[ crypto twitter](https://twitter.com/search?q=web3&src=typed_query) (CT) will, at first glance, suggest that there are many people overhyping the tech. It's cultish, weird, and colorful. But as you dig deeper, into the Discord servers of [avatar-specific](https://boredapeyachtclub.com/#/) communities for example, you'll find that the hype is real.\n\nBy real, I mean millions upon millions of dollars of investment by [top VC firms](https://a16z.com/crypto/) and personal wealth into tight-knit [pseudonymous](https://thehub.ca/in-the-know/2021-06-10/what-is-the-pseudonymous-economy-balaji-srinivasan/) communities, [fun](https://rainbow.me/) technology, and [micro-economies](https://coopahtroopa.mirror.xyz/gWY6Kfebs9wHdfoZZswfiLTBVzfKiyFaIwNf2q8JpgI). The folks working in this space have glassy eyes, looking beyond the horizon to something larger than themselves.\n\n![A new \"American West\" (Source: https://www.americanwest.amdigital.co.uk/)](https://images.mirror-media.xyz/publication-images/f637a315-997b-4b2a-a878-732235dd596d.png?height=362&width=980)\n\n[https://twitter.com/rafathebuilder/status/1424458503922536455?s=20](https://twitter.com/rafathebuilder/status/1424458503922536455?s=20)\n\n\n---\n\nAs I became enveloped in this new ecosystem (shoutout to[ @creatorcabins](https://twitter.com/creatorcabins) and [@forefront__](https://twitter.com/forefront__)), it became increasingly clear that the technology my company is building is outdated. Specifically, the company is automating outdated enterprise operations.\n\n> *\"Am I going to spend my time, energy, focus, and life building something for outdated methods of collaboration?\"*\n\nThe company will no doubt be very successful: they will disrupt the current market and become an enterprise leader. However, it is focusing on dominating an industry from a previous generation.\n\n[https://twitter.com/stefdelev/status/1431870223305658368?s=21](https://twitter.com/stefdelev/status/1431870223305658368?s=21)\n\nOnce I became aware of this, it became impossible to sit by the sidelines. New [digital-native organizations](https://www.notboring.co/p/the-dao-of-daos) are forming, maturing, and growing — and this is where the future of the global economy is being defined.\n\nMy enthusiasm can’t be contained any longer. If you’re a bit of an internet nerd like me, here are [some](https://sotonye.substack.com/p/if-einstein-had-the-internet-an-interview) [excellent](https://otherinter.net/squad-wealth/) [articles](https://ath.mirror.xyz/mDu_nGsWpjvF-KaPLADwxeAMfze3UJOtTAQi2CwPwWc) that might inspire you.\n\n\n---\n\n## Note 2: From employee to free agent\n\nHype aside, there is a larger second reason I am quitting [web2](https://dev.to/dabit3/the-new-creator-economy-daos-community-ownership-and-cryptoeconomics-lnl).\n\nTraditional organizations offer a trade-off for employees: You get paid a fixed capped amount (hourly, salary, bonus, equity), and the company retains your [intellectual property in perpetuity](https://www.uschamber.com/co/start/strategy/can-employees-own-intellectual-property#:\\~:text=If%20that%20worker%20is%20directly,or%20product%20for%20the%20business.). A fair exchange?\n\nPrior to the web, [I strongly believed this was a good bargain](https://en.wikipedia.org/wiki/The_Nature_of_the_Firm) due to transaction costs. Corporations and businesses paid you (on average) more than your ability to market and scale work across your lifespan. In other words, the payment was worth it. If you tried to create, market, sell, and scale individually, it would be too expensive (and you'd likely fail).\n\nNow, as with all things, the internet has [changed the trade-off](https://passion.io/blog/passion-economy-future-of-work#:\\~:text=The%20Passion%20Economy%20is%20a,exponentially%20and%20earn%20passive%20income.&text=The%20gig%20economy%20demands%20participants,horizon%20for%20their%20next%20one.)) dynamics. Individuals will slowly, and then suddenly, realize that their knowledge, craft, passion has accessible, monetizable niches. Companies are struggling to internalize this and, as a result, will have a great wave of [resignations](https://twitter.com/JoshuaOgundu/status/1429959048024125484?s=20) just like mine.\n\nMany companies think that increasing salaries or giving out larger bonuses will fix this, but it won't. Why? Because it is a question about ownership, [belonging](https://www.notboring.co/p/the-cooperation-economy-), and self-worth. It is not a question about take-home cash. The next-generation organizations understand this intuitively and emerge accordingly.\n\n[https://twitter.com/rafathebuilder/status/1421909057053597698?s=20](https://twitter.com/rafathebuilder/status/1421909057053597698?s=20)\n\n\n---\n\nTo better visualize the impact on organization dynamics, consider this 2x2 grid. On one axis, we have transaction costs (x-axis), and on the other we have organization group size (y-axis).\n\n![A 2x2, because I'm a consultant. (Source: @rafathebuilder)](https://images.mirror-media.xyz/publication-images/5b4dbddd-8fe7-4337-9e6f-6f8499ca492b.png?height=1174&width=1968)\n\nIn short: As transaction costs decrease (e.g. access to information, raw material for production, coordination and communication), the less need for central oversight and control (e.g. structured corporate entities). New organisms emerge, and participation pathways become possible.\n\nIn a traditional setting, you would need an interview and then a defined role to offset the cost of onboarding and coordination.\n\nBut now, I can write a single article as part of CabinDAO with no permission, get people to consent to the publication, and publish in a matter of days. No one requested this work, but these new organizations provided the space for me to express my creativity and passion. And beyond, the organization rewarded me with connections, work opportunities, and compensation. \\\\n\n\n[https://twitter.com/rafathebuilder/status/1422216770400751627?s=20](https://twitter.com/rafathebuilder/status/1422216770400751627?s=20)\n\n\n---\n\n## A digital artisan emerges\n\nOver the next year(s), I'll likely transform from a career professional into a pseudonymous agent across a variety of projects.\n\nTo start, I've joined [Forefront](http://forefront.news) in the Writers Guild, am supporting local creators at [CabinDAO](https://www.creatorcabins.com/), and have begun working as a freelancer on digital-native organization design (send me a message on Twitter [@rafathebuilder](https://twitter.com/rafathebuilder) if you’d like to speak).\n\nMost importantly, I'll continue my soul's passion: documenting the oral history of[ 100 local artisans of Puerto Rico](https://www.obrasdelpais.com/) and exploring a new, emerging generation of digital workers. I invite you to follow our journey at[ folklore.mirror.xyz](http://folklore.mirror.xyz) and support the mission.\n\nI'm not sure how this journey into web3 will turn out. However, I am sure that the exposure to this new economy will help me understand the future of work better. With some time, I might even reach the goal of becoming something more than a contributor: **A Digital Artisan.**\n\n![Personal vibe ambitions: Don Rafa, Puerto Rico Artisan (Source: obrasdelpais.com)](https://images.mirror-media.xyz/publication-images/0525b0c1-e503-40d4-8025-b14eb7bc5a1f.jpg?height=4000&width=6000)\n\n\n---\n\n## Finding your craft\n\nIf you're curious about the space and inspired, I'd recommend dipping a toe (or a leg) into the strange new organizations that are emerging today.\n\n**First off, sign up to the [Forefront newsletter](https://forefront.news/newsletter) and start learning about the space.**\n\nSecond, start building out your digital identity:\n\n1. Get some magic internet money into a wallet ([Rainbow.me](https://rainbow.me/), [Metamask](https://metamask.io/), or [others](https://ethereum.org/en/wallets/))\n2. Earn your first coins by completing quests on [rabbithole](https://rabbithole.gg/) ([More bounties here](https://www.coinvise.co/))\n3. Find your online squad by joining a DAO ([what is a DAO?](https://pet3rpan.medium.com/an-introduction-to-daos-782e3817e2cd)) ([Here is a list](https://forefront.market/market))\n4. Embrace the pseudonymous economy and buy your first Profile Picture NFT ([what is an NFT?](https://www.notion.so/cab150b9cbcc4b7fb6090fc77881a95d)) (Here is an example[ marketplace](https://opensea.io/))\n\nAnd lastly… and watch out for [gas fees](https://medium.com/geekculture/what-is-gwei-ethereum-gas-explained-c766330c2250)\n\n\n---\n\n***All funds from this NFT are in support of local Puerto Rico artisans through the [non-profit Obras del País](http://obrasdelpais.com). 100% of the proceeds will be used to promote their works online and build a digital gallery of their stories and artisanal techniques.***\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=238](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=238)\n\n", "timestamp": 1630664297, "digest": "bZ8GAWV25WkuRwe1Tftqgy0xV-7Y7VHeRUWbDcpuQVo", "contributor": "0xe62d071Ea99A63798Fec7222c483c53e87F2A32E"}
