{"id": "sMpd2auOIL9yEMO64Kf9PCDzARe1zoMtMmmsVnOd2Yg", "title": "My New Metrocard", "body": "For years, one of my prized possessions has been my MTA EasyPayXpress Metrocard.\n\n![](https://avc.com/content/uploads/2021/04/pxl\\_20210412\\_1841383923617427428799366636.jpg)\n\nIt’s a little worn down from a lot of use because it auto refills itself. It is a Metrocard that is connected to a “card on file” and it automatically refills itself so that it always has money on it and you never miss a train because your Metrocard has run out of funds. I’ve had one of these for something like twenty years. And yet many NYers don’t know that this product exists.\n\nBut last week, I realized that my Metrocard’s days are numbered. I walked into one of the subway stations I use the most and saw that the turnstiles now accept Google Pay and Apple Pay.\n\n![](https://avc.com/content/uploads/2021/04/pxl\\_20210405\\_2048452902178475724462943013-scaled.jpg)\n\nYou just wave your phone and the turnstile lets you in.\n\nThis has been in the works for a while and I knew it was coming but seeing it in place and using it was great.\n\nWhen we moved to NYC in the early 80s, we used metal tokens. Then we moved to Metrocards. And now we use our phones.\n\nIt is exciting to see NYC adopt technology in ways that makes life in the city a bit easier.\n", "timestamp": 1618306454, "digest": "L9dhru08T-q2v3LMtW-phioWNRQiiEGPLg0BIeX-Ggg", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "VLUl7mmHx3Gs4sIqaTtTXgmT5It9OcUCcx39zJf0pFQ", "title": "Entrepreneurship In Latin America", "body": "It is a little known part of my career, but for a brief period from 1997 to 2001, I was part of a small group of investors who helped to create a startup ecosystem in Latin America.\n\nIt all started with a company called StarMedia which created a Yahoo-like “portal” for Latin America. My partner Jerry Colonna and I met StarMedia in early 1997 and we brought it to our partners at Chase Capital Partners because we wanted to lead a Series A investment in it. In that Chase Capital Partners meeting was a woman named Susan Segal who ran Chase’s Latin American private equity investing. She pulled me over after the meeting and asked me if there were other startup companies like StarMedia in Latin America. I told her that there must be but I wouldn’t know how to find them. She said, “I can help with that.”\n\nSo began a five year investment partnership between Flatiron Partners (our VC firm) and Susan’s Latin American private equity business. She and her team worked their Latin American connections and they brought the deals to us and we vetted them for team, technology, market need, etc. We did something like a dozen investments together including MercadoLibre (one of the greatest Internet companies ever in any region), and Patagon.com (where I met the founders Wences Casares and Micky Malka).\n\nBut it was StarMedia where I learned the most. I made and lost more money personally (at that time in my career) on Starmedia. I have a StarMedia stock certificate in my office that I look right at that was made out to one of our family entities. It was once worth tens of millions of dollars and is now worthless and has been for decades. It takes messing up on that massive of a scale to learn some things.\n\nStarMedia is also where I met my good friend [Jerry](https://avc.com/2011/05/gerardo-miguel-rosenkranz/) who would have been 70 today. Jerry grew up in Mexico and moved in and out of Latin America and Silicon Valley with ease. He understood both places and helped to bring them together. I miss Jerry so much. He was a mentor, advisor, and coach to many of the earliest Latin American Internet entrpreneurs.\n\nI was reminded of all of that history yesterday as our firm listened to a pitch by a Latin American team that is building a very exciting company. It reminded me that we seeded something twenty-five years ago that has gone on to become a vibrant startup ecosystem. Jerry, Susan, and I made a great team and we did something really important together.\n", "timestamp": 1618306485, "digest": "lFuA166f-pScM5D8kEvy7L1HBgdWDjkRcVLVSbJ3A_Y", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "AIvveNXttarcBWjyt8jpg20vohMZXNwdcJZYZ3lYzNk", "title": "Solvency", "body": "The work of art is under constant redefinition in society. A powerful solvent, the NFT, has been applied to an existing substance, the work of art as we’ve known it so far. From this encounter a reaction has begun - what form this new element may take is yet to be fully realized. One thing is clear, in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has become a kind of hell-scape, trapping artists inside a gamified feedback loop of likes, views, advertisements, and influence, as we struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation (and fair compensation) for digital art is possible. \n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, video, or GIF cannot. So I have often felt confined by having to display my work in a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects and sold to digital collectors. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of generative, browser-based NFTs. When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n\n[Solvency](https://www.solvency.art) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines all of the logic of the work’s mechanics, which ultimately creates the artistic value for any NFT. For Solvency, I collaborated with developer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a unique smart contract that handles the logic for minting each piece, and will only ever be used for the tokens in this series. It handles the logic for the generation of a pseudo-random hash that is used to seed each work, and sets controls on how many pieces are able to be minted, and their price. The smart contract also points to an Arweave hash which represents an immutable, permanent copy of the front-end viewer hosted on the Arweave blockchain, for archival purposes. Finally, the smart contract points to a URL hosted on solvency.art that returns metadata for any given token ID.\n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to these types of files. The media associated with Solvency tokens are dynamic WebGL simulations. These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a GAN (generative adversarial network) trained on 35mm photographs I’ve taken throughout the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each token is unique, with a wide potential for aesthetic variation, but with many shared properties that generate a series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given a specific input, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others.\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork inside of a Metamask wallet, on OpenSea or on their phone (these parts of the web don’t support the real-time version of each Solvency piece.) One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers, with texture files stored on Amazon S3. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. \n\nAs technology constantly improves, it simultaneously breaks itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use, as much as they'd like to have it. Even the lowest level software depends on third parties—packages, libraries, browsers, operating systems, compilers. \n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. \n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that ars lunga, vita brevis was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain. \n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder, chaos, and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos, towards an equilibrium that can't be reversed—there is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n\n\n", "timestamp": 1618326058, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "qyrMqMyvi5AtM2l_dMG0p0doJ7zqOja5qwLDhgMmH2o", "title": "Solvency", "body": "The work of art is under constant redefinition in society. A powerful solvent, the NFT, has been applied to an existing substance, the work of art as we’ve known it so far. From this encounter a reaction has begun - what form this new element may take is yet to be fully realized. One thing is clear, in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has become a kind of hell-scape, trapping artists inside a gamified feedback loop of likes, views, advertisements, and influence, as we struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation (and fair compensation) for digital art is possible. \n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, video, or GIF cannot. So I have often felt confined by having to display my work in a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects and sold to digital collectors. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of generative, browser-based NFTs. When you’re limited by other people’s tools, sometimes you must build your own.\nSolvency\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n\n[Solvency](https://www.solvency.art) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines all of the logic of the work’s mechanics, which ultimately creates the artistic value for any NFT. For Solvency, I collaborated with developer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a unique smart contract that handles the logic for minting each piece, and will only ever be used for the tokens in this series. It handles the logic for the generation of a pseudo-random hash that is used to seed each work, and sets controls on how many pieces are able to be minted, and their price. The smart contract also points to an Arweave hash which represents an immutable, permanent copy of the front-end viewer hosted on the Arweave blockchain, for archival purposes. Finally, the smart contract points to a URL hosted on solvency.art that returns metadata for any given token ID.\n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to these types of files. The media associated with Solvency tokens are dynamic WebGL simulations. These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a GAN (generative adversarial network) trained on 35mm photographs I’ve taken throughout the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each token is unique, with a wide potential for aesthetic variation, but with many shared properties that generate a series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given a specific input, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others.\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork inside of a Metamask wallet, on OpenSea or on their phone (these parts of the web don’t support the real-time version of each Solvency piece.) One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers, with texture files stored on Amazon S3. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. \n\nAs technology constantly improves, it simultaneously breaks itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use, as much as they'd like to have it. Even the lowest level software depends on third parties—packages, libraries, browsers, operating systems, compilers. \n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. \n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that ars lunga, vita brevis was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain. \n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder, chaos, and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos, towards an equilibrium that can't be reversed—there is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n\n\n", "timestamp": 1618325702, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "Okc8hBXBWKHy9w8INauJHZ7CDtMcdb5PmTP6mpL3B3U", "title": "The 2031 Investor", "body": "![](https://images.mirror-media.xyz/publication-images/d99197b9-24a9-4bbd-8eab-430943438ada.png?height=1086&width=1916)\n\n\nFirst, the pandemic brought economic activity to a screeching halt. Then the Fed turned on the money printing machine, and the stonk casino went wild. Reddit investors brought Gamestop back to life, bitcoin soared past $50K, and a piece of digital art sold for $69M. \n\nYou can’t make this stuff up. \n\nFast forward ten years. The so-called “baby” Gen Z investors will be entering their 30s. With an expected $70T of wealth by 2040, this is the generation to start and finish their investing careers online. Today, gen Z-ers spend 10+ hours online. This little box you’re staring at is where they live, talk, spend, play and more. \n\nSo what does the 2031 investor look like? Here’s my take.\n\n## 1. Investing via a new set of principles\n\n![](https://images.mirror-media.xyz/publication-images/1407d763-5215-486f-9235-1d011a8e323e.png?height=730&width=1252)\n\n*Image via ZebraIQ State of GenZ Report*\n\nInvesting in 2031 will be driven by a new set of principles: values, culture and community.\n\n**Values**\nOften considered the activist generation, Gen Z-ers champion their beliefs everywhere they go. They bring their holistic self to work—meaning environmentalism, social justice, and racial equality will continue to play a larger role in capital allocation. Some say this generation’s authenticity stems from the *lack of authenticity* in those before them. Civic discourse is on the rise. \n\n**Culture**\nFinance has seeped into modern day culture. We’ve all watched how Elon Musk has effectively defined meme investing. Neobanks are [monetizing status signaling with credit cards](https://julian.digital/2020/12/03/banking-on-status/) designed to fit an aesthetic or mindset. As we continue to share our lives online, and really live our lives online, finances will play a larger role in signaling. Investing becomes a way to showcase your interests, your beliefs, partake in digital displays of wealth and more. Even more - what used to be done behind closed doors is increasingly public via [social media amplification.](https://luttig.substack.com/p/finance-as-culture)\n\n**Community**\n[Active investing is en vogue; passive is out.](https://a16z.com/2021/03/29/active-trading/) The so-called democratization of finance is a multi-decade effort. In the traditional world we have art via platforms like Otis, stonks via Robinhood, equity via AngelList. But we still have major barriers to entry. Digital assets, however, are accessible with an internet connection and a phone. Bitcoin was created by the people, for the people.The next step emerges via DAOs. DAOs are the future of communities. [Quick recap - what are DAOs?](https://www.notboring.co/p/the-dao-of-daos) DAOs, or decentralized autonomous organizations, are a new way to organize a group of individuals around a common goal or mission. The entity lives on the internet, exists autonomously and in a decentralized fashion. \n\nWith a DAO, a group of individuals can discuss, invest and create around a common mission. DAO participants are incentivized via ownership in the broader community. By making early users, owners, DAO will bootstrap their community alongside their network. \n\nhttps://twitter.com/jessewldn/status/1371138020884283397\n\nCommunity based investing is already taking off. [Public](https://public.com/) launched an investing social network. Wallstreetbets is a 10M group of degenerates (their words) swapping strategies all day long. In the case of investing we’ve seen DAOs like Flamingo specialize in a particular area of crypto assets. [Syndicate](https://www.coindesk.com/syndicate-an-angellist-for-defi-raises-1m-seed-round-led-by-ideo-colab-ventures) is launching “Crypto AngelList” by enabling anyone to launch an investment DAO within minutes. Communities are more like a living & breathing organization - with a personality and goals. Investing with your community, in your community, is the future. \n\n## 2. Investing merges with consumption\n\n![](https://images.mirror-media.xyz/publication-images/9a0164e5-a609-49cf-a4c8-f28574dbc327.png?height=1080&width=1080)\n\nWarren Buffet popularized the phrase “invest in what you know.” Guess what? Gen Z knows the digital world. Investing will merge with consumption over the next decade with two big trends: NFTs and asset class accessibility.\n\n[NFTs make the internet ownable.](https://variant.mirror.xyz/T8kdtZRIgy_srXB5B06L8vBqFHYlEBcv6ae2zR6Y_eo) Are NFTs an investment? Are they for consumption? I believe it’s both. Let’s break this down a bit further.\n \nWe spend our time online creating and consuming. NFTs turn creating and consuming into investing and vice versa. From wallstreetbets to twitter, people are sharing dogecoin memes, IRR tweets, angel investing announcements and more, generating a culture of investing online and sharing this as a badge of honor. Where the goal may be to generate a return, the experience of investing and building a community makes it all the more alluring. \n\n****NFTs as an Investment****\nNFTs allow fans, users, supporters, consumers to become investors in a particular idea, community, or piece of work. Rather than buying, users can invest in the future success. \n\nIn contrast to ownership, investment is characterized by the following: \n    (1) there is a *potential* for return, and early \n    curation and support is rewarded financially\n    (2) you do not plan to own the item forever \n\n\n***NFTs for consumption***\nIn a not-so-distant future, NFTs will be consumed in a myriad of ways. We’re already starting to see this with platforms like Audius and Mirror (where I’m publishing this!). Imagine gaming items you take with you into virtual worlds, DAOs where you discuss investment strategies, NFT videos where you shoot product ad campaigns from your iphone, crowdfunding a piece of art.  There are truly infinite possibilities.\n\n> Web2 engagement = like, reactions, comments, shares. \n\n> Web3 engagement = added digital scarcity, ability to invest and curate\n\nThe resulting social and economic graph will be defining for the next few decades of internet culture. \n\n***Asset Democratization***\nThe 60/40 portfolio is already a thing of the past. With the low interest rates, money printing and impending inflation, Gen Z has been dealt a different hand. Cash isn’t cutting it. Instead, we’re enabling a generation of investors who dabble in stocks, own a fraction of an art piece, angel invest on the side, and monetize their side hustle online. [Pipe](https://www.pipe.com/) is creating a new asset class in itself. Crypto has made it possible to exchange value instantaneously, via our computers. The main implications here include: \n\n- Looking for returns beyond traditional asset classes\n- Lower barriers to entry for certain asset classes\n- The slow (but eventual) globalization of investing\n\n## 3. Pseudonymity will become the norm\nPseudonymity is a near anonymous state. The case for pseudonymity is as follows. Gen Z learns from a young age to manage an online identity. Cancel culture is becoming commonplace, and online identities have implications well beyond your personal life. \n\nhttps://twitter.com/balajis/status/1216044309876813825\n\nPseudonymity does what? First, it levels the playing field. It removes the power of an “IRL” status and reputation. In a global economy, anyone can become friends with anyone. Second, it allows you to express yourself more freely. This is not to say pseudonyms can’t get “cancelled.” But the personas you develop via a pseudonym are managed with the understanding that your real-life reputation is removed from your online actions. Lastly, it allows for multifaceted identities. Authenticity is valued online, but when your name becomes the brand, lines get blurry. Pseudonyms create a path for a multi-identity future. There may be a world where someone IRL uses multiple identities online which speak to a certain audience. The ability to compartmentalize your “online brand” means there is potential for one to cultivate and create multiple lives online. \n\nAs investing moves increasingly online, viewed publicly and transparently, pseudonomity is likely to play a larger role. \n\n-------------------------------------------------------------\n\nThe 2031 investor will own their principles and invest online. Values, culture and community will become increasingly important in capital allocation decisions. Structures like DAOs, or NFTs will make investing in culture, media, tech and more easier with lower barriers to entry. \n\nAll signs point to a more decentralized, open, and honestly, fun investing culture. I have a feeling we’re only seeing the beginning of how wild this ride will be... \n\n\n\n*Many thanks to Bhavika Shah, Ellen Fishbein, and Lindsey Crawford for reviewing drafts*\n\n", "timestamp": 1618332724, "digest": "5nRbaL1-_nYirZtP3hUqIwtgurFBwHySeptod018OeE", "contributor": "0xA5E1C37Ad90BAAcb791Cfa18506224D7c50f1619"}
{"id": "Fym-CrGTu9h_LD8kuizUV3LpZzBIc9DYvmajwJPP2g8", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains:, in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has  trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation, and fair compensation, for digital art is possible. \n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, video, or GIF cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of generative, browser-based NFTs. When you’re limited by other people’s tools, sometimes you must build your own.\n\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines all of the logic of the work’s mechanics, which ultimately creates the artistic value for any NFT. For Solvency, I collaborated with developer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a unique smart contract that handles the logic for minting each piece, and will only ever be used for the tokens in this series. It generates a pseudo-random hash, used to seed each work, and sets controls on how many pieces are able to be minted, and their price. The smart contract also points to an Arweave hash which represents an immutable, permanent copy of the front-end viewer hosted on the Arweave blockchain, for archival purposes. Finally, the smart contract points to a URL hosted on solvency.art that returns metadata for any given token ID.\n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to these types of files. The media associated with Solvency tokens are dynamic WebGL simulations. These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a GAN (generative adversarial network) trained on 35mm photographs I’ve taken throughout the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given a specific input, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others.\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork inside of a Metamask wallet, on OpenSea or on their phone (these parts of the web don’t support the real-time version of each Solvency piece.) One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers, with texture files stored on Amazon S3. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. \n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. \n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that ars lunga, vita brevis was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain. \n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n\n\n\n\n\n\n", "timestamp": 1618342749, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "CL02Exg6vYG6-2mRBQVmWQy7nPZXTHjYI-7o8SzWdNQ", "title": "Editor Guide", "body": "The Mirror Editor is a plain text markdown editor with simple formatting conventions for rich media embeds and cyrpto-native blocks like crowdfunds and auctions. Here is an exhaustive overview of [Markdown formatting](https://daringfireball.net/projects/markdown/syntax), if you need assistance with the basics.\n\n**Importing**\nIt’s possible to import entries from elsewhere, such as Medium or Substack. Open the secondary `•••` menu in the navigation, then click _Import entry_. Next, enter the URL to your entry. Please only import content you have created and own.\n\n## Toolbar\n\n**Modes**\nComposition takes place in **`Edit`** mode. To preview your entry as it will appear on your publication enter **`Preview`** mode. You can toggle between them with the related buttons in the toolbar.\n\n**Blocks**\nDescribe the block selector here.\n\n## Blocks\n\nCreating a media embed on Mirror is easy. Create a new line of text, add a link, then insert a line break. Here is an example which creates a Youtube video embed.\n\n```markdown\nThe 90-minute presentation essentially demonstrated almost all the fundamental elements of modern personal computing:\n\n[The Mother of All Demos](https://www.youtube.com/watch?v=yJDv-zdhzMY)\n\nEngelbart's presentation was the first to publicly demonstrate all of these elements in a single system.\n```\n\n[The Mother of All Demos](https://www.youtube.com/watch?v=FCiBUawCawo)\n\nWe’ve decided to parse basic links—as opposed to introducing Mirror specific syntax—to ensure portability. If the markdown is rendered with Mirror you will see Media Blocks. If anywhere else, you’ll see a simple plain text link. There are a number of integrations, and we’re adding more every week.\n\n### NFT embeds\n\n```md\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n```\n\n[NFT Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/16297)\n\nEmbed an NFT by creating a link. Prefix the URL with the `ethereum://` protocol, followed by the `address/id`. Currently supports a images, audio, video, and text embeds on the following platforms:\n\n- EthBlock.art\n- Foundation\n- Rarible\n- SuperRare\n- Zora\n\n## Link previews\n\n```md\n[Mirror](https://mirror.xyz)\n```\n\nMirror displays a progressively enhanced preview of all links based on the universal standard of [OpenGraph tags](https://ogp.me).\n\n[Mirror](https://mirror.xyz)\n\n### Twitter\n\n```md\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n```\n\n[Mirror’s first tweet](https://twitter.com/viamirror/status/1325856116748726273)\n\n### Youtube\n\n```md\n[Design jam on Youtube](https://www.youtube.com/watch?v=geRPXByWV2U&feature=youtu.be)\n```\n\n[Design jam on Youtube](https://www.youtube.com/watch?v=geRPXByWV2U&feature=youtu.be)\n\n---\n\nA brief list of future enhancements:\n\n- Support for copy-and-paste between tools like Google Docs and platforms such as Medium.\n- Additional media block integrations.\n\nAre we missing an integration you’d like to see? Please don’t hesitate to [say hello](https://twitter.com/viamirror)!\n", "timestamp": 1618350299, "digest": "fMzen4XH0ez6PIu2H7c_ynrLyTajh41rPVIkSVaqDsE", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "_Rnqohu_9J7ouwClHIQzKdxi-S3ovO3SfZNpEHdMzoU", "title": "Packy test v3", "body": "[Test](split://0x1EaB5eeEE2059ec97C9Cb4d086be67fcadb3FdA9?network=rinkeby)\n\nA cool auction\n\n[Token #2410](auction://0x7c2668bd0d3c050703cecc956c11bd520c26f7d4?network=rinkeby&tokenId=2410)", "timestamp": 1618365830, "digest": "1FsTSCJuMJHcFTd0_N8Q6KTOdr7o9mm7pHW64Onkqx8", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0xb6d957c9c6045fb1d7ad382b8cced6a09c41ebd4d3909e861c37253af125c6de\"}"}
{"id": "I-nBleaRzAMt44zIn3Y8_n1SRUASkv_B6G3e9q3sSbg", "title": "Thoughts on \"Token Safe Harbor 2.0\"", "body": "\n\n![Photo by Robert Wiedemann on Unsplash](https://images.mirror-media.xyz/publication-images/a95505f5-bbd2-4ea1-aba9-5897c7d64a92.jpeg?height=1280&width=1920)\n\n\n\n\n*A cursory reading of Commissioner Peirce's updated proposal, providing regulatory clarity for tokens.* * **\n\n\n## Thoughts and Big Takeaways*\n\n- Read the \"Disclosure\" and \"Exit Report\" sections, very important\n    - You gotta start with the end in mind\n    - If you don't know what Network Maturity is, or if you aren't sure you can achieve it in 3 years, get ready for some off-shore team to pick things up where you left off when you have to start registering\n    - In that sense, the safe harbor is important, but can be a Faustian bargain (like making NFTs or social tokens as a short-term cash grab)\n    - If you're trying to do right by the community, and inspire others to see that and do that, then you should be good.\n- 3 year grace period where you can actually build a crypto network and not feel like you're going to get:\n    - A surprise fine\n    - A surprise order to shut down the business\n    - A bunch of lawsuits when the customers who bought the token find out that they may have a claim now that you're being forced to shut down your business\n    - Being barred from raising money from the US for X years (or forever)\n        - Which... forces entrepreneurs to take innovation offshore, raise offshore? 🤔\n- 3 big changes:\n    1. Enhance token purchaser protections\n    2. Safe Harbor now includes an \"exit report\" requirement\n        1. An analysis done by OC to strengthen argument on why network works or is decentralized\n        2. OR\n        3. Announcement that tokens are going to be SEA-registered\n    3. \"Exit Report\" requirement states what OC's analysis should address when explaining why network is decentralized. \n        1. Guidance is NOT a bright-line test\n            1. Guidance =/= bright-line means \"It Depends,\" as far as the eyes can see\n        2. But kind of a \"framework\" or rubric that makes it easier for these \"exit reports\" to not just look like [Ron Swanson permits](https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M7YCXHOYVQ3CDB5HPAZG4ABSAU.jpg).\n\n\n# The Thing\n\n## Proposed Securities Act Rule 195. Time-limited exemption for Tokens.\n\nPrelim Notes:\n\n1. This isn't static, and could extend past the token. Tokens can be offered or sold in the context of an investment contract, and then later not be an IC, or vice versa. It's fluid\n    1. But for a network to mature to one that's decentralized/functional, Tokens must be distributed to and freely tradable by potential network users, programmers, and participants. slapping CapMarket laws on them primary/secondary thangs doesn't really give people the flexibility to grow the network into A Good Decentralized Thing ™️\n    2. So BOOM, Safe Harbor\n        1. 3 years for dev teams wherein they're exempt from federal securities laws AS LONG AS THEY PLAY BALL\n        2. Anti-fraud still applies\n        3. Purchasers need to have access to disclosures too\n    3. By the end, Dev team gotta make a choice:\n        1. If **Network Maturity** and functionality is achieved, then they good\n\n2. Rule 195 isn't an exclusive safe harbor; if other exemptions apply, they can still claim those (I guess Reg CF, Reg A/+, Reg D, etc?)\n\na) **Exemptions:** '33 Act doesn't apply to Toekns if the Dev Team follows the following:\n\n1. Dev Team intends Token's network to reach Network Maturity within 3 years of the date of first sale\n2. Disclosures required must be PUBLIC (see paragraph b)\n3. Token must be fofered and sold to facilitate access to/participate on/develop network\n4. Dev team files \"notice of reliance\" (see paragraph c)\n5. File that \"Exit Report\" 🗣️ (see paragraph f)\n\nb) **Disclosure**: Dev Team has to publicly display this info, on a public site. *Publicly*\n\n1. Initial Disclosures: Provide following info, and any material changes must be shown on this site\n    1. *Source Code:* (so a GH, probably don't need FE but the smart contracts since you're putting thangs on-chain)\n    2. *Transaction History:* (literally a block explorer, have a functioning chain pls and don't be BitClout)\n    3. *Token Economics:* (maybe don't say NGU and NGMI and have a simple explanation of network, protocol, how it works, and the formulas). MUST INCLUDE:\n        1. Info explaining TGE, supply schedule, all the charts 📊\n        2. Info detailing how to get/mint/burn tokens, and how the consensus protocol/tx validation happens (sure, if it's not a native token I bet the native L1 will just have links that can be used)\n        3. explanation of Governance mechanisms (ie \"we use Snapshot/Sybil, here's a link to it\")\n        4. Enough info for a third party to independently verify that transactions are actually happening on a DLT (idk, a block explorer?)\n        5. A link to a block explorer (because if they didn't specify, someone would try to lie)\n    4. *Roadmaps*: Timelines, dev schedule from Day 1→ Network Maturity Day🎉\n    5. *Prior Token Sales*: Date, # of tokens sold before filing Notice of Reliance, along with their unlock schedules, and what/how much you received in exchange (probably totals, not \"I gave CMS 1% of my supply for some hats and mugs, I gave Alameda like 2% for a 10-tweet thread\", but saying \"we sold a total of 10% of supply, etc)\n    6. *Initial Dev Team and\"Certain Token Holders\"*: Post these deets:\n        1. Names, experience, quals, attributes [is this a TTRPG], skills of every Dev Team member\n        2. Tokens/rights owned by each member, and description of limitations/restrictions on transferability of tokens\n        3. If anyone gets tokens in ways that are different from regular folks, you gotta put them on this list, and how they got the tokens (ie \"SallyB got 10000 tokens for writing some life-saving code and saving the protocol that one time 10 weeks ago\")\n    7. *Trading Platforms*\n        1. Show where it's listed\n        2. Wonder if you can just use Coingecko/Coin Market Cap?\n    8. *Sales of Tokens*: Team members gotta disclose whenever they sell 5%+ of the tokens, with date, seller, and how much they sold\n    9. *Related Person Transactions:* Any material transaction where people had . Description should identify: \n        1. the nature of tx, \n        2. the person, \n        3. how the person is a Related person, \n        4. approx. value of transaction\n    10. *Warning to Token Purchasers*: A statement that purchase of tokens involves a high degree of risk, and you can lose your money\n2. Semiannual Disclosures: Every 6 Months, until 36 months, you gotta give updates on the roadmap within 30 days of the 6-month mark\n\nc) **Filing of Notice of Reliance:** Dev team must file a \"Notice of Reliance on the Safe Harbor\" (NoR) before the first token is sold in reliance of said Safe Harbor.\n\n1. NoR must contain the following:\n    1. Name of each Dev Team member\n    2. Attestation by a someone authorized by Dev Team that this NoR's conditions are satisfied\n    3. Website where disclosures can be found\n    4. Email address for contacting Dev Team\n2. NoR must be filed with Commission in Electric format through EDGAR per rules in Regulation S-T\n\nd) **Limitation**: Exemption in paragraph a doesn't apply to [Section 12(a)(2)](https://www.law.cornell.edu/uscode/text/15/77l) (when someone lies to get you to buy) or [Section 17](https://www.law.cornell.edu/uscode/text/15/77q) (fraud) of the 33 Act\n\ne) **Duration of Exemption:** 36 months of relief\n\nf) **Exit Report (Important Bit!)**: Exit report must be filed before 36 months after first Sale of Rule 195-Exempt Token, saying:\n\n1. If Network Maturity was reached, based on analysis by Outside Council. Including:\n    1. Description of extent to which decentralization has been reached:\n        1. voting power\n        2. Dev efforts\n        3. Network Participation\n        4. If applicable, include\n            1. Examples of people who aren't Dev Team members making material contributions\n            2. Explanations of the methodology for measuring decentralization\n    2. Explanation of how Dev Team's pre-Network Maturity activities are distinguishable from ongoing involvement\n        1. Showing how Dev Team has basically handed off dev efforts to the community, and can't be reasonably expected uniquely to drive token 🚀\n        2. Confirming that Dev Team doesn't have any announcement-announcements or material info that no one else knows\n        3. Show how the Dev Team is informing the network what they'll be doing after decentralizing ownership into the community\n    3. If Dev team determines that Network Maturity has not been reached, and no one has filed an exit report, they gotta provide:\n        1. Status of project, and what Dev Team plans to do next\n        2. Contact info for Token holders to communicate with Dev Team\n        3. Statement acknowledging that Dev team will file a Form 10 to register the Tokens under Section 12(g0 of the '34 SEA as a class of securities within 3 months of filing Exit report\n    4. Exit report must be filed like the above NoR, compliantly through EDGAR.\n\ng) **Transition Period for Trading Platforms**: No trading platform should be subject to [Section 6 of SEA](https://www.law.cornell.edu/uscode/text/15/78f) (they don't have to be National Securities Exchanges) due to activity related to trading a token that, by the end of 36 months, has filed an Exit Report indicating that they need to register as a securities\n\n- They get a 6 month wind-down period.\n\nh) **Tokens Previously Sold**: If the Dev team sold tokens in a way that's exempt (or a violation of Section 5 of Securities Act as determined by a court, but there aren't any other violations of federal secuirities laws), they can use this section. Notice of reliance must be filed\n\ni) **Definition of Qualified Purchaser**: For purpose of [Section 18(b)(3) of '33 Act](https://www.law.cornell.edu/uscode/text/15/77r), a \"qualified purchaser\" is anyone who is offered/sold tokens per paragraph (a). \n\nj) **Disqualifications**: \n\n- No exemption is available if the Dev Team or individuals are disqualified under Rule 506(d)\n    - [Bad Actor Designation](https://www.ecfr.gov/cgi-bin/text-idx?SID=0a94ea1a8a9ecce212ec25025efed3af&node=17:3.0.1.1.12.0.46.181&rgn=div8)\n        - Also read this, it's cleaner-looking: [SEC Bad Actor Doc](https://www.sec.gov/info/smallbus/secg/bad-actor-small-entity-compliance-guide.htm)\n\nk) **Definitions:** \n\n1. Initial Dev Team (Dev Team): A person/group/entity that provides essential managerial efforts for network development before reaching Network Maturity. They make the initial filing of Notice of Reliance\n2. Network Maturity: when the network is either:\n    1. not economically/operationally controlled, not reasonably likely to be economically/operationally controlled or unilaterally changed by a single person/entity/group under common control (except networks where Dev Team owns 20%+ of tokens, or \n    2. Functional (it works), and this an be demonstrated by people using the Token for transmission/storage of value on the network. Participation in an app running on network, or some other thing that reflects Utility🔧\n3. Related Person: Dev Team, directors, advisors to Dev Team, and their immediate family (???? Is this the same for stonks, or is this a weird spillover theme from anti-insider trading)\n4. Token: digital representation of value/rights:\n    1. With a transaction history that\n        1. is on a DLT or blockchain or other digital media structure\n        2. has transactions that are confirmed AND can be independently verified\n        3. can't be changed\n    2. capable of being P2P transferred\n    3. Isn't equity/debt financial interest in a company, partnership, or fund\n        1. Includes ownership/debt interest, revenue share, entitlement to interest/dividend payment\n        2. I wonder how governance tokens that can vote themselves into receiving a cut of revenues would fall?\n            1. I'd think that because the protocol isn't a company (could it be looped into a \"partnership\" structure if things go south) that governance tokens that can or have voted themselves into the value accrual equation could be fine.**\n\n## **Proposed Exchange Act Rule 3a1-2. Exemption from the definition of “exchange” under Section 3(a)(1) of the Act.**\n\n- An org, association, or group will be exempt from definition of \"exchange\" as long as the tokens they facilitate the exchange of satisfy Rule 195 of Securities Act, or otherwise do the things to a token that \"a stock exchange\" would typically do (based on a general understanding of what \"a stock exchange\" is).\n\n## **Proposed Exchange Act Rule 3a4-2. Exemption from the definition of “broker” for a person engaged in a Token transaction.**\n\n- Person isn't a broker insofar as it effects transactions for tokens that follow Rule 195\n\n## **Proposed Exchange Act Rule 3a5-4. Exemption from the definition of “dealer” for a person engaged in a Token transaction.**\n\n- Person isn't a dealer insofar as they effect buying/selling Rule 195-exempt Tokens\n\n## **Proposed Exchange Act Rule 12h-1(j). Exemptions from registration under Section 12(g) of the Act.**\n\n- AYYYYYYYYY 12(g) exemption 💃\n- Issuers are exempt if the token they issued is a token offered/sold pursuant to the exemption provided in Rule 195\n\n\n______________________\n\nLinks: [SEC Public Statement for Token Safe Harbor Proposal 2.0](https://www.sec.gov/news/public-statement/peirce-statement-token-safe-harbor-proposal-2.0)\n\n[GitHub Repo for TSHP 2.0](https://github.com/CommissionerPeirce/SafeHarbor2.0)\n\n\n*Shout out to Commissioner Peirce, a real one*\n\n * *this is how I procrastinate*\n\n** *Also I'm not a lawyer, don't you dare think I'm a lawyer, this was just a riff to get me to read this thing and not treat twitter commentary threads like sustenance.*", "timestamp": 1618368502, "digest": "WPJa_fgTrDEBmyr274Q32u4cJ4F51Ba8mPmbFCJDDM0", "contributor": "0x66Da63B03feCA7Dd44a5bB023BB3645D3252Fa32"}
{"id": "1621UUE3Q8EMuWE4QAVmy_g7n7issRq6V2r694J6BsU", "title": "Thoughts on \"Token Safe Harbor 2.0\"", "body": "\n\n![Photo by Robert Wiedemann on Unsplash](https://images.mirror-media.xyz/publication-images/a95505f5-bbd2-4ea1-aba9-5897c7d64a92.jpeg?height=1280&width=1920)\n\n\n\n\n*A cursory reading of Commissioner Peirce's updated proposal, providing regulatory clarity for tokens.*\n\n\n## Thoughts and Big Takeaways*\n\n- Read the \"Disclosure\" and \"Exit Report\" sections, very important\n    - You gotta start with the end in mind\n    - If you don't know what Network Maturity is, or if you aren't sure you can achieve it in 3 years, get ready for some off-shore team to pick things up where you left off when you have to start registering\n    - In that sense, the safe harbor is important, but can be a Faustian bargain (like making NFTs or social tokens as a short-term cash grab)\n    - If you're trying to do right by the community, and inspire others to see that and do that, then you should be good.\n- 3 year grace period where you can actually build a crypto network and not feel like you're going to get:\n    - A surprise fine\n    - A surprise order to shut down the business\n    - A bunch of lawsuits when the customers who bought the token find out that they may have a claim now that you're being forced to shut down your business\n    - Being barred from raising money from the US for X years (or forever)\n        - Which... forces entrepreneurs to take innovation offshore, raise offshore? 🤔\n- 3 big changes:\n    1. Enhance token purchaser protections\n    2. Safe Harbor now includes an \"exit report\" requirement\n        1. An analysis done by OC to strengthen argument on why network works or is decentralized\n        2. OR\n        3. Announcement that tokens are going to be SEA-registered\n    3. \"Exit Report\" requirement states what OC's analysis should address when explaining why network is decentralized. \n        1. Guidance is NOT a bright-line test\n            1. Guidance =/= bright-line means \"It Depends,\" as far as the eyes can see\n        2. But kind of a \"framework\" or rubric that makes it easier for these \"exit reports\" to not just look like [Ron Swanson permits](https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M7YCXHOYVQ3CDB5HPAZG4ABSAU.jpg).\n\n\n# The Thing\n\n## Proposed Securities Act Rule 195. Time-limited exemption for Tokens.\n\nPrelim Notes:\n\n1. This isn't static, and could extend past the token. Tokens can be offered or sold in the context of an investment contract, and then later not be an IC, or vice versa. It's fluid\n    1. But for a network to mature to one that's decentralized/functional, Tokens must be distributed to and freely tradable by potential network users, programmers, and participants. slapping CapMarket laws on them primary/secondary thangs doesn't really give people the flexibility to grow the network into A Good Decentralized Thing ™️\n    2. So BOOM, Safe Harbor\n        1. 3 years for dev teams wherein they're exempt from federal securities laws AS LONG AS THEY PLAY BALL\n        2. Anti-fraud still applies\n        3. Purchasers need to have access to disclosures too\n    3. By the end, Dev team gotta make a choice:\n        1. If **Network Maturity** and functionality is achieved, then they good\n\n2. Rule 195 isn't an exclusive safe harbor; if other exemptions apply, they can still claim those (I guess Reg CF, Reg A/+, Reg D, etc?)\n\na) **Exemptions:** '33 Act doesn't apply to Toekns if the Dev Team follows the following:\n\n1. Dev Team intends Token's network to reach Network Maturity within 3 years of the date of first sale\n2. Disclosures required must be PUBLIC (see paragraph b)\n3. Token must be fofered and sold to facilitate access to/participate on/develop network\n4. Dev team files \"notice of reliance\" (see paragraph c)\n5. File that \"Exit Report\" 🗣️ (see paragraph f)\n\nb) **Disclosure**: Dev Team has to publicly display this info, on a public site. *Publicly*\n\n1. Initial Disclosures: Provide following info, and any material changes must be shown on this site\n    1. *Source Code:* (so a GH, probably don't need FE but the smart contracts since you're putting thangs on-chain)\n    2. *Transaction History:* (literally a block explorer, have a functioning chain pls and don't be BitClout)\n    3. *Token Economics:* (maybe don't say NGU and NGMI and have a simple explanation of network, protocol, how it works, and the formulas). MUST INCLUDE:\n        1. Info explaining TGE, supply schedule, all the charts 📊\n        2. Info detailing how to get/mint/burn tokens, and how the consensus protocol/tx validation happens (sure, if it's not a native token I bet the native L1 will just have links that can be used)\n        3. explanation of Governance mechanisms (ie \"we use Snapshot/Sybil, here's a link to it\")\n        4. Enough info for a third party to independently verify that transactions are actually happening on a DLT (idk, a block explorer?)\n        5. A link to a block explorer (because if they didn't specify, someone would try to lie)\n    4. *Roadmaps*: Timelines, dev schedule from Day 1→ Network Maturity Day🎉\n    5. *Prior Token Sales*: Date, # of tokens sold before filing Notice of Reliance, along with their unlock schedules, and what/how much you received in exchange (probably totals, not \"I gave CMS 1% of my supply for some hats and mugs, I gave Alameda like 2% for a 10-tweet thread\", but saying \"we sold a total of 10% of supply, etc)\n    6. *Initial Dev Team and\"Certain Token Holders\"*: Post these deets:\n        1. Names, experience, quals, attributes [is this a TTRPG], skills of every Dev Team member\n        2. Tokens/rights owned by each member, and description of limitations/restrictions on transferability of tokens\n        3. If anyone gets tokens in ways that are different from regular folks, you gotta put them on this list, and how they got the tokens (ie \"SallyB got 10000 tokens for writing some life-saving code and saving the protocol that one time 10 weeks ago\")\n    7. *Trading Platforms*\n        1. Show where it's listed\n        2. Wonder if you can just use Coingecko/Coin Market Cap?\n    8. *Sales of Tokens*: Team members gotta disclose whenever they sell 5%+ of the tokens, with date, seller, and how much they sold\n    9. *Related Person Transactions:* Any material transaction where people had . Description should identify: \n        1. the nature of tx, \n        2. the person, \n        3. how the person is a Related person, \n        4. approx. value of transaction\n    10. *Warning to Token Purchasers*: A statement that purchase of tokens involves a high degree of risk, and you can lose your money\n2. Semiannual Disclosures: Every 6 Months, until 36 months, you gotta give updates on the roadmap within 30 days of the 6-month mark\n\nc) **Filing of Notice of Reliance:** Dev team must file a \"Notice of Reliance on the Safe Harbor\" (NoR) before the first token is sold in reliance of said Safe Harbor.\n\n1. NoR must contain the following:\n    1. Name of each Dev Team member\n    2. Attestation by a someone authorized by Dev Team that this NoR's conditions are satisfied\n    3. Website where disclosures can be found\n    4. Email address for contacting Dev Team\n2. NoR must be filed with Commission in Electric format through EDGAR per rules in Regulation S-T\n\nd) **Limitation**: Exemption in paragraph a doesn't apply to [Section 12(a)(2)](https://www.law.cornell.edu/uscode/text/15/77l) (when someone lies to get you to buy) or [Section 17](https://www.law.cornell.edu/uscode/text/15/77q) (fraud) of the 33 Act\n\ne) **Duration of Exemption:** 36 months of relief\n\nf) **Exit Report (Important Bit!)**: Exit report must be filed before 36 months after first Sale of Rule 195-Exempt Token, saying:\n\n1. If Network Maturity was reached, based on analysis by Outside Council. Including:\n    1. Description of extent to which decentralization has been reached:\n        1. voting power\n        2. Dev efforts\n        3. Network Participation\n        4. If applicable, include\n            1. Examples of people who aren't Dev Team members making material contributions\n            2. Explanations of the methodology for measuring decentralization\n    2. Explanation of how Dev Team's pre-Network Maturity activities are distinguishable from ongoing involvement\n        1. Showing how Dev Team has basically handed off dev efforts to the community, and can't be reasonably expected uniquely to drive token 🚀\n        2. Confirming that Dev Team doesn't have any announcement-announcements or material info that no one else knows\n        3. Show how the Dev Team is informing the network what they'll be doing after decentralizing ownership into the community\n    3. If Dev team determines that Network Maturity has not been reached, and no one has filed an exit report, they gotta provide:\n        1. Status of project, and what Dev Team plans to do next\n        2. Contact info for Token holders to communicate with Dev Team\n        3. Statement acknowledging that Dev team will file a Form 10 to register the Tokens under Section 12(g0 of the '34 SEA as a class of securities within 3 months of filing Exit report\n    4. Exit report must be filed like the above NoR, compliantly through EDGAR.\n\ng) **Transition Period for Trading Platforms**: No trading platform should be subject to [Section 6 of SEA](https://www.law.cornell.edu/uscode/text/15/78f) (they don't have to be National Securities Exchanges) due to activity related to trading a token that, by the end of 36 months, has filed an Exit Report indicating that they need to register as a securities\n\n- They get a 6 month wind-down period.\n\nh) **Tokens Previously Sold**: If the Dev team sold tokens in a way that's exempt (or a violation of Section 5 of Securities Act as determined by a court, but there aren't any other violations of federal secuirities laws), they can use this section. Notice of reliance must be filed\n\ni) **Definition of Qualified Purchaser**: For purpose of [Section 18(b)(3) of '33 Act](https://www.law.cornell.edu/uscode/text/15/77r), a \"qualified purchaser\" is anyone who is offered/sold tokens per paragraph (a). \n\nj) **Disqualifications**: \n\n- No exemption is available if the Dev Team or individuals are disqualified under Rule 506(d)\n    - [Bad Actor Designation](https://www.ecfr.gov/cgi-bin/text-idx?SID=0a94ea1a8a9ecce212ec25025efed3af&node=17:3.0.1.1.12.0.46.181&rgn=div8)\n        - Also read this, it's cleaner-looking: [SEC Bad Actor Doc](https://www.sec.gov/info/smallbus/secg/bad-actor-small-entity-compliance-guide.htm)\n\nk) **Definitions:** \n\n1. Initial Dev Team (Dev Team): A person/group/entity that provides essential managerial efforts for network development before reaching Network Maturity. They make the initial filing of Notice of Reliance\n2. Network Maturity: when the network is either:\n    1. not economically/operationally controlled, not reasonably likely to be economically/operationally controlled or unilaterally changed by a single person/entity/group under common control (except networks where Dev Team owns 20%+ of tokens, or \n    2. Functional (it works), and this an be demonstrated by people using the Token for transmission/storage of value on the network. Participation in an app running on network, or some other thing that reflects Utility🔧\n3. Related Person: Dev Team, directors, advisors to Dev Team, and their immediate family (???? Is this the same for stonks, or is this a weird spillover theme from anti-insider trading)\n4. Token: digital representation of value/rights:\n    1. With a transaction history that\n        1. is on a DLT or blockchain or other digital media structure\n        2. has transactions that are confirmed AND can be independently verified\n        3. can't be changed\n    2. capable of being P2P transferred\n    3. Isn't equity/debt financial interest in a company, partnership, or fund\n        1. Includes ownership/debt interest, revenue share, entitlement to interest/dividend payment\n        2. I wonder how governance tokens that can vote themselves into receiving a cut of revenues would fall?\n            1. I'd think that because the protocol isn't a company (could it be looped into a \"partnership\" structure if things go south) that governance tokens that can or have voted themselves into the value accrual equation could be fine.**\n\n## **Proposed Exchange Act Rule 3a1-2. Exemption from the definition of “exchange” under Section 3(a)(1) of the Act.**\n\n- An org, association, or group will be exempt from definition of \"exchange\" as long as the tokens they facilitate the exchange of satisfy Rule 195 of Securities Act, or otherwise do the things to a token that \"a stock exchange\" would typically do (based on a general understanding of what \"a stock exchange\" is).\n\n## **Proposed Exchange Act Rule 3a4-2. Exemption from the definition of “broker” for a person engaged in a Token transaction.**\n\n- Person isn't a broker insofar as it effects transactions for tokens that follow Rule 195\n\n## **Proposed Exchange Act Rule 3a5-4. Exemption from the definition of “dealer” for a person engaged in a Token transaction.**\n\n- Person isn't a dealer insofar as they effect buying/selling Rule 195-exempt Tokens\n\n## **Proposed Exchange Act Rule 12h-1(j). Exemptions from registration under Section 12(g) of the Act.**\n\n- AYYYYYYYYY 12(g) exemption 💃\n- Issuers are exempt if the token they issued is a token offered/sold pursuant to the exemption provided in Rule 195\n\n\n______________________\n\nLinks: [SEC Public Statement for Token Safe Harbor Proposal 2.0](https://www.sec.gov/news/public-statement/peirce-statement-token-safe-harbor-proposal-2.0)\n\n[GitHub Repo for TSHP 2.0](https://github.com/CommissionerPeirce/SafeHarbor2.0)\n\n\n*Shout out to Commissioner Peirce, a real one*\n\n * *this is how I procrastinate*\n\n** *Also I'm not a lawyer, don't you dare think I'm a lawyer, this was just a riff to get me to read this thing and not treat twitter commentary threads like sustenance.*", "timestamp": 1618369545, "digest": "WPJa_fgTrDEBmyr274Q32u4cJ4F51Ba8mPmbFCJDDM0", "contributor": "0x66Da63B03feCA7Dd44a5bB023BB3645D3252Fa32"}
