{"id": "kobZPv0RmUzn990ED5nKckcB8qFq5Movmu4AkFcRl8o", "title": "Hello World", "body": "We are Phlote. (“flōt”)\n\nWhy are we here?\n\nWe’re here to free artists.\n\nHow do we do that?\n\nWe’ll sell mp3’s for $2 million.\n\nThe goal is clear. We want more artists to exist in the world because a more creative world is a better one. We’ll use Mirror to document our discoveries along the way as we build Phlote into something special. Everyone is welcome to participate.\n\nLet’s do it together. 🤝", "timestamp": 1632706219, "digest": "RzPvnxUMmsWXzw9MALtY2NnMqDxYhZvNUhPghKoprSk", "contributor": "0xEf58304E292fBAeacFdeC25b67b3438031FdE313"}
{"id": "Xa4m5LiOC--ypbml1bkMzWz3vPrH5dAeqPCJVFy3fAA", "title": "E-Bikes", "body": "I used to ride a Vespa around NYC. I rode it to work and back for about ten years, from roughly 2003 to 2013. I stopped riding it when Bloomberg’s Traffic Enforcement people starting towing it when it was parked between cars on the street (something I had been doing since I started riding it). A few visits to the tow pound will do that to you.\n\nSince then, I’ve been Citibiking to and from work when it is nice out and subwaying when it is not. That has worked fine.\n\nA few weeks ago, I had breakfast with my friend Alex Ljung, who co-founded our portfolio company SoundCloud with his friend Eric Wahlforss. Alex and Eric are back at it with a new company called [Dance](https://dance.co/) which makes a beautiful e-bike that is sold via a subscription service, currently only in Berlin, but coming to your city sometime in the future.\n\nI told Alex that I was nervous about riding e-bikes. He told me to get over it and get on one. So I have been doing that, using Citibike’s e-bikes, for the last few weeks.\n\nAlex was right. I love riding e-bikes around NYC. I can see riding them out to Brooklyn and back for meetings, using the new Brooklyn Bridge bike lane.\n\nI still like riding my traditional bike for exercise, something I do three mornings a week, and something I will do when I finish this post.\n\nBut for getting around NYC, in the awesome bike lanes that have been created all around our amazing city, I think e-bikes are the way to go. I put in an order for one this weekend.\n\nI’m sold.\n", "timestamp": 1632739780, "digest": "3yLkFAdFl568JfcMWtrvSBqysY4ybx4epMqoVfoyz18", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "3GI2LsCFgqRlAE5IqjwY2-SlMAy3MN3t19chPyubzqc", "title": "Composable Membership and its Role in Generating Social Capital", "body": "Having a token brings a community together loosely with a financial stake, but composable membership holds a community together long term with social capital. That's a lot of buzzwords, so let’s explore this in three parts:\n\n1. How access, permissions, and status are the primary components of membership (and the role of tokens)\n2. Membership in Web2 versus Web3 platforms, and why composability matters here\n3. Designing a membership system to generate social capital\n\n### **Access, Permissions, and Status**\n\nOur [data and actions give us identity and relationships](https://ath.mirror.xyz/mDu_nGsWpjvF-KaPLADwxeAMfze3UJOtTAQi2CwPwWc), but having a social graph does not give you community. Put in a Web3 context, a group of people holding or trading the same token does not mean you are a community -  at best, it gives you clusters. \\*\\*An actual community has fairly clear boundaries for growth (in more than a financial sense). You've probably seen some variation on the chart below...\n\n![https://github.com/orbit-love/orbit-model](https://images.mirror-media.xyz/publication-images/47N5kFjDdcNfmaliuCEPt.png?height=1130&width=2000)\n\n... where you can identify your core contributors, and try to reward or incentivize them accordingly. Pet3rpan has put this concentric community chart nicely in a Web3 context, showcasing the funnel of activities a participant might engage in during their lifecycle in a community:\n\n![https://medium.com/1kxnetwork/how-to-grow-decentralized-communities-1bf1044924f8 ](https://images.mirror-media.xyz/publication-images/BsnO6_CiiWfe9AELOdvJo.png?height=1046&width=2000)\n\nBut just because someone has participated in any of the above events, doesn't mean they feel like they're part of the community. Even giving them tokens for their participation doesn't really move the needle.\n\nTokens are open primitives that membership should be built upon, and just issuing more POAPs or tokens based on events and then moving on is like distributing the raw materials for a house and expecting the people to build up a town. Without a blueprint, people will just stash the materials and leave (or sell them to someone else). In crypto, we’re supply rich, but guidance poor.\n\nSome communities at least take the first step to have some sort of access dependent on your token activities, usually a Discord server or channel. But access is only the first step to membership. Permissions are too closely tied to access right now, and status is left as too abstract a concept.\n\nSo let's improve on the current model. ***Access is discovery, permissions are responsibility, status is weight.*** This membership funnel is shaped different from the activity funnel above, as the customizable design area gets larger the deeper you go:\n\n![](https://images.mirror-media.xyz/publication-images/WUKtdEmRWd6lSriRuBSLs.png?height=1027&width=972)\n\nThese are basic examples, but they help lay the groundwork for how each layer could be tied to different types (and combinations) of tokens. Let's look at some token design examples for each level:\n\n* **Access:** For the most part, *ERC20's are best for access because requirements are fluid and the tokens are more liquid.* Today I might require 50 tokens to join, but in the future, I may drop it to 25 or increase it to 75 based on community needs (going wide versus deep). NFTs are cultural assets, so if you use that as the gate then it'll be tough to say you need two or more to have access now. Even if you implement project derivatives, liquidity becomes fragmented and confusing. This is project-dependent though, and Creator Cabins did a [great overview of some of the tradeoffs](https://creators.mirror.xyz/V7Ucba89-3qV9yFxj7Spj7YxjKAhc6TOd8nUcCp9n6k).\n* **Permissions:** *I personally believe permissions should be tightly coupled to a stake.* To be given the responsibility for some set of actions, there should be risk involved. Unlike access, permissions should evolve and can be revoked. If I'm making proposals, allowing staking will show my commitment and also give others the opportunity of *joining my stake*. This line of design can help a community better balance abuse of power and opportunities for discovery (of great new contributors).\n* **Status:** *This layer has the largest area because it is tied to attributes and metadata.* Status in a community has the highest amount of variance, as it will likely be event-dependent. Taking the treasury \"weighted voting power\" example, if you give status based on what is being voted on that highlights specific community members while also ensuring that it isn't always the participant with the most tokens has the most sway. NFTs are a great place to play with these attributes, especially through derivative and forge-based projects. *To clarify, this is not the same as reputation since reputation needs to be less fluid as to not confuse people. We'll get more into that later.*\n\nDifferent combinations of these layers could be bundled into \"roles\" for easier management and assignment. I'd love to dive right into a membership system, but first we need to clear out the current mental heuristics around how Web2 \"membership\" works.\n\n### Composable **Membership and the Role of Platforms (Web2 vs Web3)**\n\n*In Web2, membership forms around services. In Web3, services from around membership.* Put simply, being a YouTube subscriber does not affect your privileges when engaging in a Twitch chat or a subreddit. This kind of membership interoperability is certainly possible in Web2, and I think Patreon was the closest to getting a hierarchical membership structure in place. We could have seen a world that looks like this:\n\n![](https://images.mirror-media.xyz/publication-images/vyHiSL8oyuqovbdFvnPpM.png?height=1084&width=921)\n\nBut obvious arguments would ensue over who owns the master API, and economic flow incentives also act as a blocker since the platform at the top of the hierarchy likely has the highest money-in/money-out flow and take-rate. So in the end we have like 7 or more different memberships to manage! No one actually wants that besides the platforms themselves.\n\nIn Web3, no one is fighting to be at the top of the membership hierarchy because the primitives (tokens) aren't owned by any one platform. Smart contracts are our APIs and we can code revenue splits right into them. If that isn't enough, we can devise governance and attribution systems over the treasury to ensure the services and tooling built around membership continuously benefits communities that rely on them. In the end, the above Web2 platforms will naturally fall lower on the hierarchy. **They will be forced to fit around the composable membership systems that we all enable and create. In other words, the community is the platform:**\n\n![](https://images.mirror-media.xyz/publication-images/tC63snvRPrTVJO8ayeVhz.png?height=1039&width=961)\n\nThere's an argument to be made that in the end, apps will just be a bunch of composable components where each piece is owned by a different platform. But in the interim, it'll be Web3 communities plugging into the currently better interfaces of Web2. When planning a membership system, we'll need to think about membership as bundles of access, permission, and status across these Web2 services. If I'm a multisig member, what roles will I need across all these services and how can that be managed in a single token/membership model? To figure this out, we'd need to experiment. And to experiment, we need social capital.\n\n### A **Membership System for Generating Social Capital**\n\nWe've defined the components of membership and situated them within the Web2 and Web3 context. Now, let's have fun designing a system that could actually go into implementation. ***We'll define social capital as building an allowance for trust, experimentation, and flexibility within a community.*** This means having a membership system that improves ownership of decisions and prevents a social fork. For now, my guess is there are three main steps to execute membership and generate this new capital:\n\n1. **Define Roles:** Roles are bundles of the different layers of membership and are tied to specific participant personas. There are likely hundreds of combinations (especially if you layer token types on top), but some immediate roles that come to mind are:\n   * `Low Access (ERC20) + Low Permissions (ERC20 Stake) = new member`\n   * `High Permissions (ERC20 Stake) + High Status (NFT) = long time contributor`\n   * `High Access (NFT) + High Status (NFT) = subject matter expert`\n   * `High Access (ERC20) + High Permissions (ERC20 Stake) + High Status (NFT) = founding member`\n\n   Doing this well opens up a pathway for growth and also clarity for all members. This starts to give us history too, as I can clearly see how a community has matured by its role definitions and distribution (much more so than if I just look at the token price).\n2. **Specify Incentivizes:** Pet3rpan mentioned in the article linked earlier that *trust and engagement are key to participation.* Financial incentives are a great starting point - if you airdropped me $1000 of your community's tokens, I'd definitely come to take a look and see what I can help with. But if these drops/bounties are filtered by role or membership history, we can be much more flexible with asks and rewards and I'd likely feel more fulfilled. This is the difference between me tackling a data bounty as a nobody versus as a Dune Wizard.\n\n   This could also look like a hackathon where teams are built based on role/membership history, such that newer members are matched with older members. Or imagine if hackathon bounties rewarded community roles instead of just $$$, I think we'd end up seeing an even larger diversity of projects and teams in hackathons than we do today.\n\n   Also, I cannot stress enough the importance of history here. `Membership + Identity + Relationships` will probably be the best proxy for a reputation score, which opens up the path to more creatively weighted incentives.\n3. **Assign Roles:** This step is more technically difficult than the others, given the challenge of plugging membership systems into existing platforms. I think this is similar to the integration problems that any wallet aggregator already faces, for example, Zapper's [protocol requests](https://features.zapper.fi/). Integrating into existing Web2 platforms shouldn't be difficult, but as more Web3 platforms are built the composability will be difficult to manage.\n\n   But as long as we have an identity solution (connecting addresses to user metadata across platforms) and a membership solution (managing roles and tokens intuitively), I think we'll be able to tackle the platform integration problem elegantly. Besides, building the first two will take the ecosystem the next six months anyway.\n\nHopefully, this system helps show how much we can bring a community together while experimenting by using membership built off of tokens. I know for some people this is all still too fluffy, so I plan on doing data-driven case studies to better inform this kind of membership system in the future (and to try to be more quantitative about social capital). Some communities I'm interested in studying under this lens are Yearn, Blitmaps, and Superfluid - but if you have other case studies that come to mind, please do let me know.\n\n## Concluding Thoughts\n\nComposable membership shapes more than just communities, it will shape ecosystems and platforms as well. In crypto, we're all building platforms that give communities the tooling for implementation, visibility, collaboration, and much more. Ecosystems are forming around metadata already, and this will force a reorganization of Web2 platforms to provide a much more open surface to be built upon.\n\nMirror is one platform trying to improve the tooling for communities to implement a rewarding membership system:\n\n![](https://images.mirror-media.xyz/publication-images/Jl7vf0FRlSNXu9PQZSo9T.png?height=2025&width=4443)\n\nSeed Club is a good example of the model above, where they [deploy ERC20 tokens for specific communities and causes](https://club.mirror.xyz/dnN3Dwe-iD6jBpzkase4YLHTxYtnuFnmUbSoOfPEkjI), and once members are more defined they move on to [specialized token distribution methods such as the token race](https://club.mirror.xyz/token-race/bafkreidnqdtyls7q62w6mvfuaiwzn52ivlvephw4wul7g5ph2lqbjzymom) for engaging the community and [adding new cohorts](https://club.mirror.xyz/Q5QwN3Uol03pOK8MhAVsfwc0ektDlrkrl6sVSoC2UwA). I think there is a lot more we all can do to standardize the membership implementation process laid out in this article, using Mirror and ecosystem tooling.\n\nBut none of what I've written about can sustainably happen unless communities take their thinking around membership more seriously (and that goes for me too). If any of this interests you, please reach out so that we can build out this future together. My [twitter DMs](https://twitter.com/andrewhong5297) are always open! 🙂", "timestamp": 1632748434, "digest": "Olq6VS57xDFWDlxRdQwBKy05xdU2TJHXyk75y-ZxGNg", "contributor": "0x2Ae8c972fB2E6c00ddED8986E2dc672ED190DA06"}
{"id": "3gbcvuhoqI5pHXBta5PLasMfVEKAxBUCSsIXZK34dS0", "title": "The Weekly Hop #5: Bottom-up value creation in Loot", "body": "***The Weekly Hop is a newsletter written by Pathfinders. Click [here](https://rabbithole.mirror.xyz/2aWOCnFgLTRePfJn4C2P8RgmYh_I0VbPcColjQTtcJ8) to learn more about Pathfinders and our role in the decentralization of RabbitHole.***\n\nAlmost three weeks since its drop, [Loot](https://www.lootproject.com/) is still on my mind. And not because of what it is–yet–but because of what it could become.\n\n[Avichal Garg](https://twitter.com/avichal) of Electric Capital sums it up well when he likens Loot with a [deck of cards](https://twitter.com/avichal/status/1434271052939493376?s=20). On its own, a deck of cards is just 52 pieces of paper with signs and symbols on it. But with a bit of creativity, a deck of cards becomes the foundation to your favorite games–from Crazy 8’s, to Hearts, to my personal favorite, Poker. Similarly, while Loot may appear to be just an NFT with eight lines of white text against a black background, it could become the [foundation of an entire gaming metaverse](https://rabbithole.mirror.xyz/61mpC8avnWGmepJ0Ps1lN-Zzr9dyf_5R30j2JNiVEAU).\n\n### Turning social capital into financial capital: web3 membership communities\n\nBy building the [foundation of a game, without building a game itself](https://blog.coinbase.com/loot-project-the-first-community-owned-nft-gaming-platform-125fa1d5ffa8), Loot leaves its fate to the decentralized community that has begun to take shape around it.\n\nWith this strategy, Loot is helping to usher in what [Jacob Peters](https://twitter.com/J__Cub) describes as a [new era of community membership](https://twitter.com/J__Cub/status/1434527760790208512). Whereas web2 communities make money by charging membership fees, web3 communities make money by taking a percentage of the profits when NFTs are bought and sold. In an environment where NFT supply is fixed, so membership is scarce, communities are incentivized to grow by scaling their narrative.\n\nPeters sums up this process well in his community-first product development flywheel below.\n\n[https://twitter.com/J__Cub/status/1434527760790208512](https://twitter.com/J__Cub/status/1434527760790208512)\n\n### Loot as a headless brand\n\nGiven Loot’s reliance on bottom-up value creation, I wouldn’t be surprised to see Loot transform into what our friends over at the [Other Internet](https://otherinter.net/) refer to as a [headless brand](https://otherinter.net/research/headless-brands/).  One which is not controlled centrally, has some “immutable aspect,” and where users have a real stake in the brand–be it token, equity, status.\n\nIt’s this “stake in the brand” point that really puts things into perspective. Especially when we’re talking about developers: the [“true scarce resources of the web3 community world.”](https://twitter.com/J__Cub/status/1434527762040098822)\n\nSure, in the first couple weeks since Loot’s creation we’ve seen a multitude of projects pop  up–from [Lootmart](https://twitter.com/jonjyan/status/1433205141029761026?s=20), to [lootcharacter.com](https://www.lootcharacter.com/), to the ERC-20 Adventure Gold ($AGLD) token. But if we’ve [learned anything from previous projects like CryptoKitties](https://twitter.com/Flynnjamm/status/1434157038142111748), for Loot to continue to be successful and sustainable, developers need to continue to want to build on top of it. And importantly, that also includes developers who don’t own a Loot bag (i.e. those who wouldn't linearly benefit from the NFT’s uptake in value.)\n\n### What’s next for Loot\n\nKey to a developer’s willingness to build is the promise of mass market appeal. And in an environment where the majority of gamers are priced out of a Loot bag (current floor price is [7.39 ETH](https://opensea.io/collection/lootproject)), this just isn’t feasible.\n\nWhile Loot founder Dom Hofmann’s release of [Synthetic Loot](https://twitter.com/dhof/status/1433110412187287560?s=20) (i.e. a [type of Loot bag](https://blog.coinbase.com/loot-project-the-first-community-owned-nft-gaming-platform-125fa1d5ffa8) that “can’t be sold or transferred but can be used in Loot games, should a developer choose to allow it”) is an important step to opening the door to more players, I’m more excited to \\*hopefully\\* watch the broader Loot ecosystem begin to flex its decentralized strength. For me, it’s the development of Loot’s DAO that makes the difference between just another unsustainable NFT bubble and a stepping stone to achieving an open-source fantasy metaverse.\n\nJoin us in a conversation about what is next for Loot in its journey to decentralize the metaverse [@pathfinders_gg](https://twitter.com/pathfinders_gg) on Twitter! \n\n*This analysis of Loot and the role of decentralization in the project was written by [@anay_sim](https://twitter.com/anay_sim).* \n\n### Pathfinder update\n\nWe’re taking Pathfinders to the next level with the introduction of Artisans, a selected group of artists and designers creating the next generation of RabbitHole NFTs.\n\nHere’s a sneak peak on what they have in store. Any thoughts on what it could be?\n\n*Hint: RabbitHole hasn’t had a reward quite like this one.*\n\n![](https://images.mirror-media.xyz/publication-images/_-aZ4Zu5kd0W5Xf7ULxa7.png?height=582&width=463)\n\n### New Pathfinder guides\n\n* [Setting up / Bridging Funds on xDAI](https://rabbithole.mirror.xyz/Oxs8NXUGG2Gz4FsNmh509tBj5LEzJNvpt_IAYOFRVmg) by [@TheAlexYao](https://twitter.com/TheAlexYao)\n* [Deposit on PoolTogether (Polygon Network)](https://rabbithole.mirror.xyz/iOf5n4JioWli_Ht0txdXsfFxOBbQW_ecQBi0jJVVE-w) by [@bvajresh](https://twitter.com/bvajresh)\n* [How to Send Funds Using Hop](https://rabbithole.mirror.xyz/1uuTNpX30dZG3X__D1CONWlcqCx_2nGG1FSfpSIU7LA) by [@accel_capital](https://twitter.com/accel_capital)\n\n*Pathfinder update and compilation of this week’s Pathfinder guides written by [@JonahBaer](https://twitter.com/JonahBaer).*\n\n### Rabbit of the week\n\nYu-Gi-Oh! Rescue Rabbit Monster Card\n\n* Sending this guy to assist in your web3 journey\n* Don’t make us activate our trap card\n\n![](https://images.mirror-media.xyz/publication-images/cFU3KUOD3rxy0fF0Km9tP.png?height=695&width=478)\n\n", "timestamp": 1632752606, "digest": "v0eYFdIA05qthcWBgQcSfzHTUTcINME9YDCfj3omMLU", "contributor": "0x0ba85c9e1863E5efB8395a55cd042d61DECD6e89"}
{"id": "V0_twQV28j2wEduh4IinKr7WR5FuAgAUi5aHFHI1Qwg", "title": "The Weekly Hop #5: Bottom-up value creation in Loot", "body": "***The Weekly Hop is a newsletter written by Pathfinders. Click [here](https://rabbithole.mirror.xyz/2aWOCnFgLTRePfJn4C2P8RgmYh_I0VbPcColjQTtcJ8) to learn more about Pathfinders and our role in the decentralization of RabbitHole.***\n\nAlmost three weeks since its drop, [Loot](https://www.lootproject.com/) is still on my mind. And not because of what it is–yet–but because of what it could become.\n\n[Avichal Garg](https://twitter.com/avichal) of Electric Capital sums it up well when he likens Loot with a [deck of cards](https://twitter.com/avichal/status/1434271052939493376?s=20). On its own, a deck of cards is just 52 pieces of paper with signs and symbols on it. But with a bit of creativity, a deck of cards becomes the foundation to your favorite games–from Crazy 8’s, to Hearts, to my personal favorite, Poker. Similarly, while Loot may appear to be just an NFT with eight lines of white text against a black background, it could become the [foundation of an entire gaming metaverse](https://rabbithole.mirror.xyz/61mpC8avnWGmepJ0Ps1lN-Zzr9dyf_5R30j2JNiVEAU).\n\n### Turning social capital into financial capital: web3 membership communities\n\nBy building the [foundation of a game, without building a game itself](https://blog.coinbase.com/loot-project-the-first-community-owned-nft-gaming-platform-125fa1d5ffa8), Loot leaves its fate to the decentralized community that has begun to take shape around it.\n\nWith this strategy, Loot is helping to usher in what [Jacob Peters](https://twitter.com/J__Cub) describes as a [new era of community membership](https://twitter.com/J__Cub/status/1434527760790208512). Whereas web2 communities make money by charging membership fees, web3 communities make money by taking a percentage of the profits when NFTs are bought and sold. In an environment where NFT supply is fixed, so membership is scarce, communities are incentivized to grow by scaling their narrative.\n\nPeters sums up this process well in his community-first product development flywheel below.\n\n[https://twitter.com/J__Cub/status/1434527760790208512](https://twitter.com/J__Cub/status/1434527760790208512)\n\n### Loot as a headless brand\n\nGiven Loot’s reliance on bottom-up value creation, I wouldn’t be surprised to see Loot transform into what our friends over at the [Other Internet](https://otherinter.net/) refer to as a [headless brand](https://otherinter.net/research/headless-brands/).  One which is not controlled centrally, has some “immutable aspect,” and where users have a real stake in the brand–be it token, equity, status.\n\nIt’s this “stake in the brand” point that really puts things into perspective. Especially when we’re talking about developers: the [“true scarce resources of the web3 community world.”](https://twitter.com/J__Cub/status/1434527762040098822)\n\nSure, in the first couple weeks since Loot’s creation we’ve seen a multitude of projects pop  up–from [Lootmart](https://twitter.com/jonjyan/status/1433205141029761026?s=20), to [lootcharacter.com](https://www.lootcharacter.com/), to the ERC-20 Adventure Gold ($AGLD) token. But if we’ve [learned anything from previous projects like CryptoKitties](https://twitter.com/Flynnjamm/status/1434157038142111748), for Loot to continue to be successful and sustainable, developers need to continue to want to build on top of it. And importantly, that also includes developers who don’t own a Loot bag (i.e. those who wouldn't linearly benefit from the NFT’s uptake in value.)\n\n### What’s next for Loot\n\nKey to a developer’s willingness to build is the promise of mass market appeal. And in an environment where the majority of gamers are priced out of a Loot bag (current floor price is [7.39 ETH](https://opensea.io/collection/lootproject)), this just isn’t feasible.\n\nWhile Loot founder Dom Hofmann’s release of [Synthetic Loot](https://twitter.com/dhof/status/1433110412187287560?s=20) (i.e. a [type of Loot bag](https://blog.coinbase.com/loot-project-the-first-community-owned-nft-gaming-platform-125fa1d5ffa8) that “can’t be sold or transferred but can be used in Loot games, should a developer choose to allow it”) is an important step to opening the door to more players, I’m more excited to \\*hopefully\\* watch the broader Loot ecosystem begin to flex its decentralized strength. For me, it’s the development of Loot’s DAO that makes the difference between just another unsustainable NFT bubble and a stepping stone to achieving an open-source fantasy metaverse.\n\nJoin us in a conversation about what is next for Loot in its journey to decentralize the metaverse by tweeting us [@pathfinders_gg](https://twitter.com/pathfinders_gg)!\n\n*This analysis of Loot and the role of decentralization in the project was written by [@anay_sim](https://twitter.com/anay_sim).*\n\n### Pathfinder update\n\nWe’re taking Pathfinders to the next level with the introduction of Artisans, a selected group of artists and designers creating the next generation of RabbitHole NFTs.\n\nHere’s a sneak peak on what they have in store. Any thoughts on what it could be?\n\n*Hint: RabbitHole hasn’t had a reward quite like this one.*\n\n![](https://images.mirror-media.xyz/publication-images/_-aZ4Zu5kd0W5Xf7ULxa7.png?height=582&width=463)\n\n### New Pathfinder guides\n\n* [Setting up / Bridging Funds on xDAI](https://rabbithole.mirror.xyz/Oxs8NXUGG2Gz4FsNmh509tBj5LEzJNvpt_IAYOFRVmg) by [@TheAlexYao](https://twitter.com/TheAlexYao)\n* [Deposit on PoolTogether (Polygon Network)](https://rabbithole.mirror.xyz/iOf5n4JioWli_Ht0txdXsfFxOBbQW_ecQBi0jJVVE-w) by [@bvajresh](https://twitter.com/bvajresh)\n* [How to Send Funds Using Hop](https://rabbithole.mirror.xyz/1uuTNpX30dZG3X__D1CONWlcqCx_2nGG1FSfpSIU7LA) by [@accel_capital](https://twitter.com/accel_capital)\n\n*Pathfinder update and compilation of this week’s Pathfinder guides written by [@JonahBaer](https://twitter.com/JonahBaer).*\n\n### Rabbit of the week\n\nYu-Gi-Oh! Rescue Rabbit Monster Card\n\n* Sending this guy to assist in your web3 journey\n* Don’t make us activate our trap card\n\n![](https://images.mirror-media.xyz/publication-images/cFU3KUOD3rxy0fF0Km9tP.png?height=695&width=478)\n\n", "timestamp": 1632752672, "digest": "v0eYFdIA05qthcWBgQcSfzHTUTcINME9YDCfj3omMLU", "contributor": "0x0ba85c9e1863E5efB8395a55cd042d61DECD6e89"}
{"id": "KeslA0KC_C9CNVBMeZjmoCaZF8y0Qj8nOrn55FFppsY", "title": "Radicle Orgs: DAO Tooling for Deploying Unruggable Open Source Software", "body": "> *“Open source code has enabled trillions of dollars to be generated by software companies that use it, but the communities that develop that code typically haven’t had a means to capture much of the value directly.” -* [Jesse Walden](https://variant.fund/cryptos-business-model-is-familiar-what-isnt-is-who-benefits/)\n\nOpen source software is the backbone of the internet. A movement that started in response to the rise of proprietary software, publicly-available code soon became the foundation on which GAFAM built their powerful platforms. Today, many significant open source projects are [backed](https://insights.dice.com/2019/08/05/open-source-google-microsoft-apple-github/) by big tech. While the pros and cons of its involvement are highly debatable, it’s hard to ignore the influence these corporations have had on the open source ecosystem.\n\nIf you think about it, the very fabric of human coordination at this point is hierarchical. Hierarchy successfully allowed a few individuals to assert power and authority to control the coordination of large groups of people. Since then, it has become the de-facto form of organization for most institutions.\n\nThis reality is reflected in the way Big Tech has designed the internet. For example, centralized platforms like GitHub have made it easy for developers to produce and distribute open source software. However, convenience comes at a price — freedom. Access to your GitHub account and repositories can be banned or limited at any time, leaving your developer identity, work, and reputation confined within a walled garden.\n\nCentralized admin models and corporate-owned platforms dominate our day-to-day experience on the web, resigning us to hierarchy and extraction. But now, blockchain and crypto are changing that.\n\n## The Rise of DAOs\n\nThe crypto space, currently growing at an exponential rate, is decentralizing the very foundation of what our internet, global economy, and corporations are built on. The ecosystem’s ethos of ‘don’t trust, verify’ has eliminated our implicit reliance on trust-based “agent-principal” relationships.\n\nOne particularly interesting area that has emerged as a result is the use of Ethereum smart contracts to support decentralized human coordination and governance. The term coined for this new phenomenon: Decentralized Autonomous Organizations, or “DAOs”.\n\n> *“The ideal of a decentralized autonomous organization is easy to describe: it is an entity that lives on the internet and exists autonomously, but also heavily relies on hiring individuals to perform certain tasks that the automaton itself cannot do.” -* [Vitalik Buterin, 2014](https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/)\n\nTraditional organizations entrust managers, boards of directors, and shareholders with decision making. They rely on the legal system to enforce contracts and settle business or organizational disputes. The main advantage of a DAO compared to a traditional organization is that contracts between two parties are enforced on a distributed global ledger. The ledger is immutable and anyone can access it to verify transactions in a permissionless manner.\n\nAdditionally, a incentive network can be deployed on top of the ledger, enabling a built-in value network of project-specific cryptographic tokens. These tokens can be used to align incentives and coordinate governance between network participants as they steer the project forward as a collective. This method of incentivized coordination is a way for development teams to coordinate their mission in a transparent and verifiable way. In this light, a DAO can be viewed as **borderless, self-sustaining and self-enforcing entity for running online communities.**\n\nAs [the DAO space matures](https://thedefiant.io/what-is-a-dao-mapping-out-the-ecosystem/), the need for specialized tooling & scaffolding to support this new type of organization becomes increasingly clear.\n\n## Radicle Orgs 🎪\n\nAt Radicle, we see DAOs as a necessary part of the emerging Web3 stack. That is why we built [Radicle Orgs](https://radicle.xyz/blog/radicle-orgs.html), a decentralized code management tool for DAOs coordinating the development of open source software.\n\nWhile designing Radicle’s [Ethereum integration](https://radicle.xyz/blog/integrating-with-ethereum.html), we realized that multi-sigs can be used for more than just the distributed management of digital assets. Radicle Orgs — on-chain entities owned by multi-sigs (i.e. [Gnosis Safe](https://gnosis-safe.io/)) — offer a transparent & universally verifiable way to manage and distribute ownership of codebases.\n\n![Creating a multi-signer Org with Upstream, a desktop client built on Radicle.](https://i.imgur.com/95tugqU.png)\n\nRelying on smart contracts instead of account admins, Radicle Orgs allow developers to collectively define the rules and permissions around repositories in a trust-minimized way. With orgs, developers can host their repositories peer-to-peer while maintaining an auditable & transparent project history on Ethereum. This allows teams to create an organizational identity that is sovereign and unconstrained to a single platform, ensuring their codebases are accessible to anybody in the world, no matter where they are.\n\nModular by design, Orgs can be integrated with other DAO tooling to create unique frameworks for coordinating and governing project collaboration. In a larger sense, we see Radicle Orgs becoming an essential component of the DAO stack as they give teams the ability to truly decentralize their collaboration infrastructure.\n\n![A Radicle Org profile page on app.radicle.network](https://i.imgur.com/L2iOkvr.jpg)\n\nTo learn more about Radicle Orgs and how to create one, check out our user docs 👇\n\n[https://docs.radicle.xyz/docs/connecting-to-ethereum/creating-an-org](https://docs.radicle.xyz/docs/connecting-to-ethereum/creating-an-org)\n\n## In closing: DAOs 🤝 Open Source\n\nOpen source software is a standard in blockchain and crypto, yet our codebases and collaboration remain locked into centralized platforms. This reality is antithetical to the values of decentralization and censorship-resistance that the crypto ecosystem aligns with. In addition, the disruptive nature of crypto foretells an uncertain regulatory future that could exploit the centralized nature of software tools and forges — an institutional “rug pull” if you will.\n\n**We believe the future of open source software is self-sustaining, community owned/governed, decentralized online organizations**. However, our dependence on third-parties for the production and distribution of critical open source infrastructure is inherently unsustainable. Utilizing Radicle Orgs can make crypto-native projects unstoppable and unruggable in the face of pending retaliation from centralized institutions.\n\n![DAOs + Radicle Orgs = epic collaboration](https://i.imgur.com/rzVQsNh.jpg)\n\n\n---\n\nWe’re currently onboarding DAOs interested in decentralizing their collaboration infrastructure with Radicle Orgs. If you’re interested, reach out to **abbey@radicle.xyz**.\n\n### Join our Discord 👾\n\n[https://discord.gg/fUK5BGtyTR](https://discord.gg/fUK5BGtyTR)\n\n### Get started with Radicle 🌱\n\n[https://docs.radicle.xyz/docs/connecting-to-ethereum/overview](https://docs.radicle.xyz/docs/connecting-to-ethereum/overview)\n\n### Follow us on Twitter 🐥\n\n[https://twitter.com/radicle?lang=en](https://twitter.com/radicle?lang=en)\n\n", "timestamp": 1632759920, "digest": "LC1gmqihYDbxGi_kWqm6Em7Gou1F1WzG_cjkdsrSSpo", "contributor": "0x7BCf7A112e9fC7Ff2b54a52990976E5C3352F2D2"}
{"id": "syPn9Ni1i2J54YHqJqimuEz964d9U6yKQpSe0xSny34", "title": "Radicle Orgs: DAO Tooling for Deploying Unruggable Open Source Software", "body": "> *“Open source code has enabled trillions of dollars to be generated by software companies that use it, but the communities that develop that code typically haven’t had a means to capture much of the value directly.” -* [Jesse Walden](https://variant.fund/cryptos-business-model-is-familiar-what-isnt-is-who-benefits/)\n\nOpen source software is the backbone of the internet. A movement that started in response to the rise of proprietary software, publicly-available code soon became the foundation on which GAFAM built their powerful platforms. Today, many significant open source projects are [backed](https://insights.dice.com/2019/08/05/open-source-google-microsoft-apple-github/) by big tech. While the pros and cons of its involvement are highly debatable, it’s hard to ignore the influence these corporations have had on the open source ecosystem.\n\nIf you think about it, the very fabric of human coordination at this point is hierarchical. Hierarchy successfully allowed a few individuals to assert power and authority to control the coordination of large groups of people. Since then, it has become the de-facto form of organization for most institutions.\n\nThis reality is reflected in the way Big Tech has designed the internet. For example, centralized platforms like GitHub have made it easy for developers to produce and distribute open source software. However, convenience comes at a price — freedom. Access to your GitHub account and repositories can be banned or limited at any time, leaving your developer identity, work, and reputation confined within a walled garden.\n\nCentralized admin models and corporate-owned platforms dominate our day-to-day experience on the web, resigning us to hierarchy and extraction. But now, blockchain and crypto are changing that.\n\n## The Rise of DAOs\n\nThe crypto space, currently growing at an exponential rate, is decentralizing the very foundation of what our internet, global economy, and corporations are built on. The ecosystem’s ethos of ‘don’t trust, verify’ has eliminated our implicit reliance on trust-based “agent-principal” relationships.\n\nOne particularly interesting area that has emerged as a result is the use of Ethereum smart contracts to support decentralized human coordination and governance. The term coined for this new phenomenon: Decentralized Autonomous Organizations, or “DAOs”.\n\n> *“The ideal of a decentralized autonomous organization is easy to describe: it is an entity that lives on the internet and exists autonomously, but also heavily relies on hiring individuals to perform certain tasks that the automaton itself cannot do.” -* [Vitalik Buterin, 2014](https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/)\n\nTraditional organizations entrust managers, boards of directors, and shareholders with decision making. They rely on the legal system to enforce contracts and settle business or organizational disputes. The main advantage of a DAO compared to a traditional organization is that contracts between two parties are enforced on a distributed global ledger. The ledger is immutable and anyone can access it to verify transactions in a permissionless manner.\n\nAdditionally, a incentive network can be deployed on top of the ledger, enabling a built-in value network of project-specific cryptographic tokens. These tokens can be used to align incentives and coordinate governance between network participants as they steer the project forward as a collective. This method of incentivized coordination is a way for development teams to coordinate their mission in a transparent and verifiable way. In this light, a DAO can be viewed as **borderless, self-sustaining and self-enforcing entity for running online communities.**\n\nAs [the DAO space matures](https://thedefiant.io/what-is-a-dao-mapping-out-the-ecosystem/), the need for specialized tooling & scaffolding to support this new type of organization becomes increasingly clear.\n\n## Radicle Orgs 🎪\n\nAt Radicle, we see DAOs as a necessary part of the emerging Web3 stack. That is why we built [Radicle Orgs](https://radicle.xyz/blog/radicle-orgs.html), a decentralized code management tool for DAOs coordinating the development of open source software.\n\nWhile designing Radicle’s [Ethereum integration](https://radicle.xyz/blog/integrating-with-ethereum.html), we realized that multi-sigs can be used for more than just the distributed management of digital assets. Radicle Orgs — on-chain entities owned by multi-sigs (i.e. [Gnosis Safe](https://gnosis-safe.io/)) — offer a transparent & universally verifiable way to manage and distribute ownership of codebases.\n\n![Creating a multi-signer Org with Upstream, a desktop client built on Radicle.](https://i.imgur.com/95tugqU.png)\n\nRelying on smart contracts instead of account admins, Radicle Orgs allow developers to collectively define the rules and permissions around repositories in a trust-minimized way. With orgs, developers can host their repositories peer-to-peer while maintaining an auditable & transparent project history on Ethereum. This allows teams to create an organizational identity that is sovereign and unconstrained to a single platform, ensuring their codebases are accessible to anybody in the world, no matter where they are.\n\nModular by design, Orgs can be integrated with other DAO tooling to create unique frameworks for coordinating and governing project collaboration. In a larger sense, we see Radicle Orgs becoming an essential component of the DAO stack as they give teams the ability to truly decentralize their collaboration infrastructure.\n\n![A Radicle Org profile page on app.radicle.network](https://i.imgur.com/L2iOkvr.jpg)\n\nTo learn more about Radicle Orgs and how to create one, check out our user docs 👇\n\n[https://docs.radicle.xyz/docs/connecting-to-ethereum/creating-an-org](https://docs.radicle.xyz/docs/connecting-to-ethereum/creating-an-org)\n\n## In closing: DAOs 🤝 Open Source\n\nOpen source software is a standard in blockchain and crypto, yet our codebases and collaboration remain locked into centralized platforms. This reality is antithetical to the values of decentralization and censorship-resistance that the crypto ecosystem aligns with. In addition, the disruptive nature of crypto foretells an uncertain regulatory future that could exploit the centralized nature of software tools and forges — an institutional “rug pull” if you will.\n\n**We believe the future of open source software is self-sustaining, community owned/governed, decentralized online organizations**. However, our dependence on third-parties for the production and distribution of critical open source infrastructure is inherently unsustainable. Utilizing Radicle Orgs can make crypto-native projects unstoppable and unruggable in the face of pending retaliation from centralized institutions.\n\n![DAOs + Radicle Orgs = epic collaboration](https://i.imgur.com/rzVQsNh.jpg)\n\n\n---\n\nWe’re currently onboarding DAOs interested in decentralizing their collaboration infrastructure with Radicle Orgs. If you’re interested, reach out to **abbey@radicle.xyz**.\n\n### Join our Discord 👾\n\n[https://discord.gg/fUK5BGtyTR](https://discord.gg/fUK5BGtyTR)\n\n### Get started with Radicle 🌱\n\n[https://docs.radicle.xyz/docs/connecting-to-ethereum/overview](https://docs.radicle.xyz/docs/connecting-to-ethereum/overview)\n\n### Follow us on Twitter 🐥\n\n[https://twitter.com/radicle?lang=en](https://twitter.com/radicle?lang=en)\n\n", "timestamp": 1632760371, "digest": "LC1gmqihYDbxGi_kWqm6Em7Gou1F1WzG_cjkdsrSSpo", "contributor": "0x7BCf7A112e9fC7Ff2b54a52990976E5C3352F2D2"}
{"id": "o1N0tWI7ADjIyaIiQcuq7nIm74nuiHrrkWZ4JYKMvI0", "title": "What is Vesting Schedule?", "body": "*Hey there! [Coinvise](https://www.coinvise.co/) is a web3 platform that helps creators & communities build and manage their Social Tokens. You can join the [community here](https://discord.gg/GQNx6HpW). If you find this essay interesting, make sure to subscribe to this newsletter and follow Coinvise on [Twitter](https://twitter.com/CoinviseCo). Enjoy! 🔥*\n\n![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4487941a-9c9c-44b8-9e92-b246b233a79f_2160x1080.png)\n\nSocial tokens are digital currencies that have shown their efficiency in building successful digital economies. They can revolutionize the way people collaborate and allow a [whole new world of possibilities for workers](https://forefront.market/blog/how-creator-daos-redefine-the-way-we-work). Good incentives through Social Tokens are ideal when it's mutually beneficial to contributors and community leaders. It will create positive-sum games where everyone has an aligned interest.\n\nHowever, with Social Tokens comes the risk of speculation. Speculation is not necessarily a bad thing. It drives interest from people outside of crypto and brings capital to a community that can innovate and grow. It is, however, very complicated to build a healthy and sustainable community in the long-term with a highly volatile token and community members here to speculate. At some point, for a community to grow, it's essential to have people that put time and hard work into the community, not capital.\n\nTo prevent speculation, community leaders can lock N amount of Token for a certain period as a commitment to hold the Token. It prevents people from coming with the only purpose of buying and selling the Token a few days later when it pumps. This mechanism is called Vesting Schedule. This essay aims to explain further what a Vesting Schedule is and how it can be a powerful tool to build a sustainable decentralized community.\n\n## 1 - What is Token Vesting?\n\nWhen launching a decentralized community (or a DAO), it's common to establish a Token for governance purposes and for [attracting / rewarding high-quality talent](https://coinvise.substack.com/p/how-to-attract-high-quality-talent). The Token is usually minted (created) by the community's founding members, and those community leaders have full power over the distribution of the Token.\n\nThis is much power centralized in the hands of very few people. If contributors start to put time into the project and investors start to bring capital to the project, it's important to cover them and not let core team members have full freedom over the token distribution. To prevent bad behaviors, it's recommended to vest a portion of those tokens to ensure the long time commitment of the founding team.\n\nConcretely, vesting a token means locking a certain amount of tokens over a certain period as a commitment to hold the Token. It's a mechanism that allows **the founding team to prove they are highly interested in the project.**\n\nLocking tokens ensures investors that the team has the best intention and maintains a long-term vision, incentivizing them to continue working on the project development. When a token is vested, the owner of those Token can't withdraw them directly and have to wait until the vesting period ends. It's made possible thanks to blockchain mechanisms, and specifically smart contracts, that make it easy to lock a certain amount of funds until contract conditions are met. In our case, when the vesting period has been completed, the smart contract, enforced on a blockchain, will allow the holders to withdraw their tokens.\n\nDepending on the needs, it's possible to play on many parameters when vesting a Token. It's possible to play with the vesting period, the number of tokens subject to vesting, if the tokens will be released gradually etc... It's important to keep in mind that there is no right or wrong answer. A project could reserve 15% of its coins when the Token is minted, then gradually released some tokens every month/quarter/year during the project process. Another project could create a Community Round subject to vesting, with a vesting period that includes a 6-month cliff, followed by another six-month linear unlock. In this case, community members would receive a certain amount of Token, let's say 1200, but wouldn't be able to withdraw them for six months. They would then receive 200 tokens every month for six months.\n\n![ForeFront Treasury Diversification (subject to vesting)](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F808b8979-7f8d-4eae-9878-7f0b21606cbe_2836x1322.png)\n\nKeeping a certain amount of Token on a vesting schedule is a powerful tool to incentivize people to invest in a community. Crypto mechanisms made it easy for community members, investors, and founders to trust each other. With smart contracts, vesting a token is easy and is a tool worth using for every community.\n\nLet's dig more into the main advantages of the Vesting Schedule.\n\n## 2 - What is it useful for?\n\nTo create a healthy and sustainable community, it is essential to have token price stability. Indeed, with a highly volatile token, it will be difficult to attract talent keen to work in exchange for a Token that can plummet overnight. Vesting a Token allows reducing the price volatility of a token by disincentivizing speculation. Indeed, suppose speculators know they won't be able to withdraw their money as soon as they want. In that case, eventually, they won't invest. Only true believers of the project will stay around.\n\n![GlobalCoinResearch’s contributors can earn $GCR that are subject to vesting](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff3996c88-4daa-446c-a518-9cd89d4827fa_1920x1080.png)\n\nVesting a token ensures the investors that the founding team is serious encourages contributors to commit in the long-term and prevents speculation.\n\nThe vesting schedule mechanism is particularly useful:\n\n* **For treasury diversification -** when allowing community members to claim a token in exchange for some other tokens such as Ethereum, it can be useful to vest the tokens to ensure the long-term commitment of the new investors. It will limit the volatility of the Token for a certain period. It creates a fair process that rewards purchasers who support the project at launch and do so throughout the project's lifecycle by holding or utilizing the Token.\n* **For crowdfunding -** Instead of receiving a total share of their tokens after the crowdfunding, the team members receive tokens after regularly scheduled vesting periods determined by the project founders. This way, alone unscrupulous team members can't run off with tokens without contributing to the project.\n\nLet's also dig more into the main advantages of vesting a token.\n\n* **Vesting shows that the team is highly interested in the project -** Locking tokens ensure investors that the team has the best intention and maintain a long-term vision for the project, incentivize them to continue working on the project development.\n* **Vesting lowers market price manipulations -** There is often a several-year \"cliff,\" meaning that the individual must be with the company for a couple of years to release the first increment of tokens.\n* **Vesting limits the risk that few entities control a large proportion of the project's tokens -** It prevents the small group of people present when the supply has been minted to create supply fluctuations that can be ultimately damaging to the Token's ecosystem and price.\n* **Vesting helps keep the power centralized until the community is strong enough to be decentralized -** When rewarding a community through Tokens, it's better if the core team managed the token supply and transactions and kept the voting power centralized. By doing so, they'll have a firmer grasp of the token prices and will be able to build a strong and sustainable community.\n\nIt's also good to keep in mind that the more the already distributed tokens are used, the more valuable the reserved ones become, so it's in each project team member's best interest to create a successful project that has many users, increasing the value of their tokens in the process.\n\n## Conclusion\n\nAll those elements make vesting an integral part of Tokenomics. We call Tokenomics all the things that enable participants to earn more tokens by contributing positively. Setting up Tokenomics for a project means \"What can be put in place to incentivize a community to participate in the project.\" It's a tool worth using for every community leader, and vesting is likely to be a key component of most crypto launches for the foreseeable future. The protection that affords a token's value in an incredibly volatile market is invaluable.\n\nHaving a token over a vesting schedule is an efficient way to protect investors, founders, and collaborators. Indeed, as shown in this essay, locking a certain amount of Token allows to disincentivize founders and early investors to sell all their tokens with early traction. It also disincentivizes contributors to come only for speculation purposes.\n\n\n---\n\n###### **Want more?**\n\nFollow us on **[Twitter](https://twitter.com/CoinviseCo)**, [Instagram](https://www.instagram.com/coinvise/?hl=en) and join us on **[Discord](https://discord.gg/8jaQB5CZ) 🔥**\n\nThanks for being here!", "timestamp": 1632761980, "digest": "5k0dztRKPXaHeY8oUWIjqjhUP9ikLmGAfYhRFy4DyzE", "contributor": "0xC0241e384dB48C35E7b3FEded3BfEcd29A3E73e3"}
{"id": "_XIKGgC7ZDnUR3szA5ma1RAR7VMVfWmgGRZURDfqCKM", "title": "Introducing Token Race", "body": "[$WRITE RACE](https://mirror.xyz/race) has been very popular. Over the past few months, we've spoken with many projects that want to use a similar tool for their communities. We kept hearing this again and again, so we decided to build a standalone tool that anyone on Mirror could use. Today we'd like to introduce: Token Race.\n\nWe’ve spent a lot of time building, ideating, and iterating on Web3 economic protocols to support projects and creators. As our suite of economic tools has grown and matured and we’ve had communities form around them, we feel that now is the right time to start investing in governance tools to support these communities.\n\nA token race is a great way for individuals and DAOs to get their community involved in decision-making. You can use a token race in various ways, such as:\n\n* curating membership in a DAO\n* curating a list of proposals around the operations of a DAO\n* distributing funds for a grant program\n\nCheck out this example below for a token race I created to figure out what we should do with all this spare $WRITE. Anyone with spare $WRITE tokens in their wallet can vote once the voting period opens.\n\n[proposal://bafkreibqbj6dapw57cpsxpcwe2jgz3w3qtp66sg24la3uhkvgathtlwcq4](proposal://bafkreibqbj6dapw57cpsxpcwe2jgz3w3qtp66sg24la3uhkvgathtlwcq4)\n\nTo create a token race, a user specifies the address of the ERC20 token contract to use, uploads a list of proposals that they’d like their community to vote on, and specifies the minimum number of tokens members need to hold to be eligible to vote. We take a snapshot of balances, and once the voting opens members get to vote on the various proposals proportional to their wallet balance at the block height of the snapshot. Once the voting period ends, winners are selected based on the highest number of votes. All data is backed up on the Filecoin network and accessible via IPFS (h/t [estuary.tech](https://estuary.tech/)) so even if Mirror goes under, your token races are preserved in the annals of the metaverse.\n\nThis is just the first of many governance tools we plan to introduce, and we’re so excited to be able to share this one with you. We’re also working on adding more options and parameters to improve Token Race, such as quadratic voting, ERC721 based voting, delegation, and much more.\n\nAs usual, hit us up for any feedback, feature requests, or even if you want to build on top of Token Race.\n\nWe’ve also created a handy [quickstart guide](https://mirror.xyz/dashboard/guide/token-race) in your Mirror dashboard so you can get started right away.\n\nWe can’t wait to see what you come up with! ❤️", "timestamp": 1632767760, "digest": "dLLIq4Iebg5DLWJbOWa3sU6oQuwbogkmqPnz-ZbzPUg", "contributor": "0xbDc4199575A5FA3F19e9888C5d51Bde798F404Cc"}
{"id": "_dTSmeclJ5Q83bj_3BpczxDnrZJi7GbTOdMkOLpDVC4", "title": "Introducing the Radicle Community Blog 🌱", "body": "Radicle is an open source and community-led project. One priority of the project is to support the development and growth of collective community infrastructure that can be employed to [further decentralize the project](https://radicle.community/t/the-path-to-increasing-decentralization-within-radicle/2417).\n\n“Community infrastructure” includes the project’s content hubs. While [radicle.community](https://radicle.community/) is the official forum for discussions related to Radicle development & governance, our [website blog](https://radicle.xyz/blog/https://radicle.xyz/blog/) is also used to distribute project-wide content and announcements.\n\nAs the project grows, Radicle’s community team sees a need to create more accessible channels for content contributions from the Radicle community. We believe that as an open source project, not only should anybody be able to contribute blog posts, onboarding guides, tutorials, and other content.\n\n## Mirror ✍️ + Radicle Orgs 🎪\n\nToday, we launched [radicle.mirror.xyz](https://radicle.mirror.xyz/), a community blog for the Radicle project. Anybody is free to submit content to be published to the blog as long as it meets the following guidelines:\n\n* **Must be Radicle relevant** 🌱 \\\\n Content must be related to Radicle in some shape or form. Onboarding guides, tutorials, partnership announcements, and industry-specific thought pieces are all fair game.\n* **Must pass official review by Radicle Community maintainers** 👀 \\\\n At the moment, Prema Tsamy & Abbey Titcomb are the maintainers of radicle.mirror.xyz and conduct formal review of all submissions.\n\nWith Mirror and Radicle Orgs, we’re decentralizing the ownership, management, and collaboration of the community blog.\n\n### Dogfooding 🐶🦴\n\nRecently, we launched [Radicle Orgs](https://radicle.xyz/blog/radicle-orgs.html), a decentralized code management tool for DAOs. Radicle Orgs are a platform-agnostic, and more secure alternative to organizations on centralized forges like GitHub and Gitlab. Relying on smart contracts instead of admins, they allow developers manage and anchor their codebases on-chain. Radicle Orgs give DAOs a way to truly decentralize & own their collaboration infrastructure without relying centralized accounts & platforms.\n\n[https://radicle.mirror.xyz/LC1gmqihYDbxGi_kWqm6Em7Gou1F1WzG_cjkdsrSSpo](https://radicle.mirror.xyz/LC1gmqihYDbxGi_kWqm6Em7Gou1F1WzG_cjkdsrSSpo)\n\nAfter deciding to launch a community blog, we decided this could be a great opportunity to dogfood Radicle Orgs. While Radicle Orgs are a perfect solution for codebases, they can easily be used to decentralize management of any version-controlled repository. At Radicle, our [website blog](https://radicle.xyz/blog/) was already version-controlled and [hosted on GitHub](https://github.com/radicle-dev/radicle.xyz).\n\nWe created an org for the [Community Team](https://app.radicle.network/orgs/community.radicle.eth) and [a repository](https://app.radicle.network/orgs/community.radicle.eth/projects/rad:git:hnrkxcktftwxbk9yshjgspqqyxnye1phzjz7y/e05dd68ad4e475a8582ddede52ee76c3d2218b9e) for managing content submissions. Ownership of the radicle.mirror.xyz domain will be transferred to the Gnosis Safe that owns the Radicle Org as soon as Mirror offers multi-sig support. For now, ownership of the publication will be controlled by the lead maintainer.\n\n### Contributing\n\nContributors can submit a post for review by [creating and publishing a patch](https://docs.radicle.xyz/docs/using-radicle/creating-patches) to the radicle.mirror.xyz repository on Radicle. Contributors can [clone the repository](https://app.radicle.network/orgs/community.radicle.eth/projects/rad:git:hnrkxcktftwxbk9yshjgspqqyxnye1phzjz7y/e05dd68ad4e475a8582ddede52ee76c3d2218b9e) on app.radicle.network.\n\nOnce the patch is reviewed, maintainers will either merge the post or request changes. Once merged, the repository will be [anchored on-chain](https://docs.radicle.xyz/docs/connecting-to-ethereum/anchoring-projects) and published promptly to radicle.mirror.network.\n\nAs the blog continues to grow, we can explore automating the publishing process, distributing ownership among the community, and rewarding contributors (*cough* Radicle Funding *cough* 🤭). Let the dogfooding begin!\n\n\n---\n\n### Join our Discord 👾\n\n[https://discord.com/invite/fUK5BGtyTR](https://discord.com/invite/fUK5BGtyTR)\n\n### Get started with Radicle 🌱\n\n[https://docs.radicle.xyz/docs/connecting-to-ethereum/overview](https://docs.radicle.xyz/docs/connecting-to-ethereum/overview)\n\n### Follow us on Twitter 🐥\n\n[https://twitter.com/radicle?lang=en](https://twitter.com/radicle?lang=en)\n\n", "timestamp": 1632777276, "digest": "ya_vG_FlGpIa4RWE2g0rtaSrrTvnOfANs35Rj5P9vGo", "contributor": "0x7BCf7A112e9fC7Ff2b54a52990976E5C3352F2D2"}
{"id": "eRwHaJnEuC3nN9ir6XQ-vRCzegrQBxY6IeVngYRWDJg", "title": "Introducing the Radicle Community Blog 🌱", "body": "Radicle is an open source and community-led project. One priority of the project is to support the development and growth of collective community infrastructure that can be employed to [further decentralize the project](https://radicle.community/t/the-path-to-increasing-decentralization-within-radicle/2417).\n\n“Community infrastructure” includes the project’s content hubs. While [radicle.community](https://radicle.community/) is the official forum for discussions related to Radicle development & governance, our [website blog](https://radicle.xyz/blog/https://radicle.xyz/blog/) is also used to distribute project-wide content and announcements.\n\nAs the project grows, Radicle’s community team sees a need to create more accessible channels for content contributions from the Radicle community. We believe that as an open source project, not only should anybody be able to contribute blog posts, onboarding guides, tutorials, and other content.\n\n## Mirror ✍️ + Radicle Orgs 🎪\n\nToday, we launched [radicle.mirror.xyz](https://radicle.mirror.xyz/), a community blog for the Radicle project. Anybody is free to submit content to be published to the blog as long as it meets the following guidelines:\n\n* **Must be Radicle relevant** 🌱 \\\\n Content must be related to Radicle in some shape or form. Onboarding guides, tutorials, partnership announcements, and industry-specific thought pieces are all fair game.\n* **Must pass official review by Radicle Community maintainers** 👀 \\\\n At the moment, Prema Tsamy & Abbey Titcomb are the maintainers of radicle.mirror.xyz and conduct formal review of all submissions.\n\nWith Mirror and Radicle Orgs, we’re decentralizing the ownership, management, and collaboration of the community blog.\n\n### Dogfooding 🐶🦴\n\nRecently, we launched [Radicle Orgs](https://radicle.xyz/blog/radicle-orgs.html), a decentralized code management tool for DAOs. Radicle Orgs are a platform-agnostic, and more secure alternative to organizations on centralized forges like GitHub and Gitlab. Relying on smart contracts instead of admins, they allow developers manage and anchor their codebases on-chain. Radicle Orgs give DAOs a way to truly decentralize & own their collaboration infrastructure without relying centralized accounts & platforms.\n\n[https://radicle.mirror.xyz/LC1gmqihYDbxGi_kWqm6Em7Gou1F1WzG_cjkdsrSSpo](https://radicle.mirror.xyz/LC1gmqihYDbxGi_kWqm6Em7Gou1F1WzG_cjkdsrSSpo)\n\nAfter deciding to launch a community blog, we decided this could be a great opportunity to dogfood Radicle Orgs. While Radicle Orgs are a perfect solution for codebases, they can easily be used to decentralize management of any version-controlled repository. At Radicle, our [website blog](https://radicle.xyz/blog/) was already version-controlled and [hosted on GitHub](https://github.com/radicle-dev/radicle.xyz).\n\nWe created an org for the [Community Team](https://app.radicle.network/orgs/community.radicle.eth) and [a repository](https://app.radicle.network/orgs/community.radicle.eth/projects/rad:git:hnrkxcktftwxbk9yshjgspqqyxnye1phzjz7y/e05dd68ad4e475a8582ddede52ee76c3d2218b9e) for managing content submissions. Ownership of the radicle.mirror.xyz domain will be transferred to the Gnosis Safe that owns the Radicle Org as soon as Mirror offers multi-sig support. For now, ownership of the publication will be controlled by the lead maintainer.\n\n### Contributing\n\nContributors can submit a post for review by [creating and publishing a patch](https://docs.radicle.xyz/docs/using-radicle/creating-patches) to the radicle.mirror.xyz repository on Radicle. Contributors can [clone the repository](https://app.radicle.network/orgs/community.radicle.eth/projects/rad:git:hnrkxcktftwxbk9yshjgspqqyxnye1phzjz7y/e05dd68ad4e475a8582ddede52ee76c3d2218b9e) on app.radicle.network.\n\nOnce the patch is reviewed, maintainers will either merge the post or request changes. Once merged, the repository will be [anchored on-chain](https://docs.radicle.xyz/docs/connecting-to-ethereum/anchoring-projects) and published promptly to radicle.mirror.network.\n\nAs the blog continues to grow, we can explore automating the publishing process, distributing ownership among the community, and rewarding contributors (*cough* Radicle Funding *cough* 🤭). Let the dogfooding begin!\n\n\n---\n\n### Join our Discord 👾\n\n[https://discord.com/invite/fUK5BGtyTR](https://discord.com/invite/fUK5BGtyTR)\n\n### Get started with Radicle 🌱\n\n[https://docs.radicle.xyz/docs/connecting-to-ethereum/overview](https://docs.radicle.xyz/docs/connecting-to-ethereum/overview)\n\n### Follow us on Twitter 🐥\n\n[https://twitter.com/radicle?lang=en](https://twitter.com/radicle?lang=en)\n\n", "timestamp": 1632777276, "digest": "ya_vG_FlGpIa4RWE2g0rtaSrrTvnOfANs35Rj5P9vGo", "contributor": "0x7BCf7A112e9fC7Ff2b54a52990976E5C3352F2D2"}
{"id": "Jll-gTFd3Fk7BWWoqNBeOuFz-4GF4M6GfxU7uye1Vc0", "title": "Iterative music culture, generative AI and the Web3", "body": "A recent project called **Tunes** used AI to generate 5,000 unique NFTs. They’re songs, or rather, shells of songs - missing artwork, audio and an artist. That’s intentional. They serve as prompts for people to iterate on, tapping into a recent trend in the NFT space popularized by another project called **Loot**. Let’s dive in.\n\n![An example of one of the Tunes NFTs](https://images.mirror-media.xyz/publication-images/UjhKCX2G46uYPns-UccfB.png?height=647&width=411)\n\n## Loot\n\nAt the end of August an NFT project called [Loot](https://twitter.com/dhof/status/1431316631934967815) dropped. People could claim Loot NFTs for free by minting - only paying for the gas cost. Like [NFT avatar projects](https://musicx.mirror.xyz/r7kU3Ssy-MldqOOyEJN6f0vqYrB7OJDV6LJCy41EA8k), people did not know what they would get exactly after minting. Unlike other NFT projects, Loot was stripped from everything except text.\n\n[https://twitter.com/dhof/status/1431316631934967815?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1431316631934967815%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fnftnow.com%2Fguides%2Floot-nft-guide%2F](https://twitter.com/dhof/status/1431316631934967815?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1431316631934967815%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fnftnow.com%2Fguides%2Floot-nft-guide%2F)\n\nAfter minting, you’d get a list of gear. Text in an image. That’s all.\n\nPeople loved it, because it felt like an invitation to imagine what you could build from this starting point. Quickly, an ecosystem emerged around the project. \n\n[Adventure Gold](https://twitter.com/WillPapper/status/1433243941449568259) created a token to set a standard for projects building on Loot in the future. [Role](https://twitter.com/role4metaverse/status/1434938986431012865) creates characters which can equip the Loot. [Realms](https://twitter.com/LootRealms/status/1432798677467373571) attempts to map out a world for Loot to exist in. And there are [many other projects](https://nftnow.com/guides/loot-nft-guide/).\n\nMirror, the writing platform this article is published on, ran a similar project called [Heroes](https://twitter.com/viamirror/status/1433560941744906244) which would create randomized pen names and identities: text-only.\n\nIt’s different from many other NFTs, because instead of selling you something that is finished, you get the building blocks. Since everything’s on a blockchain with smart contracts, everyone can plug in and start building and expanding the project.\n\n[https://twitter.com/tandavas/status/1432803033650368512](https://twitter.com/tandavas/status/1432803033650368512)\n\nWhat if this idea was applied to music?\n\n## Tunes\n\n![Eight of the Tunes listed on OpenSea](https://images.mirror-media.xyz/publication-images/5S-wYIoTADnL3_GJlGJRS.png?height=753&width=1061)\n\n[Tunes](https://tunesproject.org/) started with a similar premise. 5,000 possible songs to mint for free, but without audio, cover art, or an artist. Building blocks.\n\nA bot called [Artunist](https://twitter.com/artunist) was set up on the project’s Discord to generate artwork. People can submit the ID of the NFT they minted and then get artwork generated for it. The results are impressive. \n\n![Cover art generated for Tunes by Artunist bot](https://images.mirror-media.xyz/publication-images/5INgiHsK0HptbG4cMXDSl.png?height=540&width=960)\n\nThe project has since expanded to include ‘Songs for Tunes’ which combines the generative artwork with artists and the music they made, with some being sold as NFTs for 1ETH ($3000\\~ at time of writing) like this [beat by oshi](https://opensea.io/assets/0x60d08dbded0bf56d21977b597793e69d1c5456e0/4737) or this song [generated by the AI band](https://opensea.io/assets/0x60d08dbded0bf56d21977b597793e69d1c5456e0/4699) ([Twitter](https://twitter.com/TheAIBand_)). \n\n## New games, new economies\n\nThe reason why I’m highlighting these projects is to show that there are new games to play, completely new avenues to explore. From the outside, the crypto space mostly gets attention for financial aspects while the cultural aspects don’t get picked up properly. When they do, it’s almost always in a financialized context… If an artist drops a new release on Spotify, we don’t say “Artist X is releases album on streaming service that raised over $2.1B in 18 rounds” yet that’s exactly what’s happening in the web3. \n\nThe actual exciting part is not really the money. It’s that anyone who perseveres can spin up a new project that can tap into any other project connected to the same blockchain. In that sense blockchains with smart contracts like Ethereum are global computers for us all to utilize. The web3 is iterative and music culture in the space is starting to embody that principle.\n\nThe first music artists who will never bother with the contemporary streaming landscape are likely already here, experimenting in the web3 and trying out other modes of collaboration, community-building, and are starting to make a living by doing so.\n\nAnd to put it in [Thanakron Tandavas’ words](https://twitter.com/tandavas/status/1432803053342642177): that’s fucking cool.\n\n![Image by @tandavas on Twitter](https://images.mirror-media.xyz/publication-images/iKysQfY0KlHwJp0g3NoZf.png?height=611&width=936)\n\n", "timestamp": 1632781984, "digest": "_VrkARj14fPzY8Blgglz1Yj3Gur7y6uD-6ghZpXi9ac", "contributor": "0xe612d9C2a9bA0Ff4403F4f7Ea87D5bE4290aC7B9"}
{"id": "pqJtYNBtnJmpN9T0ztQqUxzh2UDKuBn9-WYLHM6lZYc", "title": "Iterative music culture, generative AI and the Web3", "body": "A recent project called **Tunes** used AI to generate 5,000 unique NFTs. They’re songs, or rather, shells of songs - missing artwork, audio and an artist. That’s intentional. They serve as prompts for people to iterate on, tapping into a recent trend in the NFT space popularized by another project called **Loot**. Let’s dive in.\n\n![An example of one of the Tunes NFTs](https://images.mirror-media.xyz/publication-images/UjhKCX2G46uYPns-UccfB.png?height=647&width=411)\n\n## Loot\n\nAt the end of August an NFT project called [Loot](https://twitter.com/dhof/status/1431316631934967815) dropped. People could claim Loot NFTs for free by minting - only paying for the gas cost. Like [NFT avatar projects](https://musicx.mirror.xyz/r7kU3Ssy-MldqOOyEJN6f0vqYrB7OJDV6LJCy41EA8k), people did not know what they would get exactly after minting. Unlike other NFT projects, Loot was stripped from everything except text.\n\n[https://twitter.com/dhof/status/1431316631934967815?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1431316631934967815%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fnftnow.com%2Fguides%2Floot-nft-guide%2F](https://twitter.com/dhof/status/1431316631934967815?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1431316631934967815%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fnftnow.com%2Fguides%2Floot-nft-guide%2F)\n\nAfter minting, you’d get a list of gear. Text in an image. That’s all.\n\nPeople loved it, because it felt like an invitation to imagine what you could build from this starting point. Quickly, an ecosystem emerged around the project.\n\n[Adventure Gold](https://twitter.com/WillPapper/status/1433243941449568259) created a token to set a standard for projects building on Loot in the future. [Role](https://twitter.com/role4metaverse/status/1434938986431012865) creates characters which can equip the Loot. [Realms](https://twitter.com/LootRealms/status/1432798677467373571) attempts to map out a world for Loot to exist in. And there are [many other projects](https://nftnow.com/guides/loot-nft-guide/).\n\nMirror, the writing platform this article is published on, ran a similar project called [Heroes](https://twitter.com/viamirror/status/1433560941744906244) which would create randomized pen names and identities: text-only.\n\nIt’s different from many other NFTs, because instead of selling you something that is finished, you get the building blocks. Since everything’s on a blockchain with smart contracts, everyone can plug in and start building and expanding the project.\n\n[https://twitter.com/tandavas/status/1432803033650368512](https://twitter.com/tandavas/status/1432803033650368512)\n\nWhat if this idea was applied to music?\n\n## Tunes\n\n![Eight of the Tunes listed on OpenSea](https://images.mirror-media.xyz/publication-images/5S-wYIoTADnL3_GJlGJRS.png?height=753&width=1061)\n\n[Tunes](https://tunesproject.org/) started with a similar premise. 5,000 possible songs to mint for free, but without audio, cover art, or an artist. Building blocks.\n\nA bot called [Artunist](https://twitter.com/artunist) was set up on the project’s Discord to generate artwork. People can submit the ID of the NFT they minted and then get artwork generated for it. The results are impressive.\n\n![Cover art generated for Tunes by Artunist bot](https://images.mirror-media.xyz/publication-images/5INgiHsK0HptbG4cMXDSl.png?height=540&width=960)\n\nThe project has since expanded to include ‘Songs for Tunes’ which combines the generative artwork with artists and the music they made, with some being sold as NFTs for 1ETH ($3000\\~ at time of writing) like this [beat by oshi](https://opensea.io/assets/0x60d08dbded0bf56d21977b597793e69d1c5456e0/4737) or this song [generated by the AI band](https://opensea.io/assets/0x60d08dbded0bf56d21977b597793e69d1c5456e0/4699) ([Twitter](https://twitter.com/TheAIBand_)).\n\n## New games, new economies\n\nThe reason why I’m highlighting these projects is to show that there are new games to play, completely new avenues to explore. From the outside, the crypto space mostly gets attention for financial aspects while the cultural aspects don’t get picked up properly. When they do, it’s almost always in a financialized context… If an artist drops a new release on Spotify, we don’t say “Artist X is releases album on streaming service that raised over $2.1B in 18 rounds” yet that’s exactly what’s happening in the web3.\n\nThe actual exciting part is not really the money. It’s that anyone who perseveres can spin up a new project that can tap into any other project connected to the same blockchain. In that sense blockchains with smart contracts like Ethereum are global computers for us all to utilize. The web3 is iterative and music culture in the space is starting to embody that principle.\n\n[https://twitter.com/Suhail/status/1440702405612478479](https://twitter.com/Suhail/status/1440702405612478479)\n\nThe first music artists who will never bother with the contemporary streaming landscape are likely already here, experimenting in the web3 and trying out other modes of collaboration, community-building, and are starting to make a living by doing so.\n\nAnd to put it in [Thanakron Tandavas’ words](https://twitter.com/tandavas/status/1432803053342642177): that’s fucking cool.\n\n![Image by @tandavas on Twitter](https://images.mirror-media.xyz/publication-images/iKysQfY0KlHwJp0g3NoZf.png?height=611&width=936)\n\n", "timestamp": 1632782065, "digest": "_VrkARj14fPzY8Blgglz1Yj3Gur7y6uD-6ghZpXi9ac", "contributor": "0xe612d9C2a9bA0Ff4403F4f7Ea87D5bE4290aC7B9"}
{"id": "uWczmaG8EO7lj2pqkAN6s45NYNGvXVilNFBUWqtbva4", "title": "Brief responses to two USV Ethereum Critiques", "body": "*👋 Note: Originally published on Sept 9, 2019 on [Medium](https://jjmstark.medium.com/brief-responses-to-two-usv-ethereum-critiques-4f0ca7bd3066).*\n\n\n---\n\nTwo partners at Union Square Ventures recently published separate blogs critical of Ethereum: “*[Is Ethereum the AOL of Crypto?](https://continuations.com/post/187279569830/is-ethereum-the-aol-of-crypto)*” by Albert Wenger, and “*[Some Thoughts on Crypto](https://avc.com/2019/09/some-thoughts-on-crypto/)*” by Fred Wilson.\n\n**I’m fond of saying that “[Ethereum needs better critics](https://twitter.com/0xstark/status/1078758860205289477?s=20)”**. Hopefully Albert and Fred *continue* being critics, and through debate with the Ethereum community, become better ones over time. A positive trait in the Ethereum community is our interest in [deliberately seeking out flaws, exposing them](https://medium.com/@ameensol/what-you-should-know-before-putting-half-a-million-dai-in-compound-fafdb2645f77), and fixing them.\n\nThe explicit goal of this short post is to bait Albert and Fred into *being* better critics. Expand on your arguments, tell us (beyond generalities) what you think Ethereum is doing wrong, and what others are doing better.\n\nEthereum isn’t perfect. If it was perfect, what would there be to do? Ethereum has many flaws, but it has incredible potential. This means there are many interesting problems to solve, and that solving those problems matters.\n\n## “Is Ethereum the AOL of Crypto?” by Albert Wenger\n\nThe gist of Albert’s [post](https://continuations.com/post/187279569830/is-ethereum-the-aol-of-crypto) is that one area of activity on Ethereum, Decentralized Finance (or “Open Finance” if you prefer) may be circularly dependent on a small segment of the Ethereum community for both its funding and its users. There are two arguments there, which I’ll do my best to [steelman](https://wiki.lesswrong.com/wiki/Steel_man):\n\n## **1. Is DeFi dependent on Ethereum for funding?**\n\nAlbert’s first argument goes like this: DeFi has been a success for Ethereum so far. However, if it is the case that most DeFi companies are being financed “by Ethereum”, then it may create a circular dependency that could be undone by some adverse event, similar to how the dot-com bust undid AOL. For instance, ***if*** most DeFi companies are being funded by large ETH holders selling ETH, and those companies were to fail, this could lower the price of ETH. This in turn would mean there is less funding available for new DeFi companies, meaning less success, meaning a lower ETH price, and on and on.\n\nThe obvious question is simply: is it true that a lot of DeFi is “financed via Ethereum”?\n\nAlbert gives two examples of what he means by this:\n\n* When a DeFi project has its own token. I assume the point here is that a project with its own token is financially dependent on the price of that token, which we assume might be correlated with the price of ETH. Such a project might also simply hold a lot of ETH.\n* When a DeFi project is financially supported by organizations or people with large holdings of ETH (e.g. ConsenSys, which he calls out specifically).\n\nSurveying the DeFi industry, Albert’s claim seems mostly false. Most of the top DeFi projects (1) do not have their own token, and (2) have raised (and continue to raise) outside VC capital.\n\nTo use one metric, out of the 10 top DeFi projects listed on [DeFi Pulse](https://defipulse.com/):\n\n* 4 have their own token (MakerDAO, Synthetix, Bancor, Kyber)\n* 8 have raised VC money (MakerDAO, Compound, Synthetix, dYdX, Uniswap, Set, Dharma, wBTC (via Kyber), Bancor, and Kyber)\n* 1 raised money from ConsenSys (Nuo)\n\nThis doesn’t include other stablecoins like USDT, USDC, Gemini, and others — all funded by VC and large exchanges.\n\nIt doesn’t *seem* true that DeFi is being propped up by large ETH holders. What companies or projects is Albert thinking of when he writes this critique, if not the ones listed above?\n\n## **2. Is DeFi dependent on a small circular economy of users?**\n\n**Separate from the AOL analogy, Albert is getting at a deeper question: is it dangerous that so much of DeFi is “self-referential” within Ethereum?**\n\nTraders who want leverage are the primary consumers of lending products, borrowing from ETH holders. Financial services and products (derivatives, trading services, etc) let users interact with or have exposure to a variety of ETH based assets, and some of those assets have little use outside of speculation.\n\n![Source: Alethio (link)](https://miro.medium.com/max/1400/0\\*fS0WHOWlfhuGc00C)\n\nWhether you view the above description as a strike against DeFi probably depends on your frame of reference. On the one hand, it’s true that the lofty vision of a global alternative financial system that banks the unbanked and provides accessible financial services to the world is far from reality.\n\n**On the other hand, what should we expect?** Ethereum launched 5 years ago, Dai has existed for under 2 years, and DeFi as a proper noun is about 1 year old. Shouldn’t we expect an emergent financial system to *begin* as a very local phenomenon, while basic infrastructure and services are laid down, before expanding its scope? Even then, isn’t some amount of self-reference a *good* thing, since it creates demand for ETH?\n\n**It’s not even *really* true that DeFi is entirely walled off within Ethereum:** see for instance efforts to integrate with Bitcoin like [wBTC](https://www.wbtc.network/) and [tBTC](https://tbtc.network/), or the many companies working to bridge Ethereum to the legacy financial system (here [are](https://www.coindesk.com/crypto-and-security-token-exchange-inx-to-raise-130-million-in-landmark-ipo) [three](https://www.theblockcrypto.com/tiny/visa-debit-card-available-in-europe-allows-to-spend-dai-stablecoin-anywhere-in-the-world/) [examples](https://www.coindesk.com/national-stock-exchange-becomes-worlds-first-to-list-a-tokenized-security?utm_source=twitter&utm_medium=coindesk&utm_term=&utm_content=&utm_campaign=Organic%20) just from the last month). DeFi’s integration with other ecosystems is just as true at the social level: Bitfinex, a company whose culture is very Bitcoin-centric, used Ethereum for their token sale.\n\n## “Some Thoughts on Crypto” by Fred Wilson\n\nFred’s [piece](https://avc.com/2019/09/some-thoughts-on-crypto/) is a bit lighter, and has only a few remarks about Ethereum.\n\n**Fred’s claims are simple:** Ethereum is hard to build on, it’s hitting scaling challenges, and “many developers are looking elsewhere.”\n\n**Yes, Ethereum’s developer experience still needs improvement**. This has been, and remains, a large priority for the community. But while development on Ethereum is frustrating relative to established areas of software development, it is dominant over every other smart contract platform. Don’t take my word for it — [ask projects who have tried to build on other chains](https://blog.synthetix.io/cross-chain-infrastructure-revisited/) or [incubators who target blockchain startups](https://twitter.com/yossihasson/status/1169571179650322433).\n\n**Yes, some developers *are* looking at other platforms.** They should! It would be irresponsible for any entrepreneur or developer *not* to kick the tires and figure out the best stack for their needs. Especially when many (not yet launched) chains are making incredible claims about their (theoretical) performance.\n\nBut so far, when developers are voting with their [money](https://twitter.com/spencernoon/status/1151214732684222465) and time, the [vast majority of them](https://www.electriccapital.com/electric-research) are still choosing Ethereum:\n\n![Source: Electric Capital (link). Includes both protocol and ecosystem devs, including dapps.](https://miro.medium.com/max/1400/0\\*e-u9Pv4cDwBgT-aH.png)\n\nIn terms of distribution, [Ethereum remains the IBM of our ecosystem.](https://www.placeholder.vc/blog/2019/8/31/ethereum-and-the-seven-dwarfs) As more competing chains come online and begin spending their warchests, the Ethereum ecosystem might bleed a few developers. The difference between Ethereum and its competitors is that Ethereum actually *has* developers at risk of leaving.\n\nThe important question isn’t whether *some* developers build on other platforms, but whether any other chain can displace Ethereum as the de-facto smart contract platform used by the majority of the industry. Does Fred think this is likely? If so, why specifically?\n\nAs for scaling challenges — Ethereum is absolutely running up against these — an unfortunate side effect of having developers and users on your platform! Your view on whether those challenges are insurmountable will depend on your view of the adoption of layer 2 scaling tech and progress on ETH 2.0, topics too large to cover here.\n\n**The reason Fred’s piece touched a nerve isn’t these points by themselves, which are relatively obvious and well-understood concerns.** What set people off was the strange contrast between his disappointment in Ethereum and his other comments.\n\n**For instance, his very next point in the blog post is that “Stablecoins \\[…\\] are a bright spot”**. On twitter, [I pointed out](https://twitter.com/0xstark/status/1169280255254679552) that virtually every stablecoin with any use is an ERC-20, which seems at odds with his dim view of Ethereum. Fred [clarified](https://twitter.com/fredwilson/status/1169288109151924224) that his concern is that they might “leave” Ethereum.\n\nMany stablecoins probably *will* launch alt-versions of themselves on other chains eventually, but it’s hard to imagine why a project would abandon all of the capital, users, infrastructure, services, and liquidity available to their ERC-20s. Until there is any evidence that developers or users are abandoning Ethereum, isn’t the success of stablecoins — virtually all built on Ethereum — a point in its favour?\n\nI am curious what *specific* weaknesses of Ethereum and \\*specific \\*strengths of its imitators motivated Fred’s post. But it’s hard to know what to make of his conclusions right now.\n\n**If Ethereum is doing everything wrong, why is the entire crypto industry building on it?** Between Fred publishing his post, and my sitting down to draft this one, [Binance announced plans to launch a USD stablecoin](https://www.theblockcrypto.com/2019/09/05/binance-launching-its-own-usd-pegged-stablecoin-busd-with-paxos-as-custodian/), and [Paxos announced a gold-backed token](https://www.theblockcrypto.com/2019/09/05/paxos-embraces-gold-pegged-crypto-as-sea-change-in-gold-trading/).\n\nBoth will be built on Ethereum.\n\n\n---\n\n***Note:*** *I am (obviously) biased towards Ethereum. I co-founded and operate two Ethereum based companies:* *[L4](http://l4v.io/) (open source state channels) and [ETHGlobal](http://ethglobal.co/) (largest dev relations & on-boarding org in the industry), and I work with the Ethereum Foundation on a few special projects.*\n\n*Thanks to Eric Conner, Ryan Sean Adams, Evan Van Ness, and others for their feedback on this post.*", "timestamp": 1632782852, "digest": "rulb8IDz8ipY9FX3XZo-brIKo-iHVVU_Re-_XrrX9Hs", "contributor": "0x4aa9C5546BE68486c4eF264a230D25674a1A728e"}
{"id": "A5EMzsVi3xxkdnhF0uT2oWQI758oE4-sKzgVwcu7458", "title": "The Token Race", "body": "Our portfolio company [Mirror](https://mirror.xyz/) has been using a “game mechanic” called [The Write Race](https://mirror.xyz/race) to onboard users to the Mirror service. Mirror is something between a blogging platform, a crowdfunding platform, and a community platform, built for the crypto sector. Mirror is built on decentralized protocols and is a web3 version of all of those things and more.\n\nUsers need a $WRITE token to publish on Mirror and the best way to get $WRITE tokens is to join the Write Race that happens every Wednesday 5pm eastern. Anyone who holds a $WRITE token can vote for new users in the Write Race. The top ten vote getters are airdropped a $WRITE token and can publish on Mirror. \n\nYesterday, Mirror announced that they have expanded this game mechanic to any activity that requires a token. They call it [Token Race](https://dev.mirror.xyz/dLLIq4Iebg5DLWJbOWa3sU6oQuwbogkmqPnz-ZbzPUg).\n\nImagine your DAO wants to admit new members but needs a way to do that. Token Race.\n\nImagine your DAO wants to distribute funds to worthy crypto projects. Token Race.\n\nYou get the idea.\n\nHere is how Token Race works:\n\n> To create a token race, a user specifies the address of the ERC20 token contract to use, uploads a list of proposals that they’d like their community to vote on, and specifies the minimum number of tokens members need to hold to be eligible to vote. We take a snapshot of balances, and once the voting opens members get to vote on the various proposals proportional to their wallet balance at the block height of the snapshot. Once the voting period ends, winners are selected based on the highest number of votes. All data is backed up on the Filecoin network and accessible via IPFS (h/t [estuary.tech](https://estuary.tech/)) so even if Mirror goes under, your token races are preserved in the annals of the metaverse.\n>\n> https://dev.mirror.xyz/dLLIq4Iebg5DLWJbOWa3sU6oQuwbogkmqPnz-ZbzPUg\n\nSo if you’ve been looking for a tool to do your own version of the Write Race, look no further. Token Race is here.", "timestamp": 1632826299, "digest": "QktqbJ6xixTR_StMqWKkSAond8FY67eQefDQXNcK80Q", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
