{"id": "Hv0J9c-k0O_vahobXsQuesWflQRJJFvkMPOenWmJHbI", "title": "Test Edit", "body": "Testt", "timestamp": 1625483986, "digest": "CTJ8KaIC9jAvZ2BbKf6-b6CIf7Qyh0DetSlqz4utWXE", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "MS_WcJ3RohC6KkDIhM9QTk-Yw3VdBRfeQDw546X412I", "title": "Test", "body": "test", "timestamp": 1625484143, "digest": "gka6VSJXjF0dVI0c04IGhW9Ti1D_VP2NFfwUC27ccQg", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "jLa0JhjtYCGFD6JVzBT7gkqhz9GS1KlmfBV3zZAZ1b4", "title": "How to Send an On-Chain Message Using an Ethereum Transaction", "body": "\n\nUsing hexadecimal and MyEtherWallet, you can encode permanent messages onto the Ethereum blockchain. People will then be able read these messages on Etherscan if they know where and how to look.\n\n### Step 1: \nGo to a [text to hexadecimal conversion tool](https://www.rapidtables.com/convert/number/hex-to-ascii.html) and convert the message you would like to send. Make sure to swap the two fields so that you're converting text to hex. When you swap the fields, a selector will appear below that you can use to ensure no spaces are included in the final hex output: \n\nhttps://www.rapidtables.com/convert/number/hex-to-ascii.html\n\n### Step 2: \nGo to [MyEtherWallet](https://www.myetherwallet.com/) and connect your existing wallet to the site by selecting the “Access My Wallet” button:\n\nhttps://www.myetherwallet.com/\n\n### Step 3: \nChoose your connection type. I use [Rainbow](https://rainbow.me), so I select the option with **WalletConnect**.\n\n### Step 4: \nOnce connected, navigate to “Send Transaction” and toggle the “Advanced” setting that is on this screen. An “Add data” field will appear that you can paste your hexadecimal message into.\n\n![](https://images.mirror-media.xyz/publication-images/d86c5419-bd42-40e2-b376-2a48fbfa276a.png?height=596&width=1392)\n\n\n\n### Step 5: \nFill out the rest of the transaction information and click send! If you just want to send the message and no ETH, leave ETH at 0 or choose a tiny amount like 0.0001 ETH.\n\n## How to Read a Hexadecimal Message on Etherscan\n\n\n### Step 1:\nGo to the page on Etherscan for the transaction that contains the encoded message.\n\n### Step 2: \nScroll down and tap \"Click to see More\". Then, select \"View Input As\" > \"UTF-8\". The data will be converted from hexadecimal back to plain text.\n\n![](https://images.mirror-media.xyz/publication-images/9be610af-5c0e-427d-8120-8362babdedec.png?height=824&width=1502)\n\n", "timestamp": 1625485688, "digest": "5xbwbVzWcO8vQkEIGlMaUjXNM6UNM8labiN-5QkVCHM", "contributor": "0x3B3525F60eeea4a1eF554df5425912c2a532875D"}
{"id": "Fi5veRQA7Pfu15jrcDXFMasN_9gUYqoTQN21MsWKJHc", "title": "How to Send an On-Chain Message Using an Ethereum Transaction", "body": "\n\nUsing hexadecimal and MyEtherWallet, you can encode permanent messages onto the Ethereum blockchain. People will then be able read these messages on Etherscan if they know where and how to look.\n\n### Step 1: \nGo to a [text to hexadecimal conversion tool](https://www.rapidtables.com/convert/number/hex-to-ascii.html) and convert the message you would like to send. Make sure to swap the two fields so that you're converting text to hex. When you swap the fields, a selector will appear below that you can use to ensure no spaces are included in the final hex output: \n\nhttps://www.rapidtables.com/convert/number/hex-to-ascii.html\n\n### Step 2: \nGo to [MyEtherWallet](https://www.myetherwallet.com/) and connect your existing wallet to the site by selecting the “Access My Wallet” button:\n\nhttps://www.myetherwallet.com/\n\n### Step 3: \nChoose your connection type. I use [Rainbow](https://rainbow.me), so I select the option with **WalletConnect**.\n\n### Step 4: \nOnce connected, navigate to “Send Transaction” and toggle the “Advanced” setting that is on this screen. An “Add data” field will appear that you can paste your hexadecimal message into.\n\n![](https://images.mirror-media.xyz/publication-images/d86c5419-bd42-40e2-b376-2a48fbfa276a.png?height=596&width=1392)\n\n\n\n### Step 5: \nFill out the rest of the transaction information and click send! If you just want to send the message and no ETH, leave ETH at 0 or if you're using Rainbow, choose a tiny amount like 0.0001 ETH.\n\n## How to Read a Hexadecimal Message on Etherscan\n\n\n### Step 1:\nGo to the page on Etherscan for the transaction that contains the encoded message.\n\n### Step 2: \nScroll down and tap \"Click to see More\". Then, select \"View Input As\" > \"UTF-8\". The data will be converted from hexadecimal back to plain text.\n\n![](https://images.mirror-media.xyz/publication-images/9be610af-5c0e-427d-8120-8362babdedec.png?height=824&width=1502)\n\n", "timestamp": 1625485984, "digest": "5xbwbVzWcO8vQkEIGlMaUjXNM6UNM8labiN-5QkVCHM", "contributor": "0x3B3525F60eeea4a1eF554df5425912c2a532875D"}
{"id": "95jYWAqmlP51_cp299bxewfidlQHNc0Gl5_bPRsgRNU", "title": "Ways to improve the ownership economy", "body": "**🆕 New experiment:** This essay will be publicly available for 9 hours from the time it was published. For each NFT edition collected, an additional **3 hours** will be added to the countdown clock, extending public availability of the essay for all readers. \n\nIf the countdown clock expires without an NFT edition being collected, the essay will be made private until another edition is collected and the countdown is reset. Once all 25 editions are collected, the essay will be made permanently available to the public.\n\n👉 TL;DR Collecting the NFT edition gives others the opportunity to read the article — don’t run out of time. ***Timer and NFT available at the bottom of this post or [here](https://ff.mirror.xyz/editions/0x3725CA6034bcDBc3c9aDa649d49Df68527661175/25).***\n\n***\n\n*This is a guest post featuring [Austin Robey](https://twitter.com/austinrobey_), co-founder at [Ampled](https://twitter.com/ampl3d) in an FF exclusive.*\n\n\"The Ownership Economy\" is an idea coined by [Variant Fund](https://variant.fund/) investor Jesse Walden to describe emergent ways that crypto networks can be built, owned, and controlled by their users. It’s an outline for exciting new economic models that give networks the ability to create a more cooperative and equitable online economy. It’s also a counter-movement to extractive, proprietary, investor-owned platforms whose ownership structures create competing interests between their investors and their communities. \n\n![](https://images.mirror-media.xyz/publication-images/88bea002-c2b4-468f-8ddf-dc69c35b0079.png?height=1114&width=1980)\n\nJesse describes the ownership economy like this:\n\n> The ownership economy doesn’t always mean a literal distribution of tokens, stock options, or equity. It also doesn’t necessarily mean that an application or service is entirely built on a blockchain. Rather, it means that ownership — which may manifest in the form of novel economic rewards, platform governance, or new forms of social capital — can be a new keystone of user experiences, with plenty of design space to explore.\n\nAs a counter-framework against web 2.0 pitfalls, \"The Ownership Economy\" outlines how users can gain real power in emergent decentralized networks. Although \"The Ownership Economy\" represents a trend towards the creation of a more equitable online economy, words are important – and there is a risk that the word “ownership” may be misleading. \n\nTo start, there doesn’t seem to be a consensus about what \"ownership\" is.\n\n- Is ownership a metaphor for more agency? \n- Is ownership a way to share “exposure to upside”?\n- Is ownership a robust set of clear rights and responsibilities?\n\nCommunity ownership is a virtuous aspiration among web3 organizations. However, without an agreed upon definition or collective understanding of what ownership actually is, we may inadvertently dilute or abstract its meaning.\n\n### Risks of misinterpreting ownership \nIn the late aughts, there was a sense of optimism in tech, and a sentiment that tech-enabled web 2.0 platforms were \"democratizing\" things for everyday people. However, this idea of democratization never showed up where it mattered: in the boardroom and in corporate governance. Platforms were, by default, oligarchies controlled by founders or investors. Instead, what \"democracy\" really meant for common users was \"access\". We got access to things like image sharing, tweets, crowdfunding, information, and more. As users, we never got a seat at the table, or a say in how these platforms were run. At the same time, value from our user-generated data, art, content, and labor was extracted to enrich founders and investors.\n\nWeb 3.0 usage of the word \"ownership\" carries similar risks to the web 2.0 usage of the word \"democracy\". \n\nWhereas \"democracy\" was redefined to mean \"access\", \"ownership\" risks being abstracted away to mean little more than \"exposure to upside\". Yes, having the ability for users to capture more value is good, but does it qualify as \"ownership\"?\n\n[Twitter](https://twitter.com/austinrobey_/status/1366237014841053185)\n\n### Why ownership is important\nConcentrated ownership is one the primary drivers of wealth inequality today. In tech, the ownership gap between platform owners and platform users continues to grow – and has real consequences. \n\n[If Apple were structured as a worker-owned cooperative](https://www.forbes.com/sites/cameronkeng/2014/12/18/if-apple-was-a-worker-cooperative-each-employee-would-earn-at-least-403k/), the ownership stake of each of its 150,000 workers would be worth over $15m. On top of that, each employee would receive an annual dividend of over $400k. Ownership creates wealth, and its concentration helps create wealth inequality.\n\nWhile musicians faced an existential crisis during a pandemic, Spotify CEO Daniel Ek’s ownership stake in Spotify climbed to be worth over $4 billion. In order to earn $4 billion, a musician earning the median wage of $25,000 would have to work for 160,000 years – in other words, they’d have to have started working before human history began.\n\nYancey Strickler, Co-founder of Kickstarter, writes about concentrated ownership in his essay, [\"The Ownership Crisis\"](https://ystrickler.medium.com/the-ownership-crisis-55a5f84c3e88).\n\n> *Despite many people contributing to the tools and services that now dominate our lives, most people have no stake in them. To cite just one example, the four million people who drive for Uber probably own less of the company combined than a single dentist in New Jersey with Vanguard in their portfolio.*\n\n> *People with ownership — virtually all of whom are already wealthy — will become increasingly wealthier. People without ownership — everyone else — will become increasingly not. Soon it will be hard to see anything else.*\n\nShared ownership models will become a critical cornerstone for building a fairer and equitable online economy. In tech, we should not only work to create greater access to ownership, but also reinforce a definition of ownership that is ambitious and capable of delivering meaningful systems change. \n\n### What is ownership?\nOwnership can be understood as a proxy for two things: decision making power and financial power. This suite of benefits includes the ability to have a voice in the direction, strategy, operations, or fate of a company; as well as the ability to capture profits and the value of its equity and assets.\n\n*Ownership = (Financial power + Decision making power)*\n\nBoth financial power and decision making power are elements of ownership that can be broken down into sets of distinct rights and responsibilities, often on a spectrum.\n\n![](https://images.mirror-media.xyz/publication-images/695fa14e-19fa-48c5-ad8f-9e3d174111b0.jpg?height=1440&width=2560)\n\nLooking at the current web 3.0 landscape through this lens, we can examine the ways that organizations within \"The Ownership Economy\" can improve.\n\n### Financial Power: Transparent Investments & Agreements \n\nOne of the most overlooked elements of ownership in the web 3.0 space is financial transparency, particularly regarding investments and agreements. As an example, investment announcements ([like this](https://finance.yahoo.com/news/zora-gets-nft-funding-craze-212329286.html)) may share that an investment was made, but won’t openly share what investors actually purchased. If the goal of a crypto network is to become \"community owned\", it would seem logical to disclose investment deal structures and details to their community. \n\nConsider a real-world example: Imagine you are a part owner of a bakery. Next, imagine there is another owner who has entered into financial agreements with third parties, but you are not allowed to access the terms. Would this arrangement seem like true ownership?\n\nIf a crypto network is raising money from investors, demonstrating a reasonable level of transparency is an easy thing to do. All it would take is a blog post. For example, an announcement could say something like: \n\n> \"We raised x amount of money to do x. The deal was structured like this because our goal of community ownership is ____. Here's what it means for the larger ecosystem.\" \n\nIf the goal of \"progressive decentralization\" is to transition to community ownership, it would seem incongruent for early stage investments terms to be hidden from the community. In addition, opaque investment terms imply the community wasn’t given a chance to participate in the investment process.\n\nSome questions to consider:\n\n- What are investors purchasing with their investment?\n- How does this impact the path towards community ownership?\n- Why not share investment deal terms with the community?\n\n[Twitter](https://twitter.com/austinrobey_/status/1399365878718910469)\n\n### Financial Power: Transparent Compensation\n\nOften in the web 3.0 space, there is an analogous comparison given to digital cooperatives. While many DAOs do disclose compensation for full time workers, existing cooperatives are much better than crypto networks at sharing these details. As an example, look at this publicly available [Executive Compensation Report](https://www.rei.com/about-rei/executive-compensation) by REI Co-op. Disclosures of compensation within crypto networks should become a core standard in order to demonstrate real community ownership.\n\n- How are founders and executives getting paid?\n- What is the compensation package and structure?\n- How are \"advisors\" compensated?\n\n![](https://images.mirror-media.xyz/publication-images/78003790-a571-4dcc-a6b1-697d808027d5.jpg?height=1440&width=2560)\n\n### Decision Making Power: Treasury & Board Codetermination\n\nIn corporate governance, \"codetermination\" refers to workers or other stakeholders having representatives on the board of directors. It’s a step towards collective governance that any company can take to create a more democratic workplace. \n\nFor networks that aim to be community owned, there should be some form of codetermination at the outset, allowing community proxies or representatives to be involved in treasury-related decisions -- particularly around token allocation.\n\nSome questions to consider:\n\n- Who decides how tokens are allocated?\n- Who controls access to the treasury?\n- If tokens = ownership, who makes decisions around distributing ownership?\n\n### Strengthening community ownership: community investments\n\nBy default, platforms today are owned by founders and investors, not communities. If the goal for networks is to be community owned, then there is a tacit implication (even by VCs investing in the \"ownership economy\") that community ownership is preferable to investor ownership.\n\n![](https://images.mirror-media.xyz/publication-images/70e4f385-88ba-4d7b-9dc4-d92721265244.jpg?height=1440&width=2560)\n\nThis is the primary defining characteristic of a community-owned platform: less investor ownership. In order for communities to achieve greater ownership, investors need to own less. In order for communities to have greater financial power, investors must have less. In order for communities to have greater decision making power, investors must have less.\n\nTo create stronger community ownership, web 3.0 networks should move away from resourcing startup capital from centralized, opaque, and hierarchical VCs (often with undisclosed LPs), and ideally receive funding directly from stakeholders. Instead, as an alternative to venture capitalists, \"The Ownership Economy\" would be better served by transparent investments through worker self-directed investment DAOs, controlled directly by organized laborers. These worker self-directed DAOs could have more flexible, social or community-driven investment theses that aren’t bound by a fiduciary responsibility to seek outsized financial returns for LPs.\n\n### Strengthening community ownership: industry standards\n\nIn order to preserve its meaning, I believe we need an agreed upon set of criteria to evaluate \"community ownership\". Currently, [any platform](https://bitclout.com/) can claim to be \"owned\" by its users, and there is no real shared standard for gauging how true this is.\n\nI would suggest the development of a Community Ownership Assessment like the B Corp Impact Assessment, which scores companies based on criteria like impact on workers, community, customers, and corporate governance. A Community Ownership Assessment could take into account forms of transparency, equitable token distribution, and democratic participation.\n\n### Conclusion\n\n\"The Ownership Economy\" is an important idea. It outlines a promising movement to bring more power to users and help communities capture more of the value they generate. It’s an important enough idea that it deserves greater scrutiny and higher standards that will allow organizations to live up to the promise of its thesis: the development of new economic models for networks that are built, owned, and operated by their users.\n\n***\n\n*This essay will be minted as 25 NFT editions. Each edition collected will add 3 hours to the countdown clock. Once all 25 editions are purchased, the essay will be permanently available to the public!*\n\n[Ways to improve the ownership economy](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=25)\n\n[NFT Timer](https://www.forefront.auction/counter?display=iframe)\n\n*Last updated: July 5th, 2021*\n\n\n", "timestamp": 1625495503, "digest": "ZRsr5HZMfbHOEe2lIYoWinRCI65NlvDW_QzEu1rn7As", "contributor": "0xaBaF40768e575bEb3244df2853A0505Cb2D2e4bB"}
{"id": "EIXK5rj-lPOPs8gz75y3VgTUucwauZlUI4vsDsVbr9g", "title": "The quick brown fox jumped over the lazy dogs.", "body": "The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.", "timestamp": 1625499111, "digest": "05D-j0eIU9zZalReHrlUrYRsNwpSvgW_zaw4YMw6AW0", "contributor": "0xf36615A5a8A9c19a368DcE3357B8C6B723C75701"}
{"id": "RA4wKTg5nGVSGxuhB-W3cbJKeD5Y3MDu9uuYzL8ffhY", "title": "The quick brown fox jumped over the lazy dogs.", "body": "The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The [quick brown fox jumped over the lazy](https://mirror.xyz) dogs.", "timestamp": 1625502671, "digest": "05D-j0eIU9zZalReHrlUrYRsNwpSvgW_zaw4YMw6AW0", "contributor": "0xf36615A5a8A9c19a368DcE3357B8C6B723C75701"}
{"id": "YES48d7m4PBvc8hq5R3C1-4ZddrDPSfZ6f8NT83CFWY", "title": "The quick brown fox jumped over the lazy dogs.", "body": "The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The [quick brown fox jumped over the lazy](https://duckduckgo.com) dogs.", "timestamp": 1625502714, "digest": "05D-j0eIU9zZalReHrlUrYRsNwpSvgW_zaw4YMw6AW0", "contributor": "0xf36615A5a8A9c19a368DcE3357B8C6B723C75701"}
{"id": "oSS8sjBn4N_aCJhlbGOZWjnhpGRPOvY9TQRMjVMiVJg", "title": "Test", "body": "test", "timestamp": 1625503129, "digest": "9fhGr3Lf6mLrXU42QhGY662fEyP4FP3k-mVJxYBVQNw", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "GvfMVr4NG95b39z2T3eYruql_WuqeyrWxFQPwrrxkhw", "title": "Testing 123", "body": "The quick brown fox jumped over the lazy dogs.", "timestamp": 1625514140, "digest": "UoOuDa5ggiKOHWGO-kL0kPnQLbwsg5-_AfxgaiWaIQI", "contributor": "0xf36615A5a8A9c19a368DcE3357B8C6B723C75701"}
{"id": "rVparuyyaw_OsngdSocz2tgw6SJM5bh_BLw6ll8RYmc", "title": "Testing 123", "body": "The quick brown fox jumped over the lazy dogs. Hello", "timestamp": 1625516417, "digest": "UoOuDa5ggiKOHWGO-kL0kPnQLbwsg5-_AfxgaiWaIQI", "contributor": "0xf36615A5a8A9c19a368DcE3357B8C6B723C75701"}
{"id": "WBNySipSvS52vM8F8A7p4y6odHcBFy3SvNsCtFeosLU", "title": "Ways to improve the ownership economy", "body": "***🔥 Update:** WOW. Target reached! We are overwhelmed by the support for this [experiment](https://twitter.com/forefront__/status/1412056876787724291) in funding high quality public content. Thank you to all who have contributed by collecting the NFT. This essay is now permanently available to the public.*\n\n***\n\n*This is a guest post featuring [Austin Robey](https://twitter.com/austinrobey_), co-founder at [Ampled](https://twitter.com/ampl3d) in an FF exclusive.*\n\n\"The Ownership Economy\" is an idea coined by [Variant Fund](https://variant.fund/) investor Jesse Walden to describe emergent ways that crypto networks can be built, owned, and controlled by their users. It’s an outline for exciting new economic models that give networks the ability to create a more cooperative and equitable online economy. It’s also a counter-movement to extractive, proprietary, investor-owned platforms whose ownership structures create competing interests between their investors and their communities. \n\n![](https://images.mirror-media.xyz/publication-images/88bea002-c2b4-468f-8ddf-dc69c35b0079.png?height=1114&width=1980)\n\nJesse describes the ownership economy like this:\n\n> The ownership economy doesn’t always mean a literal distribution of tokens, stock options, or equity. It also doesn’t necessarily mean that an application or service is entirely built on a blockchain. Rather, it means that ownership — which may manifest in the form of novel economic rewards, platform governance, or new forms of social capital — can be a new keystone of user experiences, with plenty of design space to explore.\n\nAs a counter-framework against web 2.0 pitfalls, \"The Ownership Economy\" outlines how users can gain real power in emergent decentralized networks. Although \"The Ownership Economy\" represents a trend towards the creation of a more equitable online economy, words are important – and there is a risk that the word “ownership” may be misleading. \n\nTo start, there doesn’t seem to be a consensus about what \"ownership\" is.\n\n- Is ownership a metaphor for more agency? \n- Is ownership a way to share “exposure to upside”?\n- Is ownership a robust set of clear rights and responsibilities?\n\nCommunity ownership is a virtuous aspiration among web3 organizations. However, without an agreed upon definition or collective understanding of what ownership actually is, we may inadvertently dilute or abstract its meaning.\n\n### Risks of misinterpreting ownership \nIn the late aughts, there was a sense of optimism in tech, and a sentiment that tech-enabled web 2.0 platforms were \"democratizing\" things for everyday people. However, this idea of democratization never showed up where it mattered: in the boardroom and in corporate governance. Platforms were, by default, oligarchies controlled by founders or investors. Instead, what \"democracy\" really meant for common users was \"access\". We got access to things like image sharing, tweets, crowdfunding, information, and more. As users, we never got a seat at the table, or a say in how these platforms were run. At the same time, value from our user-generated data, art, content, and labor was extracted to enrich founders and investors.\n\nWeb 3.0 usage of the word \"ownership\" carries similar risks to the web 2.0 usage of the word \"democracy\". \n\nWhereas \"democracy\" was redefined to mean \"access\", \"ownership\" risks being abstracted away to mean little more than \"exposure to upside\". Yes, having the ability for users to capture more value is good, but does it qualify as \"ownership\"?\n\n[Twitter](https://twitter.com/austinrobey_/status/1366237014841053185)\n\n### Why ownership is important\nConcentrated ownership is one the primary drivers of wealth inequality today. In tech, the ownership gap between platform owners and platform users continues to grow – and has real consequences. \n\n[If Apple were structured as a worker-owned cooperative](https://www.forbes.com/sites/cameronkeng/2014/12/18/if-apple-was-a-worker-cooperative-each-employee-would-earn-at-least-403k/), the ownership stake of each of its 150,000 workers would be worth over $15m. On top of that, each employee would receive an annual dividend of over $400k. Ownership creates wealth, and its concentration helps create wealth inequality.\n\nWhile musicians faced an existential crisis during a pandemic, Spotify CEO Daniel Ek’s ownership stake in Spotify climbed to be worth over $4 billion. In order to earn $4 billion, a musician earning the median wage of $25,000 would have to work for 160,000 years – in other words, they’d have to have started working before human history began.\n\nYancey Strickler, Co-founder of Kickstarter, writes about concentrated ownership in his essay, [\"The Ownership Crisis\"](https://ystrickler.medium.com/the-ownership-crisis-55a5f84c3e88).\n\n> *Despite many people contributing to the tools and services that now dominate our lives, most people have no stake in them. To cite just one example, the four million people who drive for Uber probably own less of the company combined than a single dentist in New Jersey with Vanguard in their portfolio.*\n\n> *People with ownership — virtually all of whom are already wealthy — will become increasingly wealthier. People without ownership — everyone else — will become increasingly not. Soon it will be hard to see anything else.*\n\nShared ownership models will become a critical cornerstone for building a fairer and equitable online economy. In tech, we should not only work to create greater access to ownership, but also reinforce a definition of ownership that is ambitious and capable of delivering meaningful systems change. \n\n### What is ownership?\nOwnership can be understood as a proxy for two things: decision making power and financial power. This suite of benefits includes the ability to have a voice in the direction, strategy, operations, or fate of a company; as well as the ability to capture profits and the value of its equity and assets.\n\n*Ownership = (Financial power + Decision making power)*\n\nBoth financial power and decision making power are elements of ownership that can be broken down into sets of distinct rights and responsibilities, often on a spectrum.\n\n![](https://images.mirror-media.xyz/publication-images/695fa14e-19fa-48c5-ad8f-9e3d174111b0.jpg?height=1440&width=2560)\n\nLooking at the current web 3.0 landscape through this lens, we can examine the ways that organizations within \"The Ownership Economy\" can improve.\n\n### Financial Power: Transparent Investments & Agreements \n\nOne of the most overlooked elements of ownership in the web 3.0 space is financial transparency, particularly regarding investments and agreements. As an example, investment announcements ([like this](https://finance.yahoo.com/news/zora-gets-nft-funding-craze-212329286.html)) may share that an investment was made, but won’t openly share what investors actually purchased. If the goal of a crypto network is to become \"community owned\", it would seem logical to disclose investment deal structures and details to their community. \n\nConsider a real-world example: Imagine you are a part owner of a bakery. Next, imagine there is another owner who has entered into financial agreements with third parties, but you are not allowed to access the terms. Would this arrangement seem like true ownership?\n\nIf a crypto network is raising money from investors, demonstrating a reasonable level of transparency is an easy thing to do. All it would take is a blog post. For example, an announcement could say something like: \n\n> \"We raised x amount of money to do x. The deal was structured like this because our goal of community ownership is ____. Here's what it means for the larger ecosystem.\" \n\nIf the goal of \"progressive decentralization\" is to transition to community ownership, it would seem incongruent for early stage investments terms to be hidden from the community. In addition, opaque investment terms imply the community wasn’t given a chance to participate in the investment process.\n\nSome questions to consider:\n\n- What are investors purchasing with their investment?\n- How does this impact the path towards community ownership?\n- Why not share investment deal terms with the community?\n\n[Twitter](https://twitter.com/austinrobey_/status/1399365878718910469)\n\n### Financial Power: Transparent Compensation\n\nOften in the web 3.0 space, there is an analogous comparison given to digital cooperatives. While many DAOs do disclose compensation for full time workers, existing cooperatives are much better than crypto networks at sharing these details. As an example, look at this publicly available [Executive Compensation Report](https://www.rei.com/about-rei/executive-compensation) by REI Co-op. Disclosures of compensation within crypto networks should become a core standard in order to demonstrate real community ownership.\n\n- How are founders and executives getting paid?\n- What is the compensation package and structure?\n- How are \"advisors\" compensated?\n\n![](https://images.mirror-media.xyz/publication-images/78003790-a571-4dcc-a6b1-697d808027d5.jpg?height=1440&width=2560)\n\n### Decision Making Power: Treasury & Board Codetermination\n\nIn corporate governance, \"codetermination\" refers to workers or other stakeholders having representatives on the board of directors. It’s a step towards collective governance that any company can take to create a more democratic workplace. \n\nFor networks that aim to be community owned, there should be some form of codetermination at the outset, allowing community proxies or representatives to be involved in treasury-related decisions -- particularly around token allocation.\n\nSome questions to consider:\n\n- Who decides how tokens are allocated?\n- Who controls access to the treasury?\n- If tokens = ownership, who makes decisions around distributing ownership?\n\n### Strengthening community ownership: community investments\n\nBy default, platforms today are owned by founders and investors, not communities. If the goal for networks is to be community owned, then there is a tacit implication (even by VCs investing in the \"ownership economy\") that community ownership is preferable to investor ownership.\n\n![](https://images.mirror-media.xyz/publication-images/70e4f385-88ba-4d7b-9dc4-d92721265244.jpg?height=1440&width=2560)\n\nThis is the primary defining characteristic of a community-owned platform: less investor ownership. In order for communities to achieve greater ownership, investors need to own less. In order for communities to have greater financial power, investors must have less. In order for communities to have greater decision making power, investors must have less.\n\nTo create stronger community ownership, web 3.0 networks should move away from resourcing startup capital from centralized, opaque, and hierarchical VCs (often with undisclosed LPs), and ideally receive funding directly from stakeholders. Instead, as an alternative to venture capitalists, \"The Ownership Economy\" would be better served by transparent investments through worker self-directed investment DAOs, controlled directly by organized laborers. These worker self-directed DAOs could have more flexible, social or community-driven investment theses that aren’t bound by a fiduciary responsibility to seek outsized financial returns for LPs.\n\n### Strengthening community ownership: industry standards\n\nIn order to preserve its meaning, I believe we need an agreed upon set of criteria to evaluate \"community ownership\". Currently, [any platform](https://bitclout.com/) can claim to be \"owned\" by its users, and there is no real shared standard for gauging how true this is.\n\nI would suggest the development of a Community Ownership Assessment like the B Corp Impact Assessment, which scores companies based on criteria like impact on workers, community, customers, and corporate governance. A Community Ownership Assessment could take into account forms of transparency, equitable token distribution, and democratic participation.\n\n### Conclusion\n\n\"The Ownership Economy\" is an important idea. It outlines a promising movement to bring more power to users and help communities capture more of the value they generate. It’s an important enough idea that it deserves greater scrutiny and higher standards that will allow organizations to live up to the promise of its thesis: the development of new economic models for networks that are built, owned, and operated by their users.\n\n***\n\n*If you enjoyed this post, be sure to leave a tip. It will automatically be distributed to all contributors! Thank you!*\n\n[Ways to improve the ownership economy](split://0x2C75D09C7f971bc4424CdCc08a82697C806a27F2?network=mainnet)\n\n", "timestamp": 1625518201, "digest": "ZRsr5HZMfbHOEe2lIYoWinRCI65NlvDW_QzEu1rn7As", "contributor": "0xaBaF40768e575bEb3244df2853A0505Cb2D2e4bB"}
{"id": "jlbZlPnpKs1F8C6vWMjilEhJI-3biA4vTUk3niOmjLI", "title": "Ways to improve the ownership economy", "body": "***🎯 Update:** WOW. Target reached! We are overwhelmed by the support for this [experiment](https://twitter.com/forefront__/status/1412056876787724291) in funding high quality public content. Thank you to all who have contributed by collecting the NFT. This essay is now permanently available to the public.*\n\n***\n\n*This is a guest post featuring [Austin Robey](https://twitter.com/austinrobey_), co-founder at [Ampled](https://twitter.com/ampl3d) in an FF exclusive.*\n\n\"The Ownership Economy\" is an idea coined by [Variant Fund](https://variant.fund/) investor Jesse Walden to describe emergent ways that crypto networks can be built, owned, and controlled by their users. It’s an outline for exciting new economic models that give networks the ability to create a more cooperative and equitable online economy. It’s also a counter-movement to extractive, proprietary, investor-owned platforms whose ownership structures create competing interests between their investors and their communities. \n\n![](https://images.mirror-media.xyz/publication-images/88bea002-c2b4-468f-8ddf-dc69c35b0079.png?height=1114&width=1980)\n\nJesse describes the ownership economy like this:\n\n> The ownership economy doesn’t always mean a literal distribution of tokens, stock options, or equity. It also doesn’t necessarily mean that an application or service is entirely built on a blockchain. Rather, it means that ownership — which may manifest in the form of novel economic rewards, platform governance, or new forms of social capital — can be a new keystone of user experiences, with plenty of design space to explore.\n\nAs a counter-framework against web 2.0 pitfalls, \"The Ownership Economy\" outlines how users can gain real power in emergent decentralized networks. Although \"The Ownership Economy\" represents a trend towards the creation of a more equitable online economy, words are important – and there is a risk that the word “ownership” may be misleading. \n\nTo start, there doesn’t seem to be a consensus about what \"ownership\" is.\n\n- Is ownership a metaphor for more agency? \n- Is ownership a way to share “exposure to upside”?\n- Is ownership a robust set of clear rights and responsibilities?\n\nCommunity ownership is a virtuous aspiration among web3 organizations. However, without an agreed upon definition or collective understanding of what ownership actually is, we may inadvertently dilute or abstract its meaning.\n\n### Risks of misinterpreting ownership \nIn the late aughts, there was a sense of optimism in tech, and a sentiment that tech-enabled web 2.0 platforms were \"democratizing\" things for everyday people. However, this idea of democratization never showed up where it mattered: in the boardroom and in corporate governance. Platforms were, by default, oligarchies controlled by founders or investors. Instead, what \"democracy\" really meant for common users was \"access\". We got access to things like image sharing, tweets, crowdfunding, information, and more. As users, we never got a seat at the table, or a say in how these platforms were run. At the same time, value from our user-generated data, art, content, and labor was extracted to enrich founders and investors.\n\nWeb 3.0 usage of the word \"ownership\" carries similar risks to the web 2.0 usage of the word \"democracy\". \n\nWhereas \"democracy\" was redefined to mean \"access\", \"ownership\" risks being abstracted away to mean little more than \"exposure to upside\". Yes, having the ability for users to capture more value is good, but does it qualify as \"ownership\"?\n\n[Twitter](https://twitter.com/austinrobey_/status/1366237014841053185)\n\n### Why ownership is important\nConcentrated ownership is one the primary drivers of wealth inequality today. In tech, the ownership gap between platform owners and platform users continues to grow – and has real consequences. \n\n[If Apple were structured as a worker-owned cooperative](https://www.forbes.com/sites/cameronkeng/2014/12/18/if-apple-was-a-worker-cooperative-each-employee-would-earn-at-least-403k/), the ownership stake of each of its 150,000 workers would be worth over $15m. On top of that, each employee would receive an annual dividend of over $400k. Ownership creates wealth, and its concentration helps create wealth inequality.\n\nWhile musicians faced an existential crisis during a pandemic, Spotify CEO Daniel Ek’s ownership stake in Spotify climbed to be worth over $4 billion. In order to earn $4 billion, a musician earning the median wage of $25,000 would have to work for 160,000 years – in other words, they’d have to have started working before human history began.\n\nYancey Strickler, Co-founder of Kickstarter, writes about concentrated ownership in his essay, [\"The Ownership Crisis\"](https://ystrickler.medium.com/the-ownership-crisis-55a5f84c3e88).\n\n> *Despite many people contributing to the tools and services that now dominate our lives, most people have no stake in them. To cite just one example, the four million people who drive for Uber probably own less of the company combined than a single dentist in New Jersey with Vanguard in their portfolio.*\n\n> *People with ownership — virtually all of whom are already wealthy — will become increasingly wealthier. People without ownership — everyone else — will become increasingly not. Soon it will be hard to see anything else.*\n\nShared ownership models will become a critical cornerstone for building a fairer and equitable online economy. In tech, we should not only work to create greater access to ownership, but also reinforce a definition of ownership that is ambitious and capable of delivering meaningful systems change. \n\n### What is ownership?\nOwnership can be understood as a proxy for two things: decision making power and financial power. This suite of benefits includes the ability to have a voice in the direction, strategy, operations, or fate of a company; as well as the ability to capture profits and the value of its equity and assets.\n\n*Ownership = (Financial power + Decision making power)*\n\nBoth financial power and decision making power are elements of ownership that can be broken down into sets of distinct rights and responsibilities, often on a spectrum.\n\n![](https://images.mirror-media.xyz/publication-images/695fa14e-19fa-48c5-ad8f-9e3d174111b0.jpg?height=1440&width=2560)\n\nLooking at the current web 3.0 landscape through this lens, we can examine the ways that organizations within \"The Ownership Economy\" can improve.\n\n### Financial Power: Transparent Investments & Agreements \n\nOne of the most overlooked elements of ownership in the web 3.0 space is financial transparency, particularly regarding investments and agreements. As an example, investment announcements ([like this](https://finance.yahoo.com/news/zora-gets-nft-funding-craze-212329286.html)) may share that an investment was made, but won’t openly share what investors actually purchased. If the goal of a crypto network is to become \"community owned\", it would seem logical to disclose investment deal structures and details to their community. \n\nConsider a real-world example: Imagine you are a part owner of a bakery. Next, imagine there is another owner who has entered into financial agreements with third parties, but you are not allowed to access the terms. Would this arrangement seem like true ownership?\n\nIf a crypto network is raising money from investors, demonstrating a reasonable level of transparency is an easy thing to do. All it would take is a blog post. For example, an announcement could say something like: \n\n> \"We raised x amount of money to do x. The deal was structured like this because our goal of community ownership is ____. Here's what it means for the larger ecosystem.\" \n\nIf the goal of \"progressive decentralization\" is to transition to community ownership, it would seem incongruent for early stage investments terms to be hidden from the community. In addition, opaque investment terms imply the community wasn’t given a chance to participate in the investment process.\n\nSome questions to consider:\n\n- What are investors purchasing with their investment?\n- How does this impact the path towards community ownership?\n- Why not share investment deal terms with the community?\n\n[Twitter](https://twitter.com/austinrobey_/status/1399365878718910469)\n\n### Financial Power: Transparent Compensation\n\nOften in the web 3.0 space, there is an analogous comparison given to digital cooperatives. While many DAOs do disclose compensation for full time workers, existing cooperatives are much better than crypto networks at sharing these details. As an example, look at this publicly available [Executive Compensation Report](https://www.rei.com/about-rei/executive-compensation) by REI Co-op. Disclosures of compensation within crypto networks should become a core standard in order to demonstrate real community ownership.\n\n- How are founders and executives getting paid?\n- What is the compensation package and structure?\n- How are \"advisors\" compensated?\n\n![](https://images.mirror-media.xyz/publication-images/78003790-a571-4dcc-a6b1-697d808027d5.jpg?height=1440&width=2560)\n\n### Decision Making Power: Treasury & Board Codetermination\n\nIn corporate governance, \"codetermination\" refers to workers or other stakeholders having representatives on the board of directors. It’s a step towards collective governance that any company can take to create a more democratic workplace. \n\nFor networks that aim to be community owned, there should be some form of codetermination at the outset, allowing community proxies or representatives to be involved in treasury-related decisions -- particularly around token allocation.\n\nSome questions to consider:\n\n- Who decides how tokens are allocated?\n- Who controls access to the treasury?\n- If tokens = ownership, who makes decisions around distributing ownership?\n\n### Strengthening community ownership: community investments\n\nBy default, platforms today are owned by founders and investors, not communities. If the goal for networks is to be community owned, then there is a tacit implication (even by VCs investing in the \"ownership economy\") that community ownership is preferable to investor ownership.\n\n![](https://images.mirror-media.xyz/publication-images/70e4f385-88ba-4d7b-9dc4-d92721265244.jpg?height=1440&width=2560)\n\nThis is the primary defining characteristic of a community-owned platform: less investor ownership. In order for communities to achieve greater ownership, investors need to own less. In order for communities to have greater financial power, investors must have less. In order for communities to have greater decision making power, investors must have less.\n\nTo create stronger community ownership, web 3.0 networks should move away from resourcing startup capital from centralized, opaque, and hierarchical VCs (often with undisclosed LPs), and ideally receive funding directly from stakeholders. Instead, as an alternative to venture capitalists, \"The Ownership Economy\" would be better served by transparent investments through worker self-directed investment DAOs, controlled directly by organized laborers. These worker self-directed DAOs could have more flexible, social or community-driven investment theses that aren’t bound by a fiduciary responsibility to seek outsized financial returns for LPs.\n\n### Strengthening community ownership: industry standards\n\nIn order to preserve its meaning, I believe we need an agreed upon set of criteria to evaluate \"community ownership\". Currently, [any platform](https://bitclout.com/) can claim to be \"owned\" by its users, and there is no real shared standard for gauging how true this is.\n\nI would suggest the development of a Community Ownership Assessment like the B Corp Impact Assessment, which scores companies based on criteria like impact on workers, community, customers, and corporate governance. A Community Ownership Assessment could take into account forms of transparency, equitable token distribution, and democratic participation.\n\n### Conclusion\n\n\"The Ownership Economy\" is an important idea. It outlines a promising movement to bring more power to users and help communities capture more of the value they generate. It’s an important enough idea that it deserves greater scrutiny and higher standards that will allow organizations to live up to the promise of its thesis: the development of new economic models for networks that are built, owned, and operated by their users.\n\n***\n\n*If you enjoyed this post, be sure to leave a tip. It will automatically be distributed to all contributors! Thank you!*\n\n[Ways to improve the ownership economy](split://0x2C75D09C7f971bc4424CdCc08a82697C806a27F2?network=mainnet)\n\n", "timestamp": 1625518534, "digest": "ZRsr5HZMfbHOEe2lIYoWinRCI65NlvDW_QzEu1rn7As", "contributor": "0xaBaF40768e575bEb3244df2853A0505Cb2D2e4bB"}
{"id": "_NKNawaaeMLsOlqYY1w39Ie3Iz2JJlu82TGnsrPXhHw", "title": "Ways to improve the ownership economy", "body": "***🎯 Update:** WOW. Target reached! We are overwhelmed by the support for this [experiment](https://twitter.com/forefront__/status/1412056876787724291) in funding high quality public content. Thank you to all who have contributed by collecting the NFT. This essay is now permanently available to the public.*\n\n***\n\n*This is a guest post featuring [Austin Robey](https://twitter.com/austinrobey_), co-founder at [Ampled](https://twitter.com/ampl3d) in an FF exclusive.*\n\n\"The Ownership Economy\" is an idea coined by [Variant Fund](https://variant.fund/) investor Jesse Walden to describe emergent ways that crypto networks can be built, owned, and controlled by their users. It’s an outline for exciting new economic models that give networks the ability to create a more cooperative and equitable online economy. It’s also a counter-movement to extractive, proprietary, investor-owned platforms whose ownership structures create competing interests between their investors and their communities. \n\n![](https://images.mirror-media.xyz/publication-images/88bea002-c2b4-468f-8ddf-dc69c35b0079.png?height=1114&width=1980)\n\nJesse describes the ownership economy like this:\n\n> The ownership economy doesn’t always mean a literal distribution of tokens, stock options, or equity. It also doesn’t necessarily mean that an application or service is entirely built on a blockchain. Rather, it means that ownership — which may manifest in the form of novel economic rewards, platform governance, or new forms of social capital — can be a new keystone of user experiences, with plenty of design space to explore.\n\nAs a counter-framework against web 2.0 pitfalls, \"The Ownership Economy\" outlines how users can gain real power in emergent decentralized networks. Although \"The Ownership Economy\" represents a trend towards the creation of a more equitable online economy, words are important – and there is a risk that the word “ownership” may be misleading. \n\nTo start, there doesn’t seem to be a consensus about what \"ownership\" is.\n\n- Is ownership a metaphor for more agency? \n- Is ownership a way to share “exposure to upside”?\n- Is ownership a robust set of clear rights and responsibilities?\n\nCommunity ownership is a virtuous aspiration among web3 organizations. However, without an agreed upon definition or collective understanding of what ownership actually is, we may inadvertently dilute or abstract its meaning.\n\n### Risks of misinterpreting ownership \nIn the late aughts, there was a sense of optimism in tech, and a sentiment that tech-enabled web 2.0 platforms were \"democratizing\" things for everyday people. However, this idea of democratization never showed up where it mattered: in the boardroom and in corporate governance. Platforms were, by default, oligarchies controlled by founders or investors. Instead, what \"democracy\" really meant for common users was \"access\". We got access to things like image sharing, tweets, crowdfunding, information, and more. As users, we never got a seat at the table, or a say in how these platforms were run. At the same time, value from our user-generated data, art, content, and labor was extracted to enrich founders and investors.\n\nWeb 3.0 usage of the word \"ownership\" carries similar risks to the web 2.0 usage of the word \"democracy\". \n\nWhereas \"democracy\" was redefined to mean \"access\", \"ownership\" risks being abstracted away to mean little more than \"exposure to upside\". Yes, having the ability for users to capture more value is good, but does it qualify as \"ownership\"?\n\n[Twitter](https://twitter.com/austinrobey_/status/1366237014841053185)\n\n### Why ownership is important\nConcentrated ownership is one the primary drivers of wealth inequality today. In tech, the ownership gap between platform owners and platform users continues to grow – and has real consequences. \n\n[If Apple were structured as a worker-owned cooperative](https://www.forbes.com/sites/cameronkeng/2014/12/18/if-apple-was-a-worker-cooperative-each-employee-would-earn-at-least-403k/), the ownership stake of each of its 150,000 workers would be worth over $15m. On top of that, each employee would receive an annual dividend of over $400k. Ownership creates wealth, and its concentration helps create wealth inequality.\n\nWhile musicians faced an existential crisis during a pandemic, Spotify CEO Daniel Ek’s ownership stake in Spotify climbed to be worth over $4 billion. In order to earn $4 billion, a musician earning the median wage of $25,000 would have to work for 160,000 years – in other words, they’d have to have started working before human history began.\n\nYancey Strickler, Co-founder of Kickstarter, writes about concentrated ownership in his essay, [\"The Ownership Crisis\"](https://ystrickler.medium.com/the-ownership-crisis-55a5f84c3e88).\n\n> *Despite many people contributing to the tools and services that now dominate our lives, most people have no stake in them. To cite just one example, the four million people who drive for Uber probably own less of the company combined than a single dentist in New Jersey with Vanguard in their portfolio.*\n\n> *People with ownership — virtually all of whom are already wealthy — will become increasingly wealthier. People without ownership — everyone else — will become increasingly not. Soon it will be hard to see anything else.*\n\nShared ownership models will become a critical cornerstone for building a fairer and equitable online economy. In tech, we should not only work to create greater access to ownership, but also reinforce a definition of ownership that is ambitious and capable of delivering meaningful systems change. \n\n### What is ownership?\nOwnership can be understood as a proxy for two things: decision making power and financial power. This suite of benefits includes the ability to have a voice in the direction, strategy, operations, or fate of a company; as well as the ability to capture profits and the value of its equity and assets.\n\n*Ownership = (Financial power + Decision making power)*\n\nBoth financial power and decision making power are elements of ownership that can be broken down into sets of distinct rights and responsibilities, often on a spectrum.\n\n![](https://images.mirror-media.xyz/publication-images/0d8968ff-9036-451e-880a-71b22acf2950.jpg?height=1440&width=2560)\n\nLooking at the current web 3.0 landscape through this lens, we can examine the ways that organizations within \"The Ownership Economy\" can improve.\n\n### Financial Power: Transparent Investments & Agreements \n\nOne of the most overlooked elements of ownership in the web 3.0 space is financial transparency, particularly regarding investments and agreements. As an example, investment announcements ([like this](https://finance.yahoo.com/news/zora-gets-nft-funding-craze-212329286.html)) may share that an investment was made, but won’t openly share what investors actually purchased. If the goal of a crypto network is to become \"community owned\", it would seem logical to disclose investment deal structures and details to their community. \n\nConsider a real-world example: Imagine you are a part owner of a bakery. Next, imagine there is another owner who has entered into financial agreements with third parties, but you are not allowed to access the terms. Would this arrangement seem like true ownership?\n\nIf a crypto network is raising money from investors, demonstrating a reasonable level of transparency is an easy thing to do. All it would take is a blog post. For example, an announcement could say something like: \n\n> \"We raised x amount of money to do x. The deal was structured like this because our goal of community ownership is ____. Here's what it means for the larger ecosystem.\" \n\nIf the goal of \"progressive decentralization\" is to transition to community ownership, it would seem incongruent for early stage investments terms to be hidden from the community. In addition, opaque investment terms imply the community wasn’t given a chance to participate in the investment process.\n\nSome questions to consider:\n\n- What are investors purchasing with their investment?\n- How does this impact the path towards community ownership?\n- Why not share investment deal terms with the community?\n\n[Twitter](https://twitter.com/austinrobey_/status/1399365878718910469)\n\n### Financial Power: Transparent Compensation\n\nOften in the web 3.0 space, there is an analogous comparison given to digital cooperatives. While many DAOs do disclose compensation for full time workers, existing cooperatives are much better than crypto networks at sharing these details. As an example, look at this publicly available [Executive Compensation Report](https://www.rei.com/about-rei/executive-compensation) by REI Co-op. Disclosures of compensation within crypto networks should become a core standard in order to demonstrate real community ownership.\n\n- How are founders and executives getting paid?\n- What is the compensation package and structure?\n- How are \"advisors\" compensated?\n\n![](https://images.mirror-media.xyz/publication-images/78003790-a571-4dcc-a6b1-697d808027d5.jpg?height=1440&width=2560)\n\n### Decision Making Power: Treasury & Board Codetermination\n\nIn corporate governance, \"codetermination\" refers to workers or other stakeholders having representatives on the board of directors. It’s a step towards collective governance that any company can take to create a more democratic workplace. \n\nFor networks that aim to be community owned, there should be some form of codetermination at the outset, allowing community proxies or representatives to be involved in treasury-related decisions -- particularly around token allocation.\n\nSome questions to consider:\n\n- Who decides how tokens are allocated?\n- Who controls access to the treasury?\n- If tokens = ownership, who makes decisions around distributing ownership?\n\n### Strengthening community ownership: community investments\n\nBy default, platforms today are owned by founders and investors, not communities. If the goal for networks is to be community owned, then there is a tacit implication (even by VCs investing in the \"ownership economy\") that community ownership is preferable to investor ownership.\n\n![](https://images.mirror-media.xyz/publication-images/e8e5c05b-d0bf-47dd-b60c-b2ac36c3db7a.jpeg?height=1440&width=2560)\n\nThis is the primary defining characteristic of a community-owned platform: less investor ownership. In order for communities to achieve greater ownership, investors need to own less. In order for communities to have greater financial power, investors must have less. In order for communities to have greater decision making power, investors must have less.\n\nTo create stronger community ownership, web 3.0 networks should move away from resourcing startup capital from centralized, opaque, and hierarchical VCs (often with undisclosed LPs), and ideally receive funding directly from stakeholders. Instead, as an alternative to venture capitalists, \"The Ownership Economy\" would be better served by transparent investments through worker self-directed investment DAOs, controlled directly by organized laborers. These worker self-directed DAOs could have more flexible, social or community-driven investment theses that aren’t bound by a fiduciary responsibility to seek outsized financial returns for LPs.\n\n### Strengthening community ownership: industry standards\n\nIn order to preserve its meaning, I believe we need an agreed upon set of criteria to evaluate \"community ownership\". Currently, [any platform](https://bitclout.com/) can claim to be \"owned\" by its users, and there is no real shared standard for gauging how true this is.\n\nI would suggest the development of a Community Ownership Assessment like the B Corp Impact Assessment, which scores companies based on criteria like impact on workers, community, customers, and corporate governance. A Community Ownership Assessment could take into account forms of transparency, equitable token distribution, and democratic participation.\n\n### Conclusion\n\n\"The Ownership Economy\" is an important idea. It outlines a promising movement to bring more power to users and help communities capture more of the value they generate. It’s an important enough idea that it deserves greater scrutiny and higher standards that will allow organizations to live up to the promise of its thesis: the development of new economic models for networks that are built, owned, and operated by their users.\n\n***\n\n*If you enjoyed this post, be sure to leave a tip. It will automatically be distributed to all contributors! Thank you!*\n\n[Ways to improve the ownership economy](split://0x2C75D09C7f971bc4424CdCc08a82697C806a27F2?network=mainnet)\n\n", "timestamp": 1625519151, "digest": "ZRsr5HZMfbHOEe2lIYoWinRCI65NlvDW_QzEu1rn7As", "contributor": "0xaBaF40768e575bEb3244df2853A0505Cb2D2e4bB"}
{"id": "GEXW7nznVz6UXJoT5HSb3HE6aXEwXw8_Lab72YPFNd8", "title": "California: The Memory and the Forgotten Myth", "body": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aenean vitae sem diam. Nulla facilisi. Vivamus tortor ipsum, suscipit vitae finibus non, venenatis venenatis enim. Donec posuere magna eget nulla vestibulum interdum. Nulla sit amet justo neque. Curabitur commodo consequat mauris. Vivamus sit amet efficitur augue. Curabitur quis urna nec metus vehicula pretium eget sit amet tellus. Donec porta scelerisque convallis. Cras at sapien euismod, fermentum nunc non, iaculis nibh. Aenean porta sodales ullamcorper.\n\nSed id augue eget velit egestas aliquam eu et arcu. Nam tristique dui at hendrerit rhoncus. Etiam nibh ipsum, condimentum a iaculis ut, imperdiet id dui. Etiam et ante sit amet nisi lobortis semper. Sed commodo vitae mi tempor dapibus. Interdum et malesuada fames ac ante ipsum primis in faucibus. Vivamus ac urna dictum, commodo sapien et, convallis enim. Nulla id sagittis lorem.\n\nAenean aliquam mollis tellus et porta. Nunc at purus non leo dapibus porta non a ligula. Vivamus quis dapibus felis, sed convallis lectus. Integer fringilla pretium laoreet. Fusce laoreet dignissim turpis ac aliquam. Vivamus dictum a velit non gravida. Suspendisse mi lacus, ultricies ut magna sed, sollicitudin molestie quam. Quisque nulla diam, lacinia quis erat lacinia, sagittis pretium velit.", "timestamp": 1625524688, "digest": "gYa3_2EnJ7VLGlbap_ylLGFWM4MX3nYX-zDL-LtGE6E", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "QsShUkKNgKsTKdDB4cY1M1uowfQBZLCQARwGUZ2AxtQ", "title": "Modular Crowdfund", "body": "The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Overview\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=overview)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Editions\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=editions)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Backers\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=backers)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Split\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=split)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=split,overview,test)", "timestamp": 1625525595, "digest": "MxrYxc3yhE6TUEd3NTWtCV6eHEuyndYTb1SBj3yn3uM", "contributor": "0xf36615A5a8A9c19a368DcE3357B8C6B723C75701"}
{"id": "3gzx5-wQqYLA4vb0syjKq_XUfuZtpIZyEohBqBSYC2o", "title": "Modular Crowdfund", "body": "The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Overview\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=overview)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Editions\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=editions)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Backers\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=backers)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Split\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=split)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Multiple\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=split,overview,test)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=)\n\nTesting\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby)", "timestamp": 1625526978, "digest": "MxrYxc3yhE6TUEd3NTWtCV6eHEuyndYTb1SBj3yn3uM", "contributor": "0xf36615A5a8A9c19a368DcE3357B8C6B723C75701"}
{"id": "aqoVtHckZbOe6SMhSZ5N4X15VK-_ODDhaCe7UiVD0DM", "title": "Modular Crowdfund", "body": "The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Overview\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=overview)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Editions\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=editions)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Backers\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=backers)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Split\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=split)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n## Multiple\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=split,overview,test)\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\nThe quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.The quick brown fox jumped over the lazy dogs. The quick brown fox jumped over the lazy dogs.\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby&features=)\n\n[The Modular Experience](crowdfund://0x8c5f4745E3ce6A24f040E3E036A973099F43ed65?version=tiered_1&network=rinkeby)", "timestamp": 1625526866, "digest": "MxrYxc3yhE6TUEd3NTWtCV6eHEuyndYTb1SBj3yn3uM", "contributor": "0xf36615A5a8A9c19a368DcE3357B8C6B723C75701"}
{"id": "jTloNOpc6MVdJHdlMPsEsQPsBLRumpcaDW7qa-bXz9A", "title": "Positive Sum Worlds: Remaking Public Goods", "body": "> To live together in the world means essentially that a world of things is between those who have it in common, as a table is located between those who sit around it.\n– Hannah Arendt, 1958\n\n![Engraving depicting the Hanging Gardens of Babylon, one of the Seven Wonders of the World. Artist unknown, 19th c.](https://images.mirror-media.xyz/publication-images/ef6813ac-9f90-4a99-8bdb-6a6a692adf43.jpeg?height=1331&width=1920)\n\n", "timestamp": 1625537019, "digest": "OfKqtsM6xujpWVqZDTe0Z9ePMJpfYpAQ5Bx46dSYVyU", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "PehU3ZR-nmdp6E2DJWobgzQsmcLAGaYv0AokgBWGkwE", "title": "Positive Sum Worlds: Remaking Public Goods", "body": "> To live together in the world means essentially that a world of things is between those who have it in common, as a table is located between those who sit around it.\n– Hannah Arendt, 1958\n\n![Engraving depicting the Hanging Gardens of Babylon, one of the Seven Wonders of the World. Artist unknown, 19th c.](https://images.mirror-media.xyz/publication-images/ef6813ac-9f90-4a99-8bdb-6a6a692adf43.jpeg?height=1331&width=1920)\n\n\n", "timestamp": 1625537454, "digest": "OfKqtsM6xujpWVqZDTe0Z9ePMJpfYpAQ5Bx46dSYVyU", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "4_8c7PdDixPjikFj0Iel_yCkU-2jNz-0rwvj1T7r47k", "title": "Positive Sum Worlds: Remaking Public Goods", "body": "> To live together in the world means essentially that a world of things is between those who have it in common, as a table is located between those who sit around it.\n– Hannah Arendt, 1958\n\n![Engraving depicting the Hanging Gardens of Babylon, one of the Seven Wonders of the World. Artist unknown, 19th c.](https://images.mirror-media.xyz/publication-images/ef6813ac-9f90-4a99-8bdb-6a6a692adf43.jpeg?height=1331&width=1920)\n\nPublic things, whether natural resources or human creations, populate the world in which we encounter one another. We govern, share, and maintain them as a society. While imperfect in how they are built or administered, these objects draw us together in dialogue, debate, and common concern (Honig, 2017). More than mere things, natural landscapes and built environments are cultural touchpoints. They involve us in care for the public good.\n\n![Roman aqueduct of Pont du Gard, now recognized as a UNESCO World Heritage Site. Painting by Hubert Robert, 1787.](https://images.mirror-media.xyz/publication-images/aa089222-75a8-45f7-bd18-00b1b3e4dccb.jpeg?height=1200&width=1212)\n\nIn economics, a \"public good\" refers to anything that is both *non-excludable* and *non-rivalrous*, that is, people can't be barred access, and one person's use doesn't degrade another's. Clean air is an example of a naturally occurring public good, while the electric grid is a public good created by people. What are the public goods of today's industrial-knowledge society? Open source code, which supports millions of companies and independent developers, is often thought of this way. The cypherpunks considered privacy itself as a kind of public good. It seems only natural that online media archives and open digital infrastructure should qualify as well.\n\nMore recently, Vitalik Buterin and others in the cryptocurrency community have taken up the rhetoric of blockchain mechanisms as public goods. To be sure, crypto protocols are among the most compelling novel institutional forms. Their unique capabilities derive from their \"public\" qualities: unrestricted membership and participation, open APIs, transparent allocation of resources and power. But at the same time many of their characteristics contradict claims of public accessibility. Can crypto protocols be considered public goods if ownership is concentrated in the hands of a few whales? Colloquially, these market primitives are sometimes described as \"public infrastructure,\" but if blockchains serve a \"public\" today, it is primarily one of decentralized finance. Fundamentally, these tokenholders share only one common object of concern: price.\n\nSo while crypto protocols may qualify as public goods in the economic sense, where in these conversations is discussion of what's good for the public? Some of the crypto community's stated ambitions are to solve mass coordination problems, build post-national forms of sovereignty, and level the global playing field. But to create a majestic and egalitarian society requires a more expansive vision of public goods than what can be imagined with economics alone.\n\n![Ancient Ruins Used as Public Baths, Hubert Robert (1798)](https://images.mirror-media.xyz/publication-images/81fd1a35-4953-49c1-b54c-3ec794ec8db4.jpeg?height=853&width=1247)\n\nThe public bath houses of the Romans, accessible to both rich and poor, were the cornerstone of both the city's public health and its rich cultural life. At its peak, the Library of Alexandria held hundreds of thousands of texts, among the largest stores of public knowledge in the ancient world. Although exclusionary in many respects, these wonders are precursors to the public goods we know today. They point towards an ideal of openness and universality. As builders of a new digital society, we must be equipped with an even more inclusive and visionary concept of what \"public\" and \"good\" can mean. As protocol treasuries transition to community stewardship of public works, it's time to imagine how crypto protocols might uniquely conceive of public goods.\n\n## The Scope of the Public\n\nOur new understanding of public goods starts by exploring notions of the public. What makes something public? What constitutes *the* public?\n\nThe vernacular term \"public\" is understood to be something of the people, freely available for use—such as parks, roads, and common lands. Crypto protocols' strongest claim to publicness is based on this principle of open and permissionless access. Blockchains overcome a key limitation of Web 1 and Web 2 publics: their failure to satisfy the criteria of inalienable access. The internet's so-called \"public spaces\" are nothing like our cities' public parks. They are merely someone else's private server, where access can be revoked at will. By contrast, crypto protocols deliberately enforce unimpeded access.\n\nBut a public is more than a means of access to public space. Another key definition is a public as body of people, defined in relation to some political association. In 17th century England, a newly uncensored press circulated articles of public opinion, including notes from salon gatherings and critical journals. Often reproachful of the state, these published media brought \"private people together as a public\" for the first time (Habermas, 1989). Less than a century later, French revolutionaries orchestrated a new peoples' self-consciousness by organizing festivals, erecting monuments, and designating new communal spaces (Ozouf, 1975). In both instances, political bodies were raised to the status of institutions by establishing new venues for storytelling—venues in which people could begin to identify themselves as part of a collective whole, that is, a public.\n\n![Festival of the Supreme Being, organized in 1794 to inaugurate the new state religion after the French Revolution.](https://images.mirror-media.xyz/publication-images/0c066ec4-6837-4f4f-b8de-4d6ac8cc7f01.jpeg?height=775&width=1120)\n\nThis notion of the public as a self-conscious entity has also taken hold on the internet, where adoption is driven by *publication* and circulation of media. To publish a web document or software application is more than making something public: it's an act of making a public (Warner, 2002). Cryptocurrency advocates often draw on this idea when they refer to token holders as a \"community,\" or compare protocols to nations with citizens. Sovereign moneys created by blockchains certainly offer a ready comparison to sovereign states, and their immutability means APIs can't be modified or revoked without broad consensus.\n\nThese ideas feed the notion of crypto protocols as public goods, yet together they present a complicated picture. Despite their \"open\" qualities, crypto protocols do not yet offer a satisfying answer to the scope of the public they address.\n\nIn today's crypto ecosystems, token-based membership determines key considerations such as resource allocation, on-chain incentives, and off-chain decision-making. While a blockchain's censorship resistance may seem like the solution to a world of gatekeepers, in reality, pay-to-play limits access in other ways. Protocols may be owned by thousands, even millions of stakeholders, but they are not in everyone's benefit—only those who have the time, expertise, or resources to participate.\n\nWhat then are the implications of defining a public as a set of users? Web 2 platforms offer us a crucial lesson. The social media platforms which dominate the web today claim to be tools made for \"communities\" of users who have opted to participate—but these platforms have also produced wide-reaching negative externalities: effects on third parties who did not agree to incur their costs. The externalities of platforms include incursions on personal privacy, the spread of misinformation, the devaluation of creative labor, even destabilization of the democratic process. These effects are often cited as a primary motivation for those now working in Web 3 to now establish sovereign spaces built on a foundation of public accountability.\n\nWhile social platforms offer one example of a misconstrued public, nascent Web 3 \"public spaces\" suffer similar problems of definition, scope, and representation. The equivalence of stake and voice in crypto is reminiscent of early American democracy, in which political representation was conditioned on property ownership. Under this regime, only 6% of the total US population was eligible to vote—a laughably exclusionary idea of the body politic by today's standards (Ratcliffe, 2013). Recall that the universal suffrage, human rights, and public services we enjoy today are the products of struggle by those who were excluded from the designated public to have their voice represented. In fact, the theory of \"counterpublics\" specifically addresses groups who are not admitted within the larger public sphere, groups whose members may not be deemed as persons (Warner, 2002).\n\n", "timestamp": 1625538747, "digest": "OfKqtsM6xujpWVqZDTe0Z9ePMJpfYpAQ5Bx46dSYVyU", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "_CXHevU9oz8GMvpuX7j5R4qK9-mNdXhWdl4HE5Da-Lo", "title": "Positive Sum Worlds: Remaking Public Goods", "body": "> To live together in the world means essentially that a world of things is between those who have it in common, as a table is located between those who sit around it.\n– Hannah Arendt, 1958\n\n![Engraving depicting the Hanging Gardens of Babylon, one of the Seven Wonders of the World. Artist unknown, 19th c.](https://images.mirror-media.xyz/publication-images/ef6813ac-9f90-4a99-8bdb-6a6a692adf43.jpeg?height=1331&width=1920)\n\nPublic things, whether natural resources or human creations, populate the world in which we encounter one another. We govern, share, and maintain them as a society. While imperfect in how they are built or administered, these objects draw us together in dialogue, debate, and common concern (Honig, 2017). More than mere things, natural landscapes and built environments are cultural touchpoints. They involve us in care for the public good.\n\n![Roman aqueduct of Pont du Gard, now recognized as a UNESCO World Heritage Site. Painting by Hubert Robert, 1787.](https://images.mirror-media.xyz/publication-images/aa089222-75a8-45f7-bd18-00b1b3e4dccb.jpeg?height=1200&width=1212)\n\nIn economics, a \"public good\" refers to anything that is both *non-excludable* and *non-rivalrous*, that is, people can't be barred access, and one person's use doesn't degrade another's. Clean air is an example of a naturally occurring public good, while the electric grid is a public good created by people. What are the public goods of today's industrial-knowledge society? Open source code, which supports millions of companies and independent developers, is often thought of this way. The cypherpunks considered privacy itself as a kind of public good. It seems only natural that online media archives and open digital infrastructure should qualify as well.\n\nMore recently, Vitalik Buterin and others in the cryptocurrency community have taken up the rhetoric of blockchain mechanisms as public goods. To be sure, crypto protocols are among the most compelling novel institutional forms. Their unique capabilities derive from their \"public\" qualities: unrestricted membership and participation, open APIs, transparent allocation of resources and power. But at the same time many of their characteristics contradict claims of public accessibility. Can crypto protocols be considered public goods if ownership is concentrated in the hands of a few whales? Colloquially, these market primitives are sometimes described as \"public infrastructure,\" but if blockchains serve a \"public\" today, it is primarily one of decentralized finance. Fundamentally, these tokenholders share only one common object of concern: price.\n\nSo while crypto protocols may qualify as public goods in the economic sense, where in these conversations is discussion of what's good for the public? Some of the crypto community's stated ambitions are to solve mass coordination problems, build post-national forms of sovereignty, and level the global playing field. But to create a majestic and egalitarian society requires a more expansive vision of public goods than what can be imagined with economics alone.\n\n![Ancient Ruins Used as Public Baths, Hubert Robert (1798)](https://images.mirror-media.xyz/publication-images/81fd1a35-4953-49c1-b54c-3ec794ec8db4.jpeg?height=853&width=1247)\n\nThe public bath houses of the Romans, accessible to both rich and poor, were the cornerstone of both the city's public health and its rich cultural life. At its peak, the Library of Alexandria held hundreds of thousands of texts, among the largest stores of public knowledge in the ancient world. Although exclusionary in many respects, these wonders are precursors to the public goods we know today. They point towards an ideal of openness and universality. As builders of a new digital society, we must be equipped with an even more inclusive and visionary concept of what \"public\" and \"good\" can mean. As protocol treasuries transition to community stewardship of public works, it's time to imagine how crypto protocols might uniquely conceive of public goods.\n\n## The Scope of the Public\n\nOur new understanding of public goods starts by exploring notions of the public. What makes something public? What constitutes *the* public?\n\nThe vernacular term \"public\" is understood to be something of the people, freely available for use—such as parks, roads, and common lands. Crypto protocols' strongest claim to publicness is based on this principle of open and permissionless access. Blockchains overcome a key limitation of Web 1 and Web 2 publics: their failure to satisfy the criteria of inalienable access. The internet's so-called \"public spaces\" are nothing like our cities' public parks. They are merely someone else's private server, where access can be revoked at will. By contrast, crypto protocols deliberately enforce unimpeded access.\n\nBut a public is more than a means of access to public space. Another key definition is a public as body of people, defined in relation to some political association. In 17th century England, a newly uncensored press circulated articles of public opinion, including notes from salon gatherings and critical journals. Often reproachful of the state, these published media brought \"private people together as a public\" for the first time (Habermas, 1989). Less than a century later, French revolutionaries orchestrated a new peoples' self-consciousness by organizing festivals, erecting monuments, and designating new communal spaces (Ozouf, 1975). In both instances, political bodies were raised to the status of institutions by establishing new venues for storytelling—venues in which people could begin to identify themselves as part of a collective whole, that is, a public.\n\n![Festival of the Supreme Being, organized in 1794 to inaugurate the new state religion after the French Revolution.](https://images.mirror-media.xyz/publication-images/0c066ec4-6837-4f4f-b8de-4d6ac8cc7f01.jpeg?height=775&width=1120)\n\nThis notion of the public as a self-conscious entity has also taken hold on the internet, where adoption is driven by *publication* and circulation of media. To publish a web document or software application is more than making something public: it's an act of making a public (Warner, 2002). Cryptocurrency advocates often draw on this idea when they refer to token holders as a \"community,\" or compare protocols to nations with citizens. Sovereign moneys created by blockchains certainly offer a ready comparison to sovereign states, and their immutability means APIs can't be modified or revoked without broad consensus.\n\nThese ideas feed the notion of crypto protocols as public goods, yet together they present a complicated picture. Despite their \"open\" qualities, crypto protocols do not yet offer a satisfying answer to the scope of the public they address.\n\nIn today's crypto ecosystems, token-based membership determines key considerations such as resource allocation, on-chain incentives, and off-chain decision-making. While a blockchain's censorship resistance may seem like the solution to a world of gatekeepers, in reality, pay-to-play limits access in other ways. Protocols may be owned by thousands, even millions of stakeholders, but they are not in everyone's benefit—only those who have the time, expertise, or resources to participate.\n\nWhat then are the implications of defining a public as a set of users? Web 2 platforms offer us a crucial lesson. The social media platforms which dominate the web today claim to be tools made for \"communities\" of users who have opted to participate—but these platforms have also produced wide-reaching negative externalities: effects on third parties who did not agree to incur their costs. The externalities of platforms include incursions on personal privacy, the spread of misinformation, the devaluation of creative labor, even destabilization of the democratic process. These effects are often cited as a primary motivation for those now working in Web 3 to now establish sovereign spaces built on a foundation of public accountability.\n\nWhile social platforms offer one example of a misconstrued public, nascent Web 3 \"public spaces\" suffer similar problems of definition, scope, and representation. The equivalence of stake and voice in crypto is reminiscent of early American democracy, in which political representation was conditioned on property ownership. Under this regime, only 6% of the total US population was eligible to vote—a laughably exclusionary idea of the body politic by today's standards (Ratcliffe, 2013). Recall that the universal suffrage, human rights, and public services we enjoy today are the products of struggle by those who were excluded from the designated public to have their voice represented. In fact, the theory of \"counterpublics\" specifically addresses groups who are not admitted within the larger public sphere, groups whose members may not be deemed as persons (Warner, 2002).\n\n![](https://images.mirror-media.xyz/publication-images/6d2e8d08-4c83-4cf3-85cd-0d19372d885a.jpeg?height=1754&width=1072)\n\nSo it's clear that defining the scope of the public is key to understanding what public goods will mean. By equating membership in a public with ownership of a currency, we lose sight of important stakeholders and opportunities for coalition-building. The most consequential members of the crypto-public today are those who hold the most tokens, meaning even small holders are effectively removed from the conversation about what's in their benefit. Moreover, within this designated public exist people that may hold very different notions of the public good. By engaging with the underrepresented fringes that make up the wider crypto community, we can gain a deeper understanding of the public that we are building for and how to best serve them.\n\nWhen we think of the public, we should think expansively. This is not to say that we must consider everyone in the world as a part of our public. As we emphasized in our essay on squads, we also celebrate small, self-selective communities and trust-based groups. But by considering the effects (positive and negative) that we might have on groups at the margins—whether nocoiners, non-technical family members, or simply future participants in this public domain—we increase the potential for greater public upside and decrease the risk of negative externalities.\n\nPut simply: who belongs in this great post-national society the crypto community aims to build? Paraphrasing Michael Warner, a public always exceeds one's known protocol. It is a relation among strangers that's historically contingent and culturally complex. A public is constituted by the friends you have never met, with whom you share cultural coordinates without even knowing it. How does what we build render benefits for the most people possible?\n\nIn order to address this, let's turn to the \"good\" in public goods.\n\n## The Moral Basis of the Public \"Good\"\n\nHow do we determine what counts as a public good? So far we've started by questioning who exactly the public is. But even if we went along with the claim that publics = tokenholders, what exactly does this tell us about this public? Who are these tokenholders? What beliefs do they collectively hold?\n\nConsider a classic public good: a public park. We might say park visitors are generically \"users\" of this public space, or that anyone within driving distance is adequately served. But this categorization feels distinctly unsatisfying. \"User\" does not capture meaningful detail about a population that collectively values free access to protected forest or shoreline. Why are public parks more desirable than public parking lots? This brings us to an important realization: any definition of public goods presupposes a shared understanding of what is in the public's benefit, and why.\n\n![Tree Mountain - A Living Time Capsule-11,000 Trees, 11,000 People, 400 Years (1992-96) Ylojarvi, Finland](https://images.mirror-media.xyz/publication-images/dee81d2f-3703-4937-b20f-ca4096f780e3.jpeg?height=718&width=1024)\n\n", "timestamp": 1625538869, "digest": "OfKqtsM6xujpWVqZDTe0Z9ePMJpfYpAQ5Bx46dSYVyU", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "oqqjaM-S7L0jTK4ITBQEunuwuoESX7BpZhPs_RPrC80", "title": "Positive Sum Worlds: Remaking Public Goods", "body": "> To live together in the world means essentially that a world of things is between those who have it in common, as a table is located between those who sit around it.\n– Hannah Arendt, 1958\n\n![Engraving depicting the Hanging Gardens of Babylon, one of the Seven Wonders of the World. Artist unknown, 19th c.](https://images.mirror-media.xyz/publication-images/ef6813ac-9f90-4a99-8bdb-6a6a692adf43.jpeg?height=1331&width=1920)\n\nPublic things, whether natural resources or human creations, populate the world in which we encounter one another. We govern, share, and maintain them as a society. While imperfect in how they are built or administered, these objects draw us together in dialogue, debate, and common concern (Honig, 2017). More than mere things, natural landscapes and built environments are cultural touchpoints. They involve us in care for the public good.\n\n![Roman aqueduct of Pont du Gard, now recognized as a UNESCO World Heritage Site. Painting by Hubert Robert, 1787.](https://images.mirror-media.xyz/publication-images/aa089222-75a8-45f7-bd18-00b1b3e4dccb.jpeg?height=1200&width=1212)\n\nIn economics, a \"public good\" refers to anything that is both *non-excludable* and *non-rivalrous*, that is, people can't be barred access, and one person's use doesn't degrade another's. Clean air is an example of a naturally occurring public good, while the electric grid is a public good created by people. What are the public goods of today's industrial-knowledge society? Open source code, which supports millions of companies and independent developers, is often thought of this way. The cypherpunks considered privacy itself as a kind of public good. It seems only natural that online media archives and open digital infrastructure should qualify as well.\n\nMore recently, Vitalik Buterin and others in the cryptocurrency community have taken up the rhetoric of blockchain mechanisms as public goods. To be sure, crypto protocols are among the most compelling novel institutional forms. Their unique capabilities derive from their \"public\" qualities: unrestricted membership and participation, open APIs, transparent allocation of resources and power. But at the same time many of their characteristics contradict claims of public accessibility. Can crypto protocols be considered public goods if ownership is concentrated in the hands of a few whales? Colloquially, these market primitives are sometimes described as \"public infrastructure,\" but if blockchains serve a \"public\" today, it is primarily one of decentralized finance. Fundamentally, these tokenholders share only one common object of concern: price.\n\nSo while crypto protocols may qualify as public goods in the economic sense, where in these conversations is discussion of what's good for the public? Some of the crypto community's stated ambitions are to solve mass coordination problems, build post-national forms of sovereignty, and level the global playing field. But to create a majestic and egalitarian society requires a more expansive vision of public goods than what can be imagined with economics alone.\n\n![Ancient Ruins Used as Public Baths, Hubert Robert (1798)](https://images.mirror-media.xyz/publication-images/81fd1a35-4953-49c1-b54c-3ec794ec8db4.jpeg?height=853&width=1247)\n\nThe public bath houses of the Romans, accessible to both rich and poor, were the cornerstone of both the city's public health and its rich cultural life. At its peak, the Library of Alexandria held hundreds of thousands of texts, among the largest stores of public knowledge in the ancient world. Although exclusionary in many respects, these wonders are precursors to the public goods we know today. They point towards an ideal of openness and universality. As builders of a new digital society, we must be equipped with an even more inclusive and visionary concept of what \"public\" and \"good\" can mean. As protocol treasuries transition to community stewardship of public works, it's time to imagine how crypto protocols might uniquely conceive of public goods.", "timestamp": 1625538661, "digest": "OfKqtsM6xujpWVqZDTe0Z9ePMJpfYpAQ5Bx46dSYVyU", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "yQygOovQ0p20nXKRVYSkP9MaJTBFCW8k-O0-6ir3kDE", "title": "Testing 123f", "body": "The quick brown fox jumped over the lazy dogs. Hello", "timestamp": 1625538899, "digest": "UoOuDa5ggiKOHWGO-kL0kPnQLbwsg5-_AfxgaiWaIQI", "contributor": "0xf36615A5a8A9c19a368DcE3357B8C6B723C75701"}
{"id": "1G8Gy4J6M2y-F8Gjd_8Yd5POnBPgeMh0vOpUE_CzuLU", "title": "Positive Sum Worlds: Remaking Public Goods", "body": "> To live together in the world means essentially that a world of things is between those who have it in common, as a table is located between those who sit around it.\n– Hannah Arendt, 1958\n\n![Engraving depicting the Hanging Gardens of Babylon, one of the Seven Wonders of the World. Artist unknown, 19th c.](https://images.mirror-media.xyz/publication-images/ef6813ac-9f90-4a99-8bdb-6a6a692adf43.jpeg?height=1331&width=1920)\n\nPublic things, whether natural resources or human creations, populate the world in which we encounter one another. We govern, share, and maintain them as a society. While imperfect in how they are built or administered, these objects draw us together in dialogue, debate, and common concern (Honig, 2017). More than mere things, natural landscapes and built environments are cultural touchpoints. They involve us in care for the public good.\n\n![Roman aqueduct of Pont du Gard, now recognized as a UNESCO World Heritage Site. Painting by Hubert Robert, 1787.](https://images.mirror-media.xyz/publication-images/aa089222-75a8-45f7-bd18-00b1b3e4dccb.jpeg?height=1200&width=1212)\n\nIn economics, a \"public good\" refers to anything that is both *non-excludable* and *non-rivalrous*, that is, people can't be barred access, and one person's use doesn't degrade another's. Clean air is an example of a naturally occurring public good, while the electric grid is a public good created by people. What are the public goods of today's industrial-knowledge society? Open source code, which supports millions of companies and independent developers, is often thought of this way. The cypherpunks considered privacy itself as a kind of public good. It seems only natural that online media archives and open digital infrastructure should qualify as well.\n\nMore recently, Vitalik Buterin and others in the cryptocurrency community have taken up the rhetoric of blockchain mechanisms as public goods. To be sure, crypto protocols are among the most compelling novel institutional forms. Their unique capabilities derive from their \"public\" qualities: unrestricted membership and participation, open APIs, transparent allocation of resources and power. But at the same time many of their characteristics contradict claims of public accessibility. Can crypto protocols be considered public goods if ownership is concentrated in the hands of a few whales? Colloquially, these market primitives are sometimes described as \"public infrastructure,\" but if blockchains serve a \"public\" today, it is primarily one of decentralized finance. Fundamentally, these tokenholders share only one common object of concern: price.\n\nSo while crypto protocols may qualify as public goods in the economic sense, where in these conversations is discussion of what's good for the public? Some of the crypto community's stated ambitions are to solve mass coordination problems, build post-national forms of sovereignty, and level the global playing field. But to create a majestic and egalitarian society requires a more expansive vision of public goods than what can be imagined with economics alone.\n\n![Ancient Ruins Used as Public Baths, Hubert Robert (1798)](https://images.mirror-media.xyz/publication-images/81fd1a35-4953-49c1-b54c-3ec794ec8db4.jpeg?height=853&width=1247)\n\nThe public bath houses of the Romans, accessible to both rich and poor, were the cornerstone of both the city's public health and its rich cultural life. At its peak, the Library of Alexandria held hundreds of thousands of texts, among the largest stores of public knowledge in the ancient world. Although exclusionary in many respects, these wonders are precursors to the public goods we know today. They point towards an ideal of openness and universality. As builders of a new digital society, we must be equipped with an even more inclusive and visionary concept of what \"public\" and \"good\" can mean. As protocol treasuries transition to community stewardship of public works, it's time to imagine how crypto protocols might uniquely conceive of public goods.\n\n## The Scope of the Public\n\nOur new understanding of public goods starts by exploring notions of the public. What makes something public? What constitutes *the* public?\n\nThe vernacular term \"public\" is understood to be something of the people, freely available for use—such as parks, roads, and common lands. Crypto protocols' strongest claim to publicness is based on this principle of open and permissionless access. Blockchains overcome a key limitation of Web 1 and Web 2 publics: their failure to satisfy the criteria of inalienable access. The internet's so-called \"public spaces\" are nothing like our cities' public parks. They are merely someone else's private server, where access can be revoked at will. By contrast, crypto protocols deliberately enforce unimpeded access.\n\nBut a public is more than a means of access to public space. Another key definition is a public as body of people, defined in relation to some political association. In 17th century England, a newly uncensored press circulated articles of public opinion, including notes from salon gatherings and critical journals. Often reproachful of the state, these published media brought \"private people together as a public\" for the first time (Habermas, 1989). Less than a century later, French revolutionaries orchestrated a new peoples' self-consciousness by organizing festivals, erecting monuments, and designating new communal spaces (Ozouf, 1975). In both instances, political bodies were raised to the status of institutions by establishing new venues for storytelling—venues in which people could begin to identify themselves as part of a collective whole, that is, a public.\n\n![Festival of the Supreme Being, organized in 1794 to inaugurate the new state religion after the French Revolution.](https://images.mirror-media.xyz/publication-images/0c066ec4-6837-4f4f-b8de-4d6ac8cc7f01.jpeg?height=775&width=1120)\n\nThis notion of the public as a self-conscious entity has also taken hold on the internet, where adoption is driven by *publication* and circulation of media. To publish a web document or software application is more than making something public: it's an act of making a public (Warner, 2002). Cryptocurrency advocates often draw on this idea when they refer to token holders as a \"community,\" or compare protocols to nations with citizens. Sovereign moneys created by blockchains certainly offer a ready comparison to sovereign states, and their immutability means APIs can't be modified or revoked without broad consensus.\n\nThese ideas feed the notion of crypto protocols as public goods, yet together they present a complicated picture. Despite their \"open\" qualities, crypto protocols do not yet offer a satisfying answer to the scope of the public they address.\n\nIn today's crypto ecosystems, token-based membership determines key considerations such as resource allocation, on-chain incentives, and off-chain decision-making. While a blockchain's censorship resistance may seem like the solution to a world of gatekeepers, in reality, pay-to-play limits access in other ways. Protocols may be owned by thousands, even millions of stakeholders, but they are not in everyone's benefit—only those who have the time, expertise, or resources to participate.\n\nWhat then are the implications of defining a public as a set of users? Web 2 platforms offer us a crucial lesson. The social media platforms which dominate the web today claim to be tools made for \"communities\" of users who have opted to participate—but these platforms have also produced wide-reaching negative externalities: effects on third parties who did not agree to incur their costs. The externalities of platforms include incursions on personal privacy, the spread of misinformation, the devaluation of creative labor, even destabilization of the democratic process. These effects are often cited as a primary motivation for those now working in Web 3 to now establish sovereign spaces built on a foundation of public accountability.\n\nWhile social platforms offer one example of a misconstrued public, nascent Web 3 \"public spaces\" suffer similar problems of definition, scope, and representation. The equivalence of stake and voice in crypto is reminiscent of early American democracy, in which political representation was conditioned on property ownership. Under this regime, only 6% of the total US population was eligible to vote—a laughably exclusionary idea of the body politic by today's standards (Ratcliffe, 2013). Recall that the universal suffrage, human rights, and public services we enjoy today are the products of struggle by those who were excluded from the designated public to have their voice represented. In fact, the theory of \"counterpublics\" specifically addresses groups who are not admitted within the larger public sphere, groups whose members may not be deemed as persons (Warner, 2002).\n\n![](https://images.mirror-media.xyz/publication-images/6d2e8d08-4c83-4cf3-85cd-0d19372d885a.jpeg?height=1754&width=1072)\n\nSo it's clear that defining the scope of the public is key to understanding what public goods will mean. By equating membership in a public with ownership of a currency, we lose sight of important stakeholders and opportunities for coalition-building. The most consequential members of the crypto-public today are those who hold the most tokens, meaning even small holders are effectively removed from the conversation about what's in their benefit. Moreover, within this designated public exist people that may hold very different notions of the public good. By engaging with the underrepresented fringes that make up the wider crypto community, we can gain a deeper understanding of the public that we are building for and how to best serve them.\n\nWhen we think of the public, we should think expansively. This is not to say that we must consider everyone in the world as a part of our public. As we emphasized in our essay on squads, we also celebrate small, self-selective communities and trust-based groups. But by considering the effects (positive and negative) that we might have on groups at the margins—whether nocoiners, non-technical family members, or simply future participants in this public domain—we increase the potential for greater public upside and decrease the risk of negative externalities.\n\nPut simply: who belongs in this great post-national society the crypto community aims to build? Paraphrasing Michael Warner, a public always exceeds one's known protocol. It is a relation among strangers that's historically contingent and culturally complex. A public is constituted by the friends you have never met, with whom you share cultural coordinates without even knowing it. How does what we build render benefits for the most people possible?\n\nIn order to address this, let's turn to the \"good\" in public goods.\n\n## The Moral Basis of the Public \"Good\"\n\nHow do we determine what counts as a public good? So far we've started by questioning who exactly the public is. But even if we went along with the claim that publics = tokenholders, what exactly does this tell us about this public? Who are these tokenholders? What beliefs do they collectively hold?\n\nConsider a classic public good: a public park. We might say park visitors are generically \"users\" of this public space, or that anyone within driving distance is adequately served. But this categorization feels distinctly unsatisfying. \"User\" does not capture meaningful detail about a population that collectively values free access to protected forest or shoreline. Why are public parks more desirable than public parking lots? This brings us to an important realization: any definition of public goods presupposes a shared understanding of what is in the public's benefit, and why.\n\n![Tree Mountain - A Living Time Capsule-11,000 Trees, 11,000 People, 400 Years (1992-96) Ylojarvi, Finland](https://images.mirror-media.xyz/publication-images/dee81d2f-3703-4937-b20f-ca4096f780e3.jpeg?height=718&width=1024)\n\nA social body is united not only by the things it makes use of, but by a multitude of shared traits, including geography, ethnicity, religion, taste, culture, history, and values. This is why, no matter their claim to universality, instantiations of public goods are always local. Locality is created and felt through [shared space, time, or experience](https://otherinter.net/squad-wealth/#theory-of-the-squad). Without the assumptions and norms that develop out of this shared context, it would be impossible to identify and make space for things that are in the public benefit. So public goods, even as defined by economists, will always be a reflection of some group's shared context, common beliefs, and moral sensibilities; in other words, their value system.\n\nPublic libraries, public education, national artifacts, and clean running water are four public things that exemplify the moral basis of public goods. Public libraries are built by communities that value self-directed learning and spaces of shared knowledge. Public schools are valued when a culture believes a shared basis of mathematics, science, language, and history enriches civic life. Nations designate and protect historical artifacts because their people hold connection to their heritage to be something of intrinsic worth. Lastly, we provision clean water for all because of our belief that all lives are equally valuable. This humanist value is why stories like the [Flint water crisis](https://en.wikipedia.org/wiki/Flint_water_crisis)—a failure of basic infrastructure—are widely understood as humanitarian crises: certain lives are being treated as valueless, treated as if they do not belong.", "timestamp": 1625538966, "digest": "OfKqtsM6xujpWVqZDTe0Z9ePMJpfYpAQ5Bx46dSYVyU", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "1QeqHCCSDLcjKzK8nChTl2NEODwZzhAo8BDfgMvojC0", "title": "Positive Sum Worlds: Remaking Public GoodsPositive Sum Worlds: Remaking Public Goods", "body": "> To live together in the world means essentially that a world of things is between those who have it in common, as a table is located between those who sit around it.\n– Hannah Arendt, 1958\n\n![Engraving depicting the Hanging Gardens of Babylon, one of the Seven Wonders of the World. Artist unknown, 19th c.](https://images.mirror-media.xyz/publication-images/ef6813ac-9f90-4a99-8bdb-6a6a692adf43.jpeg?height=1331&width=1920)\n\nPublic things, whether natural resources or human creations, populate the world in which we encounter one another. We govern, share, and maintain them as a society. While imperfect in how they are built or administered, these objects draw us together in dialogue, debate, and common concern (Honig, 2017). More than mere things, natural landscapes and built environments are cultural touchpoints. They involve us in care for the public good.\n\n![Roman aqueduct of Pont du Gard, now recognized as a UNESCO World Heritage Site. Painting by Hubert Robert, 1787.](https://images.mirror-media.xyz/publication-images/aa089222-75a8-45f7-bd18-00b1b3e4dccb.jpeg?height=1200&width=1212)\n\nIn economics, a \"public good\" refers to anything that is both *non-excludable* and *non-rivalrous*, that is, people can't be barred access, and one person's use doesn't degrade another's. Clean air is an example of a naturally occurring public good, while the electric grid is a public good created by people. What are the public goods of today's industrial-knowledge society? Open source code, which supports millions of companies and independent developers, is often thought of this way. The cypherpunks considered privacy itself as a kind of public good. It seems only natural that online media archives and open digital infrastructure should qualify as well.\n\nMore recently, Vitalik Buterin and others in the cryptocurrency community have taken up the rhetoric of blockchain mechanisms as public goods. To be sure, crypto protocols are among the most compelling novel institutional forms. Their unique capabilities derive from their \"public\" qualities: unrestricted membership and participation, open APIs, transparent allocation of resources and power. But at the same time many of their characteristics contradict claims of public accessibility. Can crypto protocols be considered public goods if ownership is concentrated in the hands of a few whales? Colloquially, these market primitives are sometimes described as \"public infrastructure,\" but if blockchains serve a \"public\" today, it is primarily one of decentralized finance. Fundamentally, these tokenholders share only one common object of concern: price.\n\nSo while crypto protocols may qualify as public goods in the economic sense, where in these conversations is discussion of what's good for the public? Some of the crypto community's stated ambitions are to solve mass coordination problems, build post-national forms of sovereignty, and level the global playing field. But to create a majestic and egalitarian society requires a more expansive vision of public goods than what can be imagined with economics alone.\n\n![Ancient Ruins Used as Public Baths, Hubert Robert (1798)](https://images.mirror-media.xyz/publication-images/81fd1a35-4953-49c1-b54c-3ec794ec8db4.jpeg?height=853&width=1247)\n\nThe public bath houses of the Romans, accessible to both rich and poor, were the cornerstone of both the city's public health and its rich cultural life. At its peak, the Library of Alexandria held hundreds of thousands of texts, among the largest stores of public knowledge in the ancient world. Although exclusionary in many respects, these wonders are precursors to the public goods we know today. They point towards an ideal of openness and universality. As builders of a new digital society, we must be equipped with an even more inclusive and visionary concept of what \"public\" and \"good\" can mean. As protocol treasuries transition to community stewardship of public works, it's time to imagine how crypto protocols might uniquely conceive of public goods.\n\n## The Scope of the Public\n\nOur new understanding of public goods starts by exploring notions of the public. What makes something public? What constitutes *the* public?\n\nThe vernacular term \"public\" is understood to be something of the people, freely available for use—such as parks, roads, and common lands. Crypto protocols' strongest claim to publicness is based on this principle of open and permissionless access. Blockchains overcome a key limitation of Web 1 and Web 2 publics: their failure to satisfy the criteria of inalienable access. The internet's so-called \"public spaces\" are nothing like our cities' public parks. They are merely someone else's private server, where access can be revoked at will. By contrast, crypto protocols deliberately enforce unimpeded access.\n\nBut a public is more than a means of access to public space. Another key definition is a public as body of people, defined in relation to some political association. In 17th century England, a newly uncensored press circulated articles of public opinion, including notes from salon gatherings and critical journals. Often reproachful of the state, these published media brought \"private people together as a public\" for the first time (Habermas, 1989). Less than a century later, French revolutionaries orchestrated a new peoples' self-consciousness by organizing festivals, erecting monuments, and designating new communal spaces (Ozouf, 1975). In both instances, political bodies were raised to the status of institutions by establishing new venues for storytelling—venues in which people could begin to identify themselves as part of a collective whole, that is, a public.\n\n![Festival of the Supreme Being, organized in 1794 to inaugurate the new state religion after the French Revolution.](https://images.mirror-media.xyz/publication-images/0c066ec4-6837-4f4f-b8de-4d6ac8cc7f01.jpeg?height=775&width=1120)\n\nThis notion of the public as a self-conscious entity has also taken hold on the internet, where adoption is driven by *publication* and circulation of media. To publish a web document or software application is more than making something public: it's an act of making a public (Warner, 2002). Cryptocurrency advocates often draw on this idea when they refer to token holders as a \"community,\" or compare protocols to nations with citizens. Sovereign moneys created by blockchains certainly offer a ready comparison to sovereign states, and their immutability means APIs can't be modified or revoked without broad consensus.\n\nThese ideas feed the notion of crypto protocols as public goods, yet together they present a complicated picture. Despite their \"open\" qualities, crypto protocols do not yet offer a satisfying answer to the scope of the public they address.\n\nIn today's crypto ecosystems, token-based membership determines key considerations such as resource allocation, on-chain incentives, and off-chain decision-making. While a blockchain's censorship resistance may seem like the solution to a world of gatekeepers, in reality, pay-to-play limits access in other ways. Protocols may be owned by thousands, even millions of stakeholders, but they are not in everyone's benefit—only those who have the time, expertise, or resources to participate.\n\nWhat then are the implications of defining a public as a set of users? Web 2 platforms offer us a crucial lesson. The social media platforms which dominate the web today claim to be tools made for \"communities\" of users who have opted to participate—but these platforms have also produced wide-reaching negative externalities: effects on third parties who did not agree to incur their costs. The externalities of platforms include incursions on personal privacy, the spread of misinformation, the devaluation of creative labor, even destabilization of the democratic process. These effects are often cited as a primary motivation for those now working in Web 3 to now establish sovereign spaces built on a foundation of public accountability.\n\nWhile social platforms offer one example of a misconstrued public, nascent Web 3 \"public spaces\" suffer similar problems of definition, scope, and representation. The equivalence of stake and voice in crypto is reminiscent of early American democracy, in which political representation was conditioned on property ownership. Under this regime, only 6% of the total US population was eligible to vote—a laughably exclusionary idea of the body politic by today's standards (Ratcliffe, 2013). Recall that the universal suffrage, human rights, and public services we enjoy today are the products of struggle by those who were excluded from the designated public to have their voice represented. In fact, the theory of \"counterpublics\" specifically addresses groups who are not admitted within the larger public sphere, groups whose members may not be deemed as persons (Warner, 2002).\n\n![](https://images.mirror-media.xyz/publication-images/6d2e8d08-4c83-4cf3-85cd-0d19372d885a.jpeg?height=1754&width=1072)\n\nSo it's clear that defining the scope of the public is key to understanding what public goods will mean. By equating membership in a public with ownership of a currency, we lose sight of important stakeholders and opportunities for coalition-building. The most consequential members of the crypto-public today are those who hold the most tokens, meaning even small holders are effectively removed from the conversation about what's in their benefit. Moreover, within this designated public exist people that may hold very different notions of the public good. By engaging with the underrepresented fringes that make up the wider crypto community, we can gain a deeper understanding of the public that we are building for and how to best serve them.\n\nWhen we think of the public, we should think expansively. This is not to say that we must consider everyone in the world as a part of our public. As we emphasized in our essay on squads, we also celebrate small, self-selective communities and trust-based groups. But by considering the effects (positive and negative) that we might have on groups at the margins—whether nocoiners, non-technical family members, or simply future participants in this public domain—we increase the potential for greater public upside and decrease the risk of negative externalities.\n\nPut simply: who belongs in this great post-national society the crypto community aims to build? Paraphrasing Michael Warner, a public always exceeds one's known protocol. It is a relation among strangers that's historically contingent and culturally complex. A public is constituted by the friends you have never met, with whom you share cultural coordinates without even knowing it. How does what we build render benefits for the most people possible?\n\nIn order to address this, let's turn to the \"good\" in public goods.\n\n## The Moral Basis of the Public \"Good\"\n\nHow do we determine what counts as a public good? So far we've started by questioning who exactly the public is. But even if we went along with the claim that publics = tokenholders, what exactly does this tell us about this public? Who are these tokenholders? What beliefs do they collectively hold?\n\nConsider a classic public good: a public park. We might say park visitors are generically \"users\" of this public space, or that anyone within driving distance is adequately served. But this categorization feels distinctly unsatisfying. \"User\" does not capture meaningful detail about a population that collectively values free access to protected forest or shoreline. Why are public parks more desirable than public parking lots? This brings us to an important realization: any definition of public goods presupposes a shared understanding of what is in the public's benefit, and why.\n\n![Tree Mountain - A Living Time Capsule-11,000 Trees, 11,000 People, 400 Years (1992-96) Ylojarvi, Finland](https://images.mirror-media.xyz/publication-images/dee81d2f-3703-4937-b20f-ca4096f780e3.jpeg?height=718&width=1024)\n\nA social body is united not only by the things it makes use of, but by a multitude of shared traits, including geography, ethnicity, religion, taste, culture, history, and values. This is why, no matter their claim to universality, instantiations of public goods are always local. Locality is created and felt through [shared space, time, or experience](https://otherinter.net/squad-wealth/#theory-of-the-squad). Without the assumptions and norms that develop out of this shared context, it would be impossible to identify and make space for things that are in the public benefit. So public goods, even as defined by economists, will always be a reflection of some group's shared context, common beliefs, and moral sensibilities; in other words, their value system.\n\nPublic libraries, public education, national artifacts, and clean running water are four public things that exemplify the moral basis of public goods. Public libraries are built by communities that value self-directed learning and spaces of shared knowledge. Public schools are valued when a culture believes a shared basis of mathematics, science, language, and history enriches civic life. Nations designate and protect historical artifacts because their people hold connection to their heritage to be something of intrinsic worth. Lastly, we provision clean water for all because of our belief that all lives are equally valuable. This humanist value is why stories like the [Flint water crisis](https://en.wikipedia.org/wiki/Flint_water_crisis)—a failure of basic infrastructure—are widely understood as humanitarian crises: certain lives are being treated as valueless, treated as if they do not belong.\n\n![](https://images.mirror-media.xyz/publication-images/4621f607-9c87-4d45-94c5-a7b358b06d02.jpeg?height=720&width=1280)\n\n![](https://images.mirror-media.xyz/publication-images/d14df135-7528-45e1-805a-83ce75572aaf.jpeg?height=324&width=577)\n\n", "timestamp": 1625539070, "digest": "OfKqtsM6xujpWVqZDTe0Z9ePMJpfYpAQ5Bx46dSYVyU", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "P4rEh35ggyLKn4Coqd1wcMxRPn0icwWN1CGpmMm3njU", "title": "Positive Sum Worlds: Remaking Public Goods", "body": "> To live together in the world means essentially that a world of things is between those who have it in common, as a table is located between those who sit around it.\n– Hannah Arendt, 1958\n\n![Engraving depicting the Hanging Gardens of Babylon, one of the Seven Wonders of the World. Artist unknown, 19th c.](https://images.mirror-media.xyz/publication-images/ef6813ac-9f90-4a99-8bdb-6a6a692adf43.jpeg?height=1331&width=1920)\n\nPublic things, whether natural resources or human creations, populate the world in which we encounter one another. We govern, share, and maintain them as a society. While imperfect in how they are built or administered, these objects draw us together in dialogue, debate, and common concern (Honig, 2017). More than mere things, natural landscapes and built environments are cultural touchpoints. They involve us in care for the public good.\n\n![Roman aqueduct of Pont du Gard, now recognized as a UNESCO World Heritage Site. Painting by Hubert Robert, 1787.](https://images.mirror-media.xyz/publication-images/aa089222-75a8-45f7-bd18-00b1b3e4dccb.jpeg?height=1200&width=1212)\n\nIn economics, a \"public good\" refers to anything that is both *non-excludable* and *non-rivalrous*, that is, people can't be barred access, and one person's use doesn't degrade another's. Clean air is an example of a naturally occurring public good, while the electric grid is a public good created by people. What are the public goods of today's industrial-knowledge society? Open source code, which supports millions of companies and independent developers, is often thought of this way. The cypherpunks considered privacy itself as a kind of public good. It seems only natural that online media archives and open digital infrastructure should qualify as well.\n\nMore recently, Vitalik Buterin and others in the cryptocurrency community have taken up the rhetoric of blockchain mechanisms as public goods. To be sure, crypto protocols are among the most compelling novel institutional forms. Their unique capabilities derive from their \"public\" qualities: unrestricted membership and participation, open APIs, transparent allocation of resources and power. But at the same time many of their characteristics contradict claims of public accessibility. Can crypto protocols be considered public goods if ownership is concentrated in the hands of a few whales? Colloquially, these market primitives are sometimes described as \"public infrastructure,\" but if blockchains serve a \"public\" today, it is primarily one of decentralized finance. Fundamentally, these tokenholders share only one common object of concern: price.\n\nSo while crypto protocols may qualify as public goods in the economic sense, where in these conversations is discussion of what's good for the public? Some of the crypto community's stated ambitions are to solve mass coordination problems, build post-national forms of sovereignty, and level the global playing field. But to create a majestic and egalitarian society requires a more expansive vision of public goods than what can be imagined with economics alone.\n\n![Ancient Ruins Used as Public Baths, Hubert Robert (1798)](https://images.mirror-media.xyz/publication-images/81fd1a35-4953-49c1-b54c-3ec794ec8db4.jpeg?height=853&width=1247)\n\nThe public bath houses of the Romans, accessible to both rich and poor, were the cornerstone of both the city's public health and its rich cultural life. At its peak, the Library of Alexandria held hundreds of thousands of texts, among the largest stores of public knowledge in the ancient world. Although exclusionary in many respects, these wonders are precursors to the public goods we know today. They point towards an ideal of openness and universality. As builders of a new digital society, we must be equipped with an even more inclusive and visionary concept of what \"public\" and \"good\" can mean. As protocol treasuries transition to community stewardship of public works, it's time to imagine how crypto protocols might uniquely conceive of public goods.\n\n## The Scope of the Public\n\nOur new understanding of public goods starts by exploring notions of the public. What makes something public? What constitutes *the* public?\n\nThe vernacular term \"public\" is understood to be something of the people, freely available for use—such as parks, roads, and common lands. Crypto protocols' strongest claim to publicness is based on this principle of open and permissionless access. Blockchains overcome a key limitation of Web 1 and Web 2 publics: their failure to satisfy the criteria of inalienable access. The internet's so-called \"public spaces\" are nothing like our cities' public parks. They are merely someone else's private server, where access can be revoked at will. By contrast, crypto protocols deliberately enforce unimpeded access.\n\nBut a public is more than a means of access to public space. Another key definition is a public as body of people, defined in relation to some political association. In 17th century England, a newly uncensored press circulated articles of public opinion, including notes from salon gatherings and critical journals. Often reproachful of the state, these published media brought \"private people together as a public\" for the first time (Habermas, 1989). Less than a century later, French revolutionaries orchestrated a new peoples' self-consciousness by organizing festivals, erecting monuments, and designating new communal spaces (Ozouf, 1975). In both instances, political bodies were raised to the status of institutions by establishing new venues for storytelling—venues in which people could begin to identify themselves as part of a collective whole, that is, a public.\n\n![Festival of the Supreme Being, organized in 1794 to inaugurate the new state religion after the French Revolution.](https://images.mirror-media.xyz/publication-images/0c066ec4-6837-4f4f-b8de-4d6ac8cc7f01.jpeg?height=775&width=1120)\n\nThis notion of the public as a self-conscious entity has also taken hold on the internet, where adoption is driven by *publication* and circulation of media. To publish a web document or software application is more than making something public: it's an act of making a public (Warner, 2002). Cryptocurrency advocates often draw on this idea when they refer to token holders as a \"community,\" or compare protocols to nations with citizens. Sovereign moneys created by blockchains certainly offer a ready comparison to sovereign states, and their immutability means APIs can't be modified or revoked without broad consensus.\n\nThese ideas feed the notion of crypto protocols as public goods, yet together they present a complicated picture. Despite their \"open\" qualities, crypto protocols do not yet offer a satisfying answer to the scope of the public they address.\n\nIn today's crypto ecosystems, token-based membership determines key considerations such as resource allocation, on-chain incentives, and off-chain decision-making. While a blockchain's censorship resistance may seem like the solution to a world of gatekeepers, in reality, pay-to-play limits access in other ways. Protocols may be owned by thousands, even millions of stakeholders, but they are not in everyone's benefit—only those who have the time, expertise, or resources to participate.\n\nWhat then are the implications of defining a public as a set of users? Web 2 platforms offer us a crucial lesson. The social media platforms which dominate the web today claim to be tools made for \"communities\" of users who have opted to participate—but these platforms have also produced wide-reaching negative externalities: effects on third parties who did not agree to incur their costs. The externalities of platforms include incursions on personal privacy, the spread of misinformation, the devaluation of creative labor, even destabilization of the democratic process. These effects are often cited as a primary motivation for those now working in Web 3 to now establish sovereign spaces built on a foundation of public accountability.\n\nWhile social platforms offer one example of a misconstrued public, nascent Web 3 \"public spaces\" suffer similar problems of definition, scope, and representation. The equivalence of stake and voice in crypto is reminiscent of early American democracy, in which political representation was conditioned on property ownership. Under this regime, only 6% of the total US population was eligible to vote—a laughably exclusionary idea of the body politic by today's standards (Ratcliffe, 2013). Recall that the universal suffrage, human rights, and public services we enjoy today are the products of struggle by those who were excluded from the designated public to have their voice represented. In fact, the theory of \"counterpublics\" specifically addresses groups who are not admitted within the larger public sphere, groups whose members may not be deemed as persons (Warner, 2002).\n\n![](https://images.mirror-media.xyz/publication-images/6d2e8d08-4c83-4cf3-85cd-0d19372d885a.jpeg?height=1754&width=1072)\n\nSo it's clear that defining the scope of the public is key to understanding what public goods will mean. By equating membership in a public with ownership of a currency, we lose sight of important stakeholders and opportunities for coalition-building. The most consequential members of the crypto-public today are those who hold the most tokens, meaning even small holders are effectively removed from the conversation about what's in their benefit. Moreover, within this designated public exist people that may hold very different notions of the public good. By engaging with the underrepresented fringes that make up the wider crypto community, we can gain a deeper understanding of the public that we are building for and how to best serve them.\n\nWhen we think of the public, we should think expansively. This is not to say that we must consider everyone in the world as a part of our public. As we emphasized in our essay on squads, we also celebrate small, self-selective communities and trust-based groups. But by considering the effects (positive and negative) that we might have on groups at the margins—whether nocoiners, non-technical family members, or simply future participants in this public domain—we increase the potential for greater public upside and decrease the risk of negative externalities.\n\nPut simply: who belongs in this great post-national society the crypto community aims to build? Paraphrasing Michael Warner, a public always exceeds one's known protocol. It is a relation among strangers that's historically contingent and culturally complex. A public is constituted by the friends you have never met, with whom you share cultural coordinates without even knowing it. How does what we build render benefits for the most people possible?\n\nIn order to address this, let's turn to the \"good\" in public goods.\n\n## The Moral Basis of the Public \"Good\"\n\nHow do we determine what counts as a public good? So far we've started by questioning who exactly the public is. But even if we went along with the claim that publics = tokenholders, what exactly does this tell us about this public? Who are these tokenholders? What beliefs do they collectively hold?\n\nConsider a classic public good: a public park. We might say park visitors are generically \"users\" of this public space, or that anyone within driving distance is adequately served. But this categorization feels distinctly unsatisfying. \"User\" does not capture meaningful detail about a population that collectively values free access to protected forest or shoreline. Why are public parks more desirable than public parking lots? This brings us to an important realization: any definition of public goods presupposes a shared understanding of what is in the public's benefit, and why.\n\n![Tree Mountain - A Living Time Capsule-11,000 Trees, 11,000 People, 400 Years (1992-96) Ylojarvi, Finland](https://images.mirror-media.xyz/publication-images/dee81d2f-3703-4937-b20f-ca4096f780e3.jpeg?height=718&width=1024)\n\nA social body is united not only by the things it makes use of, but by a multitude of shared traits, including geography, ethnicity, religion, taste, culture, history, and values. This is why, no matter their claim to universality, instantiations of public goods are always local. Locality is created and felt through [shared space, time, or experience](https://otherinter.net/squad-wealth/#theory-of-the-squad). Without the assumptions and norms that develop out of this shared context, it would be impossible to identify and make space for things that are in the public benefit. So public goods, even as defined by economists, will always be a reflection of some group's shared context, common beliefs, and moral sensibilities; in other words, their value system.\n\nPublic libraries, public education, national artifacts, and clean running water are four public things that exemplify the moral basis of public goods. Public libraries are built by communities that value self-directed learning and spaces of shared knowledge. Public schools are valued when a culture believes a shared basis of mathematics, science, language, and history enriches civic life. Nations designate and protect historical artifacts because their people hold connection to their heritage to be something of intrinsic worth. Lastly, we provision clean water for all because of our belief that all lives are equally valuable. This humanist value is why stories like the [Flint water crisis](https://en.wikipedia.org/wiki/Flint_water_crisis)—a failure of basic infrastructure—are widely understood as humanitarian crises: certain lives are being treated as valueless, treated as if they do not belong.\n\n![](https://images.mirror-media.xyz/publication-images/4621f607-9c87-4d45-94c5-a7b358b06d02.jpeg?height=720&width=1280)\n\n![](https://images.mirror-media.xyz/publication-images/d14df135-7528-45e1-805a-83ce75572aaf.jpeg?height=324&width=577)\n\n", "timestamp": 1625538991, "digest": "OfKqtsM6xujpWVqZDTe0Z9ePMJpfYpAQ5Bx46dSYVyU", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "MbtLyuX04iJK1hl-wb1WP3a4aJVKjhsjL5q2aME5WLg", "title": "Positive Sum Worlds: Remaking Public Goods", "body": "*To live together in the world means essentially that a world of things is between those who have it in common, as a table is located between those who sit around it.*\\\n– Hannah Arendt, 1958\n\n![Engraving depicting the Hanging Gardens of Babylon, one of the Seven Wonders of the World. Artist unknown, 19th c.](https://otherinter.net/hanging-gardens.jpeg)\n\nPublic things, whether natural resources or human creations, populate the world in which we encounter one another. We govern, share, and maintain them as a society. While imperfect in how they are built or administered, these objects draw us together in dialogue, debate, and common concern (Honig, 2017). More than mere things, natural landscapes and built environments are cultural touchpoints. They involve us in care for the public good.\n\n![Roman aqueduct of Pont du Gard, now recognized as a UNESCO World Heritage Site. Painting by Hubert Robert 1787.](https://otherinter.net/aqueduct.jpeg)\n\nIn economics, a \"public good\" refers to anything that is both *non-excludable* and *non-rivalrous,* that is, people can't be barred access, and one person's use doesn't degrade another's. Clean air is an example of a naturally occurring public good, while the electric grid is a public good created by people. What are the public goods of today's industrial-knowledge society? Open source code, which supports millions of companies and independent developers, is often thought of this way. The cypherpunks considered privacy itself as a kind of public good. It seems only natural that online media archives and open digital infrastructure should qualify as well.\n\nMore recently, Vitalik Buterin and others in the cryptocurrency community have taken up the rhetoric of blockchain mechanisms as public goods. To be sure, crypto protocols are among the most compelling novel institutional forms. Their unique capabilities derive from their \"public\" qualities: unrestricted membership and participation, open APIs, transparent allocation of resources and power. But at the same time many of their characteristics contradict claims of public accessibility. Can crypto protocols be considered public goods if ownership is concentrated in the hands of a few whales? Colloquially, these market primitives are sometimes described as \"public infrastructure,\" but if blockchains serve a \"public\" today, it is primarily one of decentralized finance. Fundamentally, these tokenholders share only one common object of concern: price.\n\nSo while crypto protocols may qualify as public goods in the economic sense, where in these conversations is discussion of what's good for the public? Some of the crypto community's stated ambitions are to solve mass coordination problems, build post-national forms of sovereignty, and level the global playing field. But to create a majestic and egalitarian society requires a more expansive vision of public goods than what can be imagined with economics alone.\n\n![Ancient Ruins Used as Public Baths, Hubert Robert (1798)](https://otherinter.net/hubert-robert-baths.jpeg)\n\nThe public bath houses of the Romans, accessible to both rich and poor, were the cornerstone of both the city's public health and its rich cultural life. At its peak, the Library of Alexandria held hundreds of thousands of texts, among the largest stores of public knowledge in the ancient world. Although exclusionary in many respects, these wonders are precursors to the public goods we know today. They point towards an ideal of *openness* and *universality.* As builders of a new digital society, we must be equipped with an even more inclusive and visionary concept of what \"public\" and \"good\" can mean. As protocol treasuries transition to community stewardship of public works, it's time to imagine how crypto protocols might uniquely conceive of public goods.\n\n## The Scope of the Public\n\nOur new understanding of public goods starts by exploring notions of the public. What makes something public? What constitutes *the* public?\n\nThe vernacular term \"public\" is understood to be *something of the people, freely available for use*—such as parks, roads, and common lands. Crypto protocols' strongest claim to publicness is based on this principle of open and permissionless access. Blockchains overcome a key limitation of Web 1 and Web 2 publics: their failure to satisfy the criteria of inalienable access. The internet's so-called \"[public spaces](https://en.wikipedia.org/wiki/Public_space)\" are nothing like our cities' public parks. They are merely someone else's private server, where access can be revoked at will. By contrast, crypto protocols deliberately enforce unimpeded access.\n\nBut a public is more than a means of access to public space. Another key definition is *a* public as body of people, defined in relation to some political association. In 17th century England, a newly uncensored press circulated articles of public opinion, including notes from salon gatherings and critical journals. Often reproachful of the state, these published media brought \"private people together as a public\" for the first time (Habermas, 1989). Less than a century later, French revolutionaries orchestrated a new peoples' self-consciousness by organizing festivals, erecting monuments, and designating new communal spaces (Ozouf, 1975). In both instances, political bodies were raised to the status of institutions by establishing new venues for storytelling—venues in which people could begin to identify themselves as part of a collective whole, that is, a public.\n\n![ Festival of the Supreme Being, organized in 1794 to inaugurate the new state religion after the French Revolution.](https://otherinter.net/festival-supremebeing.jpeg)\n\nThis notion of the public as a self-conscious entity has also taken hold on the internet, where adoption is driven by *public*ation and circulation of media. To publish a web document or software application is more than making *something* public: it's an act of making *a* public (Warner, 2002). Cryptocurrency advocates often draw on this idea when they refer to token holders as a \"community,\" or compare protocols to nations with citizens. Sovereign moneys created by blockchains certainly offer a ready comparison to sovereign states, and their immutability means APIs can't be modified or revoked without broad consensus.\n\nThese ideas feed the notion of crypto protocols as public goods, yet together they present a complicated picture. Despite their \"open\" qualities, crypto protocols do not yet offer a satisfying answer to the *scope* of the public they address.\n\nIn today's crypto ecosystems, token-based membership determines key considerations such as resource allocation, on-chain incentives, and off-chain decision-making. While a blockchain's censorship resistance may seem like the solution to a world of gatekeepers, in reality, pay-to-play limits access in other ways. Protocols may be owned by thousands, even millions of stakeholders, but they are not in everyone's benefit—only those who have the time, expertise, or resources to participate.\n\nWhat then are the implications of defining a public as a set of users? Web 2 platforms offer us a crucial lesson. The social media platforms which dominate the web today claim to be tools made for \"communities\" of users who have opted to participate—but these platforms have also produced wide-reaching *negative externalities:* effects on third parties who did not agree to incur their costs. The externalities of platforms include incursions on personal privacy, the spread of misinformation, the devaluation of creative labor, even destabilization of the democratic process. These effects are often cited as a primary motivation for those now working in Web 3 to now establish sovereign spaces built on a foundation of public accountability.\n\nWhile social platforms offer one example of a misconstrued public, nascent Web 3 \"public spaces\" suffer similar problems of definition, scope, and representation. The equivalence of stake and voice in crypto is reminiscent of early American democracy, in which political representation was conditioned on property ownership. Under this regime, only 6% of the total US population was eligible to vote—a laughably exclusionary idea of the body politic by today's standards (Ratcliffe, 2013). Recall that the universal suffrage, human rights, and public services we enjoy today are the products of struggle by those who were excluded from the *designated* public to have their voice represented. In fact, the theory of \"counterpublics\" specifically addresses groups who are not admitted within the larger public sphere, groups whose members may not be deemed as persons (Warner, 2002).\n\n![Nationl Union of Womens Suffrage Societies](https://otherinter.net/nuwss.jpeg)\n\nSo it's clear that defining the scope of the public is key to understanding what public goods will mean. By equating membership in a public with ownership of a currency, we lose sight of important stakeholders and opportunities for coalition-building. The most consequential members of the crypto-public today are those who hold the most tokens, meaning even small holders are effectively removed from the conversation about what's in their benefit. Moreover, within this *designated* public exist people that may hold very different notions of the public good. By engaging with the underrepresented fringes that make up the wider crypto community, we can gain a deeper understanding of the public that we are building for and how to best serve them.\n\nWhen we think of the public, we should think expansively. This is not to say that we must consider *everyone* in the world as a part of our public. As we emphasized in our essay on [squads](http://otherinter.net/squad-wealth/), we also celebrate small, self-selective communities and trust-based groups. But by considering the effects (positive and negative) that we might have on groups at the margins—whether nocoiners, non-technical family members, or simply future participants in this public domain—we increase the potential for greater public upside and decrease the risk of negative externalities.\n\nPut simply: who belongs in this great post-national society the crypto community aims to build? Paraphrasing Michael Warner, a public always exceeds one's known protocol. It is a relation among strangers that's historically contingent and culturally complex. A public is constituted by the friends you have never met, with whom you share cultural coordinates without even knowing it. How does what we build render benefits for the most people possible?\n\nIn order to address this, let's turn to the \"good\" in public goods.\n\n## The Moral Basis of the Public \"Good\"\n\nHow do we determine what counts as a public good? So far we've started by questioning who exactly the public is. But even if we went along with the claim that publics = tokenholders, what exactly does this tell us about this public? Who are these tokenholders? What beliefs do they collectively hold?\n\nConsider a classic public good: a public park. We might say park visitors are generically \"users\" of this public space, or that anyone within driving distance is adequately served. But this categorization feels distinctly unsatisfying. \"User\" does not capture meaningful detail about a population that collectively values free access to protected forest or shoreline. *Why* are public parks more desirable than public parking lots? This brings us to an important realization: any definition of public goods presupposes a shared understanding of what is in the public's benefit, and why.\n\n![Tree Mountain - A Living Time Capsule-11,000 Trees, 11,000 People, 400 Years (1992-96) Ylojarvi, Finland](https://otherinter.net/tree-mountain.jpeg)\n\nA social body is united not only by the things it makes use of, but by a multitude of shared traits, including geography, ethnicity, religion, taste, culture, history, and values. This is why, no matter their claim to universality, instantiations of public goods are always *local*. Locality is created and felt through [shared space, time, or experience](https://otherinter.net/squad-wealth/#theory-of-the-squad). Without the assumptions and norms that develop out of this shared context, it would be impossible to identify and make space for things that are in the public benefit. So public goods, even as defined by economists, will always be a reflection of some group's shared context, common beliefs, and moral sensibilities; in other words, their value system.\n\nPublic libraries, public education, national artifacts, and clean running water are four public things that exemplify the moral basis of public goods. Public libraries are built by communities that value self-directed learning and spaces of shared knowledge. Public schools are valued when a culture believes a shared basis of mathematics, science, language, and history enriches civic life. Nations designate and protect historical artifacts because their people hold connection to their heritage to be something of intrinsic worth. Lastly, we provision clean water for all because of our belief that all lives are equally valuable. This humanist value is why stories like the [Flint water crisis](https://en.wikipedia.org/wiki/Flint_water_crisis)—a failure of basic infrastructure—are widely understood as humanitarian crises: certain lives are being treated as valueless, treated as if they do not belong.\n\n![](https://otherinter.net/flint-1.jpeg)\n\n![](https://otherinter.net/flint-2.jpeg)\n\nEach of these examples is based on a different idea of what makes life meaningful—on an idea of what *is* \"good\" (Taylor, 1977). Public goods are non-excludable and non-rivalrous, but more importantly, *they are objects that satisfy values that are shared.*\n\nThe four public goods mentioned above are upheld by social bodies with a shared belief in their value to the public at large. But how many look at the \"public goods\" funded in the crypto space and see their values reflected? What are the shared values of UNI holders, or Ethereans?\n\nThe crypto community ostensibly holds an ethos of liberalism, where \"decentralization\" frequently stands for community self-sovereignty. With the wealth creation in the space, there is no reason crypto shouldn't be able to build goods for the diverse values of its different communities. There's even a popular meme that \"crypto allows communities to encode values into money.\" But in practice, little space has been made for different values to be discussed or enacted. Which is why, in the absence of ways to enact our shared values, we default to the lowest common denominator: profit.\n\nWithout a specific idea of the good to build towards, the financial interests of large tokenholders have become over-represented in protocol governance. In our view, this constitutes a centralization risk. When protocol politicians have no mandate or formal responsibility to represent anyone's interest but their own, the result is that a homogenous and self-interested group of whales can dictate what is deemed to be of benefit for the network. Crypto still has no concept of a \"public servant.\"\n\nSo what are the alternatives to oligopolistic protocol determination? Buterin, Hitzig, and Weyl's concept of \"liberal radicalism,\" the basis for Gitcoin's Quadratic Funding mechanism, proposes a model in which public goods are equivalent to market signals (Buterin et al., 2018). One might make the argument that values are \"priced in\" to this model. If people \"vote on their values with their dollars\", then the market acts as a vehicle for funding those values, whether or not values are made explicit. Indeed, quadratic voting appears able to boost the relative voice of a passionate minority.\n\nBut while voting is symbolically powerful, this model misses an important truth: we do not discover shared values through *individually* revealed preference. *If public goods are to satisfy shared values, then public discussion of what's of value matters!* Many protocols are already learning this lesson with regards to governance: discussion and consensus-building is a necessary precursor to voting. Likewise, discussion of values is as important, if not more so, than the act of voting itself. A value system is fostered through storytelling and negotiation in forums of public discourse.\n\nIf we don't want what's of value to be centrally determined by those with the most tokens in their wallets, we need to empower diverse communities and explicitly incorporate different conceptions of worth. To have an economy in alignment with our own values, we need a stronger coupling between our idea of the public interest and how decisions are made on this public's behalf. If we wish to build a culture that lasts, members must identify with one another along dimensions beyond that of a “tokenholder.\" Members of the crypto space are New Yorkers, Berliners, and Kinshasans, we are grandchildren of the elderly and parents of the very young. We are members of a multitude of publics, and we must bring the perspective of our full selves to the creation of public goods.\n\n## Public Goods, a New Definition: Positive Externalities\n\nSo far we've learned about the complicated ways a public can be defined, suggesting that expanding our notion of the public to include many parties may produce better public outcomes. We've also seen that goods are based on the shared values of some locality. With these concepts in hand, can we build a better definition of public goods?\n\nThe type of public goods we need are those that can be enacted by digital communities, while avoiding the destructive scaling effects of Web 2 platforms. As Facebook expanded its reach, it realized increasingly negative externalities in the form of propagandist attacks on democratic institutions. Public goods enacted by Web 3 communities should strive to produce exactly the opposite effect. **Greater scale should mean *greater* *good* as valued by an increasingly wider set of people: the creation of *positive externalities*.**\n\nThis is a powerful new way of defining public goods. In fact, crypto has already generated one potent example: widespread adoption of asymmetric cryptography. Computer scientists and cryptographers have known for years that mass adoption of public key encryption could enhance the right to privacy, a value held by many. But while researchers struggled to advocate for the adoption of this technology, cryptocurrencies have driven mass adoption in a matter of years. Encrypted messaging has gone from a tool used by dark markets and intelligence agencies to a highly demanded feature of consumer applications and services.\n\n![Kryptos, Jim Sanborn (1990) cryptographic sculpture installed at the grounds of the Central Intelligence Agency. To date 3 of the 4 enscribed cyphertexts have been decoded.](https://otherinter.net/kryptos.jpeg)\n\nOther examples of crypto's positive externalities are more nascent. Today, core contributors to open source projects are still under-funded, despite entire industries being built with their software. With infrastructure provided by the likes of Gitcoin and Radicle, protocol treasuries are poised to dramatically expand the funding of open source code, both inside and outside of crypto. We are already seeing signals of this shift, as more private and public funding is directed to support open source development, within crypto and beyond.\n\nSimilarly, normalizing open organizational APIs and civic participation are objects of public interest for any contemporary advocate of liberalism and democracy. Open, unalterable, and publicly governed APIs dramatically curb the power of centralized organizations and grant agency to users, who may now determine their own interfaces and services. If blockchains pressure centralized companies and governments to make their APIs open and irrevocable, this would mark a major paradigm shift toward accessible and accountable institutions. Finally, crypto protocols reintroduce participatory governance of public systems as a part of daily life. We can only hope that one of crypto's externalities will be to raise the expectation for transparent and easy-to-use participation in local governance.\n\nEach of these public goods, both actual and potential, are goods beyond the reductive economic sense. They satisfy values of privacy, the virtue of freely shared work, liberalism, accountability, and democratic participation, incorporating a shared sense of *the good* for parties well beyond the users of Web 3 today.\n\nThis points to a useful feature of our new definition. Understanding public goods as positive externalities enables us to consider people that are not typically classified as members of a public to be our beneficiaries. This definition stands in contrast to economic discourse, where non-contributing users of some public good are considered \"free riders,\" indicative of market failure. How could we consider these users \"free riders\" when it is clearly in the interest of society to promote the creation and consumption of public goods—be they vaccines, public libraries, or open source code? The idea of positive externalities makes others' benefit axiomatic. In fact, this quality is congruent with the principle of [credible neutrality](https://nakamoto.com/credible-neutrality/). Applied to public goods, credible neutrality suggests that there ought not be *any* privileged class of \"citizens,\" that all should stand to benefit equally.\n\nPositive externalities are thus an important variation on a familiar theme in the crypto space: positive sum games. By now, most crypto-natives recognize that relationships and value creation are largely of this type, games of building and shilling where contributions have cooperatively additive effects. As protocols and infrastructures grow and become more culturally entrenched, the extent of their positive externalities should *also* increase proportionally.\n\nAn interesting case study is Fair Launch Capital. While this project does not lay out a mission explicitly in the public interest, it hints at possible social models that deserve further exploration. In short, Fair Launch Capital is a small group of facilitators who fund promising projects. The founders of these projects must be willing to forgo a founder's token allocation, instead distributing their token \"fairly\" in exchange for a startup grant. If founders net some upside over the course of deploying this protocol, they are expected to \"pay it forward,\" subsidizing a subsequent team to launch their protocol and distribute tokens in the same fashion.\n\nThe Fair Launch model is interesting for a few reasons. First, the facilitating group does not capture financial value directly; it exists to perpetuate the organization. Second, Fair Launch Capital is not hard infrastructure but a social protocol, an institution whose maintenance relies on dedication and value alignment. And thirdly, the people who benefit are distinct from those performing the service. This leads us to a surprising feature of this new form of public goods: one way to manifest positive externalities is to consider the success of others as your own.\n\n![Zilker Park Kite Festival, held annually in Austin Texas.](https://otherinter.net/zilker-kite-festival.png)\n\n***\n\nEquipped with this idea of positive externalities, what public goods could we build and how? If public goods always serve a set of values local to some userbase, we might find our best inspiration by looking at the publics we already are part of. In addition to our on-chain identities, we, the authors of this essay, write from Berlin and New York. As citizens of these places, we benefit from parks and clean air, sanitation, and public transportation; we are upset about overpolicing, deforestation, and slow vaccine deployment. We have friends who receive public arts funding and write grants to ensure they can educate disenfranchised students.\n\nOur membership in these local spaces connects us with people who share our needs, aspirations, and concerns. We would *all* benefit from more green space, quality low-cost housing, and better access to healthy produce. Could public goods funders and builders in crypto intervene in these areas? Crypto has managed to build infrastructures that exist outside the nation state, but we still live our lives embedded in places, communities, and nations. Visions of truly global DAOs representing billions of people are a fantasy. But if we apply our principle of \"positive externalities\" to include future citizens of the places we live, protocol-built public goods starts to look more like community-driven industrial policy.\n\nThis might look like Fair Launch Capital for local small business startup grants. Or maybe it's Uniswap's tokenholders voting to fund regional subcommittees tasked with acquiring land to create conservation land trusts. One of Web 3's most disruptive potentialities is the power to take an entity with a strong revenue mechanism and leverage it to address something bigger than itself. DAOs can follow the tradition of great social movements past, working outside state governments to establish public goods. The success of the Black Panther Party's nation-wide program to deliver free breakfasts to public school students, black and white, pressured state governments across the US to create their own versions. This serves as an example how a non-state group with local community concerns can serve an expanded public and drive positive externalities.\n\n![Black Panther Party Free Breakfast Program](https://otherinter.net/free-breakfast.png)\n\nThis is a model that works locally, but scales to a global public. Like the expansion of suffrage, it sets a powerful precedent for adjacent communities and cultures. By addressing concerns rooted in our felt localities and establishing social models for others, we can catalyze truly global public goods.\n\n## From Ecosystem-Building to World-Building\n\nThe Ethereum project envisioned a \"world computer,\" a coordination system for global prosperity. Along with thousands of others, we joined the crypto space in 2016 and 2017 with the ambition of remaking society for the better. Now most of us are stuck checking our portfolio balances. Have we lost sight of that core belief?\n\nEvery one of us is a beneficiary of the public goods of societies past. These grand projects humble us. Cathedrals, great canals, sanitation, the expansion of mass literacy—they tell us that the \"goodness\" of a public good is also measured in terms of its longevity. To match these great works, we must extend our time horizon. We want to ensure positive outcomes not just for token holders or protocol participants, but for the world co-extensive with these infrastructures. How can we leverage the immutability afforded by crypto protocols to create things that outlast us, forming the foundation of civilizational longevity?\n\nTo answer this, we need only think of public goods that satisfy this definition today. Permanent land preserves, the Global Seed Vault, the internet itself as the foundational communications technology of a global age. These are not only public goods, they are the cultural practices that maintain such goods over generations. *Public goods are enacted by social institutions that reproduce patterns of behavior in the public interest.*\n\nCrypto protocols provide the building blocks of social institutions equipped to take on the challenges of today's networked culture. Many are already looking for ambitious and impactful ways to spend their billion-dollar treasuries. And there is more than just financial value flowing through these cryptoeconomic systems: peoples' time, attention, and energy are resources that can be directed. Yet so much of what is built in crypto today is self-referential and self-serving money games. \"ETH = money,\" \"treasury diversification,\" even the \"ngmi\" meme—these are concepts fundamentally indexed to profit. But what is money for? The United States Dollar does not have a responsibility to profit its holders. A cryptocurrency is a monetary instrument, not a business.\n\nAs tokenholders, we have the right and the responsibility to ask what these assets should be used for—and the stakes are high. The shape of society in the 20th century was determined by corporations explicitly driven by a profit-only value system. Do we want the next-generation of protocol-based institutions to result in same outcomes? The type of social institution needed is not an on-chain corporation, but a container for a different idea of what capital and coordination is intended to do altogether. We see a seed of this in today's protocol granting bodies, distributing responsibility for treasury funds to smaller groups with targeted public goals. Imagine the power of entire protocols operating according to this principle. The scope of our ambition goes well beyond conscientious token voting. We want nothing less than entire communities aping into a redefinition of public concern. The opportunity in front of us is bigger than any one protocol. In today's world, capital is not scarce; ambitious visions for the public's benefit are.\n\n![Buckminster Fuller, 1/2,000.000 scale \"Playground Map\" developed by the World Game Institute. Upscaling by Kara Kittel.](https://otherinter.net/dymaxion-upscaled-restored.png)\n\n***\n\n*As always, we are deeply indebted to everyone at Other Internet peer review who guided our ideas. We are especially thankful to Bryan Lehrer, Kei Kreutler, Callil Capuozzo, Jay Springett, and Arthur Roing Baer for pushing our thinking. We also thank Dena Yago and Carson Salter, who clarified and sharpened our argument, and Klara Kofen for enriching our historical account. Thank you to Maria Gomez, Jerry Brito, and Chris Burniske for enlightening conversations on this theme over the last year. And finally, thank you to Scott Moore and Kevin Owocki, and the entire the Gitcoin team, whose commitment to the public good continues to inspire us.*\n\n### **References**\n\n*   Arendt, Hannah. \"The Human Condition.\" 1958.\n*   Buterin, Vitalik et al. \"Liberal Radicalism: A Flexible Design For Philanthropic Matching Funds.\" 2018.\n*   Habermas, Jürgen. \"The structural transformation of the public sphere: An inquiry into a category of bourgeois society.\" \\*\\*(T. Burger, Trans.). Cambridge, MA: MIT Press, 1989.\n*   Honig, Bonnie. \"Public Things: Democracy in Disrepair.\" New York: Fordham University Press, 2017.\n*   Ratcliffe, Donald. \"The Right to Vote and the Rise of Democracy, 1787–1828.\" Journal of the Early Republic, 2013. pp. 33.\n*   Taylor, Charles. \"What Is Human Agency?\" In Theodore Mischel (ed.), The Self: Psychological and Philosophical Issues. Rowman & Littlefield. 1977. pp. 103.\n*   Warner, Michael. \"Publics and Counterpublics.\" New York: Zone Books, 2002.\n", "timestamp": 1625539239, "digest": "OfKqtsM6xujpWVqZDTe0Z9ePMJpfYpAQ5Bx46dSYVyU", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "1ycLp-zxBie_70nQQC9LJ8ewgltoYqtw82Ke8j_XOz4", "title": "Ways to improve the ownership economy", "body": "***🎯 Update:** WOW. Target reached! We are overwhelmed by the support for this [experiment](https://twitter.com/forefront__/status/1412056876787724291) in funding high quality public content. Thank you to all who have contributed by collecting the NFT. This essay is now permanently available to the public.*\n\n***\n\n*This is a guest post featuring [Austin Robey](https://twitter.com/austinrobey_), co-founder at [Ampled](https://twitter.com/ampl3d) in an FF exclusive.*\n\n\"The Ownership Economy\" is an idea coined by [Variant Fund](https://variant.fund/) investor Jesse Walden to describe emergent ways that crypto networks can be built, owned, and controlled by their users. It’s an outline for exciting new economic models that give networks the ability to create a more cooperative and equitable online economy. It’s also a counter-movement to extractive, proprietary, investor-owned platforms whose ownership structures create competing interests between their investors and their communities. \n\n![](https://images.mirror-media.xyz/publication-images/88bea002-c2b4-468f-8ddf-dc69c35b0079.png?height=1114&width=1980)\n\nJesse describes the ownership economy like this:\n\n> The ownership economy doesn’t always mean a literal distribution of tokens, stock options, or equity. It also doesn’t necessarily mean that an application or service is entirely built on a blockchain. Rather, it means that ownership — which may manifest in the form of novel economic rewards, platform governance, or new forms of social capital — can be a new keystone of user experiences, with plenty of design space to explore.\n\nAs a counter-framework against web 2.0 pitfalls, \"The Ownership Economy\" outlines how users can gain real power in emergent decentralized networks. Although \"The Ownership Economy\" represents a trend towards the creation of a more equitable online economy, words are important – and there is a risk that the word “ownership” may be misleading. \n\nTo start, there doesn’t seem to be a consensus about what \"ownership\" is.\n\n- Is ownership a metaphor for more agency? \n- Is ownership a way to share “exposure to upside”?\n- Is ownership a robust set of clear rights and responsibilities?\n\nCommunity ownership is a virtuous aspiration among web3 organizations. However, without an agreed upon definition or collective understanding of what ownership actually is, we may inadvertently dilute or abstract its meaning.\n\n### Risks of misinterpreting ownership \nIn the late aughts, there was a sense of optimism in tech, and a sentiment that tech-enabled web 2.0 platforms were \"democratizing\" things for everyday people. However, this idea of democratization never showed up where it mattered: in the boardroom and in corporate governance. Platforms were, by default, oligarchies controlled by founders or investors. Instead, what \"democracy\" really meant for common users was \"access\". We got access to things like image sharing, tweets, crowdfunding, information, and more. As users, we never got a seat at the table, or a say in how these platforms were run. At the same time, value from our user-generated data, art, content, and labor was extracted to enrich founders and investors.\n\nWeb 3.0 usage of the word \"ownership\" carries similar risks to the web 2.0 usage of the word \"democracy\". \n\nWhereas \"democracy\" was redefined to mean \"access\", \"ownership\" risks being abstracted away to mean little more than \"exposure to upside\". Yes, having the ability for users to capture more value is good, but does it qualify as \"ownership\"?\n\n[Twitter](https://twitter.com/austinrobey_/status/1366237014841053185)\n\n### Why ownership is important\nConcentrated ownership is one the primary drivers of wealth inequality today. In tech, the ownership gap between platform owners and platform users continues to grow – and has real consequences. \n\n[If Apple were structured as a worker-owned cooperative](https://www.forbes.com/sites/cameronkeng/2014/12/18/if-apple-was-a-worker-cooperative-each-employee-would-earn-at-least-403k/), the ownership stake of each of its 150,000 workers would be worth over $15m. On top of that, each employee would receive an annual dividend of over $400k. Ownership creates wealth, and its concentration helps create wealth inequality.\n\nWhile musicians faced an existential crisis during a pandemic, Spotify CEO Daniel Ek’s ownership stake in Spotify climbed to be worth over $4 billion. In order to earn $4 billion, a musician earning the median wage of $25,000 would have to work for 160,000 years – in other words, they’d have to have started working before human history began.\n\nYancey Strickler, Co-founder of Kickstarter, writes about concentrated ownership in his essay, [\"The Ownership Crisis\"](https://ystrickler.medium.com/the-ownership-crisis-55a5f84c3e88).\n\n> *Despite many people contributing to the tools and services that now dominate our lives, most people have no stake in them. To cite just one example, the four million people who drive for Uber probably own less of the company combined than a single dentist in New Jersey with Vanguard in their portfolio.*\n\n> *People with ownership — virtually all of whom are already wealthy — will become increasingly wealthier. People without ownership — everyone else — will become increasingly not. Soon it will be hard to see anything else.*\n\nShared ownership models will become a critical cornerstone for building a fairer and equitable online economy. In tech, we should not only work to create greater access to ownership, but also reinforce a definition of ownership that is ambitious and capable of delivering meaningful systems change. \n\n### What is ownership?\nOwnership can be understood as a proxy for two things: decision making power and financial power. This suite of benefits includes the ability to have a voice in the direction, strategy, operations, or fate of a company; as well as the ability to capture profits and the value of its equity and assets.\n\n*Ownership = (Financial power + Decision making power)*\n\nBoth financial power and decision making power are elements of ownership that can be broken down into sets of distinct rights and responsibilities, often on a spectrum.\n\n![](https://images.mirror-media.xyz/publication-images/0d8968ff-9036-451e-880a-71b22acf2950.jpg?height=1440&width=2560)\n\nLooking at the current web 3.0 landscape through this lens, we can examine the ways that organizations within \"The Ownership Economy\" can improve.\n\n### Financial Power: Transparent Investments & Agreements \n\nOne of the most overlooked elements of ownership in the web 3.0 space is financial transparency, particularly regarding investments and agreements. As an example, investment announcements ([like this](https://finance.yahoo.com/news/zora-gets-nft-funding-craze-212329286.html)) may share that an investment was made, but won’t openly share what investors actually purchased. If the goal of a crypto network is to become \"community owned\", it would seem logical to disclose investment deal structures and details to their community. \n\nConsider a real-world example: Imagine you are a part owner of a bakery. Next, imagine there is another owner who has entered into financial agreements with third parties, but you are not allowed to access the terms. Would this arrangement seem like true ownership?\n\nIf a crypto network is raising money from investors, demonstrating a reasonable level of transparency is an easy thing to do. All it would take is a blog post. For example, an announcement could say something like: \n\n> \"We raised x amount of money to do x. The deal was structured like this because our goal of community ownership is ____. Here's what it means for the larger ecosystem.\" \n\nIf the goal of \"progressive decentralization\" is to transition to community ownership, it would seem incongruent for early stage investments terms to be hidden from the community. In addition, opaque investment terms imply the community wasn’t given a chance to participate in the investment process.\n\nSome questions to consider:\n\n- What are investors purchasing with their investment?\n- How does this impact the path towards community ownership?\n- Why not share investment deal terms with the community?\n\n[Twitter](https://twitter.com/austinrobey_/status/1399365878718910469)\n\n### Financial Power: Transparent Compensation\n\nOften in the web 3.0 space, there is an analogous comparison given to digital cooperatives. While many DAOs do disclose compensation for full time workers, existing cooperatives are much better than crypto networks at sharing these details. As an example, look at this publicly available [Executive Compensation Report](https://www.rei.com/about-rei/executive-compensation) by REI Co-op. Disclosures of compensation within crypto networks should become a core standard in order to demonstrate real community ownership.\n\n- How are founders and executives getting paid?\n- What is the compensation package and structure?\n- How are \"advisors\" compensated?\n\n![](https://images.mirror-media.xyz/publication-images/78003790-a571-4dcc-a6b1-697d808027d5.jpg?height=1440&width=2560)\n\n### Decision Making Power: Treasury & Board Codetermination\n\nIn corporate governance, \"codetermination\" refers to workers or other stakeholders having representatives on the board of directors. It’s a step towards collective governance that any company can take to create a more democratic workplace. \n\nFor networks that aim to be community owned, there should be some form of codetermination at the outset, allowing community proxies or representatives to be involved in treasury-related decisions -- particularly around token allocation.\n\nSome questions to consider:\n\n- Who decides how tokens are allocated?\n- Who controls access to the treasury?\n- If tokens = ownership, who makes decisions around distributing ownership?\n\n### Strengthening community ownership: community investments\n\nBy default, platforms today are owned by founders and investors, not communities. If the goal for networks is to be community owned, then there is a tacit implication (even by VCs investing in the \"ownership economy\") that community ownership is preferable to investor ownership.\n\n![](https://images.mirror-media.xyz/publication-images/e8e5c05b-d0bf-47dd-b60c-b2ac36c3db7a.jpeg?height=1440&width=2560)\n\nThis is the primary defining characteristic of a community-owned platform: less investor ownership. In order for communities to achieve greater ownership, investors need to own less. In order for communities to have greater financial power, investors must have less. In order for communities to have greater decision making power, investors must have less.\n\nTo create stronger community ownership, web 3.0 networks should move away from resourcing startup capital from centralized, opaque, and hierarchical VCs (often with undisclosed LPs), and ideally receive funding directly from stakeholders. Instead, as an alternative to venture capitalists, \"The Ownership Economy\" would be better served by transparent investments through worker self-directed investment DAOs, controlled directly by organized laborers. These worker self-directed DAOs could have more flexible, social or community-driven investment theses that aren’t bound by a fiduciary responsibility to seek outsized financial returns for LPs.\n\n### Strengthening community ownership: industry standards\n\nIn order to preserve its meaning, I believe we need an agreed upon set of criteria to evaluate \"community ownership\". Currently, [any platform](https://bitclout.com/) can claim to be \"owned\" by its users, and there is no real shared standard for gauging how true this is.\n\nI would suggest the development of a Community Ownership Assessment like the B Corp Impact Assessment, which scores companies based on criteria like impact on workers, community, customers, and corporate governance. A Community Ownership Assessment could take into account forms of transparency, equitable token distribution, and democratic participation.\n\n### Conclusion\n\n\"The Ownership Economy\" is an important idea. It outlines a promising movement to bring more power to users and help communities capture more of the value they generate. It’s an important enough idea that it deserves greater scrutiny and higher standards that will allow organizations to live up to the promise of its thesis: the development of new economic models for networks that are built, owned, and operated by their users.\n\n***\n\n[Ways to improve the ownership economy](edition://0x3725CA6034bcDBc3c9aDa649d49Df68527661175?editionId=25)\n\n*If you enjoyed this post, be sure to leave a tip. It will automatically be distributed to all contributors! Thank you!*\n\n[Ways to improve the ownership economy](split://0x2C75D09C7f971bc4424CdCc08a82697C806a27F2?network=mainnet)\n\n", "timestamp": 1625544372, "digest": "ZRsr5HZMfbHOEe2lIYoWinRCI65NlvDW_QzEu1rn7As", "contributor": "0xaBaF40768e575bEb3244df2853A0505Cb2D2e4bB"}
{"id": "GMnkGg1YEogjl17GuzjaoCztkFZKfIyWUhbfQbaI-AA", "title": "Web3 primer: setting up your cryptowallet & buying your first NFT", "body": "Recently I've written a lot about web3 use cases, from [organising raves as DAOs](https://www.musicxtechxfuture.com/2021/06/08/the-community-owned-rave-event-organisers-as-daos/), to [1,000 true fan organisations](https://www.musicxtechxfuture.com/2021/06/01/the-decentralized-autonomous-1000-true-fan-organisation/), to the [basics of bootstrapping a DAO](https://www.musicxtechxfuture.com/2021/06/22/blockchain-basics-how-to-start-a-dao/). \n\nIn order to get more of you actively participating, this post goes into something more practical: setting up a wallet & acquiring an NFT. I've set it up as a video:\n\nhttps://www.youtube.com/watch?v=p0OByzktIaA\n\nA step-by-step guide on:\n* How to set up a cryptowallet using **Metamask**\n* Adding cryptocurrency to your wallet using **Coinbase**\n* Buying your first NFT on **ENS**\n* Monitoring transactions on **Etherscan**\n* Giving your wallet a nice address like basgras.eth or musicxblockchain.eth\n\nLinks:\nhttps://metamask.io/\nhttps://www.coinbase.com/\nhttps://ens.domains/\n\nI spent about $50 on gas fees and .eth addresses in order to create this video. This is why I have a [Patreon community for MUSIC x](https://patreon.com/musicx) whose contributions help me cover the costs associated with running the sites & newsletter. Thank you! 🖤\n\nIf you want to put your new wallet to use and would like a more Web3 method to contribute, you can send a tip to this smart contract, which will then automatically split your tip to the musicxblockchain.eth and basgras.eth wallets. ETH in the former wallet will be used to fund future projects.\n\n[MUSIC x Blockchain](split://0x31F5242b4BaEA2e1AEeC0e8181C66C5B224eE96c?network=mainnet)\n\n-\n***MUSIC x is a regular [newsletter](http://musicx.email/) about innovation in music, subscribed to by thousands of people in music, entertainment & tech.**\nFollow us on Twitter [@musicxnetwork](https://twitter.com/musicxnetwork).*\n", "timestamp": 1625550860, "digest": "aFsodqVCC0JTCQ48z002Gecdkq0w9-2tGa-YqXp3BB0", "contributor": "0xe612d9C2a9bA0Ff4403F4f7Ea87D5bE4290aC7B9"}
{"id": "um1R7MQPvKvZCmifVPg-66sjwrZR-bpdFYuGHHW20YY", "title": "Web3 primer: setting up your cryptowallet & buying your first NFT", "body": "Recently I've written a lot about web3 use cases, from [organising raves as DAOs](https://www.musicxtechxfuture.com/2021/06/08/the-community-owned-rave-event-organisers-as-daos/), to [1,000 true fan organisations](https://www.musicxtechxfuture.com/2021/06/01/the-decentralized-autonomous-1000-true-fan-organisation/), to the [basics of bootstrapping a DAO](https://www.musicxtechxfuture.com/2021/06/22/blockchain-basics-how-to-start-a-dao/). \n\nIn order to get more of you actively participating, this post goes into something more practical: setting up a wallet & acquiring an NFT. I've set it up as a video:\n\nhttps://www.youtube.com/watch?v=p0OByzktIaA\n\nA step-by-step guide on:\n* How to set up a cryptowallet using **Metamask**\n* Adding cryptocurrency to your wallet using **Coinbase**\n* Buying your first NFT on **ENS**\n* Monitoring transactions on **Etherscan**\n* Giving your wallet a nice address like basgras.eth or musicxblockchain.eth\n\nLinks:\nhttps://metamask.io/\nhttps://www.coinbase.com/\nhttps://ens.domains/\n\nI spent about $50 on gas fees and .eth addresses in order to create this video. This is why I have a [Patreon community for MUSIC x](https://patreon.com/musicx) whose contributions help me cover the costs associated with running the sites & newsletter. Thank you! 🖤\n\nIf you want to put your new wallet to use and would like a more Web3 method to contribute, you can send a tip to this smart contract, which will then automatically split your tip to the musicxblockchain.eth and basgras.eth wallets. ETH in the former wallet will be used to fund future projects. As always: only if you can afford it. My goal is for MUSIC x to be freely accessible with as few barriers as possible.\n\n[MUSIC x Blockchain](split://0x31F5242b4BaEA2e1AEeC0e8181C66C5B224eE96c?network=mainnet)\n\n-\n***MUSIC x is a regular [newsletter](http://musicx.email/) about innovation in music, subscribed to by thousands of people in music, entertainment & tech.**\nFollow us on Twitter [@musicxnetwork](https://twitter.com/musicxnetwork).*\n", "timestamp": 1625550998, "digest": "aFsodqVCC0JTCQ48z002Gecdkq0w9-2tGa-YqXp3BB0", "contributor": "0xe612d9C2a9bA0Ff4403F4f7Ea87D5bE4290aC7B9"}
{"id": "k43isv8KVOFAxY2efl8RNneq4kj8uVwpEtoy7dpsikg", "title": "Web3 primer: setting up your cryptowallet & buying your first NFT", "body": "Recently I've written a lot about web3 use cases, from [organising raves as DAOs](https://www.musicxtechxfuture.com/2021/06/08/the-community-owned-rave-event-organisers-as-daos/), to [1,000 true fan organisations](https://www.musicxtechxfuture.com/2021/06/01/the-decentralized-autonomous-1000-true-fan-organisation/), to the [basics of bootstrapping a DAO](https://www.musicxtechxfuture.com/2021/06/22/blockchain-basics-how-to-start-a-dao/). \n\nIn order to get more of you actively participating, this post goes into something more practical: setting up a wallet & acquiring an NFT. I've set it up as a video:\n\nhttps://www.youtube.com/watch?v=p0OByzktIaA\n\nA step-by-step guide on:\n* How to set up a cryptowallet using **Metamask**\n* Adding cryptocurrency to your wallet using **Coinbase**\n* Buying your first NFT on **ENS**\n* Monitoring transactions on **Etherscan**\n* Giving your wallet a nice address like basgras.eth or musicxblockchain.eth\n\nLinks:\nhttps://metamask.io/\nhttps://www.coinbase.com/\nhttps://ens.domains/\n\nI spent about $50 on gas fees and .eth addresses in order to create this video. This is why I have a [Patreon community for MUSIC x](https://patreon.com/musicx) whose contributions help me cover the costs associated with running the sites & newsletter. Thank you! 🖤\n\nIf you want to put your new wallet to use and would like a more Web3 method to contribute, you can send a tip to this smart contract, which will then automatically split your tip to the musicxblockchain.eth and basgras.eth wallets. ETH in the former wallet will be used to fund future projects. As always: only if you can afford it. My goal is for MUSIC x to be freely accessible with as few barriers as possible.\n\n[MUSIC x Blockchain](split://0x31F5242b4BaEA2e1AEeC0e8181C66C5B224eE96c?network=mainnet)\n\nTip: if you want to follow along using a cheaper method, you can also use the **Tezos** blockchain. It uses a '[Liquid Proof of Stake](https://medium.com/tezos/liquid-proof-of-stake-aec2f7ef1da7)' consensus mechanism, which is more efficient, so lower gas fees and [cleaner environmentally-speaking](https://medium.com/tqtezos/clean-nfts-on-tezos-58566b2fdba1). For Tezos, you can use the [Temple wallet](https://templewallet.com/) and register your domain on [Tezos Domains](https://tezos.domains/).\n\n-\n***MUSIC x is a regular [newsletter](http://musicx.email/) about innovation in music, subscribed to by thousands of people in music, entertainment & tech.**\nFollow us on Twitter [@musicxnetwork](https://twitter.com/musicxnetwork).*\n", "timestamp": 1625551708, "digest": "aFsodqVCC0JTCQ48z002Gecdkq0w9-2tGa-YqXp3BB0", "contributor": "0xe612d9C2a9bA0Ff4403F4f7Ea87D5bE4290aC7B9"}
{"id": "Lb5lw6KjXkfEYC9qtE0yW6QRBTJ32bfxXzI1b9y9muU", "title": "Web3 primer: setting up your cryptowallet & buying your first NFT", "body": "Recently I've written a lot about web3 use cases, from [organising raves as DAOs](https://www.musicxtechxfuture.com/2021/06/08/the-community-owned-rave-event-organisers-as-daos/), to [1,000 true fan organisations](https://www.musicxtechxfuture.com/2021/06/01/the-decentralized-autonomous-1000-true-fan-organisation/), to the [basics of bootstrapping a DAO](https://www.musicxtechxfuture.com/2021/06/22/blockchain-basics-how-to-start-a-dao/). \n\nIn order to get more of you actively participating, this post goes into something more practical: setting up a wallet & acquiring an NFT. I've set it up as a video:\n\nhttps://www.youtube.com/watch?v=p0OByzktIaA\n\nA step-by-step guide on:\n* How to set up a cryptowallet using **Metamask**\n* Adding cryptocurrency to your wallet using **Coinbase**\n* Buying your first NFT on **ENS**\n* Monitoring transactions on **Etherscan**\n* Giving your wallet a nice address like basgras.eth or musicxblockchain.eth\n\nLinks:\nhttps://metamask.io/\nhttps://www.coinbase.com/\nhttps://ens.domains/\n\nI spent about $50 on gas fees and .eth addresses in order to create this video. This is why I have a [Patreon community for MUSIC x](https://patreon.com/musicx) whose contributions help me cover the costs associated with running the sites & newsletter. Thank you! 🖤\n\nIf you want to put your new wallet to use and would like a more Web3 method to contribute, you can send a tip to this smart contract, which will then automatically split your tip to the musicxblockchain.eth and basgras.eth wallets. ETH in the former wallet will be used to fund future projects. As always: only if you can afford it. My goal is for MUSIC x to be freely accessible with as few barriers as possible.\n\n[MUSIC x Blockchain](split://0x31F5242b4BaEA2e1AEeC0e8181C66C5B224eE96c?network=mainnet)\n\nTip: if you want to follow along using a cheaper method, you can also use the Tezos blockchain. It uses a '[Liquid Proof of Stake](https://medium.com/tezos/liquid-proof-of-stake-aec2f7ef1da7)' consensus mechanism, which is more efficient, so lower gas fees and [cleaner environmentally-speaking](https://medium.com/tqtezos/clean-nfts-on-tezos-58566b2fdba1). For Tezos, you can use the [Temple wallet](https://templewallet.com/) and register your domain on [Tezos Domains](https://tezos.domains/).\n\n-\n***MUSIC x is a regular [newsletter](http://musicx.email/) about innovation in music, subscribed to by thousands of people in music, entertainment & tech.**\nFollow us on Twitter [@musicxnetwork](https://twitter.com/musicxnetwork).*\n", "timestamp": 1625551682, "digest": "aFsodqVCC0JTCQ48z002Gecdkq0w9-2tGa-YqXp3BB0", "contributor": "0xe612d9C2a9bA0Ff4403F4f7Ea87D5bE4290aC7B9"}
