{"id": "saG4_BkzrZbI4uREq-FZE7oXE0sEb4pj7QGX9PNR_Yo", "title": "Additive and Subtractive Hard Forks", "body": "*👋 Note: Originally published August 15, 2016 on [Medium](https://jjmstark.medium.com/additive-and-subtractive-hard-forks-6324f1822878).*\n\n\n---\n\nWhile thinking about the lessons of [the DAO hard fork](http://www.coindesk.com/ethereum-executes-blockchain-hard-fork-return-dao-investor-funds/) I’ve been reaching for terminology necessary to make a useful distinction, and thought it would be useful to set it out here.\n\nThe DAO hard fork was controversial. Some believe that forking the network to return stolen funds was a betrayal of the basic principles that animate the ethereum project. Others viewed it as a pragmatic solution that, though it shouldn’t be used often, was necessary in this case.\n\nHard forks will often be contentious, even when they are [changing the protocol](https://en.bitcoin.it/wiki/Block_size_limit_controversy) rather than “undoing” the history of transactions. Because a hard fork will, by definition, break backwards-compatibility, the entire community must agree on a change in order to continue together on the same blockchain. If unanimity is not achieved, the minority can reject the change by [continuing as a distinct blockchain.](https://bitcoinmagazine.com/articles/rejecting-today-s-hard-fork-the-ethereum-classic-project-continues-on-the-original-chain-here-s-why-1469038808)\n\nWhen a hard fork is proposed, we debate the merits of the change that it would introduce. Will rescuing the DAO funds set a bad precedent? Will increasing the block size centralize the bitcoin network? Typically, then, when people say that a hard fork is “good” or “bad” they are commenting on whether the changes introduced by the hard fork ought to be accepted or rejected.\n\nBut as we’ve seen in this case, sometimes a minority cannot be persuaded and they decide to continue with their own blockchain. The hard-fork results in two blockchains, diverging from a common ancestor. Let’s call this a **contested fork**.\n\nThe possibility of a contested fork requires us to ask a second-order question: **when is it good that the network diverges after a hard fork?** When is it bad? What are the benefits and costs of either?\n\nIn some cases, diverging into two blockchains might benefit both chains. First, it’s possible that a blockchain could want to grow in two different directions that are, for some reason, mutually exclusive. For example, imagine a blockchain wants to add a new feature “A” that, while adding some utility, would reduce the ability of that blockchain to perform a different function “B”. Those who place more importance on feature A will support the fork, and those who place more importance on feature B will advocate rejecting the fork. In that case, splitting into two blockchains might be for the best if it allows each project to pursue a distinct feature set.\n\nA contentious fork could also be a good thing where there is a sincere ideological divide within that blockchain’s community. If the community is divided into two populations that have a different set of beliefs about what values and principles ought to guide decision-making about that blockchain, then it might be that each would be able to better govern their blockchains separately, rather than have to argue and compete within the confines of a single platform, resulting in gridlock or ineffective decision making. In other words, it may be the case that the governance priorities of the blockchain’s community cannot be reconciled.\n\nBut splitting a blockchain into two also has costs. First, each chain will individually have less hashing power than their shared ancestor, lowering the cost of mounting a 51% attack against either continuing chain. Second, blockchains benefit from network effects: the whole platform has more value when there are more people using it and building applications on it. Splitting the community of developers and companies between two blockchains could, the argument goes, slow development of the overall ecosystem.\n\nClarifying the benefits and costs of a contested fork gives us a simple framework for assessing them. When the benefits of a contested fork outweigh the costs, let’s call that an **additive fork**. The resulting separate chains are, on the whole, more valuable than when they were a single chain.\n\nWhen the opposite is true — when the loss of network effects and cooperation outweighs the benefits of continuing as separate chains — lets call that a **subtractive fork.**\n\nWhenever a hard fork is proposed, we need to have two discussions: first, whether the change introduced by the hard fork should be accepted. When the community does not reach a unanimous view on the first question, we need to ask the second: in light of that disagreement, is it worth splitting the network? Would this divergence be **additive** or **subtractive** to the system as a whole?\n\nOf course, making this distinction doesn’t help us answer the question itself. A lot of the factors that determine whether a fork is additive or subtractive are speculative or novel. A fork that appears additive may still end with the minority chain withering away, even if it had great potential in the beginning.\n\nMoreover, the factors that determine whether a fork is additive or subtractive will likely change over time. When there is a much larger developer community, it may be less costly to split them between two distinct blockchains. When the ethereum platform is more feature-complete and the value of ether is tied more to present capabilities than future expectations, reducing active development on one chain or another might be less important to us. And when it is easier for different chains to interoperate, the costs of splitting them might be far less than today.", "timestamp": 1632079257, "digest": "ta5dETh78GEPOIsp7auYELNsOm_8_UUQy-CT6aZK0O8", "contributor": "0x4aa9C5546BE68486c4eF264a230D25674a1A728e"}
{"id": "wupev7bJ2lG0NkkGLjtDm3pdT0-MSEASmUTlvbtVBjI", "title": "Making Sense of Cryptoeconomics", "body": "*👋 Note: Originally published in August 2017 on [Coindesk](https://www.coindesk.com/markets/2017/08/19/making-sense-of-cryptoeconomics/) and [Medium](https://medium.com/l4-media/making-sense-of-cryptoeconomics-c6455776669).*\n\n\n---\n\nA few months ago Parker Thompson, a well known Silicon Valley VC, [tweeted](https://twitter.com/pt/status/871473661101850624) that “the concept of crypto-economics is stupid. It’s economics. Inventing your own word is just an excuse to ignore well-understood concepts.”\n\n**The term “cryptoeconomics” causes a lot of confusion.** People are often unclear on what it is supposed to mean. The word itself can be misleading, as it suggests that there is a parallel “crypto” version of the whole of economics. This is wrong, and Parker is right to mock such a generalization.\n\n**In simple terms, cryptoeconomics is the use of incentives and cryptography to design new kinds of systems, applications, and networks**. Cryptoeconomics is specifically about *building* things, and has most in common with [mechanism design](https://en.wikipedia.org/wiki/Mechanism_design) — an area of mathematics and economic theory.\n\nCryptoeconomics is not a subfield of economics, but rather an area of applied cryptography that takes economic incentives and economic theory into account. Bitcoin, Ethereum, zcash and all other public blockchains are products of cryptoeconomics.\n\nCryptoeconomics is what makes blockchains interesting, what makes them different from other technologies. As a result of [Satoshi’s white paper](https://bitcoin.org/bitcoin.pdf), we have learned that through the clever combination of cryptography, networking theory, computer science and economic incentives we can build new kinds of technologies. These new cryptoeconomic systems can accomplish things that these disciplines could not achieve on their own. Blockchains are just one product of this new practical science.\n\nThis article aims to explain cryptoeconomics in clear, simple terms. **First**, we examine Bitcoin as an example of cryptoeconomic design. **Second**, we consider how cryptoeconomics relates to economic theory in general. **Third**, we look at three different areas of cryptoeconomic design and research that are active today.\n\n## **1. What is cryptoeconomics? Bitcoin as a case study**\n\nBitcoin is a product of cryptoeconomics.\n\nBitcoin’s innovation is that it allows many entities who do not know one another to reliably reach consensus about the state of the bitcoin blockchain. This is achieved using a combination of economic incentives and basic cryptographic tools.\n\n**Bitcoin’s design relies on economic incentives and penalties**. Economic rewards are used to enlist miners to support the network. Miners contribute their hardware and electricity because if they produce new blocks, they are rewarded with amounts of bitcoin.\n\nSecond, economic costs or penalties are part of bitcoin’s security model. The most obvious way to attack the bitcoin blockchain would be to gain control of a majority of the network’s hashing power — a so-called [51 percent attack](https://bitcoin.stackexchange.com/questions/658/what-can-an-attacker-with-51-of-hash-power-do) — which would let an attacker reliably censor transactions and even change the past state of the blockchain.\n\nBut gaining control of hashing power costs money, in the form of hardware and electricity. Bitcoin’s protocol ***intentionally*** makes mining difficult, meaning that gaining control of a majority of the network is extremely expensive — enough that it would be hard to profit from the attack. As of August 16, 2017, the [cost of a 51 percent attack on bitcoin](https://gobitcoin.io/tools/cost-51-attack/) would be around $1.88 billion in hardware and $3.4 million in electricity every day.\n\nWithout these carefully calibrated economic incentives, bitcoin wouldn’t work. If mining did not come with a high cost, it would be easy to launch a 51 percent attack. If there were no mining reward, there would be no industry of people who buy hardware and pay for electricity to contribute to the network.\n\nBitcoin also relies on cryptographic protocols. [Public-private key cryptography](https://security.stackexchange.com/questions/25741/how-can-i-explain-the-concept-of-public-and-private-keys-without-technical-jargo) is used to give individuals safe, exclusive control of their bitcoin. [Hash functions](https://medium.com/@ConsenSys/blockchain-underpinnings-hashing-7f4746cbd66b) are used to “link” each block in the bitcoin blockchain, proving an order of events and the integrity of past data.\n\nCryptographic protocols like these give us the basic tools necessary to build reliable, secure systems like Bitcoin. Without something like public-private key infrastructure, we could not guarantee to a user that they have exclusive control over their bitcoin. Without something like hashing functions, nodes would not be able to guarantee the integrity of the history of bitcoin transactions contained in Bitcoin’s blockchain.\n\nWithout the hardness of cryptographic protocols like hashing functions or public-private key cryptography, we would have no secure unit of account with which to reward miners — no confidence that our record of past accounts was authentic and exclusively controlled by a rightful owner. Without a carefully calibrated set of incentives to reward an industry of miners, that unit of account could have no market value because there would be no confidence that the system could persist into the future.\n\nIn this way, bitcoin’s design requires an understanding of both cryptography and how incentives affect the security properties and functionality of systems built with cryptography. Cryptoeconomics is strange and counterintuitive. Most of us are not used to thinking of money as a design or engineering problem, nor are we used to economic incentive design being an essential component of a new technology. Cryptoeconomics requires us to [think about information security problems in economic terms](https://youtu.be/u6VSPD5TrP4?t=6m11s).\n\nOne of the most common mistakes in this industry is made by those who view blockchains only through a lens of computer science or applied cryptography. We have a strong tendency to prioritize the things we are most comfortable with, and see things outside of our domain of expertise as less important.\n\nIn blockchain technology, this leads many people to assume or abstract away the crucial role of economic incentives. This is one reason we see meaningless phrases like “[blockchains are trustless](https://medium.com/@ntmoney/trustless-is-a-misnomer-956066661b79)”, “[bitcoin is backed only by math](https://bitcoin.org/en/faq#why-do-bitcoins-have-value)” or “[blockchains are immutable](https://www.coindesk.com/blockchain-immutability-myth/).” **These are all wrong in their own way, but all have the effect of obfuscating the essential role of a large network of people whose necessary participation in the network is maintained through economic incentives.**\n\nCryptoeconomic systems like bitcoin ***feel*** like magic to someone who views them only as a product of computer science, because bitcoin can do things that computer-science alone could never accomplish. Cryptoeconomics isn’t magic — it’s just interdisciplinary.\n\n## **2. How does it relate to economics more generally?**\n\nThe term cryptoeconomics can be misleading because it suggests a comparison to economics as a whole. This is part of what leads people like Parker to dismiss the term. Economics is the study of choice: how people and groups of people respond to incentives. The invention of cryptocurrency and blockchain technology does not require a new theory of human choice — the humans haven’t changed. Cryptoeconomics is *not* the application of macroeconomic and microeconomic theory to cryptocurrency or token markets.\n\nCryptoeconomics has most in common with mechanism design, a field related to game theory. In game theory, we look at a given strategic interaction (a “game”) and then try to understand the best strategies for each player, and the likely outcome if both players follow those strategies. For instance, we might use game theory to look at a negotiation between two firms, relations between countries or even evolutionary biology.\n\nMechanism design is often referred to as *reverse* game theory because we start with a desired outcome and then work backwards to design a game that, if players pursue their own self interest, will produce the outcome we want. For instance, imagine we are responsible for designing the rules of an auction. We have an objective that we want bidders to *actually* bid the real value they place on an item. To achieve this, we apply economic theory to design the auction as a game [where the dominant strategy for any player is to always bid their true value](https://en.wikipedia.org/wiki/Vickrey_auction#Proof_of_dominance_of_truthful_bidding). One solution to this problem is called a [Vickrey auction](https://en.wikipedia.org/wiki/Vickrey_auction#Proof_of_dominance_of_truthful_bidding), where bids are secret and the winner of the auction (defined as the player with the highest bid) only pays the second highest amount that was bid.\n\nCryptoeconomics, like mechanism design, focuses on designing and creating systems. Like in our auction example, we use economic theory to design “rules” or mechanisms that produce a certain equilibrium outcome. **But in cryptoeconomics, the mechanisms used to create economic incentives are built using [cryptography and software](https://docs.google.com/presentation/d/1-2NMcrqWOvrjcDTjiYfLHc5cNNsMpzq6FodDVkfDNZE/edit#slide=id.g6eb8cd7660a986c30)** and the systems we are designing are almost always **[distributed or decentralized](https://medium.com/@VitalikButerin/the-meaning-of-decentralization-a0c92b76a274)**.\n\nBitcoin is a product of this approach. Satoshi wanted bitcoin to have certain properties — for instance, that it be able to reach consensus about its internal state and that it be censorship-resistant. Then, Satoshi set out to design a system that would achieve those properties, assuming people responded in rational ways to economic incentives.\n\nMost often, cryptoeconomics is used to provide a ***security guarantee*** about a distributed system. For instance, we have a cryptoeconomic security guarantee that the bitcoin blockchain is secure against a 51 percent attack *unless* someone is [willing to spend a few billion dollars](https://gobitcoin.io/tools/cost-51-attack/). Or, in a state channel — a topic we discuss later — we can have a cryptoeconomic security guarantee that an off-chain process is nearly as secure and final as an on-chain transaction.\n\nIt is worth noting that mechanism design is not a panacea. **There is a limit to how much we can rely on incentives to predictably shape future behaviour.** As [Nick Szabo rightly points out](https://twitter.com/nickszabo4/status/882738070616809472), ultimately we are speculating about people’s future mental states and making assumptions about how they react to certain incentives. A cryptoeconomic system’s security guarantee depends in part on the strength of its assumptions about how people react to economic incentives.\n\n## **3. Three examples of cryptoeconomics**\n\nThere are at least three different kinds of systems being designed today that could be called “cryptoeconomic”.\n\n***Example 1***: Consensus protocols\n\nBlockchains are able to reach reliable consensus without having to rely on a central trusted party — a product of cryptoeconomic design. Bitcoin’s solution, which we surveyed above, is called “proof-of-work” consensus because miners must commit work — in the form of hardware and electricity — in order to participate in the network and receive mining rewards.\n\nImproving proof-of-work systems and designing alternatives to them is one active area of cryptoeconomic research and design. Ethereum’s current proof-of-work consensus mechanism includes many variations and improvements on the original design, enabling [faster block times](https://blog.ethereum.org/2015/09/14/on-slow-and-fast-block-times/) and being more [resistant to the mining centralization that can result from ASICs](https://ethereum.stackexchange.com/questions/16811/is-ethereum-asic-resistant).\n\nIn the near future, Ethereum plans to migrate to a “proof-of-stake” consensus protocol called Casper. This is an alternative to proof-of-work that does not require “mining” in the usual sense: there is no need for specialized mining hardware or huge expenditures of electricity.\n\nRemember that the whole point of requiring miners to buy hardware and spend electricity is to impose a cost on miners, as a way of raising the cumulative cost of attempting a 51 percent attack sufficiently high that it becomes too expensive. The idea behind proof-of-stake systems is to use deposits of cryptocurrency to create the same disincentive, rather than real-world investments like hardware and electricity.\n\nIn order to mine in a proof-of-stake system, you must commit a certain amount of ether into a smart contract “bond.” Just like in proof-of-work, this raises the cost of a 51 percent attack — an attacker would have to commit a very large amount of ether to successfully attack the network, which they would then lose forever.\n\nCasper is being designed by [Vlad Zamfir](https://medium.com/u/aa9bb0a9d2ad?source=post_page-----c6455776669--------------------------------), [Vitalik Buterin](https://medium.com/u/587a00dbce51?source=post_page-----c6455776669--------------------------------), and others at the Ethereum Foundation. You can read more about the history of Casper’s design [in this series of posts by Zamfir](https://medium.com/@Vlad_Zamfir/the-history-of-casper-part-1-59233819c9a9) or hear him talk about it on a [recent podcast](https://www.youtube.com/watch?v=9nQPcNY32JQ). Buterin wrote a long post about Casper’s design philosophy [here](https://medium.com/@VitalikButerin/a-proof-of-stake-design-philosophy-506585978d51), and there is a useful FAQ on the Ethereum GitHub wiki [here](https://github.com/ethereum/wiki/wiki/Proof-of-Stake-FAQ).\n\n***Example 2:*** *Cryptoeconomic application design*\n\nOnce we have solved the fundamental problem of blockchain consensus, we are able to build applications that sit “on top” of a blockchain like Ethereum. The underlying blockchain gives us (1) a unit of value that can be used to create incentives and penalties, and (2) a toolkit with which we can design conditional logic in the form of “[smart contract code](https://www.coindesk.com/making-sense-smart-contracts/).” The applications we build with these tools can also be a product of cryptoeconomic design.\n\nFor instance, the prediction market [Augur](https://medium.com/u/f4d568271227?source=post_page-----c6455776669--------------------------------) requires cryptoeconomic mechanisms in order to function. Using its native token REP, Augur creates a [system of incentives](http://blog.augur.net/faq/how-does-reputation-rep-work/) that rewards users for reporting the “truth” to the application, which is then used to settle bets in the prediction market. This is the innovation that makes a decentralized prediction market possible. Another prediction market, [Gnosis](https://medium.com/u/98b26cdc56aa?source=post_page-----c6455776669--------------------------------), uses a similar method, though also lets users specify other mechanisms for determining true outcomes (commonly called “oracles”).\n\nCryptoeconomics is also applied to design token sales or ICOs. Gnosis, for instance, [used a “Dutch auction”](https://blog.gnosis.pm/introducing-the-gnosis-token-launch-3cc4cffb5098) as a model for its token auction, on the theory that this would result in a more fair distribution (an experiment that had [mixed results](http://vitalik.ca/general/2017/06/09/sales.html)). We mentioned earlier that one area where mechanism design has been applied is in the design of auctions, and token sales gives us a new opportunity to apply some of that theory.\n\nThese are a different kind of problem than building the underlying consensus protocols, but they share enough similarities that both can be fairly seen as cryptoeconomic. Building these applications requires an understanding of how incentives shape users’ behaviour and careful design of economic mechanisms that can reliably produce a certain result. They also require an understanding of the capabilities and limitations of the underlying blockchain on which the application is built.\n\nMany blockchain applications are *not* products of cryptoeconomics; for instance, applications like [Status](https://medium.com/u/fbf3ec9c4a40?source=post_page-----c6455776669--------------------------------) and [MetaMask](https://medium.com/u/17995a9c1d1c?source=post_page-----c6455776669--------------------------------) — wallets or platforms that let users interact with the Ethereum blockchain. These do not involve any additional cryptoeconomic mechanisms beyond those that are already part of the underlying blockchain.\n\n***Example 3:*** *State channels*\n\nCryptoeconomics also includes the practice of designing much smaller sets of interactions between individuals. The most notable of these are [state channels](http://www.jeffcoleman.ca/state-channels/). State channels are not an application but a valuable technique that can be used by most blockchain applications to become more efficient.\n\nA fundamental limitation of blockchain applications is that blockchains are expensive. Sending transactions requires fees, and using ethereum to run smart-contract code is [comparatively costly](https://hackernoon.com/ether-purchase-power-df40a38c5a2f) to other kinds of computation. The idea behind state channels is that we can make blockchains more efficient by moving many processes off-chain, while still retaining a blockchain’s characteristic trustworthiness, through the use of cryptoeconomic design.\n\nImagine Alice and Bob want to exchange a large number of small payments of cryptocurrency. The normal way for them to do this would be to send transactions to the blockchain. This is inefficient — it requires paying transaction fees and waiting for the confirmation of new blocks.\n\nInstead, imagine that Alice and Bob sign transactions that [could be submitted to the blockchain, but are not](http://www.jeffcoleman.ca/state-channels/). They pass these back and forth between one another, as fast as they want — there are no fees at this point, because nothing is actually hitting the blockchain yet. Each update “trumps” the last one, updating the balance between the parties.\n\nWhen Alice and Bob have finished exchanging small payments, they “close out” the channel by submitting the final state (i.e. the most recent signed transaction) to the blockchain, paying only a single transaction fee for an unlimited number of transactions between themselves. They can trust this process because both Alice and Bob know that each update passed between them *could* be sent to the blockchain. If the channel is properly designed, there is no way to cheat — say, by trying to submit a previous update as though it were the most recent — since recourse to the blockchain is always available.\n\nFor illustrative purposes, you can think of this as similar to how we interact with other trusted sources, like a legal system. When two parties sign a contract, most of the time they never need to take that contract to court and ask a judge to interpret and enforce it. If the contract is properly designed, both parties simply do what they promised to do, and never interact with the courts at all. The fact that either party could go to the court and have the contract enforced is enough to make the contract useful.\n\nThis technique is not just useful for payments, but for any update to the state of an Ethereum program — hence the more general term “state channel” rather than the narrow “payment channel.” Instead of sending payments back and forth, we can send updates to a smart contract back and forth. We can even send entire Ethereum smart contracts that, if needed, will be sent to the blockchain and executed. These programs never have to be executed to be useful. All that is needed is a sufficiently high guarantee that they [could be executed if necessary](https://github.com/ledgerlabs/state-channels/wiki/Counterfactual-Terminology).\n\nIn the future, most blockchain applications will use state channels in some form. It is almost always a strict improvement to require less on-chain operation, and many things done on-chain today can be moved into state channels while still preserving a sufficiently high guarantee to be useful.\n\nThe description above skips over many important details and nuances of how state channels work. For a more detailed description, Ledger Labs [built a toy implementation last summer](https://github.com/ledgerlabs/state-channels/wiki/Example-State-Channel) that demonstrates the basic concept.\n\n## **Conclusion**\n\nThinking about the blockchain space through the lens of cryptoeconomics is helpful. **Once you understand the idea, it helps to clarify many of the controversies and debates in our industry.**\n\nFor instance, “permissioned” blockchains that are centrally managed and do not use proof-of-work have been a source of constant controversy since they were first proposed. This area of work is often referred to as “distributed ledger technology” and is focused on financial and enterprise use cases. [Many partisans of blockchain technology dislike them](https://www.reddit.com/r/Bitcoin/comments/316sdy/to_ibm_stop_this_blockchain_nonsense_it_will/) — they may be blockchains in the literal sense, but there is something about them that feels wrong. They seem to reject the thing that many people see as the whole point of blockchain technology: being able to produce consensus without relying on a central party or traditional financial systems.\n\n**A cleaner way to make this distinction is between blockchains that are products of cryptoeconomics and blockchains that are not.** Blockchains that are simply distributed ledgers and do not rely on cryptoeconomic design to produce consensus or align incentives might be useful for some applications. But they are distinct from blockchains whose whole purpose is to use cryptography and economic incentives to produce consensus that could not exist before, like Bitcoin and Ethereum. These are two different technologies, and the clearest way of distinguishing between them is whether or not they are products of cryptoeconomics.\n\nSecondly, we should expect that there will be cryptoeconomic consensus protocols that do not rely on a literal chain of blocks. Obviously, such a technology would have something in common with blockchain technology as we call it today, but labelling them blockchains would be inaccurate. Again, the relevant organizing concept is whether such a protocol is the product of cryptoeconomics, not whether it is a blockchain.\n\nThe ICO craze has also focused attention on this distinction, though few have articulated it clearly. [Many](https://news.21.co/thoughts-on-tokens-436109aabcbe) [people](https://thecontrol.co/tokens-tokens-and-more-tokens-d4b177fbb443) [independently](https://medium.com/@datarade/criterion-for-high-fidelity-token-sales-1391ff20af20) [identified](https://www.coindesk.com/framework-valuing-crypto-tokens/) that one of the strongest signs of a token’s value is whether it forms a necessary component of the application to which it is connected. To put this in clearer terms, the question should be: is the token part of a necessary cryptoeconomic mechanism in the application? Understanding the mechanism design of a project holding an ICO is an essential tool in determining that token’s utility and likely value.\n\nIn the past years, we’ve moved from thinking about this new field solely through the lens of one application (Bitcoin), to thinking about it in terms of one underlying technology (blockchains). What needs to happen now is to step back once again and view this industry in terms of a unifying approach to solving problems: cryptoeconomics.\n\n*Thanks to Jeff Coleman, Ethan Wilding, and Vlad Zamfir for their comments on an earlier draft of this article.*", "timestamp": 1632080093, "digest": "nn67JunTBHw61nD3lvVEQnihl9KkySOhVKQdLzuK5oY", "contributor": "0x4aa9C5546BE68486c4eF264a230D25674a1A728e"}
{"id": "Lztw2KeAUpfAAH6Q-zoNAEBeRelLbQdRDKvZ23cnHSo", "title": "Hello World", "body": "Why are we here?\n\nWe believe artists lead culture. Their creativity and their vision are what help us sense-make as we progress our understanding of the world around us. Artists help us communicate complex ideas before we have the right words. They help us see the path ahead.\n\nWe love artists and want more of them to exist as artists in the world. This is the promise of web3.\n\nWe love collecting art and see cryptographic tokens as a way to do what we love while helping artists achieve financial freedom. Web3 requires zero compromise. Tokens are extremely innovative artist development tools. NFTs provide artists the opportunity to find their voice and communicate more clearly.\n\nPhlote is built amplify phenoms. We’re the ghostwriters, ghostproducers, ghosttalent that makes everything around you better, sometimes without anyone knowing it.  We make the suggestion so early it feels like intuition. We show you what’s coming next. We invest in quality art and the artists who make it. We support exceptional talent. \n\nWe will power an indie artists to a Grammy. We will sell an mp3 for $2 million. We will seed and help grow some of the world’s first global art super brands. The roadmap is there.\n\nThey say Web3 enables us to realign around shared values and goals, so here’s who we really are. Phlote is a community of givers. We believe great art transcends. And exist to help lead a global art revolution using crypto. \n\nWe're here to free the artists.\n\nHow do we do that?\n\nWe’re trying to figure it out and our thoughts are evolving.  But the goal is clear. A more creative world is a better one. So we’ll use this platform and others to free artists using crypto. We feel that anyone who believes their life’s work is valuable, would document it as an archive. So this  This goes for artists of all kinds. We must always also strive to show our future selves just how naive we were. \n\nOne day, we’ll all be much smarter, so today, I just want to show little we know. ", "timestamp": 1632101666, "digest": "RzPvnxUMmsWXzw9MALtY2NnMqDxYhZvNUhPghKoprSk", "contributor": "0xEf58304E292fBAeacFdeC25b67b3438031FdE313"}
{"id": "jvAQ-E3aFebU0VSz2nlA7by4AksFLwCRq24lb9aN3AY", "title": "Thoughts on trying to become a farmer during a pandemic and a country tearing itself apart", "body": "> “Shelf of a field, green, within easy reach, the grass on it not yet high, papered with blue sky through which yellow has grown to make pure green, the surface colour of what the basin of the world contains, attendant field, shelf between sky and sea, fronted with a curtain of printed trees, friable at its edges, the corners of it rounded, answering the sun with heat, shelf on a wall through which from time to time a cuckoo is audible, shelf on which she keeps the invisible and intangible jars of her pleasure, field that I have always known, I am lying raised up on one elbow wondering whether in any direction I can see beyond where you stop. The wire around you is the horizon.”\n>\n> From *Field*, by John Berger\n\nI’ve spent countless hours this year clearing land. The property where we live in New York was owned for about 30 years by a couple that rarely used it, and they long ago stopped mowing the fields that used to be cattle pasture. Trees have marched forward from the edges of the woods. Most of them are pines that grow a foot taller every year. Because we’re working to re-establish a farm on the property, a lot of these young pines have to go.\n\nClearing land is slow work when done alone with simple tools. Becoming comfortable and familiar with the chainsaw was easy enough; the thrilling part is when you see the trunk begin to lean away from you ever so slightly and then quickly snap with a gutteral creak. Very slowly and then all at once. The hard part is cleaning up: removing each small limb, moving them into a pile to burn or chip, then bucking the larger limbs into shorter pieces that can be piled into or dragged behind the pickup. The slowness of the cleaning is characterized by a certain zen. The removal of a living thing from the land, for something new to grow, is bittersweet.\n\nThere are a few chores that continue to feel like chores. Re-baiting the mousetraps is one. Unfolded laundry another. Maybe they’re the chores that are most familiar from the pre-farm days. Over time even the chainsaw, even the tractor, will sit unused, I guess.\n\nWe’d been seriously looking for a place to farm for about a year and a half before we ended up here. I’ve known for a long time that I wanted to live and raise children in a rural area, with a small local community. It’s not how I was raised, and it’s not how I have ever lived before a year ago. If I was forced to point to a moment early in life that set me on this trajectory, I could probably argue it was my time spent in IRC rooms and on small forums as an early teenager.\n\nFor anyone who lives in a city long enough, Nature becomes a place to go -- a public park on the way home from the subway; a state park 30 minutes away by car; a weeklong national park vacation. It’s a space safely entered and exited, supporting a subset of rare Human activities. Many of us acknowledge that it’s the home of Animals, and we generally agree the Animals deserve a home. Rarely is it appreciated for its entropic tendencies. Generally those tendencies are cast only in destructive terms.\n\nThis is not an essay about climate change. I’m not talking about the impending chaos of accelerating rates of hurricane formations. This is not about how Nature Is In Control (although I do believe that).\n\nRather, I’m interested in minimizing the boundaries between my (our) ordered human life and the messiness of the woods. I hesitate to push back those boundaries, even if it’s in service of developing a place that approaches a certain harmony between chaos and order. I get over this hesitation by walking around the property over and over, feeling how I move through it efficiently (when we need to find a path for the tractor or truck) or not (when we want a place that promotes wandering). Trying to imprint the contours of the land onto my body.\n\nBerger’s field is a field of activity, a theater. I first read the essay about 15 years ago. For most of my life since then, I saw the field as the entire space of concern, the zone that could impart meaning upon both spectator and participant. This seemed a useful and accurate metaphor. But now I understand the field is also a moment, and explicitly incomplete. It’s a pause. There are some creatures which leave the security of the woods, wander serenely through cleared land, and disappear again between trees. Some creatures leave the woods by mistake, and immediately turn back. The blackbirds spend most of their days out of the woods; “their coming and going remains quite unaffected by the trains.” For both Human and Animal, the field is an irregular interruption. But it might facilitate thoughtful reflection.\n\nNow I’m thinking about another Berger essay, *The Eaters and the Eaten*:\n\n> “The principal regular meal. For the peasant this meal is usually at midday; for the bourgeois it is usually dinner in the evening. The practical reasons for this are so obvious that they need not be listed. What may be significant is that the peasant meal is in the middle of the day, surrounded by work. It is placed in the day’s stomach. The bourgeois meal comes after the day’s work and marks the transition between day and evening. It is closer to the day’s head (if the day begins with getting to the feet) and to dreams.\n>\n> At the peasant’s table the relationship between implements, food and eaters is intimate, and a value is conferred on use and handling. Each person has his own knife which he may well take out of his pocket. The knife is worn, used for many purposes other than eating, and usefully sharp. Whenever possible the same plate is kept throughout the meal, and between dishes it is cleaned with bread which is eaten. Each eater takes his share of the food and drink which are placed before all. For example: he holds the bread to his body, cuts a piece of it towards himself, and puts the bread down for another. Likewise with cheese or sausage. Contiguity as between uses, users and foods is treated as natural. There is a minimum of division.\n>\n> On the bourgeois table everything that can be is kept untouched and separate. Every dish has its own cutlery and plate. In general plates are not cleaned by eating — because eating and cleaning are distinct activities. Each eater (or a servant) holds the serving dish to allow another to serve himself. The meal is a series of discrete, untouched gifts.\n>\n> To the peasant all food represents work accomplished. The work may or may not have been his own or that of his family, but if it isn’t, the work represented is nevertheless directly exchangeable with his own work. Because food represents physical work, the eater’s body already ‘knows’ the food it is going to eat. (The peasant’s strong resistance to eating any ‘foreign’ food for the first time is partly because its origin in the work process is unknown.) He does not expect to be surprised by food — except, sometimes, by its quality. His food is familiar like his own body. Its action on his body is *continuous* with the previous action of the body (labour) on the food. He eats in the room in which the food is prepared and cooked.”\n\nAnd here it’s only appropriate to recall the videos that have become so popular lately, of Afghani or Pakistani peasants eating western foods like pizza for the first time.\n\nIn more normal times, I’m working away from home at least a third of the year. The farm was always intended as a respite from this type of continuous movement around the world. I would be in New York, in Los Angeles, in Seoul, and then return to the woods. Two zones, with a clear delineation between them. This delineation now seems pretty absurd.\n\nI think often about the community I joined de facto in January 2020 and in earnest a month later, and what distinguishes it from all my previous time spent in cities. I’ve spent many months of my life driving throughout the country in search of similar data and have a few initial ideas. Urban environments are built on substantial decentralization and anonymization of services; this cultivates a mindset of a large, mostly-invisible controlling force that keeps everything running for everybody. *Eating and cleaning are distinct activities.* Life is made as predictable as possible to make sure it runs as smoothly as possible for the greatest number of participants. This framework also breaks most human-level community; people live primarily as individuals, knowing few of their neighbors, perhaps interacting hundreds of times with the same worker at the same business without ever learning each others’ name. There’s a certain predictable linearity to urbanized life.\n\nThis is inverted in rural areas, where services are often the responsibility of the individual (or the family), and a strong local community provides the foundation that enables people to live this way: by directly sharing equipment, food, childcare, skills. Life is inherently unpredictable, the future is uncertain, and mistakes are expected. Repairs are frequent. Good tools are invaluable. Most systems have a direct user-operator relationship by design, and those that aren’t (bureaucratic) are the source of endless complaints. The fire department is staffed by volunteers.\n\nRecently an acquaintance directed me towards Wendell Berry’s framework of exploitation and nurture, as discussed in his *Unsettling of America*:\n\n> “The standard of the exploiter is efficiency; the standard of the nurturer is care. The exploiter’s goal is money, profit; the nurturer’s goal is health—his land’s health, his own, his family’s, his community’s, his country’s. Whereas the exploiter asks of a piece of land only how much and how quickly it can be made to produce, the nurturer asks a question that is much more complex and difficult: What is its carrying capacity? \\[…\\] The competence of the exploiter is in organization; that of the nurturer is in order—a human order, that is, that accommodates itself both to other order and to mystery.”\n\nEarlier this afternoon I went to buy some parts for the tractor. One of the metal pins I needed was Made In India, and I momentarily felt a twang of unhappiness. In the past several years, and particularly this year, I've made a purposeful decision to buy products made in the United States as often as possible. I don't do this for nationalistic reasons, at least not directly. In general, I've found that Made In USA products are better-made and last longer, at least when it's an American brand, the same being true for Japanese brands made in Japan, or Italian in Italy -- localism generally implies highest possible quality. But I also prefer to buy these \"locally made\" goods because it means the motivations of the company are not pure profit; if that was the goal, they'd be exploiting workers in countries where worker protection laws are weaker and wages lower. This seems obvious maybe, but the higher quality of work must come in large part from the individual's higher quantity of pride in their work -- a skill developed as a result of nurturing at the individual level (through an apprenticeship, or through a long career at a single company) and at the group level (by implementing the Toyota Production System). The benefit of labor unions, for instance, is their ability to foster the conditions conducive to nurturing by creating friction between the company and the worker. They do not maximize for efficiency and exploitation.\n\nThere’s a connection here between pride taken in one’s work as a means to supporting one’s community -- a peasant mindset, Berger might say -- and why this pride disappears in urban environments. It’s not only because urban environments, and the culture around them, encourage capitalistic, bourgeois pursuits. It’s also because the very functional structure of urban environments cleaves the individual from their work. Their work goes out into the city and disappears. Their rewards are delivered from other sources, and often are provided by an easy access to credit. Ultimately, the rewards for work done, and the debts taken for rewards desired -- at the societal level -- are unevenly distributed throughout the entire system. History has shown where this leads.\n\nI can’t assert that all rural inhabitants retain the purity of the farmer’s mindset. Neither are all city creatures following their own social codes. Farhad Manjoo -- the NYTimes Op-Ed columnist (“lefties like myself who proudly believe in science and ostentatiously defer to expertise”) -- recently wrote, “I worry about life passing us by just as we’re trying to save it. If 2020 has taught me anything, it is to resist taking the future for granted.” This is the central talking point the right, and rural areas, have been articulating all year, and generally following -- returning to church, eating with friends, whatever. It’s also what the left has been communicating, through its actions, by going to the streets. All of this is about building up communities. At the root, all of this is about working through problems pragmatically. Of course, this is not how all of this is seen by each side.\n\nA top comment on the column, with which I also agree: “This discussion does not include the millions of people that don't have the privilege of isolating or communing in pods. The folks that keep the lights on, that sell us food and supplies, that deliver our heating fuel, mail and packages, the medical profession, expose themselves to risks everyday. We who can should isolate so that those who can't isolate have a safer environment when they go to work. Sure, Zoom is a poor substitute for in-person visits, but it makes little sense to travel during these few weeks if you don't need to.”\n\nAs with all things, neither of the extremes is workable, at any level. The individual must, and does, make decisions about what to exploit and what to nurture. The community makes the same decisions.\n\nI look forward to keeping a part of my mind with the entropy of the woods when I find myself on the road again, drinking coffee in the brightness of an airport, the air above me in a constant state of rapidly recirculating disinfection.\n\nOne of the recurring motifs of this year, here at the homestead, is friends visiting from the city and willfully taking on manual labor. One stayed a week and chopped firewood every day. Another helped lay out the deer fencing. Others dug holes, moved rocks, pulled nails. All do this with hardly any invitation, let alone prodding. At the end of their visit, they seem calmer. The zen of the wheelbarrow.\n\n*This essay was originally published on January 13, 2021 on usually.world.*\n\n[ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/4853](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/4853)\n\n", "timestamp": 1632111735, "digest": "DB9Rycc-AQvi1CkSpGSKnNt2S3xZLNxakQrZCt8Fyw8", "contributor": "0xa8A33539960Ef4779CB0eCEDed8002c1EcD40582"}
{"id": "spKb02fwb--92EjMKnOO7O77Go22fm8Loyc0qq1dEYc", "title": "Hello World", "body": "Why are we here?\n\nWe love artists and want more of them to exist in the world (as artists). This is the promise of web3.\n\nTokens are ways for us to support talented emerging artists and amplify their work.   NFTs provide artists the opportunity to become exceptionally talented and financially free. And Web3 requires zero compromise. \n\nPhlote is built to invest in quality art and the artists who make it. We’re curate fun and innovative art experiences. We’re exploring the use case for crypto to power a fully sustainable model for artists and DAOs. Soon, we’ll power an indie artists to a Grammy.  We’ll sell an mp3 for $2 million.  We’ll also seed some of the world’s first global art super brands. The roadmap is there.\n\nPhlote is a community of givers. We believe great art transcends and exist to help lead a global art revolution powered by crypto.\n\nWe're here to free the artists.\n\nHow do we do that?\n\nOur thoughts are evolving, but the goal is clear. A more creative world is a better world. We’ll use Mirror to allow our community to journey with us as we build Phlote to great heights. We can’t do anything alone.\n\nWe’ll do it together. \n\n\\-G\n\nOne day, we’ll all be much smarter.", "timestamp": 1632116485, "digest": "RzPvnxUMmsWXzw9MALtY2NnMqDxYhZvNUhPghKoprSk", "contributor": "0xEf58304E292fBAeacFdeC25b67b3438031FdE313"}
{"id": "tXoW8h-QnVvaBRjbuWFkG81RTZc7sHzXdeozEL5DLis", "title": "Hello World", "body": "Why are we here?\n\nWe love artists and want more of them to exist in the world (as artists). This is the promise of web3.\n\nTokens are ways for us to support talented emerging artists and amplify their work.   NFTs provide artists the opportunity to become exceptionally talented and financially free. And Web3 requires zero compromise.\n\nPhlote is built to invest in quality art and the artists who make it. We’re curate fun and innovative art experiences. We’re exploring the use case for crypto to power a fully sustainable model for artists and DAOs. Soon, we’ll power an indie artists to a Grammy.  We’ll sell an mp3 for $2 million.  We’ll also seed some of the world’s first global art super brands. The roadmap is there.\n\nPhlote embodies sharing is caring. We believe great art transcends and are here to free the artists.\n\nHow do we do that?\n\nOur thoughts are evolving, but the goal is clear. A more creative world is a better world. We’ll use Mirror to allow our community to journey with us as we build Phlote to great heights. We can’t do anything alone.\n\nWe’ll do it together.\n\nOne day, we’ll all be much smarter.", "timestamp": 1632116678, "digest": "RzPvnxUMmsWXzw9MALtY2NnMqDxYhZvNUhPghKoprSk", "contributor": "0xEf58304E292fBAeacFdeC25b67b3438031FdE313"}
{"id": "H3Q2ZEmK2m0t5prf85U6dk401Ao-uzsz8TAAY3xGaz4", "title": "Blinking", "body": "Back in 2005 Malcolm Gladwell wrote a book called Blink that was about how our subconscious allows us to make fast decisions that are often as good or better than slow considered decisions.\n\nI was talking to someone yesterday evening about how the venture capital business has changed over the last decade and I explained that we used to have weeks, if not months, to make our investment decisions and now we have days or if we are lucky a week or two.\n\nAnd I observed that the rapid pace of venture investing and decision making has not, yet, impacted the quality of our portfolio and that it may have actually improved it.\n\nThe woman I was talking to said “like Malcolm Gladwell describes in Blink.” And I nodded affirmatively.\n\nThere is another thing going on with our decision making at USV, which is that we are regularly taking the time to articulate to each other, and ideally the world at large, what we want to invest in and why.\n\nThat work, which we call thesis building, helps us make rapid decisions in the absence of time and information.\n\nIt is tempting to mourn the loss of careful and considered investing but from where I sit it seems gone for good, at least for early stage venture capital, so I think it’s a better use of our time to spend adapting to the market, as my partner Brad likes to say, and building the conviction to act quickly and decisively.\n", "timestamp": 1632140902, "digest": "7cF5xk7BGerbZ6t--9lg4BmvVOHwitu2OsroiX2Ez3w", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "HLdX-8c2m9M1_j0EKXsSksFz00wiWn7j6_APKbHtwUM", "title": "#1 – Vitalik Buterin & Karl Floersch: Retroactive Public Goods Funding", "body": "Hi everyone - the first episode of the Into the Bytecode podcast is up: [share.transistor.fm/s/0f9aa81e](http://share.transistor.fm/s/0f9aa81e)\n\nThis is a conversation with Vitalik Buterin (the creator of Ethereum) and Karl Floersch (a long-time Ethereum researcher who is working on Optimism - the Layer 2 optimistic rollup).\n\nWe begin the conversation with a focus on retroactive public goods funding - a compelling idea that Vitalik and Karl shared earlier this year. We then move onto topics like decoupling value creation and value capture, the sustainability of public goods, Ether's Phoenix (a play on Roko's Basilisk, the thought experiment which originated in the LessWrong community), and governance models as lying somewhere on the continuum from being exclusionary to being conformist. Towards the end of the conversation, we talk about personal tokens and new social network designs.", "timestamp": 1632146494, "digest": "NMbfhwZiBFdFnXZlEojvIuLmNepGsspkzzZWj3EprUI", "contributor": "0x03B79C0C1487a68AeabD9AA4ce779DaD77855F52"}
{"id": "ZlNj0t3ueZEwj2t_P6B8cNg5jsHcs5g6DULMDCu9PKQ", "title": "#1 – Vitalik Buterin & Karl Floersch: Retroactive Public Goods Funding", "body": "Hi everyone - the first episode of the Into the Bytecode podcast is up: [share.transistor.fm/s/0f9aa81e](http://share.transistor.fm/s/0f9aa81e)\n\nThis is a conversation with Vitalik Buterin (the creator of Ethereum) and Karl Floersch (a long-time Ethereum researcher who is working on Optimism - the Layer 2 optimistic rollup).\n\nWe begin the conversation with a focus on retroactive public goods funding - a compelling idea that Vitalik and Karl shared earlier this year. We then move onto topics like decoupling value creation and value capture, the sustainability of public goods, Ether's Phoenix (a play on Roko's Basilisk, the thought experiment which originated in the LessWrong community), and governance models as lying somewhere on the continuum from being exclusionary to being conformist. Towards the end of the conversation, we talk about personal tokens and new social network designs.", "timestamp": 1632146494, "digest": "NMbfhwZiBFdFnXZlEojvIuLmNepGsspkzzZWj3EprUI", "contributor": "0x03B79C0C1487a68AeabD9AA4ce779DaD77855F52"}
{"id": "UY_CWxonzG-9UCLmF3w1DQ5tGZNgnunXqldnimIv9O4", "title": "#2 – Tim Beiko & Danny Ryan: Eth1, Eth2, and the Merge", "body": "Hi everyone - the next episode is up: \n\n[https://share.transistor.fm/s/5071af0e](https://share.transistor.fm/s/5071af0e)\n\nThis is a conversation with Tim Beiko and Danny Ryan - the lead coordinators for the Eth1 and Eth2 development efforts.\n\nIn this conversation, we go deep on the future of the Ethereum protocol together. We talk about the Merge (the transition from Proof of Work to Proof of Stake via the Beacon Chain - which is the most substantial Ethereum network upgrade to date, and happening sooner than many people realize), the cryptoeconomics of PoS, MEV, staking derivatives, and how protocol development works in practice.\n\nCheck out our newsletter for other episodes and writing: [bytecode.substack.com](http://bytecode.substack.com)", "timestamp": 1632148828, "digest": "4_0RbUsZLDYVyn_zdjGUu0cD4n6r9DetPexDB5UZUCA", "contributor": "0x03B79C0C1487a68AeabD9AA4ce779DaD77855F52"}
{"id": "x76T3cBIBrno2PAFv_gWVOteDntFxMaxN9QoAGPDgns", "title": "#2 – Tim Beiko & Danny Ryan: Eth1, Eth2, and the Merge", "body": "Hi everyone - the next episode is up: \n\n[https://share.transistor.fm/s/5071af0e](https://share.transistor.fm/s/5071af0e)\n\nThis is a conversation with Tim Beiko and Danny Ryan - the lead coordinators for the Eth1 and Eth2 development efforts.\n\nIn this conversation, we go deep on the future of the Ethereum protocol together. We talk about the Merge (the transition from Proof of Work to Proof of Stake via the Beacon Chain - which is the most substantial Ethereum network upgrade to date, and happening sooner than many people realize), the cryptoeconomics of PoS, MEV, staking derivatives, and how protocol development works in practice.\n\nCheck out our newsletter for other episodes and writing: [bytecode.substack.com](http://bytecode.substack.com)", "timestamp": 1632148828, "digest": "4_0RbUsZLDYVyn_zdjGUu0cD4n6r9DetPexDB5UZUCA", "contributor": "0x03B79C0C1487a68AeabD9AA4ce779DaD77855F52"}
{"id": "gtnFTVHTEt3se2hfU0cfcgoDxL91cxmjDBICCVnJL00", "title": "Hello World", "body": "Why are we here?\n\nWe love artists and want to see more of them to exist in the world (as artists). To us, this is the greatest potential for web3.\n\nPhlote is built to invest in high quality art and the artists who make it. Tokens offer us a way to support the development of talented artists who’s work we believe should be documented and amplified. Along the way to becoming exceptionally talented, we help them become financially free. \n\nWe’re here to free artists and help their work transcend. \n\nCrypto is transforming how we co-work and co-create. It will be used to propel an indie artists to a Grammy.  Crypto will allow an mp3 to be sold for $2 million. We’re seeding some of the world’s first global art super brands using these new tools. The roadmap is there.\n\nHow do we do that?\n\nOur thoughts are evolving, but the goal is clear. A more creative world is a better world. We’ll use Mirror to document the work of our community and allow anyone to participate as we build Phlote to great heights. We can’t do anything alone.\n\nWe’ll do it together.", "timestamp": 1632154116, "digest": "RzPvnxUMmsWXzw9MALtY2NnMqDxYhZvNUhPghKoprSk", "contributor": "0xEf58304E292fBAeacFdeC25b67b3438031FdE313"}
{"id": "bebJa6p-XRyv4SSZdaELu2PL3-j-0H2J5v00jJy1MWc", "title": "TRANSCEND 01", "body": "Transcend \\~ a new NFT series.\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=257](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=257)\n\nTaking a bit of a break from the new record to introduce a new project, called Transcend.\n\nA collection of images, videos and music, meant to transport you to another place.\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=258](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=258)\n\nIf you’ve been following my journals, you’re already familiar with my affinity for transportive art. I usually find myself using music as the way to explore that experience, but I’ve found myself experimenting more with visual art over the past few months. The NFT space feels like it’s constantly evolving and experimenting, so it only felt right to have my creative experiments live on the blockchain.\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=259](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=259)\n\nSo what is Transcend?\n\nWe’ll begin with this collection of 5 still images. Each one is unique, and non-generative. Rather than get into the process of how they get made, I would rather the viewer ask themselves “Where does this take me?”\n\nThink of it as a window into some otherworldly place, rather than a documentation of this world.\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=260](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=260)\n\nAs the project rolls on, I’ll be introducing more layers to the experience, including exclusive music, dreamy looped videos and real-world implications.\n\nFor now, I hope you enjoy this first collection.\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=261](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=261)\n\n", "timestamp": 1632154571, "digest": "gd7Vg18hdHswlaptE9eHmBLeHUE29rqFoZboiizxeGk", "contributor": "0xEa83321A41c69070C971CD9Ca193366d6Be8DDC4"}
{"id": "DIkckGgMTGpnYuasu0-FzMdX3nEaLB_fTakXW9YjODo", "title": "Test Featured Image V2", "body": "Testing", "timestamp": 1632156162, "digest": "3lGocUlILopMJkqWmmoUH5Gw1Fvx6RvkW8EH24wedqQ", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "fKlV87Xuqc9BXtMv4u99E6eTNVS-5WaZ64N7bzAiAFk", "title": "Test Featured Image", "body": "Hello", "timestamp": 1632155981, "digest": "7-Dtz94Z8gxBjSuexSiNtSFRPbpIYiJv9ff-gNQZomc", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "-iC8vHrISk6fw3ce61andnozCKlOMeAH0ncWzYrevRo", "title": "Test Featured Image V2", "body": "Testing", "timestamp": 1632156199, "digest": "3lGocUlILopMJkqWmmoUH5Gw1Fvx6RvkW8EH24wedqQ", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "J9VsdFfnGILdUQz2EM-cbfu8L1ijFB3jEgejWnVtwTM", "title": "Test Featured Image", "body": "Test", "timestamp": 1632155147, "digest": "7-Dtz94Z8gxBjSuexSiNtSFRPbpIYiJv9ff-gNQZomc", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "lPloJTeNMNzksLSVF2nO7gfBYmeHNOxGskCjZRTpovw", "title": "Test Featured Image V2", "body": "Testing", "timestamp": 1632156109, "digest": "3lGocUlILopMJkqWmmoUH5Gw1Fvx6RvkW8EH24wedqQ", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "59pdJvIuB6UAUmgVP1KhG3xTUH5_sFmQPuDVbYiKBkc", "title": "Reputation Score on Web3", "body": "![](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fd9fdb37b-cb08-4dc4-a630-1caac78edfc4_2881x1620.png)\n\n*At Coinvise, we've just released a new feature called \"Reputation Scores\" Thanks to your wallet, we can track your transactions on-chain and assign a reputation score based on the value you've created in communities. Reputation Scores will facilitate collaboration and make it easier to reward users that are creating value within communities. This essay aims to explain further what is a reputation score and why it is crucial in a Web3 world.*\n\n\n---\n\nNot so long ago, no one really cared about digital legitimacy and online reputation. There was way less collaboration happening online, and physical reputation was often sufficient to work efficiently with others. Managing a Digital identity and the reputation that goes with it was a nice-to-have, not a must-have, and was mostly limited to an email address and eventually a pseudo on several forums.\n\nBut as Vitalik Buterin, founder of Ethereum, said, \"[The Most Important Scarce Resource is Legitimacy](https://vitalik.ca/general/2021/03/23/legitimacy.html).\" Legitimacy appears in any context where there is coordination, and especially on the Internet, coordination is everywhere. Nowadays, most of our day-to-day interactions and need for coordination exist in digital accounts, and our online reputation and legitimacy are more important than ever. Our real-life and digital life are intrinsically linked. People are now landing new jobs on Twitter, getting new clients on Linkedin, and collaborating with their co-workers on Slack.\n\nOur digital identity is much more complex to manage than previously, and is formed at the intersection of different platforms, communities, and groups. So how to efficiently manage this online identity and build legitimacy?\n\nWe're already seeing solutions appearing on Web3. Web3 is defined as a decentralized web, where platforms have decentralized governance and open data compared to Web2, where platforms are mostly governed by centralized teams (CEO and key stakeholders) with lock-in data (you can't access the data of anyone on Facebook for example).\n\nWhile it was complex to manage online identity and Reputation on Web2 because of Lock-in data and centralized power, Web3 and crypto mechanisms allow every action happening on the Blockchain (on-chain) to be linked to your unique decentralized identity, which means your reputation will follow you throughout your life. **Put simply, thanks to crypto mechanisms, instead of having separate accounts on different platforms, you can now have a single account (online identity) that you can bring on different platforms.** We're about to enter a new era where collaboration will be easier, and value creation will be rewarded thanks to an efficient reputation score.\n\n### 1/ The problems with the current online Reputation\n\nAs mentioned above, our physical and digital lives are intrinsically linked, and online reputation is more important than ever. However, for 99% of people on the Internet, the value of their digital identity is locked within platforms. Creators that have built an audience of 1 million followers on Instagram won't start in another platform like Twitter with 1 million followers. They will begin with 0. Amazon sellers who have built their Reputation for years won't start on other marketplaces with five-star reviews. They will begin with 0. When leaving a platform, users have to start from scratch, all over again, as there is no interoperability between platforms. The data are locked. It doesn't incentivize users to do their best or build long-term relationships as they know they will lose it when leaving the platform.\n\nThe second problem with the current online reputations is the negligible cost of creating a new online identity. To create a whole model around reputation, we've to be sure who's the person behind this pseudonymous or this email address. Today, anyone can create new accounts for no cost, limiting the weight we can put behind a name or a pseudo.\n\nInteroperability, open data, and a reliable way to know someone's identity are essential to create a legit reputation score, and Web2 platforms have failed to provide those key elements.\n\n### 2/ Interoperability and reputation score on Web3\n\nThanks to crypto mechanisms and Crypto Wallets, we can now all have a unique decentralized identity that can be used across different platforms. We finally see the path to create a reputation score.\n\nEvery transaction (and by transaction, we don't specifically talk about monetary transactions, it can be social ones as well) happening on the Blockchain are registered on a public ledger and are accessible to anyone. To do transaction on the Blockchain, everyone needs a Crypto Wallet to be identified. Similarly than you need a credit card to purchase an item online, you need a Crypto Wallet to do transactions on the Blockchain, with the difference that you can also use your Wallet to do non-financial transactions. It's like if you could use your credit card to sign up on new websites.\n\nWeb3 platforms allow using a wallet as a single sign-on. Like the \"connect with Google\" button, you now have a \"connect with your Wallet\" button. By gaining access to every new user's identity through their Crypto Wallet, Web3 platforms will be able to track a specific user's action and reward them for creating value.\n\nWith crypto Wallets, the problem of fake online identity is solved. You can create a new address email at a negligible cost, but with your identity linked to your Wallet (already connected to a lot of Dapp (Decentralized applications) and with your virtual currencies and your NFTs in it), it will be much more difficult for someone to create several identities. The cost of creating a new wallet will be too high and the benefits too low.\n\nAt coinvise, for example, we're putting a lot of weight on people who are verified on BrightID. Brighid is a social identity network that allows you to prove that you're only using one account. It's the holy grail of digital identity. You will get verified on BrightID based on your social relationships and the communities you belong to. By taking those data (such as if you’ve a verified BrightID account) to assess an overall Reputation score, we'll make sure everyone is using a single identity on the Internet.\n\nNow comes the need of Interoperability. In Web3 As every transaction is taken on-chain and therefore accessible in an open ledger, Crypto wallet finally also allows interoperability. With its open data model (every information is on a public ledger), Crypto allows any Web3 platforms to use those data and, therefore, recover the user's reputation from other platforms. For example, if a user sent many messages on Discord, it's a good sign that the user is engaged in a community. If a user has participated in several community's crowdfunding, it shows its support in different communities. Publishing essays on decentralized platforms shows the willingness to provide value and help others etc...  All those \"transactions\" are visible on the public ledger, everything is \"on-chain.\" You can go on another platform or software, and the platform can recover all your information and past transactions. In the new world of Ethereum and Web3, your identity and data go with you.\n\nWe've just seen that Crypto solves the two main problems of centralized platforms, and that it's now possible to create a reputation score thanks to open data, interoperability, and a single decentralized identity. So now, concretely, what would be the advantages of having a web3 reputation score?\n\n### 3/ Main advantages of a Web3 Reputation score.\n\nThere are many advantages to having a Web3 reputation score. Firstly, it acts as a metric for On-chain participation, creation & ownership. It helps identify high-value creators/communities & access a better quality talent pool for communities to onboard. In many ways, a reputation score will serve to establish trust for creators, not because they're high-signal on Twitter but because they've probably built a high-value community. With interoperability and reputation Score, Web3 platforms and communities will be able to reward those who create the most value. Reputation scores incentivize creation and participation.\n\nA reputation score on Web3 has many advantages that we'll list here:\n\n* **Self-sovereignty** - users own their online identity and reputation. Web3 platforms do not lock their data, and they are the only ones with access to their Wallet and all proof of their identity and past actions.\n* **Portability & interoperability** - Users are allowed to move their data into other systems and platforms. On Web3, anyone could bring its audience or content from a platform to another.\n* **Allow to find high-quality people** - Users and communities will work with people who have a high reputation score. A reputation score will incentivize everyone to create more value and help each other.\n* **Better governance distribution** - Today, we mostly use users' number of tokens to give voting power. In the future, it could be directly your reputation score that serves to determine your voting power. It won't be enough to buy a lot of tokens. You'll have to prove your value to gain voting power.\n* **Establish trust** - With a life-long reputation, users will be more likely to play the infinite game, where the objective is not to win but to keep playing. As everything is on-chain, users will be incentivized to do good, ultimately resulting in more trust.\n* **Incentivize to create more value** - Users will be incentivized to help each other without fearing losing their reputation when joining new communities or projects. Someone with a high reputation score will be able to join new projects and prove its past experiences and capabilities right away.\n\nReputation score is a first attempt in establishing trust for creators, showcase them, and reward those who create the most value. By having a verified identity on Coinvise (Wallet + Twitter), creators will be confident that the value they are creating with their community and the reputation they are building will follow them across platforms. It's time to leverage new technologies to give users control of their digital identity and allow them to bring their reputation across platforms.\n\n\n---\n\nFurther resources:\n\n* [Creating a Community-Specific Reputation Score for Mirror Users](https://ath.mirror.xyz/aYOJc8pihb9wxI___QR9qmM5mQ4caUyQhHJIlevspjw)\n* [The Composability of Identity across Web2 and Web3](https://ath.mirror.xyz/mDu_nGsWpjvF-KaPLADwxeAMfze3UJOtTAQi2CwPwWc)\n* [The Most Important Scarce Resource is Legitimacy](https://vitalik.ca/general/2021/03/23/legitimacy.html)\n* [The Web’s Missing Interoperability](https://stratechery.com/2021/the-webs-missing-interoperability/)\n* [Identity and Reputation in Web 3](http://sinahab.com/identity-and-reputation-in-web-3/)\n\n\n---\n\n###### **Want more?**\n\nFollow us on **[Twitter](https://twitter.com/CoinviseCo)**,  [Instagram](https://www.instagram.com/coinvise/?hl=en), and join us on **[Discord](https://discord.gg/8jaQB5CZ) 🔥**\n\nThanks for being here!", "timestamp": 1632170400, "digest": "thKOFxKu3o60-YVj6Tj-pf3LUtgNKcan6DcqRd4Y37Q", "contributor": "0xC0241e384dB48C35E7b3FEded3BfEcd29A3E73e3"}
{"id": "oDlOVGH-ZYWJy3eqo4Ut5opUQMpv3XZCsHR20PqK80Y", "title": "Experimenting Type design with DAOs", "body": "Fonts are everywhere, we all use them sometimes underestimating their usefulness.\n\nTypefaces are capable of giving added value to a project by contributing in giving an emotional tone and functionality to the communication that is to be implemented.\n\nWe can imagine fonts like that pinch of salt in a plate of pasta, if it is not added everyone will notice the difference.\n\nJust think of the recent typographic redesign implemented by Twitter, within a few hours, everyone noticed that there was something different in the UI and then people judged if that different pinch of salt was a good choice or the ruin of the dish.\n\n[https://slate.com/technology/2021/08/twitter-font-redesign-chirp-franklin-gothic.html](https://slate.com/technology/2021/08/twitter-font-redesign-chirp-franklin-gothic.html)\n\nPersonally, I think the current font market is a disaster.\n\nA zombie market, with piracy raging and a single centralising entity of power that is GoogleFont. The service provided by Google is certainly useful and excellent for designers and developers, but I wonder if we are really sure that it is the fairest way to fight piracy and encourage indie type designers and digital foundries work.\n\nIf we analyse the web design market we will find boring homologation, most of the web pages converge on the usual 3/4 font families.\n\nProxima Nova, Montserrat, Poppins, Noto sans…\n\nI bet if you are a designer you will have used them at least once :)\n\nI would be very happy to reward those who dedicate time and study to the type design industry but I feel, the market has too many barriers to small professionals, and college designers who should spend a large chunk of the budget from commissioned project to buy licenses on typefaces.\n\nSurely work has to be paid, but it's fair to say that design and communication industries deserve an inclusive and accessible market.\n\nBeing a crypto-designer it is impossible not to see margins of innovation through emerging tools such as DAOs and non-fungible tokens.\n\n## Introducing 99Fonts DAO fundraising \n\n99Fonts DAO wants to create a community of designers and enthusiasts who can collaborate creating typefaces and experimenting new business models for creators and buyers.\n\nLike any self-respecting DAO, there is a need for membership and productivity, so the purpose of this article is to raise funds and distribute ownership through the minting of a genesis font that can set up this DAO firm. Genesis piece is a gothic font inspired by the typefaces used by Gutenberg for the first printing of the Bible.\n\n**By purchasing 99Fonts genesis NFT you will give birth to the discord server that will establish the DAO** **and you will earn access to all root font files (AI, PDF, OTF files) that will enable future derivatives implementations.**\n\n*I want to point out that it is my prerogative to create a truly decentralised system and the funds raised from the sale will be deposited into the DAO treasury fund.*\n\n[edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=265](edition://0xaf89C5E115Ab3437fC965224D317d09faa66ee3E?editionId=265)\n\n", "timestamp": 1632167793, "digest": "Fj_6fzQZdmJaLmDd_VkPWcpoS7Qh9Hwc8arvoqo9YQU", "contributor": "0x2f28D0f18d70CEcCF1FA969542Cc2597615b11CB"}
{"id": "g8vh_q72qPo3sEQypodQrmX725ARsNjs9DFXoFkeNUA", "title": "Making Sense of Ethereum’s Layer 2 Scaling Solutions", "body": "*👋 Note: Originally published on Feb 12, 2018 on [Medium](https://medium.com/l4-media/making-sense-of-ethereums-layer-2-scaling-solutions-state-channels-plasma-and-truebit-22cb40dcc2f4).*\n\n\n---\n\nFor ethereum [2018 is the year of infrastructure](https://twitter.com/L4ventures/status/953041925241757697). This is the year when early adoption will test the limits of the network, renewing focus on technologies built to scale ethereum.\n\n**Ethereum is still in its infancy.** Today, it [isn’t safe or scalable](https://twitter.com/VladZamfir/status/838006311598030848). This is well understood by anyone who works closely with the technology. But over the last year, the ICO-driven hype has begun to far exaggerate the current capabilities of the network. The promise of ethereum and web3 — a safe, easy to use decentralized internet, bound by a common set of economic protocols, and used by billions of people — is still on the horizon, and [will not be realized until critical infrastructure is built](https://twitter.com/granthummer/status/957353619736559616).\n\nThe projects working to build this infrastructure and expand the capabilities of ethereum are commonly referred to as *scaling solutions*. These take many different forms, and are often compatible or complimentary with each other.\n\nIn this long post I want to dive deep into *one* category of scaling solution: **“off-chain” or “layer 2” solutions.**\n\n* **First**, we’ll discuss the scaling challenges of ethereum (and all public blockchains) in general.\n* **Second**, we’ll cover the different approaches to solving the scaling challenge, distinguishing between “layer 1” and “layer 2” solutions.\n* **Third**, we’ll delve into layer 2 solutions and explain how they work — specifically, we’ll talk about **[state channels](https://medium.com/l4-media/generalized-state-channels-on-ethereum-de0357f5fb44), [Plasma](http://plasma.io/)**, and **[Truebit](http://truebit.io/)**\n\n**This article focuses on giving the reader a thorough and detailed *conceptual* understanding of how layer 2 solutions work**. But we won’t dig into code or specific implementations. Rather, we focus on understanding the economic mechanisms used to build these systems, and the common insights that are shared between all layer 2 technologies.\n\n# 1. The scaling challenges of public blockchains\n\nFirst, it’s important to understand that “scaling” isn’t a single, specific problem. **It refers to a collection of challenges that must be overcome to make ethereum useful to a global user base of billions of people.**\n\nThe most commonly discussed scaling challenge is transaction throughput. Currently, ethereum can process roughly 15 transactions per second, while in comparison Visa processes approximately 45,000/tps. In the last year, some applications — like [Cryptokitties](http://cryptokitties.co/), or the occasional ICO — have been popular enough to “slow down” the network and raise gas prices.\n\n**The core limitation is that public blockchains like ethereum require every transaction to be processed by *every single node* in the network.** Every operation that takes place on the ethereum blockchain — a payment, the birth of a Cryptokitty, deployment of a new ERC20 contract — must be performed by every single node in the network in parallel. This is by design — it’s part of what makes public blockchains authoritative. Nodes don’t have to rely on someone *else* to tell them what the current state of the blockchain is — they figure it out for themselves.\n\n**This puts a fundamental limit on ethereum’s transaction throughput:** it cannot be higher than what we are willing to require from an individual node.\n\nWe *could* ask every individual node to do more work. If we doubled the block size (i.e., the block gas limit), it would mean that each node is doing roughly double the amount of work processing each block. But this comes at the cost of decentralization: requiring more work from nodes means that less powerful computers (like consumer devices) may drop out of the network, and mining becomes more centralized in powerful node operators.\n\nInstead, we need a way for blockchains to *do more useful stuff* without increasing the workload on individual nodes.\n\nConceptually, there are [two ways we might go about solving this problem](https://blog.ethereum.org/2018/01/02/ethereum-scalability-research-development-subsidy-programs/):\n\n### I. What if each node didn’t have to process every operation in parallel?\n\nThe first approach rejects our premise — what if we could build a blockchain where every node didn’t have to process every operation? What if, instead, the network was divided into two sections, which could operate semi-independently?\n\nSection A could process one batch of transactions, while Section B processed another batch. This would effectively double the transaction throughput of a blockchain, since our limit is now what can be processed by *two* nodes at the same time. If we can split a blockchain into many different sections, then we can increase the throughput of a blockchain by many multiples.\n\nThis is the insight behind “**sharding”**, a scaling solution being pursued by Vitalik’s [Ethereum Research group](http://ethereumresearch.org/) and others. A blockchain is split into different sections called *shards*, each of which can independently process transactions. Sharding is often referred to as a **Layer 1** scaling solution because it is implemented at the base-level protocol of ethereum itself. If you want to learn more about sharding, I recommend this [extensive FAQ](https://github.com/ethereum/wiki/wiki/Sharding-FAQ) and [this blog post](https://medium.com/@icebearhww/ethereum-sharding-and-finality-65248951f649).\n\n![](https://miro.medium.com/max/1400/1\\*mPCgXycICNjuscoFt974fQ.png)\n\n### II. What if we could squeeze more useful operations out of ethereum’s existing capacity?\n\nThe second option goes in the opposite direction: rather than increase the capacity of the ethereum blockchain itself, **what if we could do** **more things** \\*\\*with the capacity we already have? \\*\\*The throughput of the base-layer ethereum blockchain would be the same, but in practice we would be able to do many more operations that are useful to people and applications — like transactions, state updates in a game, or simple computations.\n\nThis is the insight behind “off-chain” technologies like **[state channels](https://medium.com/l4-media/generalized-state-channels-on-ethereum-de0357f5fb44), [Plasma](http://plasma.io/)**, and **[Truebit](http://truebit.io/)**. While each of these is solving a different problem, they all function by performing operations “off chain” instead of on the ethereum blockchain, while still guaranteeing a sufficient level of security and finality.\n\nThese are also known as **Layer 2** solutions because they are built “on top of” the ethereum main-chain. They do not require changes to the base level protocol — rather, they exist simply as smart contracts on ethereum that interact with off-chain software.\n\n![](https://miro.medium.com/max/1400/1\\*TSKyc_gKn8kj0p-27nGQ-A.png)\n\n## **2. Layer 2 solutions are *cryptoeconomic* solutions**\n\nBefore diving into specific layer 2 solutions, it’s important to understand the underlying insight that makes them possible.\n\nThe basic power of a public blockchain is in [cryptoeconomic consensus](https://hackernoon.com/making-sense-of-cryptoeconomics-5edea77e4e8d). By carefully aligning incentives and securing them with software & cryptography, we can create networks of computers that reliably come to agreement about the internal state of a system. This is the key insight of [Satoshi’s whitepaper](https://bitcoin.org/bitcoin.pdf), which has now been applied in the design of many different public blockchains including bitcoin and ethereum.\n\n**Cryptoeconomic consensus gives us a *core hard kernel* of certainty** — unless something extreme like a 51% attack happens, we know that on-chain operations — like payments, or smart-contracts — will execute as written.\n\n**The insight behind layer 2 solutions is that we can use this core kernel of certainty as an *anchor* — a fixed point to which we attach additional economic mechanisms.** This *second* *layer* of economic mechanisms can extend the utility of public blockchains outwards, letting us have interactions *off* of the blockchain that can still reliably refer *back* to that core kernel if necessary.\n\nThese layers built “on top” of ethereum won’t always have the same guarantee as on-chain operations. But they can still be sufficiently final and secure to be very useful — especially when that slight decrease in finality lets us perform operations much faster or with lower overhead costs.\n\n**Cryptoeconomics didn’t begin and end with Satoshi’s whitepaper — it’s a body of techniques that we are only learning to apply.** Not just in the design of core protocols, but in the design of second layer systems that extend the functionality of the underlying blockchain.\n\n### I. State channels\n\nState channels are a technique for performing transactions and other state updates “off chain”. However, things that happen “inside” of a state channel still retain a very high degree of security and finality: if anything goes wrong, we still have the *option* of referring back to the “hard kernel” of certainty found in on-chain transactions.\n\nMost readers will be familiar with the idea of a *payment channel*, which has been around for several years, and recently implemented on bitcoin through the [lightning network](http://lightning.network/). State channels are the more *general* form of payment channels — they can be used not only for payments, but for any arbitrary “state update” on a blockchain — like changes inside a smart contract. State channels were [first described in detail](http://www.jeffcoleman.ca/state-channels/) by Jeff Coleman in 2015.\n\nThe best way to explain how a state channel works is by looking at an example. Keep in mind that this is a conceptual explanation, meaning that we won’t get into the technical details of a specific implementation.\n\nImagine that Alice and Bob want to play a game of tic tac toe, where the winner receives 1 eth. The naive way to do this would be to create a smart contract on ethereum that implements the rules of tic tac toe and keeps track of each players’ moves. Every time a player wants to make a move, they send a transaction to the contract. When one player wins, as determined by the rules, the contract pays out the 1 eth to the winner.\n\nThis works, but is inefficient and slow. Alice and Bob are having *the entire ethereum network* process their game, which might be overkill for what they need. They have to pay gas costs every time a player wants to make a move, and they have to *wait* for blocks to be mined before making the next move.\n\n**Instead, we can design a system that lets Alice and Bob play tic-tac-toe with *as few on-chain operations as possible*.** Alice and Bob will be able to update the state of the game *off-chain*, while still having full confidence that they can revert back to the ethereum main-chain if necessary. We call this system a “state channel”.\n\nFirst, we create a smart contract “Judge” on the ethereum main-chain that understands the rules of tic-tac-toe, and can identify Alice and Bob as the two players in our game. This contract holds the 1 eth prize.\n\nThen, Alice and Bob begin playing the game. Alice creates and signs a transaction describing her first move, and sends it to Bob, who also signs it, sends back the signed version, and keeps a copy for himself. Then Bob creates and signs a transaction describing his first move, and sends it to Alice, who also signs it, sends it back, and keeps a copy. Each time, they are updating the current state of the game between them. Each transaction contains a “nonce”, which simply means that we can always tell later in what order the moves happened.\n\n**So far, none of this is happening on-chain**. Alice and Bob are simply sending transactions *to each other* over the internet, but nothing is hitting the blockchain yet. However, all of the transactions *could* be sent to the Judge contract — in other words, they are valid ethereum transactions. You can picture this as two people writing a series of blockchain-certified cheques back and forth to each other. **No money has actually been deposited or withdrawn from a bank, but each has a stack of cheques that they *could* deposit whenever they want.**\n\nWhen Alice and Bob are done playing the game — perhaps because Alice has won — they can *close* the channel by submitting the final state (e.g. a list of transactions) to the Judge contract, paying only a single transaction fee. The Judge ensures that this “final state” is signed by both parties, and waits a period of time to ensure that no one can legitimately challenge the result, and then pays out the 1 eth award to Alice.\n\n**Why do we need this “challenge period” where the Judge contract waits?**\n\nImagine that instead of sending the *real* final state to the Judge, Bob sent an *old* version of the state — one where he was winning ahead of Alice. The Judge is just a dumb contract — on its own, it has no way of knowing whether this is the most recent state or not.\n\nThe challenge period gives Alice a chance to *prove* to the Judge contract that Bob has lied about the final state of the game. If there is a more recent state, then she will have a copy of the signed transactions, and she can submit those to the Judge. The Judge can tell that Alice’s version is more recent by checking the nonce, and Bob’s attempt to steal the win is rejected.\n\n## **Features and limitations**\n\nState channels are useful in many applications, where they are a strict improvement over doing operations on-chain. However, it’s important to keep in mind the particular tradeoffs that have been made when deciding whether an application is suitable for being channelized:\n\n* **State channels rely on availability**. If Alice lost her internet connection during a challenge (maybe because Bob, desperate to claim the prize, sabotaged her home’s internet connection) she might not be able to respond before the challenge period ends. However, Alice can pay someone else to keep a copy of her state and maintain availability on her behalf.\n* **They’re particularly useful where participants are going to be exchanging *many* state updates over a long period of time.** This is because there is an initial cost to *creating* a channel in deploying the Judge contract. But once it is deployed, the cost per state update inside that channel is extremely low.\n* **State channels are best used for applications with a defined set of participants.** This is because the Judge contract must always know the entities (i.e. addresses) that are part of a given channel. We can add and remove people, but it requires a change to the contract each time.\n* **State channels have strong privacy properties**, because everything is happening “inside” a channel between participants, rather than broadcast publicly and recorded on-chain. Only the opening and closing transactions must be public.\n* **State channels have instant finality**, meaning that as soon as both parties sign a state update, it can be considered final. Both parties have a very high guarantee that, if necessary, they can “enforce” that state on-chain.\n\nAt L4, we’re building **[Counterfactual](https://counterfactual.com/):** a framework for generalized state channels on ethereum. Our general purpose, modular implementation will let developers use state channels in their application without needing to be state channel experts themselves. You can read more about the project [here](https://medium.com/l4-media/generalized-state-channels-on-ethereum-de0357f5fb44). We’ll be releasing a paper describing our technique in Q1 2018.\n\nThe other notable state channels project for ethereum is [Raiden](https://raiden.network/), which is currently focused on building a network of *payment* channels, using a similar paradigm as the [lightning network](http://lightning.network/). This means that rather than have to open up a channel with the specific person(s) you want to transact with, you can open up a single channel with an entity connected to a much larger network of channels, enabling you to make payments to anyone else connected to the same network without additional fees.\n\nIn addition to Counterfactual and Raiden, there are several application-specific channel implementations on ethereum. For instance, Funfair has built state channels (which they call “[Fate channels](https://funfair.io/state-channels-in-disguise/)”) for their decentralized gambling platform, Spankchain has built [one-way payment channels](https://twitter.com/SpankChain/status/932801441793585152) for adult performers (they also [used a state channel for their ICO](https://github.com/SpankChain/old-sc_auction)), and [Horizon Games](https://horizongames.co/) is using state channels in their first ethereum-based game.\n\n### II. Plasma\n\nOn August 11 2017, Vitalik Buterin and Joseph Poon released a paper titled *[Plasma: Autonomous Smart Contracts](http://plasma.io/plasma.pdf)*. The paper introduced a novel technique that could enable ethereum to reach many more transactions per second than currently possible.\n\nLike state channels, Plasma is a technique for conducting off-chain transactions while relying on the underlying ethereum blockchain to ground its security. But Plasma takes the idea in a new direction, by allowing for the creation of “child” blockchains attached to the “main” ethereum blockchain. These child-chains can, in turn, spawn their own child-chains, who can spawn their own child-chains, and so on.\n\nThe result is that we can perform many complex operations at the child-chain level, running entire applications with many thousands of users, with only minimal interaction with the ethereum main-chain. **A Plasma child-chain can move faster, and charge lower transaction fees, because operations on it do not need to be replicated across the entire ethereum blockchain.**\n\n![plasma.io/plasma.pdf](https://miro.medium.com/max/906/0\\*44PC3oIBMgugPDph.)\n\nIn order to understand how Plasma works, let’s walk through an example of how it could be used.\n\nLet’s imagine that you’re creating a trading-card game on ethereum. The cards will be ERC 721 non-fungible tokens (like Cryptokitties), but have certain features and attributes that lets users play against each other — like in Hearthstone, or Magic the Gathering. These kinds of complex operations are expensive to do on-chain, so you decide to use Plasma instead for your application.\n\n**First, we create a set of smart-contracts on ethereum main-chain that serve as the “Root” of our Plasma child-chain.** The Plasma root contains the basic “state-transition rules” of our child chain (things like “transactions cannot spend assets that have already been spent”), records hashes of the child-chain’s state, and serves as a kind of “bridge” that lets users move assets between the ethereum main-chain and the child-chain.\n\nThen, we create our child-chain. The child-chain can have its own consensus algorithm — in this example, let’s say that it uses [Proof of Authority (PoA)](https://en.wikipedia.org/wiki/Proof-of-authority), a simple consensus mechanism that relies on trusted block producers (i.e. validators). Block producers are analogous to *miners* in a “Proof of Work” system — they are the nodes that receive transactions, form blocks, and collect transaction fees. Let’s keep our example simple, and say that you (the company that created the game) are the *only* entity that is creating blocks — i.e. your company runs a few nodes that are the block producers for our child-chain.\n\nOnce the child-chain is created and active, the block producers make periodic commitments to the root contract. This means they are effectively saying “I commit that the most recent block in the child-chain is X”. These commitments are recorded on-chain in the Plasma root as a proof of what has happened in the child-chain.\n\nNow that the child-chain is ready, we can create the basic components of our trading card game. The cards themselves are [ERC721](https://github.com/ethereum/eips/issues/721)’s, initially created on the ethereum main-chain, and then moved onto the child-chain through the plasma root. **This introduces a crucial point: Plasma lets us scale interactions with blockchain-based digital assets, but those assets should be created first on the ethereum-main chain.** Then, we deploy the actual game application smart-contracts on the child-chain, which contains all of the game logic and rules.\n\n**When a user wants to play our game, they are *only interacting with the child chain*.** They can hold assets (the ERC721 cards), buy and trade them for ether, play rounds of the game against other users — whatever our game lets them do — without ever interacting directly with the main-chain. Because only a much smaller number of nodes (i.e. block producers) have to process transactions, fees can be much lower and operations can be faster.\n\n## **But how can this be safe?**\n\nBy moving more operations off the main-chain and onto a child-chain, it’s clear we can perform more operations. But how secure is it? Are transactions that happen on the child-chain actually considered final? After all, we’ve just described a system where *a single entity* controls the block production for our child chain. Isn’t that centralized? **Can’t the company steal your funds or take your collectible cards whenever it wants?**\n\nThe short answer is that *even in a scenario* where a single entity controls 100% of block production on a child chain, Plasma gives you a basic guarantee that **you can always withdraw your funds and assets back onto the main chain.** If a block producer starts acting maliciously, the worst that can happen is they force you to leave the child-chain.\n\nLet’s walk through a few different ways block producers could behave badly, and see how Plasma deals with those scenarios.\n\n**First, imagine that a block producer tries to cheat you by lying — by creating a *fake* new block where suddenly your funds are controlled by them.** They are the *only* block producer, so they’re free to introduce a new block that doesn’t actually follow the rules of our blockchain. Just like other blocks, they will have to publish a commitment to the Plasma root contract containing evidence of this block.\n\nAs mentioned above, the user always has an ultimate guarantee that they can withdraw their assets back to main-chain. In this scenario, the user (or rather an application acting on their behalf) would detect the attempted theft, and withdraw before the block producer can try and use the assets they’ve “stolen”.\n\nPlasma also creates a mechanism to prevent fraud short of withdrawing to main-chain. Plasma includes a mechanism whereby anyone — including you — can publish a *fraud proof* to the root contract, to try and show that the block producer has cheated. This fraud proof would contain information about the previous block, and allows us to show that according to the state-transition rules of the child-chain, the false block doesn’t properly follow from the previous state. If fraud is proven, the child-chain is “rolled back” to the previous block. Even better, we construct a system where any block producer who signed off on the false block is penalized by losing an on-chain deposit.\n\n![](https://miro.medium.com/max/1076/0\\*Xgnr1Hv-KhckkbvV.)\n\nplasma.io/plasma.pdf\n\n**But submitting a fraud proof requires having access to the underlying data — i.e. the actual history of blocks that are used to prove the fraud.** What if the block producers are *also* not sharing information about previous blocks, to prevent Alice from being able to submit a fraud proof to the root contract?\n\nIn this case, the solution is for Alice to withdraw her funds and leave the child-chain. Essentially Alice submits a “Proof of Funds” to the root contract. After a delay period during which anyone can challenge her proof (e.g. to show she actually spent those funds in a later valid block), Alice’s funds are moved back to the ethereum main-chain.\n\n![plasma.io/plasma.pdf](https://miro.medium.com/max/1210/0\\*6b__s1TjsZqrO2zC.)\n\n**Lastly, block producers can *censor* users of the child-chain.** If they wanted, block producers could simply never include certain transactions in their blocks, effectively preventing a user from performing any operations on the child-chain. Once again, the solution is simply to withdraw all of our assets back onto the ethereum main-chain as above.\n\n**Withdrawals themselves pose risks, however.** One concern is what would happen if everyone using a child-chain tried to withdraw at the same time. In the case of a mass withdrawal, there might not be enough capacity on the ethereum main-chain to process everyone’s transactions within the challenge period, [meaning users ](https://www.reddit.com/r/ethereum/comments/6sqca5/plasma_scalable_autonomous_smart_contracts/dlex5pa/?utm_content=permalink&utm_medium=front&utm_source=reddit&utm_name=ethereum)*[could](https://www.reddit.com/r/ethereum/comments/6sqca5/plasma_scalable_autonomous_smart_contracts/dlex5pa/?utm_content=permalink&utm_medium=front&utm_source=reddit&utm_name=ethereum)*[ lose funds](https://www.reddit.com/r/ethereum/comments/6sqca5/plasma_scalable_autonomous_smart_contracts/dlex5pa/?utm_content=permalink&utm_medium=front&utm_source=reddit&utm_name=ethereum). Although there are many possible techniques for preventing this, e.g. by extending the challenge period in a way that is responsive to demand for withdrawals.\n\n**It’s worth noting that it doesn’t *need* to be the case that all block producers are controlled by one entity — this is simply the extreme case in our example.** We can create child-chains whose block production is spread among many different entities — i.e. actually decentralized in a way that is more similar to public blockchains. In those cases, there is less risk that block producers would interfere in the way described above, and so less risk that a user would have to move their assets back to the ethereum main-chain.\n\nNow that we’ve covered both state channels and Plasma, it’s worth noting a few points of comparison.\n\nOne difference is that state channels can perform *instant withdrawals* when all of the parties in the channel consent to the withdrawal. If Alice and Bob agree to close out a channel and withdraw their funds, so long as they both agree to the final state they can get their assets out of the channel immediately. This is not possible on Plasma, where users must always go through a withdrawal process that involves a challenge period, as described above.\n\nState channels should also be less expensive per transaction than Plasma, and be faster. This means that we will ***[likely build state channels on Plasma child-chains](https://www.reddit.com/r/ethereum/comments/7jzx51/scaling_ethereum_hundreds_to_thousands_of/drb930m/?context=1)***. For example, in an application where two users are exchanging a series of small transactions. Building a state channel at the child-chain level *should* be cheaper and faster than performing each of those transactions on the child-chain directly.\n\nFinally, it’s worth noting that this is only a partial description that leaves out many details. Plasma itself is in very early stages. If you’re interested in learning more about current work on Plasma, check out Vitalik’s recent proposal for a “[Minimal Viable plasma](https://ethresear.ch/t/minimal-viable-plasma/426)” (i.e. a stripped-down plasma implementation). There’s work being done by a group based in Taiwan, which you can find in [this repo](https://github.com/ethereum-plasma). OmiseGo is working on an implementation for their decentralized exchange — they posted a recent update about their progress [here](https://blog.omisego.network/construction-of-a-plasma-chain-0x1-614f6ebd1612).\n\n## **III. Truebit**\n\n[Truebit](http://truebit.io/) is a technology to help ethereum conduct *heavy or* complex computation off-chain. This makes it different from state channels and Plasma, which are more useful for increasing the total transaction throughput of the ethereum blockchain. As we discussed in the opening section, scaling is a multi-faceted challenge that requires more than high transaction throughput. **Truebit won’t let us do *more transactions*, but it will let ethereum based applications *do more complex things* in a way that can still be verified by the main-chain.**\n\nThis will let us do operations useful to ethereum applications that are too computationally expensive to do on chain. For instance, validating Simple Payment Verification (SPV) proofs from other blockchains, which could let ethereum smart-contracts “check” whether a transaction has happened on another chain (like bitcoin or [dogecoin](https://twitter.com/Truebitprotocol/status/960662648193888256)).\n\nLet’s walk through an example. Imagine that you have some expensive computation — like an SPV proof — that needs to be performed as part of an ethereum application. You can’t simply do it as part of a smart contract on ethereum main-chain, because SPV proofs are far too computationally expensive. Remember, it’s very costly to perform any computation on ethereum because every node must perform that operation in parallel. Blocks in ethereum have a *maximum gas limit* that sets a cap on how much computation can be done by all the transactions combined in that block. But an SPV proof is so computationally expensive that it would require many multiples of the *entire gas limit for an individual block*, even if it were the *only* transaction inside.\n\n**Instead, you pay *someone else* a small fee to do the computation *off chain*.** The person you paid to do this is called a *solver*.\n\nFirst, the solver pays a deposit held in a smart contract. Then, you give the solver a description of the computation they need to execute for you. They run the computation, and return the result. If the result is correct (more on that in a second), their deposit is returned. If it turns out that solver did *not* properly perform the computation — i.e. they cheated or made a mistake — they lose their deposit.\n\n**But how can we tell whether the result was correct, or false?** Truebit uses an economic mechanism called the “verification game”. Essentially, we create an incentive for other parties called *challengers* to check the solvers’ work. If a challenger is able to prove through the verification game that a solver submitted a false result, then they collect a reward, while the solver loses their deposit.\n\nBecause the verification game is performed on-chain, it cannot simply compute the result (which would defeat the entire purpose of the system — if we *could* do the computation on-chain, we wouldn’t need Truebit). Rather, we force both the solver and challenger to identify the *specific operation* that they disagree about. **In effect, we are backing both parties into a corner — finding the actual line of code where they disagree about the outcome.**\n\n![Simplified conceptual diagram of Truebit](https://miro.medium.com/max/1400/1\\*VrRnWxmwPFsszhQiPrx1IQ.png)\n\nOnce that specific operation is identified, it’s small enough to actually be executed by the ethereum main-chain. We then execute that operation through a smart-contract on ethereum, which settles once and for all which party was telling the truth and which was lying or mistaken.\n\nIf you want to learn more about Truebit, you can read the paper [here](https://people.cs.uchicago.edu/\\~teutsch/papers/truebit.pdf), or this [blog post](https://medium.com/@simondlr/an-intro-to-truebit-a-scalable-decentralized-computational-court-1475531400c3) by Simon de la Rouviere.\n\n## **Conclusion**\n\n**Layer 2 solutions share a common insight:** once we have the hard kernel of certainty provided by a public blockchain, we can use it as an anchor for cryptoeconomic systems that extend the usefulness of blockchain applications.\n\nNow that we’ve surveyed some examples, we can be more specific about how layer 2 solutions *apply* this insight. The economic mechanisms used by layer 2 solutions tend to be *interactive games*: they work by creating incentives for different parties to compete against or “check” one another. **A blockchain application can assume that a given claim is likely true, because we’ve created a strong incentive for another party to provide information showing it to be false.**\n\nIn state channels, this is how we confirm the final state of the channel — by giving parties a chance to “rebut” each other. In Plasma, it’s how we manage fraud-proofs and withdrawals. In Truebit, it’s how we ensure that solvers’ tell the truth — by giving an incentive to verifiers to prove the solver wrong.\n\nThese systems will help address some of the challenges involved in scaling ethereum to a massive global user base. Some, like state channels and Plasma, will increase the transaction throughput of the platform. Others, like Truebit, will make it possible to conduct more *difficult* computation as part of a smart contract, opening up new use cases.\n\nThese three examples represent only a small portion of the possible design space for cryptoeconomic scaling solutions. We’ve not even covered the work being done on “inter-blockchain protocols” like [Cosmos](https://cosmos.network/) or [Polkadot](https://blog.stephantual.com/web-three-revisited-part-two-introduction-to-polkadot-what-it-is-what-it-aint-657782051d34) (although whether these are “layer 2” solutions or something else altogether is a topic for another post). **We should also expect to invent *new and unexpected* layer 2 systems that improve on existing models or offer new tradeoffs between speed, finality, and overhead.**\n\nMore important than any *particular* layer 2 solution is further development of the underlying techniques and mechanisms that make them possible in the first place: cryptoeconomic design.\n\n**These layer 2 scaling solutions are a powerful argument for the long-term value of programmable blockchains like ethereum.** Building the economic mechanisms underlying layer 2 solutions is only possible when a blockchain is programmable: you need a scripting language to write the programs that enforce the interactive games. This is much more difficult (or in some cases, like Plasma, probably impossible) on blockchains like bitcoin, which offer only limited scripting possibilities.\n\n**Ethereum lets us build layer 2 solutions to access new points on the tradeoff matrix between speed, finality, and overhead cost.** This makes the underlying blockchain more useful for a larger variety of applications, since different types of applications with different threat models will have natural preferences towards different tradeoffs. For high value transactions where we want protection against even nation-states, we use the main chain. For trading digital collectibles where speed is more important, we can use Plasma. Layer 2 lets us make these tradeoffs *without* compromising the underlying blockchain, preserving decentralization and finality.\n\nFurther, it’s very hard to predict in advance what scripting capabilities will be needed for a given scaling solution. **When ethereum was being designed, Plasma and Truebit had not yet been invented.** But because ethereum is fully programmable, it is capable of implementing virtually any economic mechanism we can invent.\n\nThe only way to take full advantage of the value of blockchain technology — that core *kernel of certainty* created by cryptoeconomic consensus — is with a programmable blockchain like ethereum.\n\n\n---\n\n*Thanks to Vitalik Buterin, Jon Choi, Matt Condon, Chris Dixon, Hudson Jameson, Denis Nazarov, and Jesse Walden for their comments on an earlier draft of this article.*\n\n*Cover photo: Construction of the Tunkhannock Viaduct railway bridge in Pennsylvania ([cc](https://www.flickr.com/photos/library_of_congress/5715531287)). Roman engineering principles being extended to new uses.*", "timestamp": 1632171049, "digest": "b-y5T1oTNGAzp4j9q64aUuwfceQcZsAU1qMpIikeg2o", "contributor": "0x4aa9C5546BE68486c4eF264a230D25674a1A728e"}
{"id": "xdVeRT5dZhQrBlrpcLqCzgPu5-18tC0s5uuLSdl0xO0", "title": "Making Sense of Web 3", "body": "*👋 Note: Originally published on June 6, 2018 on [Medium](https://medium.com/l4-media/making-sense-of-web-3-c1a9e74dcae).* \n\n\n---\n\n[https://medium.com/l4-media/making-sense-of-web-3-c1a9e74dcae](https://medium.com/l4-media/making-sense-of-web-3-c1a9e74dcae)\n\nThe internet is changing again.\n\nOver the last decade internet-based services have trended towards centralization. Today, a handful of companies control the platforms we use to search for information, store our personal data, manage our online identities, and communicate publicly and privately.\n\nAt the same time, a group of seemingly unrelated technologies are being developed on the fringes of the tech industry, ranging from encrypted messaging to digital money. **Within that loose community, “web 3” has become a catchall term for a vision of a new, better internet.** An internet where payments and money are natively digital, where “decentralized” applications compete with centralized ones, and where users have more control over their identity and data.\n\nHowever, we often struggle to articulate what this all means. How might “web 3” be different from previous eras of the internet? What is “decentralization” and why does it matter? How can these new technologies actually be used? We’re spending years building [infrastructure to make blockchains more scalable](https://medium.com/l4-media/making-sense-of-ethereums-layer-2-scaling-solutions-state-channels-plasma-and-truebit-22cb40dcc2f4) — but who will actually use that infrastructure, for what, and why should anyone care?\n\n**This article attempts to explain the web 3 vision in clear, simple terms.** We discuss the core animating idea behind the many projects that form web 3, and survey three key trends.\n\n**This article isn’t a prediction about the future**. The future isn’t fixed: we have to make the right choices to get the world we want. The point of this article is to describe a future that *might* be, a future compelling enough to be worth building, and a future *clear* enough that we know which direction to travel first.\n\n## **The web 3 reformation**\n\nThe internet has gone through major generational shifts before. These expanded the performance, features, and scale of the internet. We went from plaintext websites to streaming video. We went from static web pages to full-featured applications served remotely through the browser. We went from listservs to global social networks that drive modern politics and culture.\n\nAs the web matured, we grew to rely more and more on a handful of large companies. Google built the fastest and most convenient search engine, and have been rewarded with [control over 74% of all search traffic](https://netmarketshare.com/search-engine-market-share.aspx?options=%7B%22filter%22%3A%7B%22%24and%22%3A%5B%7B%22deviceType%22%3A%7B%22%24in%22%3A%5B%22Desktop%2Flaptop%22%5D%7D%7D%5D%7D%2C%22dateLabel%22%3A%22Trend%22%2C%22attributes%22%3A%22share%22%2C%22group%22%3A%22searchEngine%22%2C%22sort%22%3A%7B%22share%22%3A-1%7D%2C%22id%22%3A%22searchEnginesDesktop%22%2C%22dateInterval%22%3A%22Monthly%22%2C%22dateStart%22%3A%222017-04%22%2C%22dateEnd%22%3A%222018-03%22%2C%22segments%22%3A%22-1000%22%7D). Facebook built the most popular social network, and was rewarded with control over the online identities of [2.2 billion people](https://www.statista.com/statistics/264810/number-of-monthly-active-facebook-users-worldwide/).\n\nWeb 3 is *different* from previous generational shifts. At its core, web 3 isn’t about speed, performance, or convenience. In fact, many web 3 applications are, at least today, slower and *less* convenient than existing products.\n\n**Instead, web 3 is about power**. It’s about who has *control* over the technologies and applications that we use every day. **It’s about breaking the dynamic that has shaped the last decade of the web: the tradeoff between convenience and control**. We’ve become so accustomed to this dynamic that it seems inevitable: *of course* using the internet means being surveilled, and *of course* having a social media account means having my personal data sold to advertisers or [worse](https://en.wikipedia.org/wiki/Facebook%E2%80%93Cambridge_Analytica_data_scandal). How could it be any other way?\n\n**Web 3 rejects the premise**. We can have the benefits of the internet *without* handing the majority of power to a minority of companies. The dynamic described above isn’t an iron law of the universe, it’s just a product of the technology available at the time and the choices we made along the way.\n\n“Web 3” is a movement to build different technologies and make better choices. We aren’t trying to *replace* the web, but rather keep what we like while changing its underlying structure — a reformation, not a revolution.\n\nThe projects within it can seem disparate, but they all share a common theme. **Web 3 is a group of technologies that restructure control over the internet.** These range from financial projects (cryptocurrencies), to basic communications technology (end to end encrypted messaging), to mass consumer use-cases (open social networks and p2p markets), to critical internet infrastructure ([decentralized DNS](http://ens.domains/)).\n\nWeb 3 includes more than just cryptocurrencies, blockchains, and other products of [cryptoeconomic design](https://medium.com/l4-media/making-sense-of-cryptoeconomics-5edea77e4e8d). It encompasses any technology that helps reform the centralized internet and lets users take back control over their digital lives. However, we believe that these technologies are the most significant contributors to the web 3 movement today, and for that reason focus on them in this article.\n\n## **Three trends for web 3**\n\nIn this article we survey three trends, and discuss how they might develop over time:\n\n* **First**, money will become a native feature of the internet.\n* **Second**, “decentralized” applications will offer users new capabilities.\n* **Third**, users will have more control over their digital identities and data.\n\nIt’s important to keep in mind that each of these are speculative. Inevitably, web 3 will include technologies and applications we can’t anticipate, and the ones we discuss below will look different than we can imagine today.\n\n## **1. Money**\n\nIn web 3, money is a native feature of the internet.\n\nIn the past, the internet was simply a portal to the offline, traditional financial system. But cryptocurrencies are fundamentally digital — sending a transaction does not require interacting with some offline system, it *only* requires sending a message over the internet. We will soon live in a world where “money” is just something the internet *does*:\n\n* Sending or receiving payments is now something that *any piece of software can do*, and by extension, something that can be done by any person with an internet connection and a phone.\n* Digital payments will unlock new business models that were previously impractical. They will radically lower the costs of some transactions (e.g. cross-border remittances), enable new use-cases (e.g. machine payments), and be available to massive new markets (e.g. people who could not previously access the traditional financial system).\n* An ecosystem of basic financial primitives — lending, derivatives, exchanges — provide the building blocks of more complex financial applications that can be used by anyone.\n* We will create new *kinds* of money, as technologists explore the [cryptoeconomic design space](https://medium.com/l4-media/making-sense-of-cryptoeconomics-5edea77e4e8d). We have only started to explore these possibilities, like [protocol tokens](https://continuations.com/post/148098927445/crypto-tokens-and-the-coming-age-of-protocol#_=_) and [non-fungible digital assets](https://medium.com/crypto-currently/the-anatomy-of-erc721-e9db77abfc24).\n\nCryptocurrency is only possible because Satoshi [invented a way](https://bitcoin.com/bitcoin.pdf) to support a currency and payment network without handing control to any centralized company. Bitcoin is *decentralized* in that it is “controlled” by a variety of actors, ranging from large mining companies, to individual node operators, to core protocol developers. All of them exert influence in different ways and to different degrees, but no individual actor has exclusive power over the network.\n\n**“Decentralization” has become a central concept for web 3**. However, it’s often used more as a slogan than a precise technical description. Decentralization can refer to a huge range of possibilities. Is a platform “decentralized” if it is controlled by 20 entities? 100? 10,000? What *[kind](https://medium.com/@VitalikButerin/the-meaning-of-decentralization-a0c92b76a274)*[ of decentralization](https://medium.com/@VitalikButerin/the-meaning-of-decentralization-a0c92b76a274) are we even considering?\n\nDecentralization isn’t a binary state — it’s a direction along a spectrum of possibilities. Saying a system ought to be “decentralized” is a little like telling an engineer that a bridge ought to be “big”. No doubt, but it’s not very useful information on its own — we also need to know what river you want to span and the load you need to bear.\n\n**The point of web 3 isn’t that all systems must be decentralized as much as possible, but rather that we are newly able to explore more points along the spectrum.** The *degree* of decentralization that is useful or necessary will depend on the application. Bitcoin is an example of this: it is decentralized to a sufficient degree that payments are very difficult to censor and it would be very difficult to change the basic parameters of the currency, i.e. a deflationary monetary policy where the total amount of bitcoin is permanently capped. Others will attempt to create similar global currencies with other features that take advantage of decentralization, e.g. stablecoins like [Dai](https://makerdao.com/) that attempt to solve the problem of volatility.\n\nBecause bitcoin was the first, it’s often taken to be the *only* possible design for a cryptocurrency. As a result, “cryptocurrency” has become synonymous with particular political views about money, such as the virtue of deflationary currencies.\n\nIt’s important to understand that there are many possible designs for a digital currency, which might serve different purposes. Bitcoin enthusiasts believe the purpose of cryptocurrency is to allow people to opt into the enthusiast’s preferred monetary policy, the superiority of which is self-evident. A more humble interpretation is that the innovation of cryptocurrencies is that people can opt into *whatever monetary policy they choose*, whatever that happens to be. All they need is an internet connection and a phone.\n\n## **2. Decentralized applications and services**\n\nThe products and services that make up the internet today tend to be produced and controlled by individual corporations. If you use an internet-based application, there is very likely a legal entity somewhere that controls it. That company employs people to work on it, decides what features get prioritized, controls the servers that host the application’s data, and ultimately determines what code gets pushed to the product.\n\nThe promise of web 3 is that there might be other options. Maybe we can build products and services that are *not* controlled by any single company, but still have comparable usefulness to their centralized equivalents. Just as with Bitcoin, these products would be “decentralized”, though the rationale for decentralization, and the benefits it offers, may be very different.\n\n**Imagine, for instance, what a “decentralized publishing platform” might look like.** This would be a social platform like Twitter or Medium that lets users share content, comment on it, and “vote” for content that they like.\n\nThe platform comes with built-in mechanisms to encourage users to contribute. Instead of just “upvoting” posts, users can send each other micropayments, or set up recurring payments for content creators whose work they want to support. **The best Twitter accounts or Medium authors get paid directly in the platform, instead of having to figure out some secondary way to monetize their large followings.** Even if each upvote was only a few cents, it would still be an improvement over centralized platforms like YouTube, where creators [earn only a few thousand dollars per million views.](https://www.quora.com/How-much-money-do-people-make-from-YouTube-videos-with-1-million-views) On our decentralized platform, there is no central entity to take a large cut of the money that users pay each other. The platform could even use [inflation funding](https://medium.com/@FEhrsam/funding-the-evolution-of-blockchains-87d160988481) to create a pool of rewards, which are distributed to the top posts each day.\n\nThe core rules that govern our decentralized service are defined in an open-source protocol. Users *interact* with that protocol using client-software of their choice. In other words, there would be a variety of apps, all made by different developers, but which all connected to the same social network. These clients may offer different features from one another, but all conform to the same shared protocol, analogous to the way that email clients all use the same standard for sending and receiving emails.\n\nUsers could use any client they choose, and clients can implement different features or offer third party services. Because we’re building on a decentralized protocol, client developers don’t have to [ask permission from any central company](https://www.theverge.com/2018/4/6/17206524/twitter-tweetbot-twitterrific-apps-features-api-changes), and they can [build their product without fear that someday their API access could be revoked.](https://medium.com/@cdixon/why-decentralization-matters-5e3f79f7638e) Users don’t have to wait for twitter to add new anti-spam or anti-harassment features, they just use a client that offers them. An ecosystem of services grows on top of the open protocol, letting users do everything they can do with twitter today and more.\n\n**This illustrates an under-appreciated benefit of decentralized platforms: sustainable ecosystems of third party services.** App developers can build useful products on top of a decentralized protocol without fear that someday their API access will be turned off, because there is no one company who *can* turn it off. The platform can remain neutral, meaning that a larger network of developers will invest their time and money into building businesses on top of it. [Chris Dixon](https://medium.com/u/a8e3741de9e2?source=post_page-----c1a9e74dcae--------------------------------)’s *[Why Decentralization Matters](https://medium.com/@cdixon/why-decentralization-matters-5e3f79f7638e)*[ ](https://medium.com/@cdixon/why-decentralization-matters-5e3f79f7638e)explores this argument in depth.\n\n**Of course, we will still use products and services created by centralized companies.** But it will be possible for these companies to restrict the *type* of control they have over their products, placing more of that control in the hands of users.\n\nThis already exists in encrypted messaging apps, with products like [Signal](https://signal.org/) (made by Open Whisper Systems) that never see or hold any customer communications. By designing their application with end-to-end encryption, they have intentionally *limited the control they have over their users.*\n\n**Where early internet startups committed to an ideal of “don’t be evil”, web 3 companies aim higher to try and ensure that they *can’t* be evil — at least with respect to specific *kinds* of evil.** Web 3 includes technologies that let developers *limit* their control over customers, by refusing to have certain kinds of power in the first place. That doesn’t mean we won’t have to trust centralized companies to some degree, but it does mean we can trust them *less*.\n\n## **3. User control over identity and data**\n\nIn web 3, users will have more control over their identity and their data.\n\nToday, most of our online identities belong to someone else, like a Gmail address or Facebook account. Web 3 is laying the groundwork for personal control of online identities.\n\nIn part, this is a result of the infrastructure being built out for cryptocurrencies. Holding cryptocurrency requires holding private keys, and millions of people use apps that let them do just this. But the same technology can let people manage *any* kind of blockchain-based data, including a personal identity. The fact that we call these apps “wallets” is no coincidence — in the future they will hold not just your money, but also your ID.\n\nAt the same time, web 3 will make it possible for users to retain control of their data. First, because users will have the option of using their *own* identity, instead of one provided by a third party, limiting the opportunities for identity providers like Facebook to capture user data. Second, because the emergence of decentralized services will mean that in some cases, there won’t *be* a central company that is in a position to collect, store, and sell your personal data when you are using social media, renting an apartment, or catching a ride home. **In general, a greater share of our use of the internet will be through platforms and systems that collect no data about us.**\n\nFinally, the new capabilities offered by web 3 technologies — control over our identities and data, and the availability of a worldwide payment network — will make it easier for individual users to capture the value that have turned social media companies into billion dollar businesses.\n\nThese companies collect your data because it’s valuable. **In web 3, users capture that value instead.** If you want to sell data about your personal browsing habits, you will be able to do so directly — but you get paid, not Facebook. And as we experiment with novel mechanisms for ownership over digital assets, individual users will have new ways to actually *own* a piece of the technology that they use every day — an opportunity currently available only to entrepreneurs, venture capitalists, and accredited investors.\n\n## **Conclusion**\n\nWeb 3 is not inevitable. The descriptions above of a *potential* future face many barriers, some of which may never be overcome. Some of the “open problems” in web 3 include:\n\n* **Are entrepreneurs actually incentivized to build decentralized applications?** Who will fund them? Today, the route to profitability and venture-scale returns for these applications is unclear, whereas the traditional “centralized” business model is more reliable.\n* **Will decentralized applications be *worse* than centralized ones?** A product controlled by a single company might have a more coherent product vision, and is able to rapidly iterate on new features. [Centralized products may always have better UX and ease of setup](https://blog.ghost.org/5/).\n* **Will the cryptographic components of decentralized applications be too challenging for most users?** How can users manage private keys in a way that can be safely recoverable? Is that even possible without returning to some form of centralized service?\n* **Will decentralized applications be more expensive to use?** Low level decentralized systems (e.g. file storage, computation, oracles) have many redundancies built in to make them function. Will these layers make decentralized applications too costly?\n* **Will decentralized applications built with “smart contracts” ever make sense?** Is it possible to write “immutable” code that fulfills an application’s requirements forever? If we need to upgrade smart contracts, then who gets to decide those upgrades, and is it any different from a centralized application?\n* **How will decentralized systems be “governed”?** Decision making by centralized companies with total control is easier than building consensus among a group of actors with different interests and priorities. How will governance of the base layers work across different political ideologies and cultures?\n* **Do enough users actually care about privacy, controlling their own identity, or access to open financial services?** Or will the goals of web 3 always be a niche concern?\n* **How will governments and regulators respond to web 3?** There is inevitable tension created by technologies that give people new capabilities. Web 3 includes technologies that avoid censorship and surveillance, and could be used to sidestep financial regulation and law enforcement.\n* **Can the base-layer blockchains used by web 3 apps** ever [scale to serve millions or billions of users?](https://medium.com/l4-media/making-sense-of-ethereums-layer-2-scaling-solutions-state-channels-plasma-and-truebit-22cb40dcc2f4)\n\nEven with this uncertainty, web 3 is a worthwhile vision for the future. Cryptocurrency and blockchain enthusiasts are rightly criticized for focusing myopically on technology, rather than the problems that technology is supposed to solve. Cryptocurrencies and blockchains aren’t ends in themselves: they are only valuable in so far as they solve a problem. The web 3 vision is helpful because it reorients us towards that problem: the internet has grown too centralized, and it needs to be opened up.\n\nFocusing on the web 3 vision instead of any specific technology also helps us step outside the partisan politics that defines much of the cryptocurrency space. Web 3 is agnostic about whose platform ends up being used — the focus is on *what the technology can actually do* and *what problems it solves for people*.\n\nEthereum or Bitcoin could fail, but if they did the web 3 vision would not die. We would just build new, better versions of those systems using the same applied body of knowledge that we’ve developed over the last 8 years — [cryptoeconomics](https://medium.com/l4-media/making-sense-of-cryptoeconomics-5edea77e4e8d) — and keep on building.\n\nWeb 3 won’t be a utopia, and we shouldn’t delude ourselves into thinking it will be. If anything, the last 20 years should teach us that technology is not a magic bullet, and that the same human problems that exist everywhere exist on the internet, too. Politics, power, and control didn’t disappear with the invention of the web, they just took different forms. The promise of web 3 is that at least this time, constraints on power and control are design requirements, not afterthoughts. We have a second chance to build the internet as it was supposed to be, and we might not get a third — let’s make the most of it.", "timestamp": 1632171911, "digest": "tUjTr4Cf5AOHUyzsXHR_CXD-1DpEegeKZvts1N7sjsU", "contributor": "0x4aa9C5546BE68486c4eF264a230D25674a1A728e"}
{"id": "A-AfJJuiiBZp1F5WJYH22EOI7_xdn_3-3_xP3tUH-08", "title": "Making Sense of Web 3", "body": "*👋 Note: Originally published on June 6, 2018 on [Medium](https://medium.com/l4-media/making-sense-of-web-3-c1a9e74dcae).*\n\n\n---\n\nThe internet is changing again.\n\nOver the last decade internet-based services have trended towards centralization. Today, a handful of companies control the platforms we use to search for information, store our personal data, manage our online identities, and communicate publicly and privately.\n\nAt the same time, a group of seemingly unrelated technologies are being developed on the fringes of the tech industry, ranging from encrypted messaging to digital money. **Within that loose community, “web 3” has become a catchall term for a vision of a new, better internet.** An internet where payments and money are natively digital, where “decentralized” applications compete with centralized ones, and where users have more control over their identity and data.\n\nHowever, we often struggle to articulate what this all means. How might “web 3” be different from previous eras of the internet? What is “decentralization” and why does it matter? How can these new technologies actually be used? We’re spending years building [infrastructure to make blockchains more scalable](https://medium.com/l4-media/making-sense-of-ethereums-layer-2-scaling-solutions-state-channels-plasma-and-truebit-22cb40dcc2f4) — but who will actually use that infrastructure, for what, and why should anyone care?\n\n**This article attempts to explain the web 3 vision in clear, simple terms.** We discuss the core animating idea behind the many projects that form web 3, and survey three key trends.\n\n**This article isn’t a prediction about the future**. The future isn’t fixed: we have to make the right choices to get the world we want. The point of this article is to describe a future that *might* be, a future compelling enough to be worth building, and a future *clear* enough that we know which direction to travel first.\n\n## **The web 3 reformation**\n\nThe internet has gone through major generational shifts before. These expanded the performance, features, and scale of the internet. We went from plaintext websites to streaming video. We went from static web pages to full-featured applications served remotely through the browser. We went from listservs to global social networks that drive modern politics and culture.\n\nAs the web matured, we grew to rely more and more on a handful of large companies. Google built the fastest and most convenient search engine, and have been rewarded with [control over 74% of all search traffic](https://netmarketshare.com/search-engine-market-share.aspx?options=%7B%22filter%22%3A%7B%22%24and%22%3A%5B%7B%22deviceType%22%3A%7B%22%24in%22%3A%5B%22Desktop%2Flaptop%22%5D%7D%7D%5D%7D%2C%22dateLabel%22%3A%22Trend%22%2C%22attributes%22%3A%22share%22%2C%22group%22%3A%22searchEngine%22%2C%22sort%22%3A%7B%22share%22%3A-1%7D%2C%22id%22%3A%22searchEnginesDesktop%22%2C%22dateInterval%22%3A%22Monthly%22%2C%22dateStart%22%3A%222017-04%22%2C%22dateEnd%22%3A%222018-03%22%2C%22segments%22%3A%22-1000%22%7D). Facebook built the most popular social network, and was rewarded with control over the online identities of [2.2 billion people](https://www.statista.com/statistics/264810/number-of-monthly-active-facebook-users-worldwide/).\n\nWeb 3 is *different* from previous generational shifts. At its core, web 3 isn’t about speed, performance, or convenience. In fact, many web 3 applications are, at least today, slower and *less* convenient than existing products.\n\n**Instead, web 3 is about power**. It’s about who has *control* over the technologies and applications that we use every day. **It’s about breaking the dynamic that has shaped the last decade of the web: the tradeoff between convenience and control**. We’ve become so accustomed to this dynamic that it seems inevitable: *of course* using the internet means being surveilled, and *of course* having a social media account means having my personal data sold to advertisers or [worse](https://en.wikipedia.org/wiki/Facebook%E2%80%93Cambridge_Analytica_data_scandal). How could it be any other way?\n\n**Web 3 rejects the premise**. We can have the benefits of the internet *without* handing the majority of power to a minority of companies. The dynamic described above isn’t an iron law of the universe, it’s just a product of the technology available at the time and the choices we made along the way.\n\n“Web 3” is a movement to build different technologies and make better choices. We aren’t trying to *replace* the web, but rather keep what we like while changing its underlying structure — a reformation, not a revolution.\n\nThe projects within it can seem disparate, but they all share a common theme. **Web 3 is a group of technologies that restructure control over the internet.** These range from financial projects (cryptocurrencies), to basic communications technology (end to end encrypted messaging), to mass consumer use-cases (open social networks and p2p markets), to critical internet infrastructure ([decentralized DNS](http://ens.domains/)).\n\nWeb 3 includes more than just cryptocurrencies, blockchains, and other products of [cryptoeconomic design](https://medium.com/l4-media/making-sense-of-cryptoeconomics-5edea77e4e8d). It encompasses any technology that helps reform the centralized internet and lets users take back control over their digital lives. However, we believe that these technologies are the most significant contributors to the web 3 movement today, and for that reason focus on them in this article.\n\n## **Three trends for web 3**\n\nIn this article we survey three trends, and discuss how they might develop over time:\n\n* **First**, money will become a native feature of the internet.\n* **Second**, “decentralized” applications will offer users new capabilities.\n* **Third**, users will have more control over their digital identities and data.\n\nIt’s important to keep in mind that each of these are speculative. Inevitably, web 3 will include technologies and applications we can’t anticipate, and the ones we discuss below will look different than we can imagine today.\n\n## **1. Money**\n\nIn web 3, money is a native feature of the internet.\n\nIn the past, the internet was simply a portal to the offline, traditional financial system. But cryptocurrencies are fundamentally digital — sending a transaction does not require interacting with some offline system, it *only* requires sending a message over the internet. We will soon live in a world where “money” is just something the internet *does*:\n\n* Sending or receiving payments is now something that *any piece of software can do*, and by extension, something that can be done by any person with an internet connection and a phone.\n* Digital payments will unlock new business models that were previously impractical. They will radically lower the costs of some transactions (e.g. cross-border remittances), enable new use-cases (e.g. machine payments), and be available to massive new markets (e.g. people who could not previously access the traditional financial system).\n* An ecosystem of basic financial primitives — lending, derivatives, exchanges — provide the building blocks of more complex financial applications that can be used by anyone.\n* We will create new *kinds* of money, as technologists explore the [cryptoeconomic design space](https://medium.com/l4-media/making-sense-of-cryptoeconomics-5edea77e4e8d). We have only started to explore these possibilities, like [protocol tokens](https://continuations.com/post/148098927445/crypto-tokens-and-the-coming-age-of-protocol#_=_) and [non-fungible digital assets](https://medium.com/crypto-currently/the-anatomy-of-erc721-e9db77abfc24).\n\nCryptocurrency is only possible because Satoshi [invented a way](https://bitcoin.com/bitcoin.pdf) to support a currency and payment network without handing control to any centralized company. Bitcoin is *decentralized* in that it is “controlled” by a variety of actors, ranging from large mining companies, to individual node operators, to core protocol developers. All of them exert influence in different ways and to different degrees, but no individual actor has exclusive power over the network.\n\n**“Decentralization” has become a central concept for web 3**. However, it’s often used more as a slogan than a precise technical description. Decentralization can refer to a huge range of possibilities. Is a platform “decentralized” if it is controlled by 20 entities? 100? 10,000? What *[kind](https://medium.com/@VitalikButerin/the-meaning-of-decentralization-a0c92b76a274)*[ of decentralization](https://medium.com/@VitalikButerin/the-meaning-of-decentralization-a0c92b76a274) are we even considering?\n\nDecentralization isn’t a binary state — it’s a direction along a spectrum of possibilities. Saying a system ought to be “decentralized” is a little like telling an engineer that a bridge ought to be “big”. No doubt, but it’s not very useful information on its own — we also need to know what river you want to span and the load you need to bear.\n\n**The point of web 3 isn’t that all systems must be decentralized as much as possible, but rather that we are newly able to explore more points along the spectrum.** The *degree* of decentralization that is useful or necessary will depend on the application. Bitcoin is an example of this: it is decentralized to a sufficient degree that payments are very difficult to censor and it would be very difficult to change the basic parameters of the currency, i.e. a deflationary monetary policy where the total amount of bitcoin is permanently capped. Others will attempt to create similar global currencies with other features that take advantage of decentralization, e.g. stablecoins like [Dai](https://makerdao.com/) that attempt to solve the problem of volatility.\n\nBecause bitcoin was the first, it’s often taken to be the *only* possible design for a cryptocurrency. As a result, “cryptocurrency” has become synonymous with particular political views about money, such as the virtue of deflationary currencies.\n\nIt’s important to understand that there are many possible designs for a digital currency, which might serve different purposes. Bitcoin enthusiasts believe the purpose of cryptocurrency is to allow people to opt into the enthusiast’s preferred monetary policy, the superiority of which is self-evident. A more humble interpretation is that the innovation of cryptocurrencies is that people can opt into *whatever monetary policy they choose*, whatever that happens to be. All they need is an internet connection and a phone.\n\n## **2. Decentralized applications and services**\n\nThe products and services that make up the internet today tend to be produced and controlled by individual corporations. If you use an internet-based application, there is very likely a legal entity somewhere that controls it. That company employs people to work on it, decides what features get prioritized, controls the servers that host the application’s data, and ultimately determines what code gets pushed to the product.\n\nThe promise of web 3 is that there might be other options. Maybe we can build products and services that are *not* controlled by any single company, but still have comparable usefulness to their centralized equivalents. Just as with Bitcoin, these products would be “decentralized”, though the rationale for decentralization, and the benefits it offers, may be very different.\n\n**Imagine, for instance, what a “decentralized publishing platform” might look like.** This would be a social platform like Twitter or Medium that lets users share content, comment on it, and “vote” for content that they like.\n\nThe platform comes with built-in mechanisms to encourage users to contribute. Instead of just “upvoting” posts, users can send each other micropayments, or set up recurring payments for content creators whose work they want to support. **The best Twitter accounts or Medium authors get paid directly in the platform, instead of having to figure out some secondary way to monetize their large followings.** Even if each upvote was only a few cents, it would still be an improvement over centralized platforms like YouTube, where creators [earn only a few thousand dollars per million views.](https://www.quora.com/How-much-money-do-people-make-from-YouTube-videos-with-1-million-views) On our decentralized platform, there is no central entity to take a large cut of the money that users pay each other. The platform could even use [inflation funding](https://medium.com/@FEhrsam/funding-the-evolution-of-blockchains-87d160988481) to create a pool of rewards, which are distributed to the top posts each day.\n\nThe core rules that govern our decentralized service are defined in an open-source protocol. Users *interact* with that protocol using client-software of their choice. In other words, there would be a variety of apps, all made by different developers, but which all connected to the same social network. These clients may offer different features from one another, but all conform to the same shared protocol, analogous to the way that email clients all use the same standard for sending and receiving emails.\n\nUsers could use any client they choose, and clients can implement different features or offer third party services. Because we’re building on a decentralized protocol, client developers don’t have to [ask permission from any central company](https://www.theverge.com/2018/4/6/17206524/twitter-tweetbot-twitterrific-apps-features-api-changes), and they can [build their product without fear that someday their API access could be revoked.](https://medium.com/@cdixon/why-decentralization-matters-5e3f79f7638e) Users don’t have to wait for twitter to add new anti-spam or anti-harassment features, they just use a client that offers them. An ecosystem of services grows on top of the open protocol, letting users do everything they can do with twitter today and more.\n\n**This illustrates an under-appreciated benefit of decentralized platforms: sustainable ecosystems of third party services.** App developers can build useful products on top of a decentralized protocol without fear that someday their API access will be turned off, because there is no one company who *can* turn it off. The platform can remain neutral, meaning that a larger network of developers will invest their time and money into building businesses on top of it. [Chris Dixon](https://medium.com/u/a8e3741de9e2?source=post_page-----c1a9e74dcae--------------------------------)’s *[Why Decentralization Matters](https://medium.com/@cdixon/why-decentralization-matters-5e3f79f7638e)*[ ](https://medium.com/@cdixon/why-decentralization-matters-5e3f79f7638e)explores this argument in depth.\n\n**Of course, we will still use products and services created by centralized companies.** But it will be possible for these companies to restrict the *type* of control they have over their products, placing more of that control in the hands of users.\n\nThis already exists in encrypted messaging apps, with products like [Signal](https://signal.org/) (made by Open Whisper Systems) that never see or hold any customer communications. By designing their application with end-to-end encryption, they have intentionally *limited the control they have over their users.*\n\n**Where early internet startups committed to an ideal of “don’t be evil”, web 3 companies aim higher to try and ensure that they *can’t* be evil — at least with respect to specific *kinds* of evil.** Web 3 includes technologies that let developers *limit* their control over customers, by refusing to have certain kinds of power in the first place. That doesn’t mean we won’t have to trust centralized companies to some degree, but it does mean we can trust them *less*.\n\n## **3. User control over identity and data**\n\nIn web 3, users will have more control over their identity and their data.\n\nToday, most of our online identities belong to someone else, like a Gmail address or Facebook account. Web 3 is laying the groundwork for personal control of online identities.\n\nIn part, this is a result of the infrastructure being built out for cryptocurrencies. Holding cryptocurrency requires holding private keys, and millions of people use apps that let them do just this. But the same technology can let people manage *any* kind of blockchain-based data, including a personal identity. The fact that we call these apps “wallets” is no coincidence — in the future they will hold not just your money, but also your ID.\n\nAt the same time, web 3 will make it possible for users to retain control of their data. First, because users will have the option of using their *own* identity, instead of one provided by a third party, limiting the opportunities for identity providers like Facebook to capture user data. Second, because the emergence of decentralized services will mean that in some cases, there won’t *be* a central company that is in a position to collect, store, and sell your personal data when you are using social media, renting an apartment, or catching a ride home. **In general, a greater share of our use of the internet will be through platforms and systems that collect no data about us.**\n\nFinally, the new capabilities offered by web 3 technologies — control over our identities and data, and the availability of a worldwide payment network — will make it easier for individual users to capture the value that have turned social media companies into billion dollar businesses.\n\nThese companies collect your data because it’s valuable. **In web 3, users capture that value instead.** If you want to sell data about your personal browsing habits, you will be able to do so directly — but you get paid, not Facebook. And as we experiment with novel mechanisms for ownership over digital assets, individual users will have new ways to actually *own* a piece of the technology that they use every day — an opportunity currently available only to entrepreneurs, venture capitalists, and accredited investors.\n\n## **Conclusion**\n\nWeb 3 is not inevitable. The descriptions above of a *potential* future face many barriers, some of which may never be overcome. Some of the “open problems” in web 3 include:\n\n* **Are entrepreneurs actually incentivized to build decentralized applications?** Who will fund them? Today, the route to profitability and venture-scale returns for these applications is unclear, whereas the traditional “centralized” business model is more reliable.\n* **Will decentralized applications be *worse* than centralized ones?** A product controlled by a single company might have a more coherent product vision, and is able to rapidly iterate on new features. [Centralized products may always have better UX and ease of setup](https://blog.ghost.org/5/).\n* **Will the cryptographic components of decentralized applications be too challenging for most users?** How can users manage private keys in a way that can be safely recoverable? Is that even possible without returning to some form of centralized service?\n* **Will decentralized applications be more expensive to use?** Low level decentralized systems (e.g. file storage, computation, oracles) have many redundancies built in to make them function. Will these layers make decentralized applications too costly?\n* **Will decentralized applications built with “smart contracts” ever make sense?** Is it possible to write “immutable” code that fulfills an application’s requirements forever? If we need to upgrade smart contracts, then who gets to decide those upgrades, and is it any different from a centralized application?\n* **How will decentralized systems be “governed”?** Decision making by centralized companies with total control is easier than building consensus among a group of actors with different interests and priorities. How will governance of the base layers work across different political ideologies and cultures?\n* **Do enough users actually care about privacy, controlling their own identity, or access to open financial services?** Or will the goals of web 3 always be a niche concern?\n* **How will governments and regulators respond to web 3?** There is inevitable tension created by technologies that give people new capabilities. Web 3 includes technologies that avoid censorship and surveillance, and could be used to sidestep financial regulation and law enforcement.\n* **Can the base-layer blockchains used by web 3 apps** ever [scale to serve millions or billions of users?](https://medium.com/l4-media/making-sense-of-ethereums-layer-2-scaling-solutions-state-channels-plasma-and-truebit-22cb40dcc2f4)\n\nEven with this uncertainty, web 3 is a worthwhile vision for the future. Cryptocurrency and blockchain enthusiasts are rightly criticized for focusing myopically on technology, rather than the problems that technology is supposed to solve. Cryptocurrencies and blockchains aren’t ends in themselves: they are only valuable in so far as they solve a problem. The web 3 vision is helpful because it reorients us towards that problem: the internet has grown too centralized, and it needs to be opened up.\n\nFocusing on the web 3 vision instead of any specific technology also helps us step outside the partisan politics that defines much of the cryptocurrency space. Web 3 is agnostic about whose platform ends up being used — the focus is on *what the technology can actually do* and *what problems it solves for people*.\n\nEthereum or Bitcoin could fail, but if they did the web 3 vision would not die. We would just build new, better versions of those systems using the same applied body of knowledge that we’ve developed over the last 8 years — [cryptoeconomics](https://medium.com/l4-media/making-sense-of-cryptoeconomics-5edea77e4e8d) — and keep on building.\n\nWeb 3 won’t be a utopia, and we shouldn’t delude ourselves into thinking it will be. If anything, the last 20 years should teach us that technology is not a magic bullet, and that the same human problems that exist everywhere exist on the internet, too. Politics, power, and control didn’t disappear with the invention of the web, they just took different forms. The promise of web 3 is that at least this time, constraints on power and control are design requirements, not afterthoughts. We have a second chance to build the internet as it was supposed to be, and we might not get a third — let’s make the most of it.", "timestamp": 1632172333, "digest": "tUjTr4Cf5AOHUyzsXHR_CXD-1DpEegeKZvts1N7sjsU", "contributor": "0x4aa9C5546BE68486c4eF264a230D25674a1A728e"}
{"id": "vqJDwGUbjMn0yP80boJX7GWpJ4CPputph-l7SXvANTA", "title": "The Space of Possible Economic Relationships", "body": "*👋 Note: Originally published on June 7, 2017 on a now-defunct personal blog.* \n\n\n---\n\nA concept I often use to explain the potential of blockchain technology is “the space of possible economic relationships”.\n\nWhat do I mean by economic relationships? I mean any situation where two or more persons enter into a relationship concerned with value:\n\n* A transfer of cash\n* An informal agreement to borrow money from a friend\n* A legal contract to buy a house\n* The relationship between all the shareholders of a corporation\n* The relationship between all persons who use US dollars\n\nThis is meant to be very broad, including informal agreements, legal contracts, and very diffuse relationships that we don’t often think about, like sharing a national currency.\n\nNow, let’s imagine a space that contains all possible economic relationships, and put some points on a graph.\n\n![](https://miro.medium.com/max/1400/1\\*u4WQl_sHGgEtAeAVdRTzLg.png)\n\nThis space includes not just all economic relationships that we’re familiar with or which are even used, but every possible economic relationship that could exist.\n\nIn reality, only some of this graph is available to us. Let’s draw a line to indicate which economic relationships are actually possible today.\n\n![](https://miro.medium.com/max/1400/1\\*1JIdAbOhHOxaQbe81PijPQ.png)\n\nEvery economic relationship currently used by human beings (not just the ones we have highlighted as examples) is in this section. Every kind of purchase, corporate structure, debt instrument, store of value, and medium of exchange is somewhere inside that shape.\n\nThis shape used to look different, and was once much smaller. Until we invented money, we might have only had access to a very small area near the bottom right. Currency zones only became possible with stable political systems. Binding contracts required the slow evolution of complex legal systems. Public companies with shareholders required centuries of common law and commercial experience, and creating new specializations in professions like finance and law. All of these required technology, too: metalworking for money, writing for law, and even information technology for modern stock exchanges (ever heard of the [paper crisis?](https://www.finra.org/investors/when-paper-paralyzed-wall-street-remembering-1960s-paperwork-crisis)).\n\nWe only have access to these economic relationships because these are the only ones for which we’ve built out the necessary institutions and technology. There are probably many other kinds of economic relationships out there, in the blank space, that we haven’t been able to access.\n\nRecently, the invention of blockchain technology has expanded the frontier of this space. Now it probably looks a lot weirder — maybe something like this:\n\n![](https://miro.medium.com/max/1400/1\\*cAFCgQinOhDUmsfzDwqtXA.png)\n\nBlockchains let us do things that weren’t possible before:\n\n* A small group of cryptography enthusiasts can [successfully bootstrap a global currency into existence](https://bitcoin.org/bitcoin.pdf), without relying on the infrastructure of a nation state.\n* We can now send money anywhere in the world very quickly and relatively cheaply, again without relying on traditional institutions.\n* We can [use very simple computer code to organize and collect millions of dollars](https://medium.com/@balajis/thoughts-on-tokens-436109aabcbe) from thousands of contributors all over the world.\n\nTypes of economic relationships that used to have big, expensive barriers to entry are suddenly a lot easier, and we’ve only really just begun experimenting with the technology.\n\nBlockchains have expanded the space of possible economic relationships. But it’s been so sudden, we’re not really sure what to do with them yet. Usually these new capabilities develop slowly, because they require legal and political systems that are naturally gradual and expensive to change.\n\nBut blockchains let us do some things without those institutions, which means new capabilities become available much faster than usual. The limiting factor isn’t going to be whether we have the capability to do these things, but our ability to recognize that the space of possible economic relationships *has* expanded, and identify new useful things to build in those spaces.", "timestamp": 1632173630, "digest": "6s-JuW7PpgOxGUUNGu_k8NqhU3gjEFk4byy2znXv-dU", "contributor": "0x4aa9C5546BE68486c4eF264a230D25674a1A728e"}
{"id": "l5pZb7XR_pfNEh_TuQz_Wne5qh4pZ4scg8W97GaeDu4", "title": "Test Entry Editions With Fees", "body": "Test", "timestamp": 1632184065, "digest": "q7Ykp1rGI_OQd8apKWzePP0pWWX-7Es45Y7LlkLqcgo", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "fyJ8UEfcm1bJGDwcx-OnZY04Yh796oT9UFlDrpkv5qU", "title": "Using the Technology as a Tool", "body": "The timeline of human development is a spring. Sometimes the coil is more compressed.\n\n[https://twitter.com/0ddette/status/1376008296415559680](https://twitter.com/0ddette/status/1376008296415559680)\n\nMy undergrad photography program, like most liberal art programs, was built on a structure emphasizing fundamentals as a first step down a path of cumulative experimentation–in intellectual development, in visual style, and in tools used. The cornerstone was analog: shooting black and white 35mm film, developing the negatives yourself, and making prints in the darkroom. Later years had time devoted to learning view cameras, lighting, studio setups–all the stuff that’s been around for 50-100 years–and, of course, digital capture, editing, and printing.\n\nIn my last two years at school a department-wide debate emerged: whether to still require incoming freshmen to learn the wet darkroom or let them go directly digital. For a lot of younger students it made no sense to grok a skill and set of equipment they didn’t want to use. For a lot of older students it made no sense to experiment at the cutting edge without appreciation for the art’s history. Faculty, who practiced in a wide range of media, seemed caught in the middle.\n\nWorking in color captured these questions well. It isn’t practical (or really even possible) for someone to develop color film themselves, so shooting color means taking it to an outside lab as a first step; already once removed from the artist’s hands. Chromogenic prints cannot be made in the same type of wet darkroom as gelatin silver prints since no visible spectrum of light is safe to use with the paper, so they’re exposed in total darkness (in small individual darkrooms), and developed by a machine the size of a truck that’s accessed through a closet (at Tisch ours was a Colenta and probably cost $350,000 when new, in the 1990s). No hands in trays of chemicals, no fighting over control of the stereo. The complexity and relative absurdity of the process–working in complete darkness at each step, going in and out of different tiny rooms–in fact makes it far more esoteric than black and white printing, which can be done by almost anyone in almost any dark space with a few buckets and a red light bulb. But at one time, it was cutting edge. While I was in school, it was still the dominant method of printing color, and what you saw most often on gallery walls in Chelsea.\n\nMy thesis exhibition (in 2009) was entirely chromogenic prints, and if I remember correctly about a third of my classmates did the same. Within two years, the program’s head technician emailed me saying I could have the Colenta if I would get it out of the building.\n\n[https://twitter.com/lemiscate/status/1369237479317004289](https://twitter.com/lemiscate/status/1369237479317004289)\n\nEthereum opened a new space and provides an opportunity for artists to work with a previously unknown medium. This is exciting to the point of mania-inducing, which is what makes it feel simultaneously hopeful and dangerous. It’s also what creates a financial bubble, which for the obvious reasons is dramatically exacerbated in the case of NFTs. Worst of all, it’s what often pushes aside the most interesting work being done, work which is trying to understand what the technology unlocks–what it enables in itself–separate from how it can merely transport an existing object (say, a JPEG) into a different realm (say, a hyperfinancial one). I’m talking about the work that literally cannot exist without the specific tool.\n\nAn excellent example of this is Robin Sloan’s [Amulets](https://text.bargains/) project.\n\n[ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/815](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/815)\n\nAn amulet results from the appearance of sequential 8’s in the sha256 hash of a short piece of text; it cannot exist separate from the sha256 hash function (which is integral, but not unique, to Ethereum). The quantity of 8’s determines the amulet’s rarity (as established by the artist). The full definition and set of rules are very worth reading. It’s a nice game. It’s hard to imagine anyone paying a lot of money for these.\n\n[Framergence](https://framergence.art/) is particularly interesting because the creative mechanism is tied explicitly to Ethereum, in that the set of NFTs that exists can be modified in real time on-chain by the users. Each is algorithmically generated based on fractal patterns; the contract also rewards token burning by re-minting an n-1 amount of new tokens. This has led to people purchasing examples they intend to burn in the hunt for more pleasing iterations.\n\n![](https://content.framergence.art/3023962126_hires.png)\n\nEzra Miller’s [Solvency](https://solvency.art), a personal favorite, is not only technically accomplished, with the assets stored entirely on Ethereum and Arweave, but the individual mints are also beautiful, aesthetically complex and varied between mints, yet still cohesive as a body of work. Their infinite runtime is the kicker.\n\n[https://5kuzmctr2tmkwxq7vkz6ejfqrjvz7sih34rfmu6wyhnywbvkmivq.arweave.net/6qmWCnHU2KteH6qz4iSwimufyQffIlZT1sHbiwaqYis/?seed=0x1940347e592e022caa1f5b729b5902bf39de340a44dec77a99d1d2ff4070ea53?display=iframe](https://5kuzmctr2tmkwxq7vkz6ejfqrjvz7sih34rfmu6wyhnywbvkmivq.arweave.net/6qmWCnHU2KteH6qz4iSwimufyQffIlZT1sHbiwaqYis/?seed=0x1940347e592e022caa1f5b729b5902bf39de340a44dec77a99d1d2ff4070ea53?display=iframe)\n\nThese examples demonstrate the positive feedback loop that emerges from strong artist-tool relationships and leads to canonical outcomes. In the best cases it is indistinguishable from collaboration. I would go further and say that the strongest relationships depend on high friction environments. In these cases, the tools are new. They’re difficult to understand and often expensive to use. There’s a lot of trial and error. Much of the work has to be done “by hand,” and it’s slow going. The audience doesn’t have good references to understand the output; there’s probably very little criticism to place it in a historical context. The conditions are conducive to failure rather than success. And this leads to a lot of “failures.” Outside the small ecosystem of devoted creators and users, the work that employs the most experimental elements of a new technological space tends to be misunderstood, undervalued, and in many cases lost entirely.\n\nThe same dynamic (with the opposite effect on market price) can apply to esoteric and “outdated” tools and processes. It was no surprise that [the best paper maker in Japan](https://www.washiya.com/shop/iwanohousho/kodawarienglish.html) had custom-designed all of his equipment, worked without the use of any bleach or other additives, and had not changed the process first established by his family 8 generations prior. Of course, his output is 1/100th of what a modernized paper maker can achieve, let alone a factory.\n\nWhat constitutes high friction (and low friction) is an ever-moving target and always relative. In 2007 digital photography was high friction (to achieve comparable results to analog, or to embrace the unique aesthetics of pixels), and analog low friction. That has since inverted. Today, shooting 4K video on your phone feels easy; it will eventually feel cumbersome when most people have contact lens wearables, or something equally absurd-sounding.\n\n[https://twitter.com/etheria_feed/status/1370825688647884802](https://twitter.com/etheria_feed/status/1370825688647884802)\n\n[https://twitter.com/samspike/status/1439030208640823305?s=20](https://twitter.com/samspike/status/1439030208640823305?s=20)\n\nI originally began this essay in March. Etheria has since been resuscitated; NFT archeology in the search of yield is an active pursuit. Generative art is now rampant with derivatives. Copies of copies of copies. As with everything, the financial mechanisms of crypto allow–if not require–this speedrunning. Thus, we are already in a transient period of low friction and increasing mania. We’re surrounded by work that deploys the technology as an inherent component, but is otherwise artistically unremarkable. Its newness nonetheless commands enormous value. This, too, can cause artists’ work to be overlooked. Launch a series on Art Blocks and you tap into an automatic market of collectors and liquidity. Launch the same series on your own site and you may be lucky to sell a handful (probably not in this market, but you know what I mean). This problem isn’t unique to NFTs; the same dynamic is built into the structures of the legacy art world. Indeed the same dynamic emerges any time a certain technology (and its associated market) becomes frictionless enough.\n\nIt’s a failure both when a technology is used as a non-tool acceleration vehicle, and when it’s worshipped as a self-solving perpetual motion machine. During a bubble the technology exhibits both properties. Everybody rushes in because it’s a money printer, and many of those involved begin to see it as a Rosetta stone device. Irrational exuberance. Soon after the bubble pops because it’s discovered that the tools are insufficient for the narrative they sell.\n\nA similar mistake can be made with tools and their characteristics of nostalgia. This was at the heart of the debate at Tisch. Many saw digital photography as a fad, a shortcut, and aesthetically insufficient (“It’s a lower resolution than film, what’s the point?”). Thus black and white wet darkroom printing *had* to be learned; when the current iteration of digital technology was no longer in use, the artist would still have the through-line to grasp. A safety net, and therefore superior.\n\nThis is the common misconception of any new technology: riskier, less reliable, less future-proof. Because it’s iterating so quickly, it’s impermanent whenever and wherever it’s measured. It appears fleeting because most of it is fleeting. But that’s measuring the products of a tool; it’s not taking stock of the tool itself, on its inherent conceptual terms. Certain foundational components attain extreme Lindy status, while many cutting-edge experiments are ultimately relegated to history after leapfrogging each other during the rapid expansion phase. Here’s where we start arguing about Bitcoin and Ethereum.\n\nOf course, even gelatin silver prints, the most Lindy form of photography in history, are becoming harder to make and more homogenized–the number of companies still producing the necessary materials (film, paper, chemicals) and equipment (enlargers, cameras) has shrunk dramatically, a process that began well before digital photography became superior (the market re-prices according to future developments, not current realities). For the few photographers still working in black and white wet darkrooms, they’ve had to further hone their craft. But most have moved on to digital.\n\nDeafBeef [understands this well](https://jpg.mirror.xyz/qSUps1Krz02iyW8FCWHiEcHGaLrslw6BSldJQpuD9_A):\n\n> Your old smartphone is junk. On the other hand, an analog signal processor can be repaired, repurposed, and scavenged for parts. Oscilloscopes remain useful tools for electrical engineers. Vinyl and magnetic tape recordings from the 60s can still be played. ASCII terminal screens, for those who know how to use them, remain the most efficient way to interact with a computer for many tasks.\n\nEventually, the old smartphone will also be a field to harvest. And It turns out that inkjet prints are actually more stable and conservation-friendly than chromogenic prints; they also don’t require the use of harsh chemicals. Thus the point is not necessarily to be faithful to a specific tool, but to a certain intellectual approach, which is reliant on an appreciation for and handiness with a certain set of tools, and an ability to recognize which tools hold the most potency for honing and distilling.\n\n![David Rudnick's EXODUS 2, VII – Jagged Quartz Towers](https://images.mirror-media.xyz/publication-images/kQVIyPwG9JQfTpg54kLmQ.png?height=996&width=1016)\n\nI’m reminded now of [David Rudnick](https://exodus-ii.folia.app/)’s rhetorical device of [primacy](https://interdependence.fm/episodes/primacism-david-rudnick-on-the-struggle-for-primacy-type-and-poetrys-unique-value-in-an-age-of-digital-and-physical-conflict-and-percy-shelleys-mont-blanc)–Physical Prime vs. Digital Prime. We’re rapidly approaching the event horizon of digital primacy, the point at which we will spend more of our time in digital spaces rather than physical ones. The exponential deployment of digital objects as totemic and memetic devices is testament to this. These totems help us form narratives, and their appearance (in absolute numbers, in iterative qualities, in variability of aesthetics) has a direct relationship to our distance from the threshold.\n\nA major risk is in not recognizing the threshold; the result is a digital-prime world built with tools we can’t understand, illustrating myths that only abstract our social relationship to them. It inflates a bubble. Life feels easy. But we’re really in limbo.\n\n[Dean Kissick](https://www.documentjournal.com/2021/08/rediscovering-desire-in-a-panopticon-of-virtual-pleasures/) writes of a similar problem between cultural output and friction:\n\n> Much of culture now has the hollow, vacant feeling of having been made by algorithm. Consider the drab, broken anti-spectacle of Addison Rae performing trending TikTok dances onstage with Jimmy Kimmel or NFTs sold for millions at Christie’s and Sotheby’s—it’s art and pop stripped of all verve, fertility, and eroticism. What’s left is the new aesthetic of lifelessness and void, a consumer culture of throwaway experiences that wash right over you like an Ambien. It’s made to be experienced without friction: seamless post-death entertainment from an empire ruled over by a sleepy, old man. “Avoiding friction,” the critic Rob Horning has noted, “becomes a kind of content in itself—‘readable books’; ‘listenable music’; ‘vibes’; ‘ambience,’ etc.” And this is in keeping with a generational preference for light demi-pleasures: bumps not lines; microdosing, not getting high; sugary milks made of oats; podcasts, not conversation; the simulated intimacy of ASMR. Each of life’s pleasures in small amounts.\n\nRecognizing the threshold is particularly important for artists. They *must* grok the requisite tools and use them to shape the narrative surrounding the technological shift. They must sustain a high friction environment both as creators and for their audience. They must shock.\n\nHigh tool fluency, up and down the spiral (closer to and further from the threshold), is necessary. One must know one’s history, and then push forward. Otherwise the response to an algorithmic existence itself is honed by algorithm, so as not to be too disruptive; to sell.\n\nPart of what makes this urgent is the constant stream of legacy systems busting rivets left and right.\n\n![Maxar Technologies / Associated Press](https://images.mirror-media.xyz/publication-images/U5ZAAeuSz80_c1zJhXEPy.jpg?height=667&width=1200)\n\nThe ship as totem: a menacing combination of high meme content, an esoteric community, and structural fragility.\n\nThe physical prime world is literally breaking as it optimizes for digital prime users. Its systems are consolidating in the name of efficiency and introducing centralized weaknesses that halt entire networks. Its tools are opaque, if not entirely unknown, to its supposed beneficiaries.\n\nIt’s easy to see this as a sign that all things analog are destined for obsolescence. There are many in the NFT realm who seem to think–or at least proclaim loudly, to sustain a trade–there’s no going back; a switch has flipped, we’ve discovered a new set of tools that are better in every way, and a panacea is upon us. That there’s a direct relationship between one’s financial exposure to said tools and one’s insistence on their panacean qualities is no surprise. It should be obvious that this binary relationship between past and future is wrong, but to extrapolate a bit: culture doesn’t lurch forward in a series of discrete steps. Generative art is not new. We might think of Sol Lewitt’s [Wall Drawings](https://massmoca.org/sol-lewitt/) as generative artworks (Mitchell F Chan [certainly does](https://artblocks.io/project/118)), or [Marina Abramovic](https://www.tate.org.uk/art/artworks/abramovic-rhythm-0-t14875), or [Bruce Nauman](https://www.artsy.net/artwork/bruce-nauman-body-pressure), or [Lawrence Weiner](https://www.moma.org/collection/works/137437)… The Louvre predates photography and will still exist long after NFTs are outdated. A museum is a tool–a piece of infrastructure so implicit to society that it will both adapt to and force the adaptation of new aesthetics, new concepts, new media. If NFTs are successful as an artistic medium it will be because they expand culture, not fork it.\n\nIt seems to me that the turbulence of our time is a result of not allowing ourselves to cleave our digital selves from the physical and thus nurture both. We insist on bringing the algorithmic efficiency of digital primacy to bear on everything we do, eat, say, build.\n\nA dramatic inversion is necessary, and this brings me to [Loot](https://www.lootproject.com/).\n\n![Bag #2957](https://images.mirror-media.xyz/publication-images/OmhyiqFNr7onQZr4j0xXz.png?height=2270&width=2270)\n\nLoot has been discussed mostly as a game primitive, but I think this is too simple. Loot is a generative artwork: a set of variables spawning artistic outputs off chain. Each bag is a recursive digital-prime totem, a memetic device that leads to expansive world building within digital primacy. A set of instructions.\n\nIts recursion is a direct result of its pliability through time. It’s non-static; it reflects and refracts the underlying technology. Each bag is a tool.\n\nThe rapid and frothy growth of Loot derivatives (and knock-offs) is confirmation of this. It shows the power of the idea: ”this is so stupid that I must spend my time mocking it;” “this allows us to build our own universes, how exciting;” “this will make me a lot of money.” It immediately (well, it took three days) became a bubble market. Most of these derivatives will go bust. The naysayers will celebrate. The devoted will continue building, sometimes in the wrong directions.\n\nBut as with the bubble of generative blockchain art, and the bubble of NFTs, and the (current) bubble of crypto, there remains a potent signal to which we should pay attention.\n\n[ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/161](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/161)\n\n", "timestamp": 1632140118, "digest": "mEoh4x8-1kDTsca-IhRIR9vygFI_vnNy0NHWTzYGF6U", "contributor": "0xa8A33539960Ef4779CB0eCEDed8002c1EcD40582"}
{"id": "gH0Vhjrh9sLkgjeivd3FyWxypowuge0upFCqprnQvho", "title": "Using the Technology as a Tool", "body": "The timeline of human development is a spring. Sometimes the coil is more compressed.\n\n[https://twitter.com/0ddette/status/1376008296415559680](https://twitter.com/0ddette/status/1376008296415559680)\n\nMy undergrad photography program, like most liberal art programs, was built on a structure emphasizing fundamentals as a first step down a path of cumulative experimentation–in intellectual development, in visual style, and in tools used. The cornerstone was analog: shooting black and white 35mm film, developing the negatives yourself, and making prints in the darkroom. Later years had time devoted to learning view cameras, lighting, studio setups–all the stuff that’s been around for 50-100 years–and, of course, digital capture, editing, and printing.\n\nIn my last two years at school a department-wide debate emerged: whether to still require incoming freshmen to learn the wet darkroom or let them go directly digital. For a lot of younger students it made no sense to grok a skill and set of equipment they didn’t want to use. For a lot of older students it made no sense to experiment at the cutting edge without appreciation for the art’s history. Faculty, who practiced in a wide range of media, seemed caught in the middle.\n\nWorking in color captured these questions well. It isn’t practical (or really even possible) for someone to develop color film themselves, so shooting color means taking it to an outside lab as a first step; already once removed from the artist’s hands. Chromogenic prints cannot be made in the same type of wet darkroom as gelatin silver prints since no visible spectrum of light is safe to use with the paper, so they’re exposed in total darkness (in small individual darkrooms), and developed by a machine the size of a truck that’s accessed through a closet (at Tisch ours was a Colenta and probably cost $350,000 when new, in the 1990s). No hands in trays of chemicals, no fighting over control of the stereo. The complexity and relative absurdity of the process–working in complete darkness at each step, going in and out of different tiny rooms–in fact makes it far more esoteric than black and white printing, which can be done by almost anyone in almost any dark space with a few buckets and a red light bulb. But at one time, it was cutting edge. While I was in school, it was still the dominant method of printing color, and what you saw most often on gallery walls in Chelsea.\n\nMy thesis exhibition (in 2009) was entirely chromogenic prints, and if I remember correctly about a third of my classmates did the same. Within two years, the program’s head technician emailed me saying I could have the Colenta if I would get it out of the building.\n\n[https://twitter.com/lemiscate/status/1369237479317004289](https://twitter.com/lemiscate/status/1369237479317004289)\n\nEthereum opened a new space and provides an opportunity for artists to work with a previously unknown medium. This is exciting to the point of mania-inducing, which is what makes it feel simultaneously hopeful and dangerous. It’s also what creates a financial bubble, which for the obvious reasons is dramatically exacerbated in the case of NFTs. Worst of all, it’s what often pushes aside the most interesting work being done, work which is trying to understand what the technology unlocks–what it enables in itself–separate from how it can merely transport an existing object (say, a JPEG) into a different realm (say, a hyperfinancial one). I’m talking about the work that literally cannot exist without the specific tool.\n\nAn excellent example of this is Robin Sloan’s [Amulets](https://text.bargains/) project.\n\n[ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/815](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/815)\n\nAn amulet results from the appearance of sequential 8’s in the sha256 hash of a short piece of text; it cannot exist separate from the sha256 hash function (which is integral, but not unique, to Ethereum). The quantity of 8’s determines the amulet’s rarity (as established by the artist). The full definition and set of rules are very worth reading. It’s a nice game. It’s hard to imagine anyone paying a lot of money for these.\n\n[Framergence](https://framergence.art/) is particularly interesting because the creative mechanism is tied explicitly to Ethereum, in that the set of NFTs that exists can be modified in real time on-chain by the users. Each is algorithmically generated based on fractal patterns; the contract also rewards token burning by re-minting an n-1 amount of new tokens. This has led to people purchasing examples they intend to burn in the hunt for more pleasing iterations.\n\n![](https://content.framergence.art/3023962126_hires.png)\n\nEzra Miller’s [Solvency](https://solvency.art), a personal favorite, is not only technically accomplished, with the assets stored entirely on Ethereum and Arweave, but the individual mints are also beautiful, aesthetically complex and varied between mints, yet still cohesive as a body of work. Their infinite runtime is the kicker.\n\n[https://5kuzmctr2tmkwxq7vkz6ejfqrjvz7sih34rfmu6wyhnywbvkmivq.arweave.net/6qmWCnHU2KteH6qz4iSwimufyQffIlZT1sHbiwaqYis/?seed=0x1940347e592e022caa1f5b729b5902bf39de340a44dec77a99d1d2ff4070ea53?display=iframe](https://5kuzmctr2tmkwxq7vkz6ejfqrjvz7sih34rfmu6wyhnywbvkmivq.arweave.net/6qmWCnHU2KteH6qz4iSwimufyQffIlZT1sHbiwaqYis/?seed=0x1940347e592e022caa1f5b729b5902bf39de340a44dec77a99d1d2ff4070ea53?display=iframe)\n\nThese examples demonstrate the positive feedback loop that emerges from strong artist-tool relationships and leads to canonical outcomes. In the best cases it is indistinguishable from collaboration. I would go further and say that the strongest relationships depend on high friction environments. In these cases, the tools are new. They’re difficult to understand and often expensive to use. There’s a lot of trial and error. Much of the work has to be done “by hand,” and it’s slow going. The audience doesn’t have good references to understand the output; there’s probably very little criticism to place it in a historical context. The conditions are conducive to failure rather than success. And this leads to a lot of “failures.” Outside the small ecosystem of devoted creators and users, the work that employs the most experimental elements of a new technological space tends to be misunderstood, undervalued, and in many cases lost entirely.\n\nThe same dynamic (with the opposite effect on market price) can apply to esoteric and “outdated” tools and processes. It was no surprise that [the best paper maker in Japan](https://www.washiya.com/shop/iwanohousho/kodawarienglish.html) had custom-designed all of his equipment, worked without the use of any bleach or other additives, and had not changed the process first established by his family 8 generations prior. Of course, his output is 1/100th of what a modernized paper maker can achieve, let alone a factory.\n\nWhat constitutes high friction (and low friction) is an ever-moving target and always relative. In 2007 digital photography was high friction (to achieve comparable results to analog, or to embrace the unique aesthetics of pixels), and analog low friction. That has since inverted. Today, shooting 4K video on your phone feels easy; it will eventually feel cumbersome when most people have contact lens wearables, or something equally absurd-sounding.\n\n[https://twitter.com/etheria_feed/status/1370825688647884802](https://twitter.com/etheria_feed/status/1370825688647884802)\n\n[https://twitter.com/samspike/status/1439030208640823305?s=20](https://twitter.com/samspike/status/1439030208640823305?s=20)\n\nI originally began this essay in March. Etheria has since been resuscitated; NFT archeology in the search of yield is an active pursuit. Generative art is now rampant with derivatives. Copies of copies of copies. As with everything, the financial mechanisms of crypto allow–if not require–this speedrunning. Thus, we are already in a transient period of low friction and increasing mania. We’re surrounded by work that deploys the technology as an inherent component, but is otherwise artistically unremarkable. Its newness nonetheless commands enormous value. This, too, can cause artists’ work to be overlooked. Launch a series on Art Blocks and you tap into an automatic market of collectors and liquidity. Launch the same series on your own site and you may be lucky to sell a handful (probably not in this market, but you know what I mean). This problem isn’t unique to NFTs; the same dynamic is built into the structures of the legacy art world. Indeed the same dynamic emerges any time a certain technology (and its associated market) becomes frictionless enough.\n\nIt’s a failure both when a technology is used as a non-tool acceleration vehicle, and when it’s worshipped as a self-solving perpetual motion machine. During a bubble the technology exhibits both properties. Everybody rushes in because it’s a money printer, and many of those involved begin to see it as a Rosetta stone device. Irrational exuberance. Soon after the bubble pops because it’s discovered that the tools are insufficient for the narrative they sell.\n\nA similar mistake can be made with tools and their characteristics of nostalgia. This was at the heart of the debate at Tisch. Many saw digital photography as a fad, a shortcut, and aesthetically insufficient (“It’s a lower resolution than film, what’s the point?”). Thus black and white wet darkroom printing *had* to be learned; when the current iteration of digital technology was no longer in use, the artist would still have the through-line to grasp. A safety net, and therefore superior.\n\nThis is the common misconception of any new technology: riskier, less reliable, less future-proof. Because it’s iterating so quickly, it’s impermanent whenever and wherever it’s measured. It appears fleeting because most of it is fleeting. But that’s measuring the products of a tool; it’s not taking stock of the tool itself, on its inherent conceptual terms. Certain foundational components attain extreme Lindy status, while many cutting-edge experiments are ultimately relegated to history after leapfrogging each other during the rapid expansion phase. Here’s where we start arguing about Bitcoin and Ethereum.\n\nOf course, even gelatin silver prints, the most Lindy form of photography in history, are becoming harder to make and more homogenized–the number of companies still producing the necessary materials (film, paper, chemicals) and equipment (enlargers, cameras) has shrunk dramatically, a process that began well before digital photography became superior (the market re-prices according to future developments, not current realities). For the few photographers still working in black and white wet darkrooms, they’ve had to further hone their craft. But most have moved on to digital.\n\nDeafBeef [understands this well](https://jpg.mirror.xyz/qSUps1Krz02iyW8FCWHiEcHGaLrslw6BSldJQpuD9_A):\n\n> Your old smartphone is junk. On the other hand, an analog signal processor can be repaired, repurposed, and scavenged for parts. Oscilloscopes remain useful tools for electrical engineers. Vinyl and magnetic tape recordings from the 60s can still be played. ASCII terminal screens, for those who know how to use them, remain the most efficient way to interact with a computer for many tasks.\n\nEventually, the old smartphone will also be a field to harvest. And It turns out that inkjet prints are actually more stable and conservation-friendly than chromogenic prints; they also don’t require the use of harsh chemicals. Thus the point is not necessarily to be faithful to a specific tool, but to a certain intellectual approach, which is reliant on an appreciation for and handiness with a certain set of tools, and an ability to recognize which tools hold the most potency for honing and distilling.\n\n![David Rudnick's EXODUS 2, VII – Jagged Quartz Towers](https://images.mirror-media.xyz/publication-images/kQVIyPwG9JQfTpg54kLmQ.png?height=996&width=1016)\n\nI’m reminded now of [David Rudnick](https://exodus-ii.folia.app/)’s rhetorical device of [primacy](https://interdependence.fm/episodes/primacism-david-rudnick-on-the-struggle-for-primacy-type-and-poetrys-unique-value-in-an-age-of-digital-and-physical-conflict-and-percy-shelleys-mont-blanc)–Physical Prime vs. Digital Prime. We’re rapidly approaching the event horizon of digital primacy, the point at which we will spend more of our time in digital spaces rather than physical ones. The exponential deployment of digital objects as totemic and memetic devices is testament to this. These totems help us form narratives, and their appearance (in absolute numbers, in iterative qualities, in variability of aesthetics) has a direct relationship to our distance from the threshold.\n\nA major risk is in not recognizing the threshold; the result is a digital-prime world built with tools we can’t understand, illustrating myths that only abstract our social relationship to them. It inflates a bubble. Life feels easy. But we’re really in limbo.\n\n[Dean Kissick](https://www.documentjournal.com/2021/08/rediscovering-desire-in-a-panopticon-of-virtual-pleasures/) writes of a similar problem between cultural output and friction:\n\n> Much of culture now has the hollow, vacant feeling of having been made by algorithm. Consider the drab, broken anti-spectacle of Addison Rae performing trending TikTok dances onstage with Jimmy Kimmel or NFTs sold for millions at Christie’s and Sotheby’s—it’s art and pop stripped of all verve, fertility, and eroticism. What’s left is the new aesthetic of lifelessness and void, a consumer culture of throwaway experiences that wash right over you like an Ambien. It’s made to be experienced without friction: seamless post-death entertainment from an empire ruled over by a sleepy, old man. “Avoiding friction,” the critic Rob Horning has noted, “becomes a kind of content in itself—‘readable books’; ‘listenable music’; ‘vibes’; ‘ambience,’ etc.” And this is in keeping with a generational preference for light demi-pleasures: bumps not lines; microdosing, not getting high; sugary milks made of oats; podcasts, not conversation; the simulated intimacy of ASMR. Each of life’s pleasures in small amounts.\n\nRecognizing the threshold is particularly important for artists. They *must* grok the requisite tools and use them to shape the narrative surrounding the technological shift. They must sustain a high friction environment both as creators and for their audience. They must shock.\n\nHigh tool fluency, up and down the spiral (closer to and further from the threshold), is necessary. One must know one’s history, and then push forward. Otherwise the response to an algorithmic existence itself is honed by algorithm, so as not to be too disruptive; to sell.\n\nPart of what makes this urgent is the constant stream of legacy systems busting rivets left and right.\n\n![Maxar Technologies / Associated Press](https://images.mirror-media.xyz/publication-images/U5ZAAeuSz80_c1zJhXEPy.jpg?height=667&width=1200)\n\nThe ship as totem: a menacing combination of high meme content, an esoteric community, and structural fragility.\n\nThe physical prime world is literally breaking as it optimizes for digital prime users. Its systems are consolidating in the name of efficiency and introducing centralized weaknesses that halt entire networks. Its tools are opaque, if not entirely unknown, to its supposed beneficiaries.\n\nIt’s easy to see this as a sign that all things analog are destined for obsolescence. There are many in the NFT realm who seem to think–or at least proclaim loudly, to sustain a trade–there’s no going back; a switch has flipped, we’ve discovered a new set of tools that are better in every way, and a panacea is upon us. That there’s a direct relationship between one’s financial exposure to said tools and one’s insistence on their panacean qualities is no surprise. It should be obvious that this binary relationship between past and future is wrong, but to extrapolate a bit: culture doesn’t lurch forward in a series of discrete steps. Generative art is not new. We might think of Sol Lewitt’s [Wall Drawings](https://massmoca.org/sol-lewitt/) as generative artworks (Mitchell F Chan [certainly does](https://artblocks.io/project/118)), or [Marina Abramovic](https://www.tate.org.uk/art/artworks/abramovic-rhythm-0-t14875), or [Bruce Nauman](https://www.artsy.net/artwork/bruce-nauman-body-pressure), or [Lawrence Weiner](https://www.moma.org/collection/works/137437)… The Louvre predates photography and will still exist long after NFTs are outdated. A museum is a tool–a piece of infrastructure so implicit to society that it will both adapt to and force the adaptation of new aesthetics, new concepts, new media. If NFTs are successful as an artistic medium it will be because they expand culture, not fork it.\n\nIt seems to me that the turbulence of our time is a result of not allowing ourselves to cleave our digital selves from the physical and thus nurture both. We insist on bringing the algorithmic efficiency of digital primacy to bear on everything we do, eat, say, build.\n\nA dramatic inversion is necessary, and this brings me to [Loot](https://www.lootproject.com/).\n\n![Bag #2957](https://images.mirror-media.xyz/publication-images/OmhyiqFNr7onQZr4j0xXz.png?height=2270&width=2270)\n\nLoot has been discussed mostly as a game primitive, but I think this is too simple. Loot is a generative artwork: a set of variables spawning artistic outputs off chain. Each bag is a recursive digital-prime totem, a memetic device that leads to expansive world building within digital primacy. A set of instructions.\n\nIts recursion is a direct result of its pliability through time. It’s non-static; it reflects and refracts the underlying technology. Each bag is a tool.\n\nThe rapid and frothy growth of Loot derivatives (and knock-offs) is confirmation of this. It shows the power of the idea: ”this is so stupid that I must spend my time mocking it;” “this allows us to build our own universes, how exciting;” “this will make me a lot of money.” It immediately (well, it took three days) became a bubble market. Most of these derivatives will go bust. The naysayers will celebrate. The devoted will continue building, sometimes in the wrong directions.\n\nBut as with the bubble of generative blockchain art, and the bubble of NFTs, and the (current) bubble of crypto, there remains a potent signal to which we should pay attention.\n\n[ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/161](ethereum://0x3B3ee1931Dc30C1957379FAc9aba94D1C48a5405/161)\n\n", "timestamp": 1632140118, "digest": "mEoh4x8-1kDTsca-IhRIR9vygFI_vnNy0NHWTzYGF6U", "contributor": "0xa8A33539960Ef4779CB0eCEDed8002c1EcD40582"}
