{"id": "LzNSE3xUjUH5EVJkDdqsKlhI7OHDUd6bR9qAa4wJq0c", "title": "Breaking the Fourth Wall: The Business of Media Subculture", "body": "![Trey Anastasio, Phish, Nashville 2018](https://images.mirror-media.xyz/publication-images/25cafc24-71f1-4f50-93e6-02ada2762b21.jpeg?height=1620&width=2160)\n\nIf media companies are record labels and creators are rock stars then the audience are fans — and that introduces an entirely new business opportunity.\nMedia, like music, can only thrive when the audience and the creator travel down a path together, giving each other the opportunity to define one another. It’s a two-way street, not a top-down dictum. But what happens when a creator or artist gets so big that their audience starts building products on top of their work?\n\nThe media’s status quo is accelerating towards disruption. We’re seeing the development of new media brands (micro-labels) on platforms and services, the prioritization of talent as a core business pillar by media companies and the shifting business models moving from content direct to creator direct.\n\nAs each component of creation evolves, there is another evolution happening with the most critical part of the media business’ formula: the consumers. In the media business, business models drive product strategy. And while that’s the driving force behind the product, it’s contingent on consumer interest, participation and loyalty. That means that as the economy shifts, so needs the consumer value. This is an opportunity to build a new business that puts the creator and consumer relationship front and center and introduces the element of ownership. This is the business of fandom and subcultures.\n\nCreators should be in the business of eliciting and manufacturing subculture.\n\nSubcultures develop as a response to a pre-existing culture. In the case of music and media, that pre-existing culture or categorization is the genre. The desire to fit within a pre-existing genre, traditionally, has been beneficial for the artist. Genres set the taste broadly for what the listener or reader should expect from the artist or creator within that category. There is an existing audience, an existing business model — the foundation is set.\n\nThe goal is to bust through genres and create a subgenre (subcultures) of its own. Think of it on both sides: the creator (or label) develops their own identity in response to genre a la Sub-Pop and the fans develop their own identity and subculture in response to it a la Punk. In the era of niche, the approach is quite the opposite. Instead of creating for the broader audience, the fashion is now to style the particular few. It’s less about scale and more about the quality of the audience who wants it. By doing this, not only do creators open up a unique pocket of value for themselves but their community starts to construct an identity out of the value that’s been created.\n\nThe relationship between creator and consumers is more valuable than its transactional currency (ie. content). In this era of media, the content is not the only product. The content is a key part of the value in that it’s the tool for consistency but the creator and the community are the product. The true value is the connection between consumer and creator acquired through a variety of access points that eventually develop a consumer benefit. As the business moves from content is value to creator is value we should shift the business opportunities that support it as well.\nThe consumer builds on the brand.\n\nCreators should be in the business of eliciting and manufacturing subculture. For a creator, culture is when their brand is so transportable, that commerce and community are built outside of the creator itself. If membership enables identity, and identity builds brand then culture is eternal. When the consumers become the creators and associate their value with not just building within the creator environment but outside of it as well, the creator becomes a platform. Businesses are being built on top of the creator, separate from their participation because of the consumers commitment and dedication to their brand. The creator is the platform. In this example, the relationship is not just with the content, the creator and the community, but in the development of a subculture itself. The audience isn’t a commodity. Instead, the audience views themself as a part of the brand, and associate their own ideas with their consumption and engagement with the creator. An example of this is the band Phish.\n\nThrough the music, brand and community of Phish, an entire subculture has developed around the group to the point where there are businesses, identities and communities built outside of the band’s direct participation. Phish is the creator but the nature of their creation (ie. music and community) and their development of culture has turned their fans into creators themselves. They can leverage the Phish audience to develop their own audiences, thus expanding the brand and culture. Like The Grateful Dead’s shakedown scene, Phish has built themselves as a platform for consumers (in this case fans) to build their business on top of. As a result, the brand becomes immortal through their association in the foundation of the community’s business. In the Phish subculture, there are many fan built establishments across a variety of trades.\n\nThere is Phish.net run by Scott Marks and team that compile set-lists, news and analysis on the band and their associated projects in real-time. Phantasy Tour, a reddit-esque forum developed by fans for fans has become the defacto platform for all fans to discuss… anything. Here, a fan (and one of my dear friends), is seeking mid-century modern furniture for his new house. The first post maxed out at 499 responses (499’d!) and it spilled over to a second thread. He chose to have this conversation on Phantasy Tour and found the perfect chair.\n\nThere is a completely robust ecosystem of commerce developed, designed and distributed by fans. The band influenced, independent and run JEMP Radio and Phish Just Jams are music applications built on top of the catalog to service a particular interest, a particular niche. Fan photographers have built an entire business and reputation around their art, one of my favorites being AZN. There’s even a physical marketplace for commerce at live events in the cities the band plays in. Beyond commerce, there are a lot of societal benefits to the growing subculture. For example, the Phellowship is a fan lead group of fans who choose to be drug and alcohol free.\n\nIn the culture Phish defined, the subculture now dictates the identity and longevity of the brand in its ability to live in perpetuity. The fans themselves are defining the culture as well as the brand through business. Granted, this took over 30 years and compounds all the time.\n\nFunny enough, this entire movement towards the creator economy with the unbundling and rebundling of media operations and platforms is itself a media subculture. Creators and supporting platforms and services are looking to challenge the interpretive authority of media institutions and their structure by building providence of their own. For some creator’s it’s less about the business and more about the desire to break through the establishment and promote individual freedom and construct an environment of their own. Many that go independent could potentially earn less than if they stayed at an establishment, but that’s not the point. And this is a signal both for how incumbents need to prepare against challengers and how businesses need to be set up to provide a platform for subculture momentum.\n\nA business of subculture and fandom has always existed in music. Phish has taken it to the next level by not only making their consumers creators, but also making them owners. They are very much in the lead here and, against the strong insistence of opportunity in this piece, will be difficult replicate.\nThe media business has traditionally been built around content. There have been hints of culture driven commerce throughout the years in the NYT blue bag, the New Yorker tote bag, but most of these attempts teetered on the edge of membership and nowhere near the manufacturing of subcultures. We are seeing new media companies begin to work towards this opportunity of moving consumer identity down the line from someone who subscribes, to someone who’s a member, to someone who sees the brand as part of their culture. As business models drive product strategy, the business of manufacturing subculture can’t just be a phenomenon, it must also be a source of brand growth. Encouraging fandom and moving to an environment where consumers become the creators is insurance and future proofing your brand.\n\nSubcultures happen organically with time but they can be pushed towards a direction and accelerated. This tied simply to the idea of brand — in order to drive culture, your brand must have a point of view. In order to drive subculture, you must elicit a response from your consumer who themselves have a point of view. A way to trigger this is to unlock your brand. Rights management is important, and culture is driven through commerce, but holding it too tight means you forfeit earned media potential and the ability for your consumer to become a creator. Consumers becoming creators are good for your brand, especially if it’s built with your brand in mind. The end goal is to have the brand be so associated with the consumer identity, that some even model their life, or business, around it.\n\nAnother great example is the agency behind K-pop sensation BTS, Big Hit. They recently listed their initial public offering and it had been massively oversubscribed by both institutional and retail investors. Fans are literally investing in the artists success and are incentivized for them to do well. The fourth wall is breaking.\n\nBTS Won't Stay Forever Young. The K-Pop Sensation's Owner Needs New Big Hits.\nKorean pop music, or K-pop, has taken the world by storm. It is shaking up the financial markets, too. \n\nThere are many emerging creators that are building culture through community that, through time and commitment, will elicit subculture. As defined and showcased above, the business of subculture is different from the development of subculture. This is about reversing the flow of expectations about the fans role from a passive consumer to an actual business creator. There is a lot of momentum in the gaming space, especially with the commerce, branding and communities being built by the likes of MrBeast and Ninja, and my expectation is that this is the obvious next phase in their brand expansion.\n\nThe environment has changed and so have the platforms. This opportunity is truly rooted in the digital landscape. As media companies work to become record labels and independent creators start their own brands, or collaborate with others to create their own micro label, the business models should follow. As we unbundle and rebundle the operational structure of what a media company is, we should equally unbundle and rebundle the way we drive that business and where we put the emphasis of value. As explained above, that’s a move from content as value to creator as value. And as we shift further away from content and towards the creator, the existing structure of subscription and membership will limit the opportunity for a brand to expand in this next age.\n\nSo we enter the business of subculture with a focus on building a brand as a platform. Those that invest in brokering deeper connections with their fans, and enabling them to become creators on behalf of a brand will be way ahead of the curve. There is an incredible opportunity ahead of us in the media industry and I’m excited to see what you all build.", "timestamp": 1610660306, "digest": "9RU2OOwUxzZCPsJP6OISJiQV7F8io7G9TtxmAASt3Dg", "contributor": "0x7FdCA0A469Ea8b50b92322aFc0215b67D56A5e9A"}
{"id": "gUZbdcTehtkBr6zn9eJdLe2B-1nyilWbt0LqvNzjOTc", "title": "Test post", "body": "123", "timestamp": 1610663035, "digest": "SI786idRXEgsakSKx7UP-MoEAJ51nqRlOhqI_qjkHWo", "contributor": "0x8c5A261d38fE7fE65221AdAD3c2Ba5c3D10F046C"}
{"id": "nVeMJaJ4-UkxdcXimEFinyEas6XWlgg6B-ccKYF0oGQ", "title": "Test post 2", "body": "123", "timestamp": 1610663128, "digest": "SI786idRXEgsakSKx7UP-MoEAJ51nqRlOhqI_qjkHWo", "contributor": "0x8c5A261d38fE7fE65221AdAD3c2Ba5c3D10F046C"}
{"id": "bRLSFDTd2rZfrMTf8TVw-uwmg09jIqq9IVKztGOzqwM", "title": "Test post 3", "body": "asdasd", "timestamp": 1610663886, "digest": "3k_MtlCFpNOpir6zA_bwJijtlJAqOhdVo17SmL0KvOU", "contributor": "0x8c5A261d38fE7fE65221AdAD3c2Ba5c3D10F046C"}
{"id": "pl3sqRDZ-u4sRDvkOvo61C5-K_cWYoqsWwuVg6BU5B0", "title": "Test", "body": "123", "timestamp": 1610666520, "digest": "wAelKRxJ6sDVMbFEcNEcSIaRVL8KnXnCOpEDlnCX2sU", "contributor": "0x6cE3f4eC4e8B70e2014D146D9aBb06b5664132CE"}
{"id": "lcr4dRbTy8Tga6BVVeXl2cTnOH32Rbss0q8yt-9is2A", "title": "Staging Test", "body": "Test Test", "timestamp": 1610666799, "digest": "XcGOC7bYFLtah-OtVBg8vAmnuip0flLbE0DFSprY2oA", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "6MmFC5o_PI0M_skYS7dzJ_IdG4HaCP057-eHIGdJqe8", "title": "Staging Test - Update 1", "body": "Test Test 1", "timestamp": 1610668349, "digest": "XcGOC7bYFLtah-OtVBg8vAmnuip0flLbE0DFSprY2oA", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "A1BIPhtbuQv7_V8bB6mduQmrYFknmHLtzbcMKlzwUdA", "title": "Staging Test - Update 2", "body": "Test Test 2", "timestamp": 1610668377, "digest": "XcGOC7bYFLtah-OtVBg8vAmnuip0flLbE0DFSprY2oA", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "edOzZegnzmlt9gOZabLota-hAXx680VmVzZVN0jYc0c", "title": "testtest es 33", "body": "testes", "timestamp": 1610669083, "digest": "69_WlUjCZyMnbQ8EYs06VvQhfqLZk_w7Rpe7qovl0Z4", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "Xl58DwXsnB6rB_KbNAYr8c3YSBsEGdIlLOaGnkyyYBI", "title": "testtest es 44", "body": "testes 44", "timestamp": 1610669148, "digest": "69_WlUjCZyMnbQ8EYs06VvQhfqLZk_w7Rpe7qovl0Z4", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "Evd2NfK9dkNC_V6_LWym1aMB8Qn2bXaX759zB_L82nU", "title": "tes test 45", "body": "45", "timestamp": 1610669183, "digest": "3YziCRkXV7uMFAY56GEx34wQ77j3Jj1gHSx4kXRmegY", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "Tp6f_ki8xRYQxfQubX1QxvOq2JPw-OrO-WaQldQbzCg", "title": "testtest es 33 => 46", "body": "testes 46", "timestamp": 1610669216, "digest": "qPGcADnRSPtSz22G5NVzL14F4bFsy5YjhKBlG-LPk_k", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "auaZrxiXfRD4VZRx6_WQYrY61EywWcPvVpEqZz9Kuwg", "title": "NFT test", "body": "[](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/18153)\n\n[](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/18105)", "timestamp": 1610681218, "digest": "5YyUHWFQK6Rr4oG1TJfWldt9mFH8lvHptzGzohFdtmw", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
{"id": "_2yJoRvq0INm_ehfjUfK3_ReAHWryOZQBqqazG1v3Kc", "title": "NFT test", "body": "[](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/18105)", "timestamp": 1610681261, "digest": "5YyUHWFQK6Rr4oG1TJfWldt9mFH8lvHptzGzohFdtmw", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
{"id": "ShixHMv7BGW6HGKmMt8aatseqzlnyAHCWXJoX8CRGJs", "title": "Migrating to a Publication World", "body": "My head's clearly been stuck in the *Publication contract* for the last few days, since I've been implementing that.\n\nThere's a lot that I like about the Publication contract paradigm, but it's not derisked yet as a feature. Currently, the cost to register on Mirror with the Publication contract would be around $100 on Mainnet, which is a lot of money relative to some other options.\n\n![Registration cost calculation using Numi (excuse the typo)](https://images.mirror-media.xyz/publication-images/98a15907-dd09-4757-a8e3-650799febad4.jpeg?height=1338&width=2252)\n\nI can decrease the cost of this deployment by using a pattern whereby only the storage is deployed per user, and everything else delegates back to a single \"implementation\" contract. I will almost certainly do this! Uniswap does not do this for new token pairs, which makes it expensive to add new tokens.\n\nBut the feature isn't derisked yet; we need to start playing with it and seeing how it feels to use Mirror with a real Ethereum protocol behind it, rather than a database for storage. This will feel weird; some things won't be as fast, and then the suggestion by others could be to speed it up by caching on the backend. We can do that, but first it makes sense to lean into the web3 aspects of this feature and get people excited about all of the net-new economic actions that it enables.\n\nIn other news, we've been working on NFT integrations for the frontend. John Palmer, a designer in our network, wants to write a blog post and create an NFT from it. He also wants to try crowdsourcing the funding of this article/NFT. This is interesting. I proposed that we do it this way:\n\n* Deploy a contract that can hold an ERC721 (ERC721-receiver)\n* Also make it an ERC20 token that can mint\n* Add a method called `fund()` that pulls a given amount of USDC from a user's account, and mints an equal number of tokens for that user.\n* Allow the contract to bid for and accept ownership of the NFT\n* Allow the contract to sell the NFT\n* Allow users to burn their tokens and withdraw a proportional amount of USDC in the contract\n\nThis would mean that users are contributing USDC into the contract in exchange for fractional ownership of the NFT. Once the NFT has been sold, the total USDC will be greater than the number of outstanding tokens minted by the contract, and those who contributed will be able to withdraw their profits.\n\nJohn and Denis seem quite excited about this idea. I think it's interesting in so far as it's a prototype for something that the Publication contract might be able to do in the future -- i.e. crowdfund something like an article, or an education course. If it weren't for that, I wouldn't want to consider this for a once-off event, since it'll likely take a considerable amount of effort to make sure that there isn't a security vulnerability in the contract (ah, DAO-hack anyone?)", "timestamp": 1610688103, "digest": "cVQ_fzO_UBV0tEDRj7SjXiLbn47DUnVgLsfOKB23MrI", "contributor": "0xCC65fA278B917042822538c44ba10AD646824026"}
{"id": "FD4fPGs6384Vvt_IuUq3WIW_hCSGsYBbgKnsFRKc6kk", "title": "Crypto Community Treasuries", "body": "Crypto treasuries are typically thought to be transparent. But if a community member needs to spend several hours digging through [Etherscan](https://etherscan.io/), [Snapshot](https://snapshot.page/#/), and [Discourse](https://www.discourse.org/) to get a summary of the treasury’s activities over the past month, is the transparency useful?\n\nA crypto community treasury consists of crypto assets in a wallet owned and operated by the community. It is like a community savings account with assets in crypto (not fiat), typically held in a multisig wallet (not a bank account), managed by the community (not a CFO/CEO), and public (not private).\n\n**Accounting**\n\nWe’re in the early days of documentation for crypto treasuries. It is time-consuming for treasurers or operations members of crypto projects to categorize income and expenses, so many do not do it effectively. There could be several proposals every day or week, which are difficult to track. For the community, there is limited real-time, human-readable transparency of the treasury. Members might feel less informed to make and vote on proposals.\n\nThere are several open problems to solve with crypto treasuries:\n\n- How can a treasurer easily categorize transactions and produce a summary statement?\n- How can community members quickly find details for a specific payment made five months back?\n- How can they see a summary of the treasury’s activities for a particular historical month?\n- How can they filter all the bounties made since the treasury’s inception?\n- How can they see the average salary paid to community managers across all crypto projects?\n- For VC funded projects like Uniswap, how do we [integrate](https://twitter.com/lsukernik/status/1321168174004330497) off-chain expenses made in VC-funded dollars with on-chain income?\n- How do we produce real-time income statements, cash flow statements, and balance sheets that can be accessed by community members, contributors, investors, and outsiders? \n- How can we standardize these statements across crypto projects, similar to the standardization of statements in 10k reports of public companies?\n- How can we rate the financial health of a treasury?\n- For DAOs or other projects that are registered as legal entities, how do we produce statements that can easily be used by accountants and tax people?\n\nThere is a need for a full stack solution that helps communities manage their treasuries ([Stripe Treasury](https://stripe.com/treasury) for crypto) and helps them disclose relevant information (SEC [Edgar](https://www.sec.gov/edgar/search-and-access) but [on-chain](https://twitter.com/lsukernik/status/1335652170792914945)). I’m working on solving some of these problems at [Llama](https://llama.community/#/), a dashboard for crypto communities to manage their treasury. These communities include DeFi protocols, DAOs, and social token communities.\n\nYFI is one of the first protocols that released its self reported [financial statements](https://twitter.com/iearnfinance/status/1336686533701582849) in December 2020. This was a great initiative by YFI community members, but it is difficult to reconcile these statements. It is important for any community to generate such financial statements easily and for outsiders to be able to audit them. Additionally, if communities want to keep certain treasury details private, they should have the option to do that.\n\n**Governance**\n\nAs Fred Ehrsam argued - while governance minimization is important, treasury management is an area where governance will likely be required for the foreseeable future. It is difficult to entirely automate the process of deciding how to allocate funds.\n\nMonetary policy of crypto protocols is discussed a lot, but fiscal policy isn’t. This will change in the next few years. These are some important questions relating to fiscal policy of decentralized communities:\n\n- How should a budget get approved? \n- Who should authorize payments for a treasury?\n- How should grants and bounties be structured?\n- How much should core contributors get paid? What type of vesting schedule is appropriate?\n- How much should be spent on liquidity mining efforts? (This is a monetary and fiscal policy question.)\n- How should treasuries decide token [buybacks](https://twitter.com/lsukernik/status/1349774197799661569)?\n- How should the treasury be structured? Is the goal of the treasury to exist in perpetuity, like a university endowment, or to be dissolved after a certain number of years, like the [Gates Foundation](https://www.gatesfoundation.org/Who-We-Are/General-Information/Financials/Foundation-Trust)?\n- How should liquidity of the treasury be managed? What percentage of assets should be in the native protocol token, in ETH/BTC, and in stablecoins like DAI and USDC?\n\nIt is too much to expect the average token holder to vote on small transactions spent by the treasury. Uniswap's grants program [proposal](https://gov.uniswap.org/t/rfc-uniswap-grants-program-v0-1/9081) is an example of a thoughtful approach to a protocol's fiscal policy. A committee of six members will be responsible for allocating up to $750,000 every quarter towards Uniswap's ecosystem development efforts. Every committee has a term of two quarters. Budgets and caps will be re-assessed every six months.\n\nSynthetix recently created the [Spartan Council](https://blog.synthetix.io/spartan-council-proposal/), which is a group of members elected by SNX token holders responsible for approving changes to the Synthetix protocol. Elections take place every three months. Such a council could potentially be used to make day-to-day treasury decisions, while the community approves larger budgets.\n\nIn certain cases, a governance proposal in crypto can function as an invoice. Take for example the [proposal](https://snapshot.page/#/jamm/proposal/QmdEH5prtD5nRzLT8PLLXtx1wLGwsqBw8KEu2zcS95VBvh) to pay Michael Arnold for developing the [website](https://www.jammpad.com/) for JAMM's social token. It contains the necessary details for an invoice: proposer name and contact info, seller name and contact info, date of invoice, description of services, seller payment details, and terms for payment.\n\nWhy does documentation like this matter? Besides helping the treasurer and other community members, documentation can be useful in the future for auditing and rating.\n\n**Auditing & Rating**\n\nWhile accounting involves recording transactions and producing financial statements, auditing involves verifying and evaluating those statements. An external auditor must be able to easily go through each transaction initiated by the community treasury and verify if it is legitimate.\n\nEach transaction should have a corresponding governance proposal, transaction hash, budget category, and other notes. An auditor should be able to track a transaction from a year ago and check if any fraud has been committed. Just like smart contracts need to be audited, treasuries need to be audited. We will eventually have some type of rating system to evaluate the financial health of different crypto treasuries. To do that, we need to organize the raw data in a useful way.\n\n![Transaction history on [Llama](https://llama.community/#/jamm/)](https://images.mirror-media.xyz/publication-images/0bbe82c4-ad25-427d-956f-f2cd9f6f778a.jpeg)\n\n**Conclusion**\n\nCrypto treasuries offer the promise of transparency and community empowerment. But to realize this promise, we need to build tools and frameworks to organize treasury data, produce real-time financial statements, audit those statements, and rate the treasury’s financial health.", "timestamp": 1610709860, "digest": "ztqMIwxBolqqID8y_70Bte3F6uRfEMJoIDEShZYNwJE", "contributor": "0x10D6d2e343281D388291A3e02f3293AaEdA67178"}
{"id": "CXcdUAkQrI-t3OTB0MWuXhTb-B1qtKPzSmaUf5Uqb5c", "title": "Crypto and Society", "body": "We have tools to communicate with billions of people but our tools to coordinate with people haven’t kept up with this. It has been over twelve years since Satoshi published the Bitcoin whitepaper. Since then, we’ve had several successful experiments in human coordination. It is clear to me that crypto will re-orient society. It will affect how people think, feel, and live.\n\nIt was [easy](https://quoteinvestigator.com/2019/10/23/traffic/) to predict the automobile in 1880; it was difficult to predict the traffic jam. For a technology to affect the way we live, society needs to be re-oriented around it. For the automobile to affect the way people lived, we needed to build roads, highways, traffic signals, parking garages, drive thru restaurants, seatbelts, traffic laws, and toll stations. Over the next few decades, we will build the infrastructure needed for crypto to affect the way people live.\n\nThis blog will focus on crypto and society. I will dive into crypto projects and protocols, Etherscan transactions, Discord and Telegram chats, governance proposals, and smart contract exploits. I will cover pseudonymous reputation and justice, DeFi, DAOs, social tokens, NFTs, decentralized governance, encryption, digital nation states, and more. I will write about how crypto will re-orient society.\n\nDM me on Twitter at [@HelloShreyas](https://twitter.com/HelloShreyas) if you have any thoughts or questions.", "timestamp": 1610710249, "digest": "6573b67b491d423c8b6eb3ad89aae63048aa85a5ce81c2cf54205dc515defefc", "contributor": "0x10D6d2e343281D388291A3e02f3293AaEdA67178"}
{"id": "GYFR0lgtZxb_9ACdW0XYSGcLEVYh2M3wYEk7MtyY8Xs", "title": "Crypto Community Treasuries", "body": "Crypto treasuries are typically thought to be transparent. But if a community member needs to spend several hours digging through [Etherscan](https://etherscan.io/), [Snapshot](https://snapshot.page/#/), and [Discourse](https://www.discourse.org/) to get a summary of the treasury’s activities over the past month, is the transparency useful?\n\nA crypto community treasury consists of crypto assets in a wallet owned and operated by the community. It is like a community savings account with assets in crypto (not fiat), typically held in a multisig wallet (not a bank account), managed by the community (not a CFO/CEO), and public (not private).\n\n**Accounting**\n\nWe’re in the early days of documentation for crypto treasuries. It is time-consuming for treasurers or operations members of crypto projects to categorize income and expenses, so many do not do it effectively. There could be several proposals every day or week, which are difficult to track. For the community, there is limited real-time, human-readable transparency of the treasury. Members might feel less informed to make and vote on proposals.\n\nThere are several open problems to solve with crypto treasuries:\n\n- How can a treasurer easily categorize transactions and produce a summary statement?\n- How can community members quickly find details for a specific payment made five months back?\n- How can they see a summary of the treasury’s activities for a particular historical month?\n- How can they filter all the bounties made since the treasury’s inception?\n- How can they see the average salary paid to community managers across all crypto projects?\n- For VC funded projects like Uniswap, how do we [integrate](https://twitter.com/lsukernik/status/1321168174004330497) off-chain expenses made in VC-funded dollars with on-chain income?\n- How do we produce real-time income statements, cash flow statements, and balance sheets that can be accessed by community members, contributors, investors, and outsiders? \n- How can we standardize these statements across crypto projects, similar to the standardization of statements in 10k reports of public companies?\n- How can we rate the financial health of a treasury?\n- For DAOs or other projects that are registered as legal entities, how do we produce statements that can easily be used by accountants and tax people?\n\nThere is a need for a full stack solution that helps communities manage their treasuries ([Stripe Treasury](https://stripe.com/treasury) for crypto) and helps them disclose relevant information (SEC [Edgar](https://www.sec.gov/edgar/search-and-access) but [on-chain](https://twitter.com/lsukernik/status/1335652170792914945)). I’m working on solving some of these problems at [Llama](https://llama.community/#/), which helps crypto communities like DeFi protocols, DAOs, and social token communities manage their treasury.\n\nYFI is one of the first protocols that released its self reported [financial statements](https://twitter.com/iearnfinance/status/1336686533701582849) in December 2020. This was a great initiative by YFI community members, but it is difficult to reconcile these statements. It is important for any community to generate such financial statements easily and for outsiders to be able to audit them. Additionally, if communities want to keep certain treasury details private, they should have the option to do that.\n\n**Governance**\n\nAs Fred Ehrsam argued - while governance minimization is important, treasury management is an area where governance will likely be required for the foreseeable future. It is difficult to entirely automate the process of deciding how to allocate funds.\n\nMonetary policy of crypto protocols is discussed a lot, but fiscal policy isn’t. This will change in the next few years. These are some important questions relating to fiscal policy of decentralized communities:\n\n- How should a budget get approved? \n- Who should authorize payments for a treasury?\n- How should grants and bounties be structured?\n- How much should core contributors get paid? What type of vesting schedule is appropriate?\n- How much should be spent on liquidity mining efforts? (This is a monetary and fiscal policy question.)\n- How should treasuries decide token [buybacks](https://twitter.com/lsukernik/status/1349774197799661569)?\n- How should the treasury be structured? Is the goal of the treasury to exist in perpetuity, like a university endowment, or to be dissolved after a certain number of years, like the [Gates Foundation](https://www.gatesfoundation.org/Who-We-Are/General-Information/Financials/Foundation-Trust)?\n- How should liquidity of the treasury be managed? What percentage of assets should be in the native protocol token, in ETH/BTC, and in stablecoins like DAI and USDC?\n\nIt is too much to expect the average token holder to vote on small transactions spent by the treasury. Uniswap's grants program [proposal](https://gov.uniswap.org/t/rfc-uniswap-grants-program-v0-1/9081) is an example of a thoughtful approach to a protocol's fiscal policy. A committee of six members will be responsible for allocating up to $750,000 every quarter towards Uniswap's ecosystem development efforts. Every committee has a term of two quarters. Budgets and caps will be re-assessed every six months.\n\nSynthetix recently created the [Spartan Council](https://blog.synthetix.io/spartan-council-proposal/), which is a group of members elected by SNX token holders responsible for approving changes to the Synthetix protocol. Elections take place every three months. Such a council could potentially be used to make day-to-day treasury decisions, while the community approves larger budgets.\n\nIn certain cases, a governance proposal in crypto can function as an invoice. Take for example the [proposal](https://snapshot.page/#/jamm/proposal/QmdEH5prtD5nRzLT8PLLXtx1wLGwsqBw8KEu2zcS95VBvh) to pay Michael Arnold for developing the [website](https://www.jammpad.com/) for JAMM's social token. It contains the necessary details for an invoice: proposer name and contact info, seller name and contact info, date of invoice, description of services, seller payment details, and terms for payment.\n\nWhy does documentation like this matter? Besides helping the treasurer and other community members, documentation can be useful in the future for auditing and rating.\n\n**Auditing & Rating**\n\nWhile accounting involves recording transactions and producing financial statements, auditing involves verifying and evaluating those statements. An external auditor must be able to easily go through each transaction initiated by the community treasury and verify if it is legitimate.\n\nEach transaction should have a corresponding governance proposal, transaction hash, budget category, and other notes. An auditor should be able to track a transaction from a year ago and check if any fraud has been committed. Just like smart contracts need to be audited, treasuries need to be audited. We will eventually have some type of rating system to evaluate the financial health of different crypto treasuries. To do that, we need to organize the raw data in a useful way.\n\n![Transaction history on [Llama](https://llama.community/#/jamm/)](https://images.mirror-media.xyz/publication-images/0bbe82c4-ad25-427d-956f-f2cd9f6f778a.jpeg)\n\n**Conclusion**\n\nCrypto treasuries offer the promise of transparency and community empowerment. But to realize this promise, we need to build tools and frameworks to organize treasury data, produce real-time financial statements, audit those statements, and rate the treasury’s financial health.", "timestamp": 1610717777, "digest": "ztqMIwxBolqqID8y_70Bte3F6uRfEMJoIDEShZYNwJE", "contributor": "0x10D6d2e343281D388291A3e02f3293AaEdA67178"}
{"id": "SN5binMH7ANpZbhLm85HD-jVdSVsMPfZEcu2tcGwLlk", "title": "Crypto Community Treasuries", "body": "Crypto treasuries are typically thought to be transparent. But if a community member needs to spend several hours digging through [Etherscan](https://etherscan.io/), [Snapshot](https://snapshot.page/#/), and [Discourse](https://www.discourse.org/) to get a summary of the treasury’s activities over the past month, is the transparency useful?\n\nA crypto community treasury consists of crypto assets in a wallet owned and operated by the community. It is like a community savings account with assets in crypto (not fiat), typically held in a multisig wallet (not a bank account), managed by the community (not a CFO/CEO), and public (not private).\n\n**Accounting**\n\nWe’re in the early days of documentation for crypto treasuries. It is time-consuming for treasurers or operations members of crypto projects to categorize income and expenses, so many do not do it effectively. There could be several proposals every day or week, which are difficult to track. For the community, there is limited real-time, human-readable transparency of the treasury. Members might feel less informed to make and vote on proposals.\n\nThere are several open problems to solve with crypto treasuries:\n\n- How can a treasurer easily categorize transactions and produce a summary statement?\n- How can community members quickly find details for a specific payment made five months back?\n- How can they see a summary of the treasury’s activities for a particular historical month?\n- How can they filter all the bounties made since the treasury’s inception?\n- How can they see the average salary paid to community managers across all crypto projects?\n- For VC funded projects like Uniswap, how do we [integrate](https://twitter.com/lsukernik/status/1321168174004330497) off-chain expenses made in VC-funded dollars with on-chain income?\n- How do we produce real-time income statements, cash flow statements, and balance sheets that can be accessed by community members, contributors, investors, and outsiders? \n- How can we standardize these statements across crypto projects, similar to the standardization of statements in 10k reports of public companies?\n- How can we rate the financial health of a treasury?\n- For DAOs or other projects that are registered as legal entities, how do we produce statements that can easily be used by accountants and tax people?\n\nThere is a need for a full stack solution that helps communities manage their treasuries ([Stripe Treasury](https://stripe.com/treasury) for crypto) and helps them disclose relevant information (SEC [Edgar](https://www.sec.gov/edgar/search-and-access) but [on-chain](https://twitter.com/lsukernik/status/1335652170792914945)). I’m working on solving some of these problems at [Llama](https://llama.community/#/), which helps DeFi protocols, DAOs, and social token communities manage their treasury.\n\nYFI is one of the first protocols that released its self reported [financial statements](https://twitter.com/iearnfinance/status/1336686533701582849) in December 2020. This was a great initiative by YFI community members, but it is difficult to reconcile these statements. It is important for any community to generate such financial statements easily and for outsiders to be able to audit them. Additionally, if communities want to keep certain treasury details private, they should have the option to do that.\n\n**Governance**\n\nAs Fred Ehrsam argued - while governance minimization is important, treasury management is an area where governance will likely be required for the foreseeable future. It is difficult to entirely automate the process of deciding how to allocate funds.\n\nMonetary policy of crypto protocols is discussed a lot, but fiscal policy isn’t. This will change in the next few years. These are some important questions relating to fiscal policy of decentralized communities:\n\n- How should a budget get approved? \n- Who should authorize payments for a treasury?\n- How should grants and bounties be structured?\n- How much should core contributors get paid? What type of vesting schedule is appropriate?\n- How much should be spent on liquidity mining efforts? (This is a monetary and fiscal policy question.)\n- How should treasuries decide token [buybacks](https://twitter.com/lsukernik/status/1349774197799661569)?\n- How should the treasury be structured? Is the goal of the treasury to exist in perpetuity, like a university endowment, or to be dissolved after a certain number of years, like the [Gates Foundation](https://www.gatesfoundation.org/Who-We-Are/General-Information/Financials/Foundation-Trust)?\n- How should liquidity of the treasury be managed? What percentage of assets should be in the native protocol token, in ETH/BTC, and in stablecoins like DAI and USDC?\n\nIt is too much to expect the average token holder to vote on small transactions spent by the treasury. Uniswap's grants program [proposal](https://gov.uniswap.org/t/rfc-uniswap-grants-program-v0-1/9081) is an example of a thoughtful approach to a protocol's fiscal policy. A committee of six members will be responsible for allocating up to $750,000 every quarter towards Uniswap's ecosystem development efforts. Every committee has a term of two quarters. Budgets and caps will be re-assessed every six months.\n\nSynthetix recently created the [Spartan Council](https://blog.synthetix.io/spartan-council-proposal/), which is a group of members elected by SNX token holders responsible for approving changes to the Synthetix protocol. Elections take place every three months. Such a council could potentially be used to make day-to-day treasury decisions, while the community approves larger budgets.\n\nIn certain cases, a governance proposal in crypto can function as an invoice. Take for example the [proposal](https://snapshot.page/#/jamm/proposal/QmdEH5prtD5nRzLT8PLLXtx1wLGwsqBw8KEu2zcS95VBvh) to pay Michael Arnold for developing the [website](https://www.jammpad.com/) for JAMM's social token. It contains the necessary details for an invoice: proposer name and contact info, seller name and contact info, date of invoice, description of services, seller payment details, and terms for payment.\n\nWhy does documentation like this matter? Besides helping the treasurer and other community members, documentation can be useful in the future for auditing and rating.\n\n**Auditing & Rating**\n\nWhile accounting involves recording transactions and producing financial statements, auditing involves verifying and evaluating those statements. An external auditor must be able to easily go through each transaction initiated by the community treasury and verify if it is legitimate.\n\nEach transaction should have a corresponding governance proposal, transaction hash, budget category, and other notes. An auditor should be able to track a transaction from a year ago and check if any fraud has been committed. Just like smart contracts need to be audited, treasuries need to be audited. We will eventually have some type of rating system to evaluate the financial health of different crypto treasuries. To do that, we need to organize the raw data in a useful way.\n\n![Transaction history on [Llama](https://llama.community/#/jamm/)](https://images.mirror-media.xyz/publication-images/0bbe82c4-ad25-427d-956f-f2cd9f6f778a.jpeg)\n\n**Conclusion**\n\nCrypto treasuries offer the promise of transparency and community empowerment. But to realize this promise, we need to build tools and frameworks to organize treasury data, produce real-time financial statements, audit those statements, and rate the treasury’s financial health.", "timestamp": 1610717817, "digest": "ztqMIwxBolqqID8y_70Bte3F6uRfEMJoIDEShZYNwJE", "contributor": "0x10D6d2e343281D388291A3e02f3293AaEdA67178"}
{"id": "_nOrJ9B0RQZ-VidRKeFlzLzM8pLUvfJJkE2Pt8e5O4Q", "title": "Crypto Community Treasuries", "body": "Crypto treasuries are typically thought to be transparent. But if a community member needs to spend several hours digging through [Etherscan](https://etherscan.io/), [Snapshot](https://snapshot.page/#/), and [Discourse](https://www.discourse.org/) to get a summary of the treasury’s activities over the past month, is the transparency useful?\n\nA crypto community treasury consists of crypto assets in a wallet owned and operated by the community. It is like a community savings account with assets in crypto (not fiat), typically held in a multisig wallet (not a bank account), managed by the community (not a CFO/CEO), and public (not private).\n\n**Accounting**\n\nWe’re in the early days of documentation for crypto treasuries. It is time-consuming for treasurers or operations members of crypto projects to categorize income and expenses, so many do not do it effectively. There could be several proposals every day or week, which are difficult to track. For the community, there is limited real-time, human-readable transparency of the treasury. Members might feel less informed to make and vote on proposals.\n\nThere are several open problems to solve with crypto treasuries:\n\n- How can a treasurer easily categorize transactions and produce a summary statement?\n- How can community members quickly find details for a specific payment made five months back?\n- How can they see a summary of the treasury’s activities for a particular historical month?\n- How can they filter all the bounties made since the treasury’s inception?\n- How can they see the average salary paid to community managers across all crypto projects?\n- For VC funded projects like Uniswap, how do we [integrate](https://twitter.com/lsukernik/status/1321168174004330497) off-chain expenses made in VC-funded dollars with on-chain income?\n- How do we produce real-time income statements, cash flow statements, and balance sheets that can be accessed by community members, contributors, investors, and outsiders? \n- How can we standardize these statements across crypto projects, similar to the standardization of statements in 10k reports of public companies?\n- How can we rate the financial health of a treasury?\n- For DAOs or other projects that are registered as legal entities, how do we produce statements that can easily be used by accountants and tax people?\n\nThere is a need for a full stack solution that helps communities manage their treasuries ([Stripe Treasury](https://stripe.com/treasury) for crypto) and helps them disclose relevant information (SEC [Edgar](https://www.sec.gov/edgar/search-and-access) but [on-chain](https://twitter.com/lsukernik/status/1335652170792914945)). I’m working on solving some of these problems at [Llama](https://llama.community/#/), which helps DeFi protocols, DAOs, and social token communities manage their treasuries.\n\nYFI is one of the first protocols that released its self reported [financial statements](https://twitter.com/iearnfinance/status/1336686533701582849) in December 2020. This was a great initiative by YFI community members, but it is difficult to reconcile these statements. It is important for any community to generate such financial statements easily and for outsiders to be able to audit them. Additionally, if communities want to keep certain treasury details private, they should have the option to do that.\n\n**Governance**\n\nAs Fred Ehrsam argued - while governance minimization is important, treasury management is an area where governance will likely be required for the foreseeable future. It is difficult to entirely automate the process of deciding how to allocate funds.\n\nMonetary policy of crypto protocols is discussed a lot, but fiscal policy isn’t. This will change in the next few years. These are some important questions relating to fiscal policy of decentralized communities:\n\n- How should a budget get approved? \n- Who should authorize payments for a treasury?\n- How should grants and bounties be structured?\n- How much should core contributors get paid? What type of vesting schedule is appropriate?\n- How much should be spent on liquidity mining efforts? (This is a monetary and fiscal policy question.)\n- How should treasuries decide token [buybacks](https://twitter.com/lsukernik/status/1349774197799661569)?\n- How should the treasury be structured? Is the goal of the treasury to exist in perpetuity, like a university endowment, or to be dissolved after a certain number of years, like the [Gates Foundation](https://www.gatesfoundation.org/Who-We-Are/General-Information/Financials/Foundation-Trust)?\n- How should liquidity of the treasury be managed? What percentage of assets should be in the native protocol token, in ETH/BTC, and in stablecoins like DAI and USDC?\n\nIt is too much to expect the average token holder to vote on small transactions spent by the treasury. Uniswap's grants program [proposal](https://gov.uniswap.org/t/rfc-uniswap-grants-program-v0-1/9081) is an example of a thoughtful approach to a protocol's fiscal policy. A committee of six members will be responsible for allocating up to $750,000 every quarter towards Uniswap's ecosystem development efforts. Every committee has a term of two quarters. Budgets and caps will be re-assessed every six months.\n\nSynthetix recently created the [Spartan Council](https://blog.synthetix.io/spartan-council-proposal/), which is a group of members elected by SNX token holders responsible for approving changes to the Synthetix protocol. Elections take place every three months. Such a council could potentially be used to make day-to-day treasury decisions, while the community approves larger budgets.\n\nIn certain cases, a governance proposal in crypto can function as an invoice. Take for example the [proposal](https://snapshot.page/#/jamm/proposal/QmdEH5prtD5nRzLT8PLLXtx1wLGwsqBw8KEu2zcS95VBvh) to pay Michael Arnold for developing the [website](https://www.jammpad.com/) for JAMM's social token. It contains the necessary details for an invoice: proposer name and contact info, seller name and contact info, date of invoice, description of services, seller payment details, and terms for payment.\n\nWhy does documentation like this matter? Besides helping the treasurer and other community members, documentation can be useful in the future for auditing and rating.\n\n**Auditing & Rating**\n\nWhile accounting involves recording transactions and producing financial statements, auditing involves verifying and evaluating those statements. An external auditor must be able to easily go through each transaction initiated by the community treasury and verify if it is legitimate.\n\nEach transaction should have a corresponding governance proposal, transaction hash, budget category, and other notes. An auditor should be able to track a transaction from a year ago and check if any fraud has been committed. Just like smart contracts need to be audited, treasuries need to be audited. We will eventually have some type of rating system to evaluate the financial health of different crypto treasuries. To do that, we need to organize the raw data in a useful way.\n\n![Transaction history on [Llama](https://llama.community/#/jamm/)](https://images.mirror-media.xyz/publication-images/0bbe82c4-ad25-427d-956f-f2cd9f6f778a.jpeg)\n\n**Conclusion**\n\nCrypto treasuries offer the promise of transparency and community empowerment. But to realize this promise, we need to build tools and frameworks to organize treasury data, produce real-time financial statements, audit those statements, and rate the treasury’s financial health.", "timestamp": 1610718000, "digest": "ztqMIwxBolqqID8y_70Bte3F6uRfEMJoIDEShZYNwJE", "contributor": "0x10D6d2e343281D388291A3e02f3293AaEdA67178"}
{"id": "E6AxtJRErQ0CFnBxpxE71PJxueh6Y-rhVFnr8a_ignc", "title": "Crypto Community Treasuries", "body": "Crypto treasuries are typically thought to be transparent. But if a community member needs to spend several hours digging through [Etherscan](https://etherscan.io/), [Snapshot](https://snapshot.page/#/), and [Discourse](https://www.discourse.org/) to get a summary of the treasury’s activities over the past month, is the transparency useful?\n\nA crypto community treasury consists of crypto assets in a wallet owned and operated by the community. It is like a community savings account with assets in crypto (not fiat), typically held in a multisig wallet (not a bank account), managed by the community (not a CFO/CEO), and public (not private).\n\n**Accounting**\n\nWe’re in the early days of documentation for crypto treasuries. It is time-consuming for treasurers or operations members of crypto projects to categorize income and expenses, so many do not do it effectively. There could be several proposals every day or week, which are difficult to track. For the community, there is limited real-time, human-readable transparency of the treasury. Members might feel less informed to make and vote on proposals.\n\nThere are several open problems to solve with crypto treasuries:\n\n- How can a treasurer easily categorize transactions and produce a summary statement?\n- How can community members quickly find details for a specific payment made five months back?\n- How can they see a summary of the treasury’s activities for a particular historical month?\n- How can they filter all the bounties made since the treasury’s inception?\n- How can they see the average salary paid to community managers across all crypto projects?\n- For VC funded projects like Uniswap, how do we [integrate](https://twitter.com/lsukernik/status/1321168174004330497) off-chain expenses made in VC-funded dollars with on-chain income?\n- How do we produce real-time income statements, cash flow statements, and balance sheets that can be accessed by community members, contributors, investors, and outsiders? \n- How can we standardize these statements across crypto projects, similar to the standardization of statements in 10k reports of public companies?\n- How can we rate the financial health of a treasury?\n- For DAOs or other projects that are registered as legal entities, how do we produce statements that can easily be used by accountants and tax people?\n\nThere is a need for a full stack solution that helps communities manage their treasuries ([Stripe Treasury](https://stripe.com/treasury) for crypto) and helps them disclose relevant information (SEC [Edgar](https://www.sec.gov/edgar/search-and-access) but [on-chain](https://twitter.com/lsukernik/status/1335652170792914945)). I’m working on solving some of these problems at [Llama](https://llama.community/#/), which helps DeFi protocols, DAOs, and social token communities manage their treasuries.\n\nYFI is one of the first protocols that released its self reported [financial statements](https://twitter.com/iearnfinance/status/1336686533701582849) in December 2020. This was a great initiative by YFI community members, but it is difficult to reconcile these statements. It is important for any community to generate such financial statements easily and for outsiders to be able to audit them. Additionally, if communities want to keep certain treasury details private, they should have the option to do that.\n\n**Governance**\n\nAs Fred Ehrsam [argued](https://www.fehrsam.xyz/blog/governance-minimization) - while governance minimization is important, treasury management is an area where governance will likely be required for the foreseeable future. It is difficult to entirely automate the process of deciding how to allocate funds.\n\nMonetary policy of crypto protocols is discussed a lot, but fiscal policy isn’t. This will change in the next few years. These are some important questions relating to fiscal policy of decentralized communities:\n\n- How should a budget get approved? \n- Who should authorize payments for a treasury?\n- How should grants and bounties be structured?\n- How much should core contributors get paid? What type of vesting schedule is appropriate?\n- How much should be spent on liquidity mining efforts? (This is a monetary and fiscal policy question.)\n- How should treasuries decide token [buybacks](https://twitter.com/lsukernik/status/1349774197799661569)?\n- How should the treasury be structured? Is the goal of the treasury to exist in perpetuity, like a university endowment, or to be dissolved after a certain number of years, like the [Gates Foundation](https://www.gatesfoundation.org/Who-We-Are/General-Information/Financials/Foundation-Trust)?\n- How should liquidity of the treasury be managed? What percentage of assets should be in the native protocol token, in ETH/BTC, and in stablecoins like DAI and USDC?\n\nIt is too much to expect the average token holder to vote on small transactions spent by the treasury. Uniswap's grants program [proposal](https://gov.uniswap.org/t/rfc-uniswap-grants-program-v0-1/9081) is an example of a thoughtful approach to a protocol's fiscal policy. A committee of six members will be responsible for allocating up to $750,000 every quarter towards Uniswap's ecosystem development efforts. Every committee has a term of two quarters. Budgets and caps will be re-assessed every six months.\n\nSynthetix recently created the [Spartan Council](https://blog.synthetix.io/spartan-council-proposal/), which is a group of members elected by SNX token holders responsible for approving changes to the Synthetix protocol. Elections take place every three months. Such a council could potentially be used to make day-to-day treasury decisions, while the community approves larger budgets.\n\nIn certain cases, a governance proposal in crypto can function as an invoice. Take for example the [proposal](https://snapshot.page/#/jamm/proposal/QmdEH5prtD5nRzLT8PLLXtx1wLGwsqBw8KEu2zcS95VBvh) to pay Michael Arnold for developing the [website](https://www.jammpad.com/) for JAMM's social token. It contains the necessary details for an invoice: proposer name and contact info, seller name and contact info, date of invoice, description of services, seller payment details, and terms for payment.\n\nWhy does documentation like this matter? Besides helping the treasurer and other community members, documentation can be useful in the future for auditing and rating.\n\n**Auditing & Rating**\n\nWhile accounting involves recording transactions and producing financial statements, auditing involves verifying and evaluating those statements. An external auditor must be able to easily go through each transaction initiated by the community treasury and verify if it is legitimate.\n\nEach transaction should have a corresponding governance proposal, transaction hash, budget category, and other notes. An auditor should be able to track a transaction from a year ago and check if any fraud has been committed. Just like smart contracts need to be audited, treasuries need to be audited. We will eventually have some type of rating system to evaluate the financial health of different crypto treasuries. To do that, we need to organize the raw data in a useful way.\n\n![Transaction history on [Llama](https://llama.community/#/jamm/)](https://images.mirror-media.xyz/publication-images/0bbe82c4-ad25-427d-956f-f2cd9f6f778a.jpeg)\n\n**Conclusion**\n\nCrypto treasuries offer the promise of transparency and community empowerment. But to realize this promise, we need to build tools and frameworks to organize treasury data, produce real-time financial statements, audit those statements, and rate the treasury’s financial health.", "timestamp": 1610718108, "digest": "ztqMIwxBolqqID8y_70Bte3F6uRfEMJoIDEShZYNwJE", "contributor": "0x10D6d2e343281D388291A3e02f3293AaEdA67178"}
{"id": "5fp0jqmYumGlS6Y-t5oUE3oMvRRZG5cHV-QjgvmXkwo", "title": "NFT test", "body": "[](ethereum://0xb932a70A57673d89f4acfFBE830E8ed7f75Fb9e0/18271)\n\n[](ethereum://0xd07dc4262BCDbf85190C01c996b4C06a461d2430/111946)", "timestamp": 1610734716, "digest": "5YyUHWFQK6Rr4oG1TJfWldt9mFH8lvHptzGzohFdtmw", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
{"id": "S615OCFW3UGg7p2Y22rvp10_JvGYPrViWyM7IZeYR7E", "title": "NFT Testing", "body": "[I’m a little NFT](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/18276)\n\nNice", "timestamp": 1610737510, "digest": "15fxkJ1z0Xm-juCU8llFrTIr430-E7ekcx9Ya0L6Irs", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "fYJ_McPyux-Rv_BHJ-493HqathxtZzTFZDpS5-Mn2vc", "title": "The Rise of the Activist Validator", "body": "**Intro**\n\nThis is Part 1 of a two part series titled \"The Rise of the Activist Validator\". Part 1 describes the current situation as I see it. It explains why I see a need for activist validators. Part 2 will describe why I feel the current situation could prevent staking networks from maximizing their longevity and value creation.\n\n**The Blissful Honeymoon**\n\nThese early staking days are characterized by a blissful harmony. Projects get along with their validators. Validators get along well with the projects. There's an optimism that permeates early testnets. It continues into the early mainnet days.\n\nHard questions might arise here and there. Compromises are made in the name of progress. No need to be a troublemaker by rocking the boat. Can't we all just get along?\n\nThe answers may not be totally satisfactory but \"no worries\", the unwanted consequences of these decisions will probably not happen. People are generally good and will do the right thing.\n\nValidators still jump when asked to jump, provide input when asked for input and keep the testnets running. Networks reward the validators for their efforts to varying degrees. The currency is often unissued, illiquid tokens whose value, it's assumed, will only appreciate.\n\n**March Toward Mainnet**\n\nThe blissful march toward mainnet moves forward. Then, after a usually successful launch, the optimism continues. The token remains illiquid.\n\nThe idling mainnets idle along. The community at large, including validators, waits patiently for token liquidity, usually in the form of exchange listings.\n\nDelegators stake to the validators. This usually results in a high stake concentration among a small number of well known, larger validator operators. Everyone sees this happening. Nobody makes too much noise about it.\n\nThat's simply how it goes these days. What can we do about it? Don't worry, things will even out, eventually.\n\nWho wants to be seen as rocking the boat so early? Nobody want's to be seen as the naysayer or the one who's being negative, in the midst of all this post-launch and pre-exchange listing bliss and congratulatory back-slapping.\n\n**The Foundation Delegations**\n\nThen there are those foundation delegations.\n\nIn these early days, these foundation delegations can make or break a validator, especially the smaller- to mid-size operators. The larger operators already have the large institutional fund delegations locked-up. Those large delegations cement the larger validators' spots in the active validator set.\n\nSmaller- to mid-size operators need the foundation delegations to stay in the active set and hopefully at least break even. They're at the mercy of the foundations to delegate enough tokens to them, for a long enough period of them, to keep them in the game.\n\nThis makes it even more unlikely for any validator who hopes for a foundation grant to rock the boat. This could hurt their chances of operating on the network, period. And who wants to look back on all that time and attention invested, only to see it get wiped away, by not having enough delegation to operate?\n\nAnd what about the larger operators? Well, they don't want to rock the boat, either. Many of them have invested large amounts of money in early token sales. Many of their biggest customers are large funds who invested in the token pre-sale.\n\nInvestors in token sales want to see the token price go up, not down. Rocking the boat by pointing out concerns with the network, will probably cause the price to go down, at least in the short term.\n\nEverything's great then! Isn't it?\nThis sounds fantastic, doesn't it? Everyone wins?\n\nOr do they?\n\nIs this really the best route to creating long-term, sustainable value for these networks and their supports?\n\nOver the past couple years, I'm beginning to sense that this lack of dissenting opinion is preventing the networks from realizing their true potential. Not having a well-rounded set of opinions can make these networks more vulnerable to the known or unknown unknown.\n\nActivist validators are needed to balance out the opinion set. These are validators who aren't afraid to rock the boat a little. They don't hesitate to point out vulnerabilities when they see them. They push back when the core team asks them to do something they feel is too risky.\n\nMore on this in Part 2. I'll publish it first on The Crypto Mirror (this publication).\n\n*(Part 1 was first published on the [Chainflow blog](https://chainflow.io/the-rise-of-the-activist-validator/). You can support ideas and writing like this by [delegating to Chainflow](https://chainflow.io/staking).)*", "timestamp": 1610741877, "digest": "Cv9DsogmPlqiWipdDwz5mWnBxZPiNHy8Vh8XwqQI6Cg", "contributor": "0x53b91350a481C1ad80f12127d10524793c9a7E89"}
{"id": "63tXD0hLhYZUoycgUVpDBVEpnMl22eTKlEyHF3GK_Nk", "title": "NFT subculture", "body": "Established art cultures online and in the physical world won't be early adopters of NFTs. A crypto-native subculture will emerge around the medium first.\n\n[NFT Embed Example](ethereum://0xb932a70a57673d89f4acffbe830e8ed7f75fb9e0/18276)\n\nLet's look at two subcultures that may provide inspiration for how NFTs might evolve:\n\n- Photography as an art form\n- Streetwear as fashion\n\nPhotography was rejected by the art establishment until late in the 20th century, almost a century after it was invented.\n\n> They saw photography merely as a thoughtless mechanism for replication, one that lacked, “that refined feeling and sentiment which animate the productions of a man of genius.” [source](https://daily.jstor.org/when-photography-was-not-art/)\n\nStreetwear, similarly, was seen as a low form of fashion consumed by a low-brow audience.\n\nSome important properties of disruptive subcultures:\n\n**Practiced by outsiders**\n- Photography: Camera equipment tinkerers\n- Streetwear: Skater kids\n\n**Considered culturally inferior**\n- Photography: Not art, but the output of a \"machine\"\n- Streetwear: Logos on sweatshirts, no appreciation for craft or materials of fashion\n\n**New marketplaces and connoisseurship criteria**\n- Photography: Collector community outside of “art world”\n- Streetwear: Bespoke online and retail marketplaces\n\nBoth result in controversy and a rejection of the new form among the old guard. Both are initially adopted by outsiders to the dominant culture.\n\nEventually, the old guard starts to slowly embrace the new medium, because the economic and cultural opportunities are too big to miss out on. Finally, the new culture is merged wholesale into the old.\n\nNFT culture will evolve following a similar trajectory. NFT art won’t be taken seriously by the art world at first. Crypto-natives will blaze their unique path and create a new culture.\n\nThe best example of NFT culture today may be community  \"portraits\" of crypto founders. Every civilization valorizes its heroes through art, and crypto is no different.\n\n[](https://twitter.com/Iiterature/status/1349060357889908737)", "timestamp": 1610743286, "digest": "OQrTGdbiDDKs-7it-URF2NYRG9xLMYEQcNnET8fah3I", "contributor": "0x5507dbd48a5A5bAcE8a6030e878cC4E0af147C33"}
{"id": "_V_eXkA0vy-Qb_0mxPATk4rC5ICpt6t-eLuqkGFcQ3E", "title": "Satoshi's Dreams", "body": "As a physics undergrad, one of my favorite books was [Einstein's Dreams](https://en.wikipedia.org/wiki/Einstein%27s_Dreams) by Alan Lightman. In it, the author imagines a fictional version of Einstein in the weeks leading to his publication of the theory of special relativity.\n\nSpecial relativity was paradigm-shifting in part because it totally screwed with the contemporary conception of how time 'worked.' Einstein showed that an entity's perception of time changed depending on how fast that entity was moving (see [here](https://en.wikipedia.org/wiki/Lorentz_transformation) for more specificity). It's still a mind-blowing result to ponder and it's easy to imagine how thinking about it really screwed with Einstein's head.\n\nIn the book, Einstein is plagued with dreams about different versions of the world, each supposing a different tweak on the rules of time. In one version, time flows more slowly the farther one is from the center of earth. People in this world strive to live on mountaintops and status is conferred to those that live 'higher' than others. In another, cause and effect sometimes happen in reverse order. In this world, scientists feel helpless and artists feel joyous. People mostly choose to live in the moment. In yet another, time is a sense, like taste or touch. Those with more 'refined' palates experience events with more motion and temporal details than those who are 'time-deaf'.\n\nThis meta-perspective, of imagining possible futures based on slight tweaks to the rules, seems timely for crypto. We're sitting at an interesting inflection: 2020 showed us that smart contracts are interesting (DeFi Summer), but there are many possible ways the protocol layer might shake out. New layer 1s, rollups, application-specific chains, and various other structural components could play a part and this has implications for what crypto *feels* like 10 years from today.\n\nEvery project that has a stake in that future will be eager to sell its version of the future as a concrete inevitability; I think we'd all make better decisions if we adopted Lightman's perspective instead. Consider multiple possible futures at once and construct your own (ever-changing) probability distribution across those futures.\n\nConsider the digital futures that Satoshi Nakomoto was dreaming of in the weeks leading up to the release of the Bitcoin whitepaper.\n\nI expect that I'll refer back to this way of thinking in future posts.", "timestamp": 1610749943, "digest": "chxvLZhjuPw7KjIh3L1Afr94WMrz9x7Hu0sokQMxyE4", "contributor": "0xed625c9ABa1245Fa8e22eb1f1825881517A9DCE7"}
{"id": "E_1tOfkj6ZlueOSi3HpiG_xWPjSZ4xKbNah3GRm1y0M", "title": "Spyplane \"Beautiful HOME GOODS\" Guide", "body": "![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff794c27a-4078-4e52-8072-e339af37a16c\\_1125x1128.jpeg)\n\n**“Blackbird Spyplane Original I.P.” is priceless**, but a few weeks back we threw a FREEBIE onto IG apropos of nothing but LOVE: Our all-time favorite chair, we were ready to let the world know, is the **Hans Wegner CH-25**. Made in Denmark from wood and WOVEN PAPER, it’s a low-slung beauty **we lucked out & found for the low on Craigslist a few years ago —** and COPPED with panache.\n\nImmediately, our DMs exploded in a chorus of ppl saying things like “GIVE US **MORE HOME-JAWN INTEL**,” “WE NEED **SPICY HOME-DÉCOR** TIPS” and “DROP THE **SPYPLANE HOME-GOODS REVIEW**”\n\nSo **Blackbird Spyplane co-pilot & professional DOPE-DESIGN-SPOTTER Erin** went into **HYPERDRIVE RECON-MODE for fire handcrafted under-the-radar pieces for your crib** — Vol. 1 is today, Vol. 2 comes Thursday… in 2021 we’ll DROP MORE !\n\nFirst up: a **PEACEFUL** **ARMY **of** SMALL MAKERS** whipping up these **SICK HOME-JAWNS by hand from CLAY…**\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F7180bae7-ec8f-4ee3-9a9d-9b2356bf40b0\\_1920x1080.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F7180bae7-ec8f-4ee3-9a9d-9b2356bf40b0\\_1920x1080.jpeg)\n\n**[Shane Gabier](https://www.instagram.com/shanegabier/)**, who co-founded the VERY COOL NYC FASHION LINE Creatures of the Wind (R.I.P.), spent the early part of lockdown getting good at ceramics — turns out if yr a gifted pattern-maker then **u possess the grace and dexterity to tease WET EARTH into POPPING OBJECTS**.\n\nHis ceramics range from **relatively simple pieces, above left**, to more complex forms, like the **WILDLY DOPE interlocking sculpture / vase below**. Shane takes inspiration from modernist design and Brutalist architecture but u already knew that because **u have the SOPHISTICATED AESTHETIC LITERACY required** to subscribe to this newsletter in the first place …\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F1cc37746-790a-4272-97d8-5cd514b89f37\\_1920x1080.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F1cc37746-790a-4272-97d8-5cd514b89f37\\_1920x1080.jpeg)\n\nShane Gabier hand-built this interlocking ceramic sculpture/vase…GOD-LEVEL\n\nShane’s stuff is available through high-end Tribeca jawn emporium [180 the Store](https://180thestore.com/) or u can** [DM him about copping on IG](https://www.instagram.com/shanegabier/). Prices start at $38 for his flatware and start at $250 for his more sculptural pieces…**\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F029db3e2-e0e1-46cd-857b-26dcfdc38ed2\\_1920x1080.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F029db3e2-e0e1-46cd-857b-26dcfdc38ed2\\_1920x1080.jpeg)\n\nMeanwhile, **[Ginny Sims](https://www.ginnysimsceramics.com/shop) is a Minneapolis-based artist & ceramicist **whose traditional **Staffordshire- and folk-art-inspired** pieces (those are **her mugs above left**) Erin’s been feeling for a minute…. Ginny announces her **sales on [Instagram](https://www.instagram.com/ginnysimsceramics/) and the wares SELL OUT PRONTO**. Her next drop is set for the end of December so smash the follow and lay up in the damn cut.\n\nThose **blue cobalt dash pattern plates above right** ?? They come from the UK’s **[Ali Hewson](https://www.instagram.com/ali.hewson/), who has heat for days** (and is NOT Bono’s wife)— u can check her stuff out & cop it [here](https://8hollandstreet.com/artists/127-ali-hewson/); it ships internationally.\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F63578676-e6b1-40ef-af7c-3bd3ebfecae4\\_1920x1080.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F63578676-e6b1-40ef-af7c-3bd3ebfecae4\\_1920x1080.jpeg)\n\nOK **THESE R TIGHT AS S\\*\\*T** ! Based just north of us in the East Bay, **[Ariel Clute](http://www.ariel-clute.com/ceramics)** makes CRUNCHY vessels & plates that look like peace signs and smiley faces — and her handpainted shadowy-shapes series (**above right)** is tight, too. We don’t know her, but we f\\*\\*k with her local vision.\n\nThe super-popping **punk/kind-vibe** **dish** above left comes from sculptor **[Eric Preston Alexander](https://www.instagram.com/e.p.alexanderssssss)**, who just had an exhibit at Mast Books last month, and whose IG is full of stunners.\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fb04e8628-0475-4358-be5d-2e06e9d3aedd\\_1920x1080.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fb04e8628-0475-4358-be5d-2e06e9d3aedd\\_1920x1080.jpeg)\n\nIn a **more utilitarian register**: check out **[Kat & Roger](http://www.katandroger.com/)**, above right, a husband-and-wife duo based in L.A. whose joints u might have seen in COOL HOME-GOODS STORES… And the **footed bowl above left** is one of many FIRE pieces by **[Dina Nur Satti](https://www.instagram.com/nur_ceramics/?hl=en)**, a Brooklyn-based ceramicist originally from Sudan and Somalia who riffs on objects with ritual origins…\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fe40d0bc1-7d61-4f5a-b441-91d0c4b2a755\\_1920x1080.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fe40d0bc1-7d61-4f5a-b441-91d0c4b2a755\\_1920x1080.jpeg)\n\nHere at Spyplane HQ we own a few pieces (bowl, fruit stand, and planter) from L.A.-based **[Pawena Thimaporn](https://www.instagram.com/pawenastudio/)**, an industrial designer who said F\\*\\*K THE CORPO-LIFE in order to throw clay and PAINT ON IT GEOMETRICALLY — those are her pots **above right.**\n\n**Above left** are a few of Atlanta-based **Aleisha Ellis’s [UTILITY OBJECTS](https://www.instagram.com/utilityobjects/?hl=en)** line which takes its inspiration from modern Japanese ceramics and is cool as hell.\n\n(These are definitively not “under the radar” small makers BUT u gotta give it up for California ceramics legends **HEATH** and also **HASAMI PORCELAIN**, made in Japan & designed by the owner of [L.A. store ](https://tortoiselife.com/tortoise-hasami-porcelain-store/)**[Tortoise](https://tortoiselife.com/tortoise-hasami-porcelain-store/)**, who make **durable everyday classics** u can cop new OR check for on **eBay / Craigslist** … i.e. the secondhand pieces [here](https://rover.ebay.com/rover/1/711-53200-19255-0/1?mpre=https%3A%2F%2Fwww.ebay.com%2Fitm%2FEdith-Heath-ceramics-orange-and-brown-coupe-bread-and-butter-plates-set-of-6%2F233814921769%3Fhash%3Ditem3670749229%3Ag%3AYq0AAOSwyoNfqxRs\\&campid=5338702204\\&toolid=10001\\&customid=heathplates) and [here](https://rover.ebay.com/rover/1/711-53200-19255-0/1?mpre=https%3A%2F%2Fwww.ebay.com%2Fitm%2FNIB-Hasami-japan-porcelain-mug-with-lid%2F202990166377%3Fhash%3Ditem2f43282169%3Ag%3AJA0AAOSwW21evLab\\&campid=5338702204\\&toolid=10001\\&customid=hasami).)\n\nOK let’s **PAUSE THE CLAY DRIP and get briefly METALLIC**…\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F478b24f9-6268-4832-b7f8-b528ad088d4c\\_1920x1080.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F478b24f9-6268-4832-b7f8-b528ad088d4c\\_1920x1080.jpeg)\n\nBack in 2014 Erin & I went on an “UNBEATABLE SPIRITUAL-RECON” road trip across the Southwest — one of our stops was **[Cosanti](https://cosanti.com/)**, the profoundly vibey Arizona home & studio of **wild visionary Paolo Soleri, an Italian-born architect, urban designer and philosopher** best known for his cast-bronze bells, one of which is **above left**. They cost **$35 and up and r coppable [HERE](https://cosanti.com/collections/bronze-bells)**.\n\nU can hang these off a **tree branch in yr backyard, off a fire escape out yr window, or from a hook in yr damn ceiling**. (We copped a little bell and it’s in our kitchen.)\n\nSpeaking of **WILD VISIONARIES**, salute **[Oakland metal-artist Mark Bulwinkle](http://markbulwinkle.com/)**, whose house numbers are **above right** — dude custom-makes** cool weird posi-energy pieces** of all sorts (he also did the signage at our **favorite Oakland Cactus Plug, [The Dry Garden](https://www.thedrygardennursery.com/)** — if yr a Bay Area reader come baptize yrself in the soil.)\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F45d17e9b-44bb-45cb-aedc-c56fccc0f19c\\_1920x1080.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F45d17e9b-44bb-45cb-aedc-c56fccc0f19c\\_1920x1080.jpeg)\n\n**OKAY — mushrooms**… every Blackbird Spyplane installment that goes by without a mushroom shout-out is a tiny tragedy, so YOU KNOW we are f\\*\\*king with San Diego-based **[Nick Pourfard](https://www.instagram.com/nbijanpourfard/)**’s BEAUTIFUL **hand-thrown ceramic “mushroom lamps” with tiltable “mushroom cap” shades, **above right, [here](https://lovehouseny.com/collections/nick-pourfard/products/mushroom-lamp-by-nick-pourfard).\n\n(He also makes cool **stackable wooden chairs, above left**, that remind us of the furniture Donald Judd made for his SoHo crib.)\n\nRelatedly, check out **Fernando Aciar’s Fefo Studio** ceramic lamps, which are made on the Lower East Side. We esp. like his **super-simple [Bubble Lamp](http://www.fefostudio.com/shop-lighting/bubble-lamphoney)**.\n\nBut maybe u want to ILLUMINATE yr domain by **lighting some f\\*\\*king wax on fire** ?? Then it’s time for some ‘STICK TALK…\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0360ba68-14fb-4ce5-b2c8-be58124fc235\\_1920x1080.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0360ba68-14fb-4ce5-b2c8-be58124fc235\\_1920x1080.jpeg)\n\nCheck the VERY FUN **“Hot Legs” high-heel candlesticks above left** by Berlin-based **[Laura Welker](https://www.instagram.com/la_walker\\_/)**. They also come in a cowboy boot if that’s your thing. *NOTE FROM ERIN*: Jonah is personally agnostic on these but thankfully when he is BLIND TO THE FIRE I am here to give him sight. Jonah IS into **cute puppers & good boyz** generally so he recognizes the charm of the candlesticks and lamps by L.A.’s **[Zozos General](https://www.instagram.com/zozos_general/)**, above right. Both these makers are DM-to-order.\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F2a0053e4-4523-4226-a27b-04fa8f1517d4\\_1920x1080.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F2a0053e4-4523-4226-a27b-04fa8f1517d4\\_1920x1080.jpeg)\n\nWow. Right now yr saying, “OMG, Blackbird Spyplane** you just went HAM RADIO with home-jawns intel, 10-4**, thank you, I can not wait for volume 2. But please, before u wrap things up, **give us a lil taste of that NATURAL WOODGRAIN!?**”\n\n**For you?? NO DOUBT: Book/Shop**, a store around the corner from us in Oakland, sells these excellent minimal [bookshelves](https://www.shopbookshop.com/collections/furnishings/products/the-ssb-1-in-birch-ply), **above left, which is some of the simplest & handsomest shelving u r likely 2 park your lit on…**\n\nMeanwhile our literal and figurative ethos is to **“KEEP ALL DOORS OPEN”** so we bang with the doorstop above right from **[Larry Tchogniou](https://www.instagram.com/larrytchogninou/)**, a young Chicago-based designer originally from Benin. He made this doorstop by **recording the sound his own front door makes when it closes, then carving curves based on the soundwaves**: $40, [here](https://rupturvision.bigcartel.com/product/sound-level-door-stopper). \n\nU can prop open a door with it OR grant it “**conceptual-art-tier tchotchke status**” and place it on a mantle or coffee table …\n\nWANT **MORE DÉCOR**? Recon on **cool secondhand shops**? **DOPE art** for the low? Vibey **rugs**? Beautiful hand-made **pillows**?\n\nThat’s all coming in PART 2 of the SPYPLANE CRIB REPORT, going out this Thursday to **CLA$$IFIED subscribers behind the paywall**.\n\n“Cla$$ified subscribers? What’s that??” Oh, it’s a beautiful modern miracle: Blackbird Spyplane is **a precious 100% SUBSCRIBER-SUPPORTED “unbeatable newsletter”** — paying for it is FUN & comes w/ MANY PERKS that we don’t charge as much for as we should, so **SMASH the subscribe, underpay us**, join the inner $anctum, yr welcome — and PEACE ☮✌☮✌☮✌☮✌☮✌\n\nJonah & Erin\n\n\\- We interviewed **Ellen Van Dusen** tha home-goods god [here](https://www.blackbirdspyplane.com/p/make-yr-crib-733-more-popping-w-rare)\\\n\\- Herman Miller archivist / learned crib-jawnspotter **Amy Auscherman** gave us **great home ideas** [here](https://www.blackbirdspyplane.com/p/rare-ways-to-make-yr-home-cooler) AND **tips on copping secondhand design online** [here](https://www.blackbirdspyplane.com/p/win-this-rare-herman-miller-chair)\n\nMEANWHILE: The full “**Blackbird Spyplane Interview” **archive, featuring such luminaries of the arts & sciences as **Nathan Fielder, Jerry Seinfeld, André 3000, Lorde, Rashida Jones, John Wilson, Emily Bode, Ezra Koenig, Online Ceramics **and more — is **[here](https://www.blackbirdspyplane.com/p/the-blackbird-spyplane-interview)**.\n", "timestamp": 1610754520, "digest": "elSEhDdY5moHri9ZVmMnLeloE8_I70k0ZDdAwCKitJQ", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
