{"id": "5Ptm2-Cqv1lQPCivqIWS1RbX8G3gQUnlzpRikQImZQU", "title": "Start Here", "body": "Welcome 👋\n\nMy name is Patrick Rivera and I'm a software engineer, writer, and investor in crypto protocols. I currently work at [Mirror](https://mirror.xyz), a decentralized protocol helping creators and communities build crypto-native businesses. So far, we've built tools for [tokenized crowdfunding](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ), [NFT auctions](https://dev.mirror.xyz/_OstP6dwYsX-0YsIaGDw-W4fs3VzESC_QpxrhiyM_Bg),  [on-chain revenue splits](https://dev.mirror.xyz/V_7Jp1hy_g8bz-J1B4Wb5KYSmj5Lt4W7q7cw0noxJsU), and a [tokenized governance game](https://mirror.xyz/race) to onboard new users.\n\nPreviously, I was a growth engineer at [Instacart](https://instacart.com) and a lead growth engineer at a DeFi startup called [Dharma](https://dharma.io).\n\nIn my free time, I write about the intersection of crypto, creators, and communities.\n\nHere are some of my most popular posts:\n- [A Presentation on Crypto Fundamentals and NFTs](https://docs.google.com/presentation/d/1sUpk0gbvRQelH0MUIOqjNeGe8nwRH4mhrhDHmI6qh4M/edit?usp=sharing)\n- [Come for the Creator, Stay for the Economy](https://p.mirror.xyz/1EpvJwUpx_KlRcHOKLNqADEkwHL_Z1ZYKobF2uLwgBg)\n- [Tips for Creators Getting Into Crypto](https://p.mirror.xyz/WQQywdjjfnksMRPMaNKBMxPBqfE5k8nL6pCLe1roGyw)\n- [Crypto-native Newsletter Businesses](https://p.mirror.xyz/CQnk9PLrBAUskCTCHiA5fA9SBDFZGEfCitVH343FWkY)\n- [Internet Renaissance Vibez](https://p.mirror.xyz/pl07RMWdJZktHUAn8hZ02YlO35-Ju49orPrhaRnn4Vo)\n\nSay hi on [Twitter](https://twitter.com/patrickxrivera) or email me at patrick.x.rivera@gmail.com.\n\nI publish a deep dive essay every few weeks so subscribe below to get it right in your inbox.\n\nThanks for reading :~)", "timestamp": 1621091563, "digest": "aKg6UJL7ngyKbmScJ4YbV4bYzjsrWJxLODyU9Rfr0g0", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "VkrwE77rFyDC2k8MOgM5CwHLImu7Jz4LS_dYPN9Kjl8", "title": "Internet renaissance vibez", "body": "[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/81)\n\nThree years ago, I was about to graduate college and still had no idea what I wanted to do. I studied Finance but after a few internships, I realized I wasn’t meant to be in a cheap suit from JCPenny cranking out discounted cash flow models until midnight. At the time, a friend of mine had just finished a coding bootcamp and suggested I try learning to code.\n\nIt was my senior year so like any rational person, I decided to stop going to class so I could code all day (sorry mom). Over the next few months I picked up web development, built full-stack apps, and did so many [Leetcode](https://leetcode.com/) problems that you’d think it was a form of capital punishment. \n\nOnce I graduated, I bought a one-way ticket to San Francisco and stayed on a cozy air mattress in my friend’s living room. Over the next few months, I did some contract work for my friends at [Career Karma](http://careerkarma.com/) and eventually landed a job as a software engineer on the growth team at [Instacart](instacart.com).\n\nA little over a year later, I was looking to work at an early stage startup so I got in touch with a [DeFi](https://en.wikipedia.org/wiki/Decentralized_finance) startup called [Dharma](http://dharma.io/). I had no clue what DeFi was but it was using this crypto thing I vaguely remembered hearing about a while back. After speaking with the team about their vision for a decentralized bank, I was red pilled.\n\nI joined the team but started having imposter syndrome in my first meeting. They talked about counterfactuals, meta transactions, proxy contracts, on-chain this and off-chain that. After the meeting, I had a mini dictionary worth of terms to look up on Wikipedia that night. Then we got to lunch and the entire team passionately debated token economics, incentive structures, governance mechanisms, and all this other stuff I had no clue about. I quickly realized this crypto thing wasn’t just slightly different than existing systems. It was completely different.\n\nOne of my favorite things about crypto is that it’s not just a technology. It’s a philosophy. It’s a belief system. It’s a way of viewing the world. It’s about questioning conventional systems and not caring if everyone else thinks you’re batshit crazy.\n\nOver the next few months, I learned more about cryptonetworks and how they worked under the hood. I remember the “aha moment” when I wrote my first smart contract. With just a few lines of code and a private key, I was able to transfer an internet-native currency anywhere in the world in seconds. \n\nI didn’t have to sign up for Stripe. I didn’t have to use the Plaid API to connect a bank account. I didn’t have to check if TransferWise supported payments for a specific country. There was no centralized party. Just a peer-to-peer cryptonetwork called Ethereum. It was pretty damn mindblowing.\n\nAfter the first few weeks at Dharma, I was confident that DeFi and crypto were the future. But I also got the itch to work on some of my own ideas. I wanted to build software for creative people. Writers. Artists. Musicians. Online teachers. I strongly believe our world depends on these types of people having the tools they need to serve their communities as best they can.\n\nFrankly, I also thought it would take a couple years before the crypto industry had the infrastructure in place for a mainstream consumer app to be built.\n\n\nSo I ended up leaving Dharma to take some time off and explore a few startup ideas. But a couple months ago I read a [manifesto](https://cryptomedia.wtf/) by [Zora](https://zora.co/) that changed how I thought about crypto.\n\nIt described a world where crypto could be used to give any digital media file (eg an image, a song, an essay, digital art, etc.) property rights. It explained how cryptonetworks could turn digital media into liquid financial assets, secured through cryptography, and programmable through smart contracts.\n\nAlthough the individual ideas weren’t new, they were combined and articulated in a way that just made sense. And not just to me.\n\n[Digital artists](https://www.reuters.com/article/retail-trading-nfts/insight-how-a-10-second-video-clip-sold-for-6-6-million-idUKL8N2KV6X9), [athletes](https://www.cnbc.com/2021/02/28/230-million-dollars-spent-on-nba-top-shot.html), [social media influencers](https://cryptoslate.com/logan-paul-nfts-sell-3-5-million-worth-on-first-day-of-release/), [tech executives](https://scottbelsky.medium.com/the-furry-lisa-cryptoart-the-new-economy-of-digital-creativity-6cb2300ea081), [media executives](https://darkstar.mirror.xyz/srmoGiN_1pg_toQGzCupkjWFOaf8xi0mM60zYpn_pwI), and [journalists](https://twitter.com/CaseyNewton/status/1366554892035219462) that never took the crypto weirdos seriously, seem to be taking notice.\n\nBut let’s be real. Is this latest NFT craze a bubble? Probz. Yet, is there at least a kernel of value in the idea of ownership over creative work? I think so.\n\nSo where do we go from here?\n\nWell, there’s been a lot of talk about high transaction fees and lack of scalability in these systems. Although I do think these problems should and will get fixed, a lack of technical scalability is kinda the point.\n\nCryptonetworks trade off technical scalability for social scalability.\n\nFacebook is technically scalable because it’s a social network that processes millions of transactions per second. Meanwhile, Bitcoin is socially scalable because it’s a trillion dollar economic network without a centralized authority.\n\nCrypto isn’t just a technological revolution. It’s also a revolution in capital formation and human coordination. How creative projects are funded. How groups of people are incentivized. How organizations are structured.\n\nYears from now, when I’m old and senile, I believe we’ll look back at this period as an [Internet Renaissance](https://twitter.com/ourZORA/status/1343210395704541189) of sorts. \n\nA time where we dared to fight back against systems that have been designed for centuries to elevate certain groups and keep others disenfranchised.\n\nWho knows though. Maybe all this crypto stuff really is just an intellectual ideal that’ll never work in practice. Regardless, I think it’s at least worth trying.", "timestamp": 1621091605, "digest": "pl07RMWdJZktHUAn8hZ02YlO35-Ju49orPrhaRnn4Vo", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "WA6m6ZuefhDJDIClULYc6zHMMX2RlPMIQt4b7E_5SlM", "title": "Tips for creators getting into crypto", "body": "One of the cool things about working at a startup is that you get to wear a lot hats.\n\n![](https://images.mirror-media.xyz/publication-images/448266d8-eacf-41b7-9a4e-5f884ea1bf79.jpeg?height=1536&width=2048)\n\nOne of my favorite parts of the week is speaking with creators about how they can use crypto to build stronger communities.\n\nIn the future, I think crypto will be a core part of every creator’s business. Kinda like how tech products rely on AI to remain competitive today.\n\nBut we’re still really damn early. So, what is crypto actually good for, *right now?* In this post, we'll cover a framework I share with creators on how to think about the crypto landscape.\n\nBy the way, when I say \"creators\", I'm referring to “[anyone doing non-commoditized work supported by digital platforms](https://twitter.com/ljin18/status/1350863079425376258)”. This includes writers, social media influencers, digital artists, musicians, podcasters, and online teachers, among others.\n\nAlright, now let's take a look at some tips for creators looking to experiment with crypto.\n\n## Tip #1: First, focus on creator market fit\n\nCreators are their own mini startups. They're responsible for focusing on a niche, understanding what customers want, creating something that people love, and finding sustainable ways to grow.\n\nIn startups, the concept “product market fit” is widely regarded as [the key](https://pmarchive.com/guide_to_startups_part4.html) to sustainable growth. Product market fit creates a positive feedback loop between happy customers, new customers, and profits.\n\nThe equivalent to product market fit for creators is [creator market fit](https://twitter.com/ljin18/status/1376393732610785283).\n\n![](https://images.mirror-media.xyz/publication-images/931d23e6-1795-41c4-baf5-20b4d17de8d9.jpeg?height=1108&width=1972)\n\nBefore focusing on growth, creators should prioritize finding creator market fit because it will serve as the foundation for a sustainable career. Once a creator gets to creator market fit, then it may make sense to start experimenting with crypto to accelerate grow.\n\nCrypto is a powerful tool for growth. Crypto is *NOT* a replacement for creator market fit.\n\n## Tip #2: Start off using crypto as a monetization tool\n\nOnce a creator feels like they have creator market fit, it's time to think about how they can use crypto to build a sustainable business.\n\nCrypto can help creators in four main areas:\n\n*   **Financing**: \"Help me raise money for projects.\"\n*   **Acquisition**: \"Help me get more community members.\"\n*   **Engagement:** \"Help my existing community members get more involved.\"\n*   **Monetization:** \"Help me make money.\"\n\nSo, as a bright-eyed and bushy-tailed creator ready to jump down the crypto rabbit hole, where do you start? Well, crypto isn't like signing up for a new SaaS product. Instead, crypto is more like building a mini economy.\n\nEconomies have currencies, laws, governance, goods and services, markets, citizens, etc.\n\nCrypto gives creators the tools to build their own economies with each of these components. But like any good startup, creators should smart small and iterate.\n\nOut of all the ways crypto can help creators, I think *focusing on crypto as a monetization tool is the best place to start* for a few reasons:\n\n*   **Focusing on monetization empowers creators to produce on-chain goods.** Goods and services are the core engine for productive economies because it creates resources to reinvest in growth. One issue I see with many creator tokens is that they launch a token but don't produce any on-chain goods. Most of their revenue is off-chain so that’s where their focus ends up.\n*   **On-chain goods convince community members to download a crypto wallet, buy ETH, and pay the creator on-chain.** Convincing community members to download a crypto wallet and buy ETH is one of the biggest barriers for creators experimenting with crypto. I think it's much easier to persuade your community to go through the mindfvck of learning crypto if they're able to buy a cool NFT at the end.\n*   **On-chain cash flow provides a solid foundation for other experiments.** As you sell more digital goods, you begin to accrue an on-chain treasury. This treasury can then be used to fund experiments like a decentralized investment fund, rewards programs for token holders, collaborations with other crypto-native creators, etc. These experiments then create a positive feedback loop which makes the treasury more valuable and provides more resources for future projects.\n\n[](https://twitter.com/jessewldn/status/1376966491816476674)\n\nAdditionally, creators can view crypto-native monetization as just one part of their product portfolio.\n\nWeb2 is great at monetizing artificial scarcity through paywalls for stuff like content, courses, and communities. Web2 is also great at monetizing attention through ads. But as we’ve seen, ad platforms heavily favor large creators and optimize for certain engagement metrics that aren’t always in the best interest of people consuming the content. Sponsorships are another option but they may require a large audience and a bunch of boring administrative work.\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F3ec3efa3-9281-4312-b919-a295c1f22eaa\\_1440x1080.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F3ec3efa3-9281-4312-b919-a295c1f22eaa\\_1440x1080.jpeg)\n\nNFTs provide a new monetization channel for creators that complements existing channels. Instead of monetizing access or attention, NFTs monetize *ownership*.\n\nThrough math, computer science, and cryptography, digital goods that live on a blockchain can have a single owner. That’s basically what NFTs are. Digital goods that live on a blockchain and have an owner. The wider implication is that [NFTs make the internet ownable](https://variant.mirror.xyz/T8kdtZRIgy_srXB5B06L8vBqFHYlEBcv6ae2zR6Y_eo). As a result, superfans are willing to buy NFTs from their favorite creators because for the first time in history, they can truly *own* a digital good. It’s like having a Nike shoe in your closet. As long as you buy it legally, Nike can’t bust down your door and take the shoe. It’s yours. Similarly, NFTs now provide a digitally-native form of property rights.\n\nAs scalability solutions reduce transaction fees and more infrastructure is built out, I believe NFTs will evolve to provide many other benefits beyond just ownership.\n\nEventually, creators will come up with crypto-native business models like [programmable subscriptions](https://medium.com/superfluid-blog/the-dawn-of-programmable-cashflows-2d50edae05cb), [prediction markets](https://twitter.com/vitalikbuterin/status/1309078385369460741?lang=en), [token reward programs](https://medium.com/bollinger-investment-group/liquidity-mining-a-user-centric-token-distribution-strategy-1d05c5174641), investing in other creators, etc.\n\nIn the meantime, here are a few ways creators can monetize with NFTs today.\n\n***1 of 1 NFTs***\n\nFor this model to work, you need just one true fan. But that leads to the main downside of this model. There’s only one owner. As a result, it's hard to create a community around these NFTs because only one person owns it. This model also prices out consumers who aren't willing to yolo their entire life savings on an NFT.\n\n***Limited supply NFT drops w/ collector rewards***\n\nThis model is still very underexplored. I think 3LAU is the [best example](https://nft.3lau.com/#/auction) of doing it right. With this model, you release a few NFTs and offer rewards to anybody that bids. This creates more of a community since multiple people can get involved while also retaining some scarcity. I think this model works best when releasing a large creative project like an album, a book, film, etc. because it can be made into an extravagant digital experience with a positive feedback loop between the value of the project and the NFTs.\n\n***Fractionalized NFTs***\n\nI think this will become the dominant model at some point. There are many variations but the general idea is to take one NFT and allow people to buy fungible tokens that represent the NFT. Token holders can speculate on the value of the NFT by trading their tokens or they can hold onto the NFT for access to exclusive rewards or just to flex. The main benefit is that this model enables many people to own a piece of your NFT. This can sow the seeds for a well-incentivized community. The design space here is pretty wide so I'm sure we'll see all sorts of experimentation in the coming months.\n\nWe're still in the early days but it's worth taking the time to experiment with different monetization models yourself to understand which is right for the type of community you want to build.\n\nOnce you've started generating on-chain cash flow through NFTs, the next step is community governance.\n\n## Increase community engagement and retention through decentralized governance\n\nDecentralized governance is another killer feature of cryptonetworks. Today, the relationship between creators and their communities is mostly one-way. The creator publishes content and their community consumes it. Maybe there are some chat groups but that‘s about it.\n\nI believe cryptonetworks will usher in a new era of *co-creation*. Creators will involve their communities in key decisions like how to allocate funds, who to onboard, what types of projects they should work on, etc. This type of co-creation increases community and retention which can lead to stronger communities over the long-term.\n\nHere's a few ways creators can involve their community in key decisions today.\n\n***Community-driven capital allocation***\n\nOnce a creator starts generating on-chain revenue, they can redistribute funds with the help of their community. One option is to create an investment fund where community members earn tokens which they use to vote on which digital assets the fund should purchase. Digital assets could include NFTs, [NBA Top Shot](https://nbatopshot.com/) moments, plots of land in [Decentraland](https://decentraland.org/), or tokens for a DeFi protocol. One example of a decentralized investment fund is [FlamingoDAO](https://docs.flamingodao.xyz/). [Cooper Turley](https://twitter.com/Cooopahtroopa), has a [great blog post](https://coopahtroopa.mirror.xyz/A16NP2XXi9RdHptfdF9WHR0Xq_E1XDmUgMwPmJYOG7w) explaining the potential of these decentralized investment funds.\n\nAnother option is to create a grant program where community members decide projects to fund based on their potential impact on the community. DeFi protocols like Uniswap, AAVE, and Compound all have community-driven grant programs for projects improving their core protocol.\n\nLastly, communities could also vote on what percentage of the treasury should go to community members. For example, $UNI holders get to vote on whether to turn on the 0.05% [protocol fee switch](https://gov.uniswap.org/t/proposal-flip-the-protocol-fee-switch-for-uniswap-dev-team-and-uni-holders/4777).\n\n***Democratically add new community members***\n\nOnboarding new members to a community usually goes one of two ways. On one hand, there's an opaque process where a few people decide who gets allowed in. On the other hand, it's an open access community which can lead to trolls and fvck up the vibez.\n\nWith decentralized governance, the community can self-regulate by collectively deciding who gets onboarded.\n\nFor example, at Mirror, we onboard ten new members each week using a community-driven process called [$WRITE Race](https://mirror.xyz/race). Existing Mirror writers start with 1,000 votes and prospective members start with 10 votes. Everyone has two hours to cast their votes and the top ten people each week are airdropped a $WRITE token which they can burn to get access to Mirror.\n\nGranted, there's still a lot we could do to improve (eg give people a chance to write a short prompt on what they would use Mirror for, experiment with quadratic voting to disincentivize large votes for one person, give prospective members ways to earn more votes, turn the voting system into a prediction market to incentivize voting for people that add the most value to the Mirror protocol, create a DAO to set the voting parameters, etc.)\n\nRegardless, $WRITE Race has turned onboarding from a centralized / permissioned process to a community-driven process.\n\nAs more tools get built for decentralized governance, I think it will become the default way communities make decisions online.\n\n## Capitalize projects through crowdfunding\n\nCrowdfunding today is limited. You either need to live in a certain jurisdiction or be an accredited investor. I believe these limitations are good-natured and agree that we need guardrails to protect consumers from scam artists.\n\nYet, I also believe these limitations are preventing many talented people from gaining access to capital they could use to build something great. There needs to be some sort of middle ground. Here are a few reasons why I think creators should consider using crypto to finance creative projects.\n\n***Global and permissionless access***\n\nTo contribute to a crypto-native crowdfund, all you need is an Ethereum address. No jurisdictional requirements. No minimum net worth requirements. Just a computer, an internet connection, and a crypto wallet with some ETH or ERC20 tokens.\n\n***Programmable ownership***\n\nWith a crowdfund on Kickstarter or GoFundMe, you mostly just receive a warm fuzzy feeling that you contributed to something meaningful. Granted, that’s super important! Unfortunately, many people would rather spend their funds on other assets that generate some sort of return. Whether that be financial or pro-social.\n\nWith crowdfunds on Ethereum, instead of just receiving a warm fuzzy feeling or a bumper sticker, contributors can receive an ERC20 token. This token can then be programmed to include all sorts of benefits. These could include access to an online community, governance rights on how the funds should be allocated, royalties on the assets generated from the crowdfund, or maybe even a cool badge you can display in your crypto wallet or virtual merchandise you can wear in a video game.\n\nThe main takeaway is that cryptonetworks provide a new era of *programmable ownership* which can be used as a tool for better incentive alignment around capital formation.\n\n***Economic graphs***\n\nWeb 1.0 was about information links (web pages). Web 2.0 was about social links (likes, follows, shares). Web 3.0 is about economic links (tokens you earn, investments you make, assets you own). ([source](https://twitter.com/Iiterature/status/1373809410485719045)) One of the coolest products that I think will emerge is a “crypto-native [Crunchbase](https://www.crunchbase.com/) for creators”. For example, if you go to [Instacart’s page on Crunchbase](https://www.crunchbase.com/organization/instacart), you can see their total funding amount, the number of investors, who the investors are, how much they’ve allocated, and a bunch of other information.\n\nWith crypto-native crowdfunding, we could see something similar emerge for any creative project. As the next generation of social products get built on crypto rails, I believe creators will use some sort of decentralized crowdfunding to finance their projects. If so, you could see the entire cap table for the next [Mr. Beast](https://www.youtube.com/channel/UCX6OQ3DkcsbYNE6H8uQQuVA) or [Cardi B](https://www.instagram.com/iamcardib/) and build products around those economic graphs.\n\nYet, decentralized crowdfunding comes with risks since there’s no centralized party to regulate. To limit the risk of scams, I think we could develop something like an on-chain KYC process. To contribute to a crowdfund, you would need to submit your public key and be limited to contributing only a certain percentage of your net worth.\n\nTo raise funds, you would start off with a low funding cap (say $10k) and be required to build credibility within the system through certain metrics before being able to raise larger amounts.\n\nSo far, we’ve covered how crypto can help creators with monetization, engagement, and financing. Now let's take a look at how crypto can help with acquiring new community members.\n\n## Drive acquisition through token rewards\n\nTo drive customer acquisition, DeFi protocols employ a tactic known as \"[liquidity mining](https://medium.com/bollinger-investment-group/liquidity-mining-a-user-centric-token-distribution-strategy-1d05c5174641)\". This is just a fancy way of saying “rewards program”. But, instead of providing cash incentives, protocols incentivize customers with their protocol token.\n\nFor creators, I prefer calling this a \"token rewards\" program since it's a bit more intuitive. Token rewards are so powerful that an entirely [new field of study](https://ce.mit.edu/) called cryptoeconomics was developed to understand it better.\n\nOne kinda scary definition of cryptoeconomics is: \"programming human behavior through the careful design of incentives.\" ([source](https://www.youtube.com/watch?v=gCFlGLbI_kE))\n\nThis is powerful stuff. In web2, we've seen what types of shitshows can happen online when incentives aren't crafted carefully. It’s important to educate ourselves on the mechanics of incentive design so we can consciously create new systems that reward positive sum behavior.\n\nHere's one framework that can help creators think through designing a token rewards program:\n\n1.  **Identify your community’s goal.** Is it to develop deeper social connections? Improve at a skill? Find a better job? Make money?\n2.  **Choose a reward mechanism.** In cryptonetworks, this is usually a programmable token.\n3.  **Choose a positive sum reward that benefits the network.** This can include votes in decentralized governance. Access to exclusive experiences. Or even financial rewards.\n\n*Source: https://www.youtube.com/watch?v=gCFlGLbI_kE*\n\n(If you’d like to go deeper on this subject, check out [Token Engineering 101](https://tokenengineeringcommunity.github.io/website/docs/library-te-101/)).\n\nCrypto gives us powerful tools for human coordination. Creators can use these tools to ensure their communities correct the mistakes that social networks made in the previous era of the web.\n\n## Final Thoughts\n\nCrypto is one of the most fascinating technologies in the world. Over the past decade, it has evolved from a cute little science experiment, to something that might actually be kinda important. Over the next decade, I strongly believe it will become an integral part of our lives.\n\nBut as a creator trying to make a living *today*, it's important to be practical.\n\nFirst, focus on getting to creator market fit. That will serve as the foundation for a sustainable career as a creator. Then, slowly start experimenting with all this crazy crypto stuff. At a high-level, crypto can help creators with financing, acquisition, engagement, and monetization.\n\nOn a tactical level, one option is to start by generating on-chain cash flows through NFTs. Creators can experiment with 1 of 1 NFTs, fractionalization, and limited release drops with tiered rewards. Another option is to create a system of community-driven governance to help improve engagement and retention. Creators can also try to crowdfund for a creative project and give contributors programmable ownership. Creators can even design a token rewards program for incentivizing positive sum behavior within their community.\n\nWhether you've been in crypto for a decade or just downloaded Metamask last week, we're all still trying to figure this stuff out. But that's what makes it so damn fun.\n", "timestamp": 1621091591, "digest": "WQQywdjjfnksMRPMaNKBMxPBqfE5k8nL6pCLe1roGyw", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "4-t1FR5etaHFx-8jXzFLRvBjMb4PiqkIT9wR9TnQ_3U", "title": "THREE POETRY NFTs TO BENEFIT THE DELUGE DAO", "body": "\n***NOTE: These works are now live and available for bidding at [folia.app](https://www.folia.app/works/11) :)***\n \n## HELLO AND WELCOME\n\nToday I’m very excited to launch three new works on [Folia](https://www.folia.app/works/11) – CODE OF HOLES,  PLASTIC BEACH and THE FUTURIST. These three NFT works are generative poems I created with new digital language models and algorithms, plus my own poetic composition. The proceeds from this Folia auction will be completely redistributed to queer, trans, experimental and undersupported writers as the first action of the Deluge Books DAO. [Deluge Books](https://delugebooks.com/) is the mass experimental queer literary press I run with collaborators in New York and Los Angeles (try to say that five times fast). Ever since I [crowdfunded my new book BURN ALPHA as $NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg) we have been excited about the possibilities of crypto, Mirror, and NFTs for generating new methods for sustaining original literary work. You can read a little more about my thoughts on that in [my interview in Decrypt](https://decrypt.co/68981/emily-segal-novel-crowdfund). Down the road, we are pumped about the possibility of crowdfunding for the Deluge DAO on Mirror and our own social token :) Feel free to reach out to me on Twitter at @khole_emily or at emily@delugebooks.com if you have thoughts or suggestions about that!\n\n![](https://images.mirror-media.xyz/publication-images/67fbed62-e121-4b82-bf4e-45bca26fa1fd.png?height=2030&width=3360)\n\n\n\n## MORE ABOUT THESE POETRY NFTs \n \nLast summer I started making an experimental series of language works that used AI, cut-ups and word generators as a form of divination. These poems are the product of that process.\n \nI have always been inspired by William Burroughs and Bryon Gysin’s ideas around how cutting up a text could generate visions of the future or flashes of a deeper truth. When a chaos element got introduced by slicing something up and rescrambling it, the deeper meaning of the words could show up on the surface of the new arrangement. This new layer of meaning could be poetic or divinatory. I've always been interested in divination, and especially since my job as \"trend forecaster\" is a kind of tacky contempo version of divination, it's interesting to me to mix the various spheres where divination goes down: astrology, tarot, cut-ups, data dives, pattern recognition, etc. Introducing randomness in poetic composition has been a persistent theme since Tristan Tzara and Dada, through the Surrealists, hypertext poets and beyond. \n \nOver the summer of 2020, my friend K Allado-Macdowell got their hands on a pilot version of GPT-3, the language model. (Eventually they helped [my project Nemesis write our DOOM! trend report](https://nemesis.global/memos/the-doom-report) using it.) While K started writing an amazing book using GPT-3 at warp speed ([Pharmako-AI, now published by Ignota, here](https://ignota.org/products/pharmako-ai)) they meanwhile indulged me by running fragments of my own poetry and existing poems by writers I loved through the machine, generating text for me to play with. It was all rather astounding and addictive and I looked for a way to work with it directly, since the real thing was only for researchers at the time. \n \nLuckily, that’s when I found out that a game called AI Dungeon, which is a browser-based text roleplaying game, supposedly used GPT-3 as the basis for its premium version, and you could use it to generate texts if you paid the $9/month. So I started making poems using AI dungeon, dodging its role-player-ish verbiage most of the time and trying to get it to present some far-out truths, which it did.\n\n![](https://images.mirror-media.xyz/publication-images/ad9d3716-e893-42e6-9bb7-a0bbf3f5bc11.png?height=1590&width=1588)\n\nOne of my early experiments became the basis for the first poem here, CODE OF HOLES, when the game started describing light as a \"code of holes\" which I found rather dharmic and spooky and appealing. I then took the text generated by interacting with the AI dungeon game and did a Burroughs-style cut-up to it, then edited it into something pithier. Instead of presenting it on a page in the normal way, I justified it in a square and used black emoji as a form of punctuation, since I think it emphasizes the code/hole content motif. The font I used is a nasty free dafont called hole-hearted, another echo of the theme. \n\n![](https://images.mirror-media.xyz/publication-images/e7012e9d-bd18-4d72-bbfd-b14768c9ff49.png?height=1592&width=1596)\n\n\nThe second poem, PLASTIC BEACH, is about having sex with Kylie Jenner. I dreamt I had sex with her in a beach vacation setting surrounded by family, and it included an obscene squirting element. When I woke up I wrote out the dream in order of its events to turn it into a poem but it was too linear, just sounded like badly written erotica. So I ran that text through [an algorithm that mimics Bourroughs-style cutups](http://www.languageisavirus.com/cutupmachine.php) and suddenly it was turned back into a dream, like the cutting and scrambling allowed the dream logic came to the surface again. Bonsai-tree-style pruning and editing followed. There's an influence of the poet Bernadette Mayer here too who worked a lot with dreams and dream logic in her work. You can check out more of Mayer’s writing prompts [here](http://www.writing.upenn.edu/library/Mayer-Bernadette_Experiments.html).\n \nThe font used in the second Folia work is another dafont called PLASTIC BEACH (also the title of the piece) and the background is a photo I took of the sky while tripping on acid on Laguna Beach on the last hot day of summer.\n \n![](https://images.mirror-media.xyz/publication-images/f852bb61-78d7-407a-a007-e13011cf2f37.png?height=1590&width=1580)\n\nThe third piece, THE FUTURIST, came out of my original experimentation with GPT-3 via K. I had asked if GPT-3 could write poetry, and they said yes, but epic poetry, because it did better with longer text samples. Inspired by this, I sent over the first few pages of [The Descent of Alette by Alice Notley](https://poets.org/poem/descent-alette-i-walked), a feminist epic poem and one of my all time favorite books. The Descent of Alette begins in a world where everyone is trapped underground on an infinite subway system. In the world of the book, the “tyrant” stands in for a male supervillain responsible for the suppression of authentic life, and the consciousness of the poem begins to tangle with him. The poem uses a very particular quotation style in which each phrase is bracketed by its own quotation marks – GPT-3 aped this perfectly on the first try, which was eerie, since it’s so unusual. THE FUTURIST is like a riff on one of the tyrant’s moments from the original book, but made kind of fluffier and more treacle-y...a supervillain gone soft in the machine. I edited the original GPT-3 sample considerably and replaced the quotation marks with smiley dingbats (thematically linked to the poem’s smile at the end) and hearts. The font is Futura, obviously! I feel the overall effect is like deep fried Joe Boxer.\n\n \n## MANY THANKS TO...\n\nThe Folia crew – Dan Denorch, Everett Williams, Billy Rennekamp. My Deluge Books collaborators – Cyrus Simonoff, Hannah Baer, Taylor Thompson, Calvin Waterman and Max Ackerman. K Allado-Macdowell for being there. Elaine Kahn and the Poetry Field School Workshops. Kei Kreutler for breaking this and many other things down for me. Dena Yago, period. Patrick, Denis and the whole Mirror team. My $NOVEL supporters who I still can't believe exist. Kay Gabriel’s Bernadette Mayer Class at the Poetry Project. And finally, as always, Math Bass <3 \n\n## P.S. / S.W.A.K.\n\nThe energy consumption of this project and all Folia projects are carbon-offset via Offsetra xoxo ", "timestamp": 1621098879, "digest": "iBV1wCqnnXuELNFYC7dBuVgMz9KScqBPmStdtekGZO0", "contributor": "0xDA18e1537622802EC576D99A8e3913914653BD6F"}
{"id": "Pubpi0qft7jjU9VhQfMaNS9uH5SbKzyjjXBNtED8Fe4", "title": "THREE POETRY NFTs TO BENEFIT THE DELUGE DAO", "body": "\n***NOTE: These works are now live and available for bidding at [folia.app](https://www.folia.app/works/11) :)***\n \n## HELLO AND WELCOME\n\nToday I’m very excited to launch three new works on [Folia](https://www.folia.app/works/11) – CODE OF HOLES,  PLASTIC BEACH and THE FUTURIST. These three NFT works are generative poems I created with new digital language models and algorithms, plus my own poetic composition. The proceeds from this Folia auction will be completely redistributed to queer, trans, experimental and undersupported writers as the first action of the Deluge Books DAO. [Deluge Books](https://delugebooks.com/) is the mass experimental queer literary press I run with collaborators in New York and Los Angeles (try to say that five times fast). Ever since I [crowdfunded my new book BURN ALPHA as $NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg) we have been excited about the possibilities of crypto, Mirror, and NFTs for generating new methods for sustaining original literary work. You can read a little more about my thoughts on that in [my interview in Decrypt](https://decrypt.co/68981/emily-segal-novel-crowdfund). Down the road, we are pumped about the possibility of crowdfunding for the Deluge DAO on Mirror and our own social token :) Feel free to reach out to me on Twitter at @khole_emily or at emily@delugebooks.com if you have thoughts or suggestions about that!\n\n![](https://images.mirror-media.xyz/publication-images/67fbed62-e121-4b82-bf4e-45bca26fa1fd.png?height=2030&width=3360)\n\n\n\n## MORE ABOUT MY POETRY NFTs \n \nLast summer I started making an experimental series of language works that used AI, cut-ups and word generators as a form of divination. These poems are the product of that process.\n \nI have always been inspired by William Burroughs and Bryon Gysin’s ideas around how cutting up a text could generate visions of the future or flashes of a deeper truth. When a chaos element got introduced by slicing something up and rescrambling it, the deeper meaning of the words could show up on the surface of the new arrangement. This new layer of meaning could be poetic or divinatory. I've always been interested in divination, and especially since my job as \"trend forecaster\" is a kind of tacky contempo version of divination, it's interesting to me to mix the various spheres where divination goes down: astrology, tarot, cut-ups, data dives, pattern recognition, etc. Introducing randomness in poetic composition has been a persistent theme since Tristan Tzara and Dada, through the Surrealists, hypertext poets and beyond. \n \nOver the summer of 2020, my friend K Allado-Macdowell got their hands on a pilot version of GPT-3, the language model. (Eventually they helped [my project Nemesis write our DOOM! trend report](https://nemesis.global/memos/the-doom-report) using it.) While K started writing an amazing book using GPT-3 at warp speed ([Pharmako-AI, now published by Ignota, here](https://ignota.org/products/pharmako-ai)) they meanwhile indulged me by running fragments of my own poetry and existing poems by writers I loved through the machine, generating text for me to play with. It was all rather astounding and addictive and I looked for a way to work with it directly, since the real thing was only for researchers at the time. \n \nLuckily, that’s when I found out that a game called AI Dungeon, which is a browser-based text roleplaying game, supposedly used GPT-3 as the basis for its premium version, and you could use it to generate texts if you paid the $9/month. So I started making poems using AI dungeon, dodging its role-player-ish verbiage most of the time and trying to get it to present some far-out truths, which it did.\n\n![](https://images.mirror-media.xyz/publication-images/ad9d3716-e893-42e6-9bb7-a0bbf3f5bc11.png?height=1590&width=1588)\n\nOne of my early experiments became the basis for the first poem here, CODE OF HOLES, when the game started describing light as a \"code of holes\" which I found rather dharmic and spooky and appealing. I then took the text generated by interacting with the AI dungeon game and did a Burroughs-style cut-up to it, then edited it into something pithier. Instead of presenting it on a page in the normal way, I justified it in a square and used black emoji as a form of punctuation, since I think it emphasizes the code/hole content motif. The font I used is a nasty free dafont called hole-hearted, another echo of the theme. \n\n![](https://images.mirror-media.xyz/publication-images/e7012e9d-bd18-4d72-bbfd-b14768c9ff49.png?height=1592&width=1596)\n\n\nThe second poem, PLASTIC BEACH, is about having sex with Kylie Jenner. I dreamt I had sex with her in a beach vacation setting surrounded by family, and it included an obscene squirting element. When I woke up I wrote out the dream in order of its events to turn it into a poem but it was too linear, just sounded like badly written erotica. So I ran that text through [an algorithm that mimics Bourroughs-style cutups](http://www.languageisavirus.com/cutupmachine.php) and suddenly it was turned back into a dream, like the cutting and scrambling allowed the dream logic came to the surface again. Bonsai-tree-style pruning and editing followed. There's an influence of the poet Bernadette Mayer here too who worked a lot with dreams and dream logic in her work. You can check out more of Mayer’s writing prompts [here](http://www.writing.upenn.edu/library/Mayer-Bernadette_Experiments.html).\n \nThe font used in the second Folia work is another dafont called PLASTIC BEACH (also the title of the piece) and the background is a photo I took of the sky while tripping on acid on Laguna Beach on the last hot day of summer.\n \n![](https://images.mirror-media.xyz/publication-images/f852bb61-78d7-407a-a007-e13011cf2f37.png?height=1590&width=1580)\n\nThe third piece, THE FUTURIST, came out of my original experimentation with GPT-3 via K. I had asked if GPT-3 could write poetry, and they said yes, but epic poetry, because it did better with longer text samples. Inspired by this, I sent over the first few pages of [The Descent of Alette by Alice Notley](https://poets.org/poem/descent-alette-i-walked), a feminist epic poem and one of my all time favorite books. The Descent of Alette begins in a world where everyone is trapped underground on an infinite subway system. In the world of the book, the “tyrant” stands in for a male supervillain responsible for the suppression of authentic life, and the consciousness of the poem begins to tangle with him. The poem uses a very particular quotation style in which each phrase is bracketed by its own quotation marks – GPT-3 aped this perfectly on the first try, which was eerie, since it’s so unusual. THE FUTURIST is like a riff on one of the tyrant’s moments from the original book, but made kind of fluffier and more treacle-y...a supervillain gone soft in the machine. I edited the original GPT-3 sample considerably and replaced the quotation marks with smiley dingbats (thematically linked to the poem’s smile at the end) and hearts. The font is Futura, obviously! I feel the overall effect is like deep fried Joe Boxer.\n\n \n## MANY THANKS TO...\n\nThe Folia team - Dan Denorch, Everett Williams, Billy Rennekamp. My Deluge Books collaborators – Cyrus Simonoff, Hannah Baer, Taylor Thompson, Calvin Waterman and Max Ackerman. K Allado-Macdowell for being there. Elaine Kahn and the Poetry Field School Workshops. Kei Kreutler for breaking this and many other things down for me. Dena Yago, period. Patrick, Denis and the whole Mirror team. My $NOVEL supporters who I still can't believe exist. Kay Gabriel’s Bernadette Mayer Class at the Poetry Project. And finally, as always, Math Bass <3 \n\n## PS \n\nThe energy consumption of this project and all Folia projects are carbon-offset via Offsetra xoxo ", "timestamp": 1621098658, "digest": "iBV1wCqnnXuELNFYC7dBuVgMz9KScqBPmStdtekGZO0", "contributor": "0xDA18e1537622802EC576D99A8e3913914653BD6F"}
{"id": "bxdYWGaTWVzvYHKOkPrTD1xlHELule-kZC5hI3qaqe0", "title": "THREE POETRY NFTs TO BENEFIT THE DELUGE DAO", "body": "\n***NOTE: These works are now live and available for bidding at [folia.app](https://www.folia.app/works/11) :)***\n \n## HELLO AND WELCOME\n\n![](https://images.mirror-media.xyz/publication-images/1c7c81e2-1f3b-4380-bff7-dd22c85c3d77.png?height=1678&width=3030)\n\nToday I’m very excited to launch three new works on [Folia](https://www.folia.app/works/11) – CODE OF HOLES,  PLASTIC BEACH and THE FUTURIST. These three NFT works are generative poems I created with new digital language models and algorithms, plus my own poetic composition. The proceeds from this Folia auction will be completely redistributed to queer, trans, experimental and undersupported writers as the first action of the Deluge Books DAO. [Deluge Books](https://delugebooks.com/) is the mass experimental queer literary press I run with collaborators in New York and Los Angeles (try to say that five times fast). Ever since I [crowdfunded my new book BURN ALPHA as $NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg) we have been excited about the possibilities of crypto, Mirror, and NFTs for generating new methods for sustaining original literary work. You can read a little more about my thoughts on that in [my interview in Decrypt](https://decrypt.co/68981/emily-segal-novel-crowdfund). Down the road, we are pumped about the possibility of crowdfunding for the Deluge DAO on Mirror and our own social token :) Feel free to reach out to me on Twitter at @khole_emily or at emily@delugebooks.com if you have thoughts or suggestions about that!\n\n\n\n\n\n## MORE ABOUT THESE POETRY NFTs...\n \nLast summer I started making an experimental series of language works that used AI, cut-ups and word generators as a form of divination. These poems are the product of that process.\n \nI have always been inspired by William Burroughs and Bryon Gysin’s ideas around how cutting up a text could generate visions of the future or flashes of a deeper truth. When a chaos element got introduced by slicing something up and rescrambling it, the deeper meaning of the words could show up on the surface of the new arrangement. This new layer of meaning could be poetic or divinatory. I've always been interested in divination, and especially since my job as \"trend forecaster\" is a kind of tacky contempo version of divination, it's interesting to me to mix the various spheres where divination goes down: astrology, tarot, cut-ups, data dives, pattern recognition, etc. Introducing randomness in poetic composition has been a persistent theme since Tristan Tzara and Dada, through the Surrealists, hypertext poets and beyond. \n \nOver the summer of 2020, my friend K Allado-Macdowell got their hands on a pilot version of GPT-3, the language model. (Eventually they helped [my project Nemesis write our DOOM! trend report](https://nemesis.global/memos/the-doom-report) using it.) While K started writing an amazing book using GPT-3 at warp speed ([Pharmako-AI, now published by Ignota, here](https://ignota.org/products/pharmako-ai)) they meanwhile indulged me by running fragments of my own poetry and existing poems by writers I loved through the machine, generating text for me to play with. It was all rather astounding and addictive and I looked for a way to work with it directly, since the real thing was only for researchers at the time. \n \nLuckily, that’s when I found out that a game called AI Dungeon, which is a browser-based text roleplaying game, supposedly used GPT-3 as the basis for its premium version, and you could use it to generate texts if you paid the $9/month. So I started making poems using AI dungeon, dodging its role-player-ish verbiage most of the time and trying to get it to present some far-out truths, which it did.\n\n![](https://images.mirror-media.xyz/publication-images/ad9d3716-e893-42e6-9bb7-a0bbf3f5bc11.png?height=1590&width=1588)\n\nOne of my early experiments became the basis for the first poem here, CODE OF HOLES, when the game started describing light as a \"code of holes\" which I found rather dharmic and spooky and appealing. I then took the text generated by interacting with the AI dungeon game and did a Burroughs-style cut-up to it, then edited it into something pithier. Instead of presenting it on a page in the normal way, I justified it in a square and used black emoji as a form of punctuation, since I think it emphasizes the code/hole content motif. The font I used is a nasty free dafont called hole-hearted, another echo of the theme. \n\n![](https://images.mirror-media.xyz/publication-images/e7012e9d-bd18-4d72-bbfd-b14768c9ff49.png?height=1592&width=1596)\n\n\nThe second poem, PLASTIC BEACH, is about having sex with Kylie Jenner. I dreamt I had sex with her in a beach vacation setting surrounded by family, and it included an obscene squirting element. When I woke up I wrote out the dream in order of its events to turn it into a poem but it was too linear, just sounded like badly written erotica. So I ran that text through [an algorithm that mimics Bourroughs-style cutups](http://www.languageisavirus.com/cutupmachine.php) and suddenly it was turned back into a dream, like the cutting and scrambling allowed the dream logic came to the surface again. Bonsai-tree-style pruning and editing followed. There's an influence of the poet Bernadette Mayer here too who worked a lot with dreams and dream logic in her work. You can check out more of Mayer’s writing prompts [here](http://www.writing.upenn.edu/library/Mayer-Bernadette_Experiments.html).\n \nThe font used in the second Folia work is another dafont called PLASTIC BEACH (also the title of the piece) and the background is a photo I took of the sky while tripping on acid on Laguna Beach on the last hot day of summer.\n \n![](https://images.mirror-media.xyz/publication-images/f852bb61-78d7-407a-a007-e13011cf2f37.png?height=1590&width=1580)\n\nThe third piece, THE FUTURIST, came out of my original experimentation with GPT-3 via K. I had asked if GPT-3 could write poetry, and they said yes, but epic poetry, because it did better with longer text samples. Inspired by this, I sent over the first few pages of [The Descent of Alette by Alice Notley](https://poets.org/poem/descent-alette-i-walked), a feminist epic poem and one of my all time favorite books. The Descent of Alette begins in a world where everyone is trapped underground on an infinite subway system. In the world of the book, the “tyrant” stands in for a male supervillain responsible for the suppression of authentic life, and the consciousness of the poem begins to tangle with him. The poem uses a very particular quotation style in which each phrase is bracketed by its own quotation marks – GPT-3 aped this perfectly on the first try, which was eerie, since it’s so unusual. THE FUTURIST is like a riff on one of the tyrant’s moments from the original book, but made kind of fluffier and more treacle-y...a supervillain gone soft in the machine. I edited the original GPT-3 sample considerably and replaced the quotation marks with smiley dingbats (thematically linked to the poem’s smile at the end) and hearts. The font is Futura, obviously! I feel the overall effect is like deep fried Joe Boxer.\n\n \n## MANY THANKS TO...\n\nThe Folia crew – Dan Denorch, Everett Williams, Billy Rennekamp. My Deluge Books collaborators – Cyrus Simonoff, Hannah Baer, Taylor Thompson, Calvin Waterman and Max Ackerman. K Allado-Macdowell for being there. Elaine Kahn and the Poetry Field School Workshops. Kei Kreutler for breaking this and many other things down for me. Dena Yago, period. Patrick, Denis and the whole Mirror team. My $NOVEL supporters who I still can't believe exist. Kay Gabriel’s Bernadette Mayer Class at the Poetry Project. And finally, as always, Math Bass <3 \n\n## IF YOU'D LIKE TO GET IN TOUCH\n\nI'm on Twitter at @khole_emily, Instagram @nemesis_emily and reachable at emily@delugebooks.com XOXO\n\n## ONE MORE NOTE\n\n*The energy consumption of this project and all Folia projects are fully carbon-offset via Offsetra.*", "timestamp": 1621099285, "digest": "iBV1wCqnnXuELNFYC7dBuVgMz9KScqBPmStdtekGZO0", "contributor": "0xDA18e1537622802EC576D99A8e3913914653BD6F"}
{"id": "ztguSnX3kt8C2ABbOkgqMGJG_0x2pG0oTPSKGtiCK48", "title": "THREE POETRY NFTs TO BENEFIT THE DELUGE DAO", "body": "\n***NOTE: These works are now live and available for bidding at [folia.app](https://www.folia.app/works/11)!***\n \n## HELLO AND WELCOME\n\n![](https://images.mirror-media.xyz/publication-images/1c7c81e2-1f3b-4380-bff7-dd22c85c3d77.png?height=1678&width=3030)\n\nToday I’m very excited to launch three new works on [Folia](https://www.folia.app/works/11) – CODE OF HOLES,  PLASTIC BEACH and THE FUTURIST. These three NFT works are generative poems I created with new digital language models and algorithms, plus my own poetic composition. The proceeds from this Folia auction will be completely redistributed to queer, trans, experimental and undersupported writers as the first action of the Deluge Books DAO. [Deluge Books](https://delugebooks.com/) is the mass experimental queer literary press I run with collaborators in New York and Los Angeles (try to say that five times fast). Ever since I [crowdfunded my new book BURN ALPHA as $NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg) we have been excited about the possibilities of crypto, Mirror, and NFTs for generating new methods for sustaining original literary work. You can read a little more about my thoughts on that in [my interview in Decrypt](https://decrypt.co/68981/emily-segal-novel-crowdfund). Down the road, we are pumped about the possibility of crowdfunding for the Deluge DAO on Mirror and our own social token :) Feel free to reach out to me on Twitter at @khole_emily or at emily@delugebooks.com if you have thoughts or suggestions about that!\n\n\n\n\n\n## MORE ABOUT THESE POETRY NFTs...\n \nLast summer I started making an experimental series of language works that used AI, cut-ups and word generators as a form of divination. These poems are the product of that process.\n \nI have always been inspired by William Burroughs and Bryon Gysin’s ideas around how cutting up a text could generate visions of the future or flashes of a deeper truth. When a chaos element got introduced by slicing something up and rescrambling it, the deeper meaning of the words could show up on the surface of the new arrangement. This new layer of meaning could be poetic or divinatory. I've always been interested in divination, and especially since my job as \"trend forecaster\" is a kind of tacky contempo version of divination, it's interesting to me to mix the various spheres where divination goes down: astrology, tarot, cut-ups, data dives, pattern recognition, etc. Introducing randomness in poetic composition has been a persistent theme since Tristan Tzara and Dada, through the Surrealists, hypertext poets and beyond. \n \nOver the summer of 2020, my friend K Allado-Macdowell got their hands on a pilot version of GPT-3, the language model. (Eventually they helped [my project Nemesis write our DOOM! trend report](https://nemesis.global/memos/the-doom-report) using it.) While K started writing an amazing book using GPT-3 at warp speed ([Pharmako-AI, now published by Ignota, here](https://ignota.org/products/pharmako-ai)) they meanwhile indulged me by running fragments of my own poetry and existing poems by writers I loved through the machine, generating text for me to play with. It was all rather astounding and addictive and I looked for a way to work with it directly, since the real thing was only for researchers at the time. \n \nLuckily, that’s when I found out that a game called AI Dungeon, which is a browser-based text roleplaying game, supposedly used GPT-3 as the basis for its premium version, and you could use it to generate texts if you paid the $9/month. So I started making poems using AI dungeon, dodging its role-player-ish verbiage most of the time and trying to get it to present some far-out truths, which it did.\n\n![](https://images.mirror-media.xyz/publication-images/ad9d3716-e893-42e6-9bb7-a0bbf3f5bc11.png?height=1590&width=1588)\n\nOne of my early experiments became the basis for the first poem here, CODE OF HOLES, when the game started describing light as a \"code of holes\" which I found rather dharmic and spooky and appealing. I then took the text generated by interacting with the AI dungeon game and did a Burroughs-style cut-up to it, then edited it into something pithier. Instead of presenting it on a page in the normal way, I justified it in a square and used black emoji as a form of punctuation, since I think it emphasizes the code/hole content motif. The font I used is a nasty free dafont called hole-hearted, another echo of the theme. \n\n![](https://images.mirror-media.xyz/publication-images/e7012e9d-bd18-4d72-bbfd-b14768c9ff49.png?height=1592&width=1596)\n\n\nThe second poem, PLASTIC BEACH, is about having sex with Kylie Jenner. I dreamt I had sex with her in a beach vacation setting surrounded by family, and it included an obscene squirting element. When I woke up I wrote out the dream in order of its events to turn it into a poem but it was too linear, just sounded like badly written erotica. So I ran that text through [an algorithm that mimics Bourroughs-style cutups](http://www.languageisavirus.com/cutupmachine.php) and suddenly it was turned back into a dream, like the cutting and scrambling allowed the dream logic came to the surface again. Bonsai-tree-style pruning and editing followed. There's an influence of the poet Bernadette Mayer here too who worked a lot with dreams and dream logic in her work. You can check out more of Mayer’s writing prompts [here](http://www.writing.upenn.edu/library/Mayer-Bernadette_Experiments.html).\n \nThe font used in the second Folia work is another dafont called PLASTIC BEACH (also the title of the piece) and the background is a photo I took of the sky while tripping on acid on Laguna Beach on the last hot day of summer.\n \n![](https://images.mirror-media.xyz/publication-images/f852bb61-78d7-407a-a007-e13011cf2f37.png?height=1590&width=1580)\n\nThe third piece, THE FUTURIST, came out of my original experimentation with GPT-3 via K. I had asked if GPT-3 could write poetry, and they said yes, but epic poetry, because it did better with longer text samples. Inspired by this, I sent over the first few pages of [The Descent of Alette by Alice Notley](https://poets.org/poem/descent-alette-i-walked), a feminist epic poem and one of my all time favorite books. The Descent of Alette begins in a world where everyone is trapped underground on an infinite subway system. In the world of the book, the “tyrant” stands in for a male supervillain responsible for the suppression of authentic life, and the consciousness of the poem begins to tangle with him. The poem uses a very particular quotation style in which each phrase is bracketed by its own quotation marks – GPT-3 aped this perfectly on the first try, which was eerie, since it’s so unusual. THE FUTURIST is like a riff on one of the tyrant’s moments from the original book, but made kind of fluffier and more treacle-y...a supervillain gone soft in the machine. I edited the original GPT-3 sample considerably and replaced the quotation marks with smiley dingbats (thematically linked to the poem’s smile at the end) and hearts. The font is Futura, obviously! I feel the overall effect is like deep fried Joe Boxer.\n\n \n## MANY THANKS TO...\n\nThe Folia crew – Dan Denorch, Everett Williams, Billy Rennekamp. My Deluge Books collaborators – Cyrus Simonoff, Hannah Baer, Taylor Thompson, Calvin Waterman and Max Ackerman. K Allado-Macdowell for being there. Elaine Kahn and the Poetry Field School Workshops. Kei Kreutler for breaking this and many other things down for me. Dena Yago, period. Patrick, Denis and the whole Mirror team. My $NOVEL supporters who I still can't believe exist. Kay Gabriel’s Bernadette Mayer Class at the Poetry Project. And finally, as always, Math Bass <3 \n\n## IF YOU'D LIKE TO GET IN TOUCH\n\nI'm on Twitter at @khole_emily, Instagram @nemesis_emily and reachable at emily@delugebooks.com XOXO\n\n## ONE MORE NOTE\n\n*The energy consumption of this project and all Folia projects are fully carbon-offset via Offsetra.", "timestamp": 1621100042, "digest": "iBV1wCqnnXuELNFYC7dBuVgMz9KScqBPmStdtekGZO0", "contributor": "0xDA18e1537622802EC576D99A8e3913914653BD6F"}
{"id": "0VRC4G35xiTGxUAnDbta8xExPrUTLcVpxz0efJYnhHo", "title": "THREE POETRY NFTs TO BENEFIT THE DELUGE DAO", "body": "\n***NOTE: These works are now live and available for bidding at [folia.app](https://www.folia.app/works/11)!***\n \n## HELLO AND WELCOME\n\n![](https://images.mirror-media.xyz/publication-images/1c7c81e2-1f3b-4380-bff7-dd22c85c3d77.png?height=1678&width=3030)\n\nToday I’m very excited to launch three new works on [Folia](https://www.folia.app/works/11) – CODE OF HOLES,  PLASTIC BEACH and THE FUTURIST. These three NFT works are generative poems I created with new digital language models and algorithms, plus my own poetic composition. The proceeds from this Folia auction will be completely redistributed to queer, trans, experimental and undersupported writers as the first action of the Deluge Books DAO. [Deluge Books](https://delugebooks.com/) is the mass experimental queer literary press I run with collaborators in New York and Los Angeles (try to say that five times fast). Ever since I [crowdfunded my new book BURN ALPHA as $NOVEL](https://emily.mirror.xyz/0AFENlMKv9amUC1OJIZY26udpISw_raXkoEcvelPvzg) we have been excited about the possibilities of crypto, Mirror, and NFTs for generating new methods for sustaining original literary work. You can read a little more about my thoughts on that in [my interview in Decrypt](https://decrypt.co/68981/emily-segal-novel-crowdfund). Down the road, we are pumped about the possibility of crowdfunding for the Deluge DAO on Mirror and our own social token :) Feel free to reach out to me on Twitter at @khole_emily or at emily@delugebooks.com if you have thoughts or suggestions about that!\n\n\n\n\n\n## MORE ABOUT THESE POETRY NFTs...\n \nLast summer I started making an experimental series of language works that used AI, cut-ups and word generators as a form of divination. These poems are the product of that process.\n \nI have always been inspired by William Burroughs and Bryon Gysin’s ideas around how cutting up a text could generate visions of the future or flashes of a deeper truth. When a chaos element got introduced by slicing something up and rescrambling it, the deeper meaning of the words could show up on the surface of the new arrangement. This new layer of meaning could be poetic or divinatory. I've always been interested in divination, and especially since my job as \"trend forecaster\" is a kind of tacky contempo version of divination, it's interesting to me to mix the various spheres where divination goes down: astrology, tarot, cut-ups, data dives, pattern recognition, etc. Introducing randomness in poetic composition has been a persistent theme since Tristan Tzara and Dada, through the Surrealists, hypertext poets and beyond. \n \nOver the summer of 2020, my friend K Allado-Macdowell got their hands on a pilot version of GPT-3, the language model. (Eventually they helped [my project Nemesis write our DOOM! trend report](https://nemesis.global/memos/the-doom-report) using it.) While K started writing an amazing book using GPT-3 at warp speed ([Pharmako-AI, now published by Ignota, here](https://ignota.org/products/pharmako-ai)) they meanwhile indulged me by running fragments of my own poetry and existing poems by writers I loved through the machine, generating text for me to play with. It was all rather astounding and addictive and I looked for a way to work with it directly, since the real thing was only for researchers at the time. \n \nLuckily, that’s when I found out that a game called AI Dungeon, which is a browser-based text roleplaying game, supposedly used GPT-3 as the basis for its premium version, and you could use it to generate texts if you paid the $9/month. So I started making poems using AI dungeon, dodging its role-player-ish verbiage most of the time and trying to get it to present some far-out truths, which it did.\n\n![](https://images.mirror-media.xyz/publication-images/ad9d3716-e893-42e6-9bb7-a0bbf3f5bc11.png?height=1590&width=1588)\n\nOne of my early experiments became the basis for the first poem here, CODE OF HOLES, when the game started describing light as a \"code of holes\" which I found rather dharmic and spooky and appealing. I then took the text generated by interacting with the AI dungeon game and did a Burroughs-style cut-up to it, then edited it into something pithier. Instead of presenting it on a page in the normal way, I justified it in a square and used black emoji as a form of punctuation, since I think it emphasizes the code/hole content motif. The font I used is a nasty free dafont called hole-hearted, another echo of the theme. \n\n![](https://images.mirror-media.xyz/publication-images/e7012e9d-bd18-4d72-bbfd-b14768c9ff49.png?height=1592&width=1596)\n\n\nThe second poem, PLASTIC BEACH, is about having sex with Kylie Jenner. I dreamt I had sex with her in a beach vacation setting surrounded by family, and it included an obscene squirting element. When I woke up I wrote out the dream in order of its events to turn it into a poem but it was too linear, just sounded like badly written erotica. So I ran that text through [an algorithm that mimics Bourroughs-style cutups](http://www.languageisavirus.com/cutupmachine.php) and suddenly it was turned back into a dream, like the cutting and scrambling allowed the dream logic came to the surface again. Bonsai-tree-style pruning and editing followed. There's an influence of the poet Bernadette Mayer here too who worked a lot with dreams and dream logic in her work. You can check out more of Mayer’s writing prompts [here](http://www.writing.upenn.edu/library/Mayer-Bernadette_Experiments.html).\n \nThe font used in the second Folia work is another dafont called PLASTIC BEACH (also the title of the piece) and the background is a photo I took of the sky while tripping on acid on Laguna Beach on the last hot day of summer.\n \n![](https://images.mirror-media.xyz/publication-images/f852bb61-78d7-407a-a007-e13011cf2f37.png?height=1590&width=1580)\n\nThe third piece, THE FUTURIST, came out of my original experimentation with GPT-3 via K. I had asked if GPT-3 could write poetry, and they said yes, but epic poetry, because it did better with longer text samples. Inspired by this, I sent over the first few pages of [The Descent of Alette by Alice Notley](https://poets.org/poem/descent-alette-i-walked), a feminist epic poem and one of my all time favorite books. The Descent of Alette begins in a world where everyone is trapped underground on an infinite subway system. In the world of the book, the “tyrant” stands in for a male supervillain responsible for the suppression of authentic life, and the consciousness of the poem begins to tangle with him. The poem uses a very particular quotation style in which each phrase is bracketed by its own quotation marks – GPT-3 aped this perfectly on the first try, which was eerie, since it’s so unusual. THE FUTURIST is like a riff on one of the tyrant’s moments from the original book, but made kind of fluffier and more treacle-y...a supervillain gone soft in the machine. I edited the original GPT-3 sample considerably and replaced the quotation marks with smiley dingbats (thematically linked to the poem’s smile at the end) and hearts. The font is Futura, obviously! I feel the overall effect is like deep fried Joe Boxer.\n\n \n## MANY THANKS TO...\n\nThe Folia crew – Dan Denorch, Everett Williams, Billy Rennekamp. My Deluge Books collaborators – Cyrus Simonoff, Hannah Baer, Taylor Thompson, Calvin Waterman and Max Ackerman. K Allado-Macdowell for being there. Elaine Kahn and the Poetry Field School Workshops. Kei Kreutler for breaking this and many other things down for me. Dena Yago, period. Patrick, Denis and the whole Mirror team. My $NOVEL supporters who I still can't believe exist. Kay Gabriel’s Bernadette Mayer Class at the Poetry Project. And finally, as always, Math Bass <3 \n\n## IF YOU'D LIKE TO GET IN TOUCH\n\nI'm on Twitter at @khole_emily, Instagram @nemesis_emily and reachable at emily@delugebooks.com XOXO\n\n## ONE MORE NOTE\n\nThe energy consumption of this project and all Folia projects are fully carbon-offset via Offsetra.", "timestamp": 1621100138, "digest": "iBV1wCqnnXuELNFYC7dBuVgMz9KScqBPmStdtekGZO0", "contributor": "0xDA18e1537622802EC576D99A8e3913914653BD6F"}
{"id": "qzFXJgXOVwZXRrqUpLL4c285ya-WsghjXcBl93MSZsk", "title": "Example draft", "body": "Testing it out!! Again!!", "timestamp": 1621100327, "digest": "yKjzbeQ8yjUDb4gv4L38EGg-RTipgbS_BjNnDdwtkw4", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "Mr29uI6fblUs8K16Y3SsrjgKgkydvw2cqLnKOamcX08", "title": "Start Here", "body": "Welcome 👋\n\nMy name is Patrick Rivera and I'm a software engineer, writer, and investor in crypto protocols. I currently work at [Mirror](https://mirror.xyz), a decentralized protocol helping creators and communities build crypto-native businesses. So far, we've built tools for [tokenized crowdfunding](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ), [NFT auctions](https://dev.mirror.xyz/_OstP6dwYsX-0YsIaGDw-W4fs3VzESC_QpxrhiyM_Bg),  [on-chain revenue splits](https://dev.mirror.xyz/V_7Jp1hy_g8bz-J1B4Wb5KYSmj5Lt4W7q7cw0noxJsU), and a [tokenized referral program](https://mirror.xyz/race).\n\nPreviously, I was a growth engineer at [Instacart](https://instacart.com) and a lead growth engineer at a DeFi startup called [Dharma](https://dharma.io).\n\nIn my free time, I write about the intersection of crypto, creators, and communities.\n\nHere are some of my most popular posts:\n- [A Presentation on Crypto Fundamentals and NFTs](https://docs.google.com/presentation/d/1sUpk0gbvRQelH0MUIOqjNeGe8nwRH4mhrhDHmI6qh4M/edit?usp=sharing)\n- [Come for the Creator, Stay for the Economy](https://p.mirror.xyz/1EpvJwUpx_KlRcHOKLNqADEkwHL_Z1ZYKobF2uLwgBg)\n- [Tips for Creators Getting Into Crypto](https://p.mirror.xyz/WQQywdjjfnksMRPMaNKBMxPBqfE5k8nL6pCLe1roGyw)\n- [Crypto-native Newsletter Businesses](https://p.mirror.xyz/CQnk9PLrBAUskCTCHiA5fA9SBDFZGEfCitVH343FWkY)\n- [Internet Renaissance Vibez](https://p.mirror.xyz/pl07RMWdJZktHUAn8hZ02YlO35-Ju49orPrhaRnn4Vo)\n\nSay hi on [Twitter](https://twitter.com/patrickxrivera) or email me at patrick.x.rivera@gmail.com.\n\nI publish a deep dive essay every few weeks so subscribe below to get it right in your inbox.\n\nThanks for reading :~)", "timestamp": 1621110723, "digest": "aKg6UJL7ngyKbmScJ4YbV4bYzjsrWJxLODyU9Rfr0g0", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "yUpyJSGHe_Z_DEL-AMhVkM6_cMaKN_eq3CGr4-GRLc8", "title": "Creative Immortality: Combating Cultural Erasure Through Active Archivism + Curation", "body": "### \"We are born like this, into this. Into hospitals which are so expensive that it's cheaper to die. Into lawyers who charged so much, it's cheaper to plead guilty...Born into this, walking and living through this—dying because of this.\"\n*[Charles Bukowski — Dinosauria, We](https://www.youtube.com/watch?v=HDiLfQUBnyA)*\n\nIf I think about my own community, as a Black American, our traditions are mostly oral being barred from reading or writing for over 200 years in American history. While we since have developed the most global cultural zeitgeist through literature, music, language, and other cultural markers that document our experiences, for a long time, we were the property of America. Undocumented human labor dying en masse for the benefits of the estranged Britons, and subject to the experimentation of bizarre proportions under other European countries. To be Black is to live in a transient truth; unknowing of our past selves and thrust in a world built from our backs we cannot claim nor own as our own. \n\nUntil today.\n\nI had the pleasure of being [interviewed by George Howard](https://www.forbes.com/sites/georgehoward/2021/04/30/creative-immortality-ameer-carters-mint-fund-helps-bipoc-and-lgbtqia-creators-mint-their-first-nfts/?sh=2bac2bb94fa6), a passionate writer, educator, and lawyer who preaches “purpose not product” in a post in Forbes about [Mint Fund](https://themint.fund). We talked at length about black culture and the exploitation we’ve endured for centuries. \n\n\n> *“This is something so near and dear to me...Black culture has had their voices silenced, their art appropriated by white people, with no or little-to-no credit, and certainly no financial benefit. You know for me the thing that absolutely destroys me is the South Bronx, in the late seventies, and DJ Kool Herc and Grandmaster Flash actually taking Rock’n’Roll records — which were obviously built upon Black people’s rhythms — and Grandmaster Flash pulling the record backward. To me, that was the gesture of reclamation. But even to this day, people kind of know Grandmaster Flash, but nobody knows Kool Herc, right? But everyone knows Eminem. Again, all props to Eminem, but this is why [Blockchain tech, social tokens, NFTs are] interesting to me: **The provenance of creation, and particularly as it resonates with the actual creators.** Not the rent-seekers, not the people who just steal the ideas.”*\n\n\nThe provenance of creation. Tracking value to and from the source transparently. Or what I like to call, “Creative Immortality”. With the advent of decentralized applications, **we have the opportunity to build a framework of perpetual wealth redistribution through attribution, patronage, community to build and sustain our cultural capital.** \n\nAs a participant in this space, my goal is to activate and engage Black Culture in crypto to document and record our past, and build our future simultaneously. In order to achieve creative immortality, we need to be able to reconcile with the things we’ve already made. It doesn’t necessarily mean it has to be an NFT, but it does mean that we should have all of our references available and easily accessible. I am reminded of institutions like our HBCUs that are constantly fighting for resources to preserve and teach our history. Or institutions like Yale or the MOMA who have profited from us without retribution. \n\nHow much of our work has been purchased over the years that have never seen the light of day? That has never been exhibited before, that hasn’t been intellectualized, that doesn't have the type of attention or appeal that centralized institutions are looking for. What if the artists of our past could have flourished had we seen ourselves in those galleries, publicly supported, and paid equitably?\n\nCrypto can enable that level of patronage at scale if we anchor ourselves to act inclusively. \n\n\n---\n\n### “Killing fields need blood to graze the cash cow/ It's a number game, but shit don't add up somehow/ Like I got, sixteen to thirty-two bars to rock it/ But only 15% of profits, ever see my pockets like—” \n*[Mos Def, Mathematics](https://www.youtube.com/watch?v=8Ir-zFC9nFE)*\n\n\nLet's face it: Out of the $MM that have touched the hands of NFT artists, cultural communities can count on their fingers the number of artists that have seen any significant portion of that. Micah Johnson's first Aku drop on Nifty Gateway, and the DAO Clash to acquire the work of Ix_Shells x TOR collaboration are the ONLY examples of black artists in the space (notwithstanding celebrities) that have had their works sold for over $1mm. \n\nThat's two fingers. The other 8? \n\n- (50 ETH)* $77.7k high for Carlos Marcial;\n- (22 ETH) $55k high for Cory Van Lew; \n- (11 ETH) $44k high for Osinachi;\n- (10 ETH) $28k high for DIGITAL + Mighty33; \n- (4 ETH) $16.4k high for Yatreda;\n- (9.7 ETH) $16.1k high for Blacksneakers; \n- (4 ETH) $11.6k high for Yosnier;\n- (2.68 ETH) $11.1k high for Latasha (collab);\n\n\nNow if we take these 10 artists out of the equation, for black artists, **our average HIGH ETH sale is roughly 1.79 ETH.**** \n\nThat sucks. \n\nEven if these artists manage to hodl their assets for as long as they can, as the cost of ETH rises, their holdings do not rise at the same rate making it increasingly harder for us to participate in other projects. Perhaps this speaks to a larger issue about ETH becoming more of a store of value than a token to be exchanged—but ultimately, the disparity of asset accrual is not foreign to the black experience. While we have this \"early access\" to crypto, we must work toward broader redistribution of assets to prevent the same issues that plague us: income disparity, low wealth accrual, lack of access to funding, etc.\n\n>> Mention MintFund + other grants\n>> Mention SyndicateDAO + DAO groups \n\n---\n\n### Archivism: Defining Ethical Digital Archeology + Cultural Preservation\n\nWe are at an inflection point in the digital art age where the same mistakes in traditional institutions are being made in cryptospaces:\n\n**Cultural erasure. **\n\nThere’s this push and pull between folks who are really about the provenance of the blockchain versus folks who are wanting to predispose themselves first because they have more visibility.\n\nBlack artists like Connie Digital, Harrison First, and others were some of the first people to institute social tokens and mint albums, songs, and EPs as NFTs for their fans on the blockchain. Unfortunately, after the release of 3LAU's album, media articles were declaring he’s the first to sell an album. And without pause, had said the same for Kings of Leon (which they've since corrected to 'first band' but how accurate is that really?) which is not true. At all. But what has continued to contribute to erasing us has been the attention around that sale, becoming the formative marker as being first because it’s the one that’s made the most noise (and most $$$). I find it interesting because the blockchain doesn't lie—we can literally go back tangibly, and there’s verifiable hash proof that none of those works are first.\n\nFrustratingly, it's also hard to go back further than 2017 because the NFT standard contract ERC-721 wasn't invented prior to the launch of CryptoPunks. So unless you have already documented this work (largely being part of the scene pre-ICOs), you wouldn't even know what to look for. \n\nRelated to this, the convo with @boop  (reference MoonCats)\n\nWe need to instill ethics in our works, projects, and practices. We must respect those who have paved the way for us. We have to actively practice attribution. Several articles I've read recently have deepened my motives around defining the practice of preserving context from archival works:\n\nCryptarchivism (or Crypto-Archivism)\nCryptarch (or Crypto-Archivist)\n\nCryptarchivism - The art of practice of maintaining, discovering, and accessing archives of crypto assets with long-term value.\n\nCryptarch - A practitioner of cryptarchivism.\n\nI think it's at least a first attempt at an ethical practice of handling crypto archives.\n\nI’m not necessarily a historian, but I think the more and more I get involved in this space, the more and more I feel that pressing role of being an archivist. So that culturally, we aren’t erased, even in a space that’s supposed to be decentralized and supposed to be something that works for everyone.\n\n>> Propose DAO for preservation\n\n---\n\nInclusion. Diversity. Equity. Buzzwords when spoken through hollow action. Powerful instruments of change when cultivated in the right hands. But let's be honest with ourselves—this shit is hard fucking work. Many don't want to talk about it. Many don't believe there's a problem. And many of us don't want to do shit about it. The fact remains, cultural work is undervalued. \n\nThe crypto-creative space does not have an ecosystem (yet) for curators to market signal dope creatives that are minting really great works, collectors are largely unaware of works made that don't already have big followings, AND artists lack the tools they need to increase their exposure. \n\nCulture flourishes when its creators and participants are equally given agency within their respective roles. If collectors empower creators of culture, the larger global communities that engage with the culture benefit greatly. \n\nBy changing the state of play, we positively impact creativity, give larger agency for cultural communities to make their best works, leave rich histories for those who come after us, and build toward a more inclusive, equitable, and sustainable world.\n\n**Examples of Success + Patronage of toward Black creatives**\n\n- The Micah Johnson “Aku” drop on Nifty Gateway has created more than $2.6M in primary and secondary sales from the Black community buy-in. \n- xx1/Off (the largest holder/patron of black works) has spent more than 69ETH on black artists.\n- MintFund is currently supporting 650+ BIPOC and Queer artists to mint freely on the Ethereum blockchain.  \n\n### High-value collectors can help accelerate and increase long-term value for these communities.\n\n>> Mention The Well, $HEAT\n\nAs early adopters, we have a responsibility toward creating a fair, safe, inclusive, and equitable environment for all creatives. This isn't done by simply hiring more of us in your companies especially if they aren't already diverse from its inception. The culture is already built—you can't hire out of it unless those folks are granted enough power and influence to do so. Real change starts from the community level. You have to be in it and of it especially if you are an ally (or want to be; we don't just hand these out). The goal is to make sure any cultural community can build their communities as they see fit. As builders, leaders, analysts, engineers, influencers, we HAVE to co-create tools to enable agency. **Don't build for us, build with us.**\n\n>> Mention Open Source Tools \n>> Mention $BOUNTY + PartyDAO (groups toward public goods)\n\nAs we set precedents for outsiders to respect the space, artists, creators, and curators, we must center them for the generations of cultural stewards that succeed us. I’m challenging all of us to start thinking about intentionality and being actively present in this moment. **Because when it’s gone, it’s gone.**\n\n\n---\nAppendix:\n\n**Accounting for the trading value of ETH at time of sale, not adjusted for current value.*\n\n** *This study is based on the sales collected from a pool of 40 black artists. The sales account for the highest historic USD value/ETH sale. There is a correlation of higher ETH = higher USD despite some outliers. This post and study will be updated as I collect more data.*\n\n\n\n\n\n", "timestamp": 1621141232, "digest": "aY5NWo3tf__bWWvZ5slk61T2b6rgGDbXBRzjHSSw_O0", "contributor": "0xEB95ff72EAb9e8D8fdb545FE15587AcCF410b42E"}
{"id": "N94LMfMIOBMxCntCPaEh1mZXOlQ3-lNJMlBxxYfuJCk", "title": "Creative Immortality: Combating Cultural Erasure Through Active Archivism + Curation", "body": "### \"We are born like this, into this. Into hospitals which are so expensive that it's cheaper to die. Into lawyers who charged so much, it's cheaper to plead guilty...Born into this, walking and living through this—dying because of this.\"\n*[Charles Bukowski — Dinosauria, We](https://www.youtube.com/watch?v=HDiLfQUBnyA)*\n\nIf I think about my own community, as a Black American, our traditions are mostly oral being barred from reading or writing for over 200 years in American history. While we since have developed the most global cultural zeitgeist through literature, music, language, and other cultural markers that document our experiences, for a long time, we were the property of America. Undocumented human labor dying en masse for the benefits of the estranged Britons, and subject to the experimentation of bizarre proportions under other European countries. To be Black is to live in a transient truth; unknowing of our past selves and thrust in a world built from our backs we cannot claim nor own as our own. \n\nUntil today.\n\nI had the pleasure of being [interviewed by George Howard](https://www.forbes.com/sites/georgehoward/2021/04/30/creative-immortality-ameer-carters-mint-fund-helps-bipoc-and-lgbtqia-creators-mint-their-first-nfts/?sh=2bac2bb94fa6), a passionate writer, educator, and lawyer who preaches “purpose not product” in a post in Forbes about [Mint Fund](https://themint.fund). We talked at length about black culture and the exploitation we’ve endured for centuries. \n\n\n> *“This is something so near and dear to me...Black culture has had their voices silenced, their art appropriated by white people, with no or little-to-no credit, and certainly no financial benefit. You know for me the thing that absolutely destroys me is the South Bronx, in the late seventies, and DJ Kool Herc and Grandmaster Flash actually taking Rock’n’Roll records — which were obviously built upon Black people’s rhythms — and Grandmaster Flash pulling the record backward. To me, that was the gesture of reclamation. But even to this day, people kind of know Grandmaster Flash, but nobody knows Kool Herc, right? But everyone knows Eminem. Again, all props to Eminem, but this is why [Blockchain tech, social tokens, NFTs are] interesting to me: **The provenance of creation, and particularly as it resonates with the actual creators.** Not the rent-seekers, not the people who just steal the ideas.”*\n\n\nThe provenance of creation. Tracking value to and from the source transparently. Or what I like to call, “Creative Immortality”. With the advent of decentralized applications, **we have the opportunity to build a framework of perpetual wealth redistribution through attribution, patronage, community to build and sustain our cultural capital.** \n\nAs a participant in this space, my goal is to activate and engage Black Culture in crypto to document and record our past, and build our future simultaneously. In order to achieve creative immortality, we need to be able to reconcile with the things we’ve already made. It doesn’t necessarily mean it has to be an NFT, but it does mean that we should have all of our references available and easily accessible. I am reminded of institutions like our HBCUs that are constantly fighting for resources to preserve and teach our history. Or institutions like Yale or the MOMA who have profited from us without retribution. \n\nHow much of our work has been purchased over the years that have never seen the light of day? That has never been exhibited before, that hasn’t been intellectualized, that doesn't have the type of attention or appeal that centralized institutions are looking for. What if the artists of our past could have flourished had we seen ourselves in those galleries, publicly supported, and paid equitably?\n\nCrypto can enable that level of patronage at scale if we anchor ourselves to act inclusively. \n\n\n---\n\n### “Killing fields need blood to graze the cash cow/ It's a number game, but shit don't add up somehow/ Like I got, sixteen to thirty-two bars to rock it/ But only 15% of profits, ever see my pockets like—” \n*[Mos Def, Mathematics](https://www.youtube.com/watch?v=8Ir-zFC9nFE)*\n\n\nLet's face it: Out of the $MM that have touched the hands of NFT artists, cultural communities can count on their fingers the number of artists that have seen any significant portion of that. Micah Johnson's first Aku drop on Nifty Gateway, and the DAO Clash to acquire the work of Ix_Shells x TOR collaboration are the ONLY examples of black artists in the space (notwithstanding celebrities) that have had their works sold for over $1mm. \n\nThat's two fingers. The other 8? \n\n- (50 ETH)* $77.7k high for Carlos Marcial;\n- (22 ETH) $55k high for Cory Van Lew; \n- (11 ETH) $44k high for Osinachi;\n- (10 ETH) $28k high for DIGITAL + Mighty33; \n- (4 ETH) $16.4k high for Yatreda;\n- (9.7 ETH) $16.1k high for Blacksneakers; \n- (4 ETH) $11.6k high for Yosnier;\n- (2.68 ETH) $11.1k high for Latasha (collab);\n\n\nNow if we take these 10 artists out of the equation, for black artists, **our average HIGH ETH sale is roughly 1.79 ETH.**** \n\nThat sucks. \n\nEven if these artists manage to hodl their assets for as long as they can, as the cost of ETH rises, their holdings do not rise at the same rate making it increasingly harder for us to participate in other projects. Perhaps this speaks to a larger issue about ETH becoming more of a store of value than a token to be exchanged—but ultimately, the disparity of asset accrual is not foreign to the black experience. While we have this \"early access\" to crypto, we must work toward broader redistribution of assets to prevent the same issues that plague us: income disparity, low wealth accrual, lack of access to funding, etc.\n\n>> Mention MintFund + other grants\n>> Mention SyndicateDAO + DAO groups \n\n---\n\n### Archivism: Defining Ethical Digital Archeology + Cultural Preservation\n\nWe are at an inflection point in the digital art age where the same mistakes in traditional institutions are being made in cryptospaces:\n\n**Cultural erasure. **\n\nThere’s this push and pull between folks who are really about the provenance of the blockchain versus folks who are wanting to predispose themselves first because they have more visibility.\n\nBlack artists like Connie Digital, Harrison First, and others were some of the first people to institute social tokens and mint albums, songs, and EPs as NFTs for their fans on the blockchain. Unfortunately, after the release of 3LAU's album, media articles were declaring he’s the first to sell an album. And without pause, had said the same for Kings of Leon (which they've since corrected to 'first band' but how accurate is that really?) which is not true. At all. But what has continued to contribute to erasing us has been the attention around that sale, becoming the formative marker as being first because it’s the one that’s made the most noise (and most $$$). I find it interesting because the blockchain doesn't lie—we can literally go back tangibly, and there’s verifiable hash proof that none of those works are first.\n\nFrustratingly, it's also hard to go back further than 2017 because the NFT standard contract ERC-721 wasn't invented prior to the launch of CryptoPunks. So unless you have already documented this work (largely being part of the scene pre-ICOs), you wouldn't even know what to look for. \n\nhttps://twitter.com/boop/status/1370599380114358272\n\nRelated to this, the convo with @boop  (reference MoonCats)\n\nWe need to instill ethics in our works, projects, and practices. We must respect those who have paved the way for us. We have to actively practice attribution. Several articles I've read recently have deepened my motives around defining the practice of preserving context from archival works:\n\nCryptarchivism (or Crypto-Archivism)\nCryptarch (or Crypto-Archivist)\n\nCryptarchivism - The art of practice of maintaining, discovering, and accessing archives of crypto assets with long-term value.\n\nCryptarch - A practitioner of cryptarchivism.\n\nI think it's at least a first attempt at an ethical practice of handling crypto archives.\n\nI’m not necessarily a historian, but I think the more and more I get involved in this space, the more and more I feel that pressing role of being an archivist. So that culturally, we aren’t erased, even in a space that’s supposed to be decentralized and supposed to be something that works for everyone.\n\n>> Propose DAO for preservation\n\n---\n\nInclusion. Diversity. Equity. Buzzwords when spoken through hollow action. Powerful instruments of change when cultivated in the right hands. But let's be honest with ourselves—this shit is hard fucking work. Many don't want to talk about it. Many don't believe there's a problem. And many of us don't want to do shit about it. The fact remains, cultural work is undervalued. \n\nThe crypto-creative space does not have an ecosystem (yet) for curators to market signal dope creatives that are minting really great works, collectors are largely unaware of works made that don't already have big followings, AND artists lack the tools they need to increase their exposure. \n\nhttps://twitter.com/sirsuhayb/status/1336704819239772160\n\nCulture flourishes when its creators and participants are equally given agency within their respective roles. If collectors empower creators of culture, the larger global communities that engage with the culture benefit greatly. \n\nBy changing the state of play, we positively impact creativity, give larger agency for cultural communities to make their best works, leave rich histories for those who come after us, and build toward a more inclusive, equitable, and sustainable world.\n\n**Examples of Success + Patronage of toward Black creatives**\n\n- The Micah Johnson “Aku” drop on Nifty Gateway has created more than $2.6M in primary and secondary sales from the Black community buy-in. \n- xx1/Off (the largest holder/patron of black works) has spent more than 69ETH on black artists.\n- MintFund is currently supporting 650+ BIPOC and Queer artists to mint freely on the Ethereum blockchain.  \n\n### High-value collectors can help accelerate and increase long-term value for these communities.\n\n>> Mention The Well, $HEAT\n\nAs early adopters, we have a responsibility toward creating a fair, safe, inclusive, and equitable environment for all creatives. This isn't done by simply hiring more of us in your companies especially if they aren't already diverse from its inception. The culture is already built—you can't hire out of it unless those folks are granted enough power and influence to do so. Real change starts from the community level. You have to be in it and of it especially if you are an ally (or want to be; we don't just hand these out). The goal is to make sure any cultural community can build their communities as they see fit. As builders, leaders, analysts, engineers, influencers, we HAVE to co-create tools to enable agency. **Don't build for us, build with us.**\n\n>> Mention Open Source Tools \n>> Mention $BOUNTY + PartyDAO (groups toward public goods)\n\nAs we set precedents for outsiders to respect the space, artists, creators, and curators, we must center them for the generations of cultural stewards that succeed us. I’m challenging all of us to start thinking about intentionality and being actively present in this moment. **Because when it’s gone, it’s gone.**\n\n\n---\n**Appendix:**\n\n**Accounting for the trading value of ETH at time of sale, not adjusted for current value.*\n\n** *This study is based on the sales collected from a pool of 40 black artists. The sales account for the highest historic USD value/ETH sale. There is a correlation of higher ETH = higher USD despite some outliers. This post and study will be updated as I collect more data.*\n\n\n**Additional References:**\n\nhttps://news.artnet.com/market/nft-revolution-four-factors-1950645\n\nhttps://techcrunch.com/2021/03/02/explosive-inclusive-potential-nfts/\n\n\n\n\n\n", "timestamp": 1621148932, "digest": "aY5NWo3tf__bWWvZ5slk61T2b6rgGDbXBRzjHSSw_O0", "contributor": "0xEB95ff72EAb9e8D8fdb545FE15587AcCF410b42E"}
{"id": "o0W-YB8wWP2rSaOb5uUmMjEWmywPpgAzo7IAMQ-bAuc", "title": "Creative Immortality: Combating Cultural Erasure Through Active Archivism + Curation", "body": "### \"We are born like this, into this. Into hospitals which are so expensive that it's cheaper to die. Into lawyers who charged so much, it's cheaper to plead guilty...Born into this, walking and living through this—dying because of this.\"\n*[Charles Bukowski — Dinosauria, We](https://www.youtube.com/watch?v=HDiLfQUBnyA)*\n\nIf I think about my own community, as a Black American, our traditions are mostly oral being barred from reading or writing for over 200 years in American history. While we since have developed the most global cultural zeitgeist through literature, music, language, and other cultural markers that document our experiences, for a long time, we were the property of America. Undocumented human labor dying en masse for the benefits of the estranged Britons, and subject to the experimentation of bizarre proportions under other European countries. To be Black is to live in a transient truth; unknowing of our past selves and thrust in a world built from our backs we cannot claim nor own as our own. \n\nUntil today.\n\nI had the pleasure of being [interviewed by George Howard](https://www.forbes.com/sites/georgehoward/2021/04/30/creative-immortality-ameer-carters-mint-fund-helps-bipoc-and-lgbtqia-creators-mint-their-first-nfts/?sh=2bac2bb94fa6), a passionate writer, educator, and lawyer who preaches “purpose not product” in a post in Forbes about [Mint Fund](https://themint.fund). We talked at length about black culture and the exploitation we’ve endured for centuries. \n\n\n> *“This is something so near and dear to me...Black culture has had their voices silenced, their art appropriated by white people, with no or little-to-no credit, and certainly no financial benefit. You know for me the thing that absolutely destroys me is the South Bronx, in the late seventies, and DJ Kool Herc and Grandmaster Flash actually taking Rock’n’Roll records — which were obviously built upon Black people’s rhythms — and Grandmaster Flash pulling the record backward. To me, that was the gesture of reclamation. But even to this day, people kind of know Grandmaster Flash, but nobody knows Kool Herc, right? But everyone knows Eminem. Again, all props to Eminem, but this is why [Blockchain tech, social tokens, NFTs are] interesting to me: **The provenance of creation, and particularly as it resonates with the actual creators.** Not the rent-seekers, not the people who just steal the ideas.”*\n\n\nThe provenance of creation. Tracking value to and from the source transparently. Or what I like to call, “Creative Immortality”. With the advent of decentralized applications, **we have the opportunity to build a framework of perpetual wealth redistribution through attribution, patronage, community to build and sustain our cultural capital.** \n\nAs a participant in this space, my goal is to activate and engage Black Culture in crypto to document and record our past, and build our future simultaneously. In order to achieve creative immortality, we need to be able to reconcile with the things we’ve already made. It doesn’t necessarily mean it has to be an NFT, but it does mean that we should have all of our references available and easily accessible. I am reminded of institutions like our HBCUs that are constantly fighting for resources to preserve and teach our history. Or institutions like Yale or the MOMA who have profited from us without retribution. \n\nHow much of our work has been purchased over the years that have never seen the light of day? That has never been exhibited before, that hasn’t been intellectualized, that doesn't have the type of attention or appeal that centralized institutions are looking for. What if the artists of our past could have flourished had we seen ourselves in those galleries, publicly supported, and paid equitably?\n\nCrypto can enable that level of patronage at scale if we anchor ourselves to act inclusively. \n\n\n---\n\n### “Killing fields need blood to graze the cash cow/ It's a number game, but shit don't add up somehow/ Like I got, sixteen to thirty-two bars to rock it/ But only 15% of profits, ever see my pockets like—” \n*[Mos Def, Mathematics](https://www.youtube.com/watch?v=8Ir-zFC9nFE)*\n\n\nLet's face it: Out of the $MM that have touched the hands of NFT artists, cultural communities can count on their fingers the number of artists that have seen any significant portion of that. Micah Johnson's first Aku drop on Nifty Gateway, and the DAO Clash to acquire the work of Ix_Shells x TOR collaboration are the ONLY examples of black artists in the space (notwithstanding celebrities) that have had their works sold for over $1mm. \n\nThat's two fingers. The other 8? \n\n- (50 ETH)* $77.7k high for Carlos Marcial;\n- (22 ETH) $55k high for Cory Van Lew; \n- (11 ETH) $44k high for Osinachi;\n- (10 ETH) $28k high for DIGITAL + Mighty33; \n- (4 ETH) $16.4k high for Yatreda;\n- (9.7 ETH) $16.1k high for Blacksneakers; \n- (4 ETH) $11.6k high for Yosnier;\n- (2.68 ETH) $11.1k high for Latasha (collab);\n\n\nNow if we take these 10 artists out of the equation, for black artists, **our average HIGH ETH sale is roughly 1.79 ETH.**** \n\nThat sucks. \n\nEven if these artists manage to hodl their assets for as long as they can, as the cost of ETH rises, their holdings do not rise at the same rate making it increasingly harder for us to participate in other projects. Perhaps this speaks to a larger issue about ETH becoming more of a store of value than a token to be exchanged—but ultimately, the disparity of asset accrual is not foreign to the black experience. While we have this \"early access\" to crypto, we must work toward broader redistribution of assets to prevent the same issues that plague us: income disparity, low wealth accrual, lack of access to funding, etc.\n\n>> Mention MintFund + other grants\n>> Mention SyndicateDAO + DAO groups \n\n---\n\n### Archivism: Defining Ethical Digital Archeology + Cultural Preservation\n\nWe are at an inflection point in the digital art age where the same mistakes in traditional institutions are being made in cryptospaces:\n\n**Cultural erasure.**\n\nThere’s this push and pull between folks who are really about the provenance of the blockchain versus folks who are wanting to predispose themselves first because they have more visibility.\n\nBlack artists like Connie Digital, Harrison First, and others were some of the first people to institute social tokens and mint albums, songs, and EPs as NFTs for their fans on the blockchain. Unfortunately, after the release of 3LAU's album, media articles were declaring he’s the first to sell an album. And without pause, had said the same for Kings of Leon (which they've since corrected to 'first band' but how accurate is that really?) which is not true. At all. But what has continued to contribute to erasing us has been the attention around that sale, becoming the formative marker as being first because it’s the one that’s made the most noise (and most $$$). I find it interesting because the blockchain doesn't lie—we can literally go back tangibly, and there’s verifiable hash proof that none of those works are first.\n\nFrustratingly, it's also hard to go back further than 2017 because the NFT standard contract ERC-721 wasn't invented prior to the launch of CryptoPunks. So unless you have already documented this work (largely being part of the scene pre-ICOs), you wouldn't even know what to look for. \n\nhttps://twitter.com/boop/status/1370599380114358272\n\nRelated to this, the convo with @boop  (reference MoonCats)\n\nWe need to instill ethics in our works, projects, and practices. We must respect those who have paved the way for us. We have to actively practice attribution. Several articles I've read recently have deepened my motives around defining the practice of preserving context from archival works:\n\nCryptarchivism (or Crypto-Archivism)\nCryptarch (or Crypto-Archivist)\n\nCryptarchivism - The art of practice of maintaining, discovering, and accessing archives of crypto assets with long-term value.\n\nCryptarch - A practitioner of cryptarchivism.\n\nI think it's at least a first attempt at an ethical practice of handling crypto archives.\n\nI’m not necessarily a historian, but I think the more and more I get involved in this space, the more and more I feel that pressing role of being an archivist. So that culturally, we aren’t erased, even in a space that’s supposed to be decentralized and supposed to be something that works for everyone.\n\n>> Propose DAO for preservation\n\n---\n\nInclusion. Diversity. Equity. Buzzwords when spoken through hollow action. Powerful instruments of change when cultivated in the right hands. But let's be honest with ourselves—this shit is hard fucking work. Many don't want to talk about it. Many don't believe there's a problem. And many of us don't want to do shit about it. The fact remains, cultural work is undervalued. \n\nThe crypto-creative space does not have an ecosystem (yet) for curators to market signal dope creatives that are minting really great works, collectors are largely unaware of works made that don't already have big followings, AND artists lack the tools they need to increase their exposure. \n\nhttps://twitter.com/sirsuhayb/status/1336704819239772160\n\nCulture flourishes when its creators and participants are equally given agency within their respective roles. If collectors empower creators of culture, the larger global communities that engage with the culture benefit greatly. \n\nBy changing the state of play, we positively impact creativity, give larger agency for cultural communities to make their best works, leave rich histories for those who come after us, and build toward a more inclusive, equitable, and sustainable world.\n\n**Examples of Success + Patronage of toward Black creatives**\n\n- The Micah Johnson “Aku” drop on Nifty Gateway has created more than $2.6M in primary and secondary sales from the Black community buy-in. \n- xx1/Off (the largest holder/patron of black works) has spent more than 69ETH on black artists.\n- MintFund is currently supporting 650+ BIPOC and Queer artists to mint freely on the Ethereum blockchain.  \n\n### High-value collectors can help accelerate and increase long-term value for these communities.\n\n>> Mention The Well, $HEAT\n\nAs early adopters, we have a responsibility toward creating a fair, safe, inclusive, and equitable environment for all creatives. This isn't done by simply hiring more of us in your companies especially if they aren't already diverse from its inception. The culture is already built—you can't hire out of it unless those folks are granted enough power and influence to do so. Real change starts from the community level. You have to be in it and of it especially if you are an ally (or want to be; we don't just hand these out). The goal is to make sure any cultural community can build their communities as they see fit. As builders, leaders, analysts, engineers, influencers, we HAVE to co-create tools to enable agency. **Don't build for us, build with us.**\n\n>> Mention Open Source Tools \n>> Mention $BOUNTY + PartyDAO (groups toward public goods)\n\nAs we set precedents for outsiders to respect the space, artists, creators, and curators, we must center them for the generations of cultural stewards that succeed us. I’m challenging all of us to start thinking about intentionality and being actively present in this moment. **Because when it’s gone, it’s gone.**\n\n\n---\n**Appendix:**\n\n**Accounting for the trading value of ETH at time of sale, not adjusted for current value.*\n\n** *This study is based on the sales collected from a pool of 40 black artists. The sales account for the highest historic USD value/ETH sale. There is a correlation of higher ETH = higher USD despite some outliers. This post and study will be updated as I collect more data.*\n\n\n**Additional References:**\n\nhttps://news.artnet.com/market/nft-revolution-four-factors-1950645\n\nhttps://techcrunch.com/2021/03/02/explosive-inclusive-potential-nfts/\n\n\n\n\n\n", "timestamp": 1621150785, "digest": "aY5NWo3tf__bWWvZ5slk61T2b6rgGDbXBRzjHSSw_O0", "contributor": "0xEB95ff72EAb9e8D8fdb545FE15587AcCF410b42E"}
{"id": "cnPr11vu7E4X_s_Lso0AAC9Gx-y5SIT3Vis9v2k0xuY", "title": "In Vitro Nostalgia: Minting Memories", "body": "### Non-Fungible Memory Tokens \n[NFMTs]\n\nMemories. What do they reveal about you? What do they remind you of? A forgotten time? The nostalgia of an experience since passed? \n\nAs combed through the various voice recordings on my iPhone, I found a selection of memories from a secret party in Ishikawa Prefecture, Japan that I attended. I didn't immediately think to make them into NFTs. It wasn't until I had gone through the motions on Zora that the audio looped over and over that it clicked. This was the perfect experiment in documenting, sharing, and collecting memories.\n\nWhat could I reveal to the listener? Could they learn about me? And because we had all been deprived of events, could these moments hold a deeper meaning to the fleeting nature of socialization? Did we take for granted the ever innocuous social gathering? I'm not entirely sure. But these are questions that have continued to come into view the longer I've sat with those voice notes.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/178)\n\n \n\nJust close your eyes, think of yourself either as the observer of the scene, or part of the scene, and let your mind paint the picture of the environment. Imagine where the DJ is, where the characters are, what type of house are you in? The first of three notes in this trilogy called ***[\"Shīkurettopātī: One Night In Kurosakimachi\"](https://zora.co/sirsu/178)***, it's very serendipitous that my phone picked up both a conversation I'm having about crate-digging at one of the only remaining Tower Record stores in the world AND some amazing house music. The instrumentation starts to swell with a soulful synth as the conversation reaches a euphoric note as we make the resolve to buy records and acknowledge how awesome the moment is.\n\nThe remaining two notes, ***[\"Not Now, But In The Future\"](https://zora.co/sirsu/189)*** and ***[\"Chinese Omelette OST\"](https://zora.co/sirsu/188)*** create this unintended effect of feeling like a short film + soundtrack with your own visual dreamscape constructing a memory that’s unique to you despite the fact that the audio is not your lived experience.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/189)\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/188)\n\n\n\n\n\n\n\n---\n\n### Spatial Conversations\n\nIn the context of memories, archived works in many ways achieve a similar effect of nostalgia. While they may not draw specifically from real life as a form of `reporting-lived-experience-as-documentation`, works that pull on the thread of life can be memory-inducing. For me, one of those works is a live recording in 2014 of a freeform DJ set with my uni-mates after a day of getting unbelievably stoned called \"SYNESTHESIA\". \n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/1643)\n\n\n\n\n---\n\nI'd be super curious to see what YOU see, more so than my own recollection of the space and the folks within it.\n\n\n\n//\n\nTweets to include\n\nhttps://twitter.com/Aidan_Wolf/status/1355397771076005889?s=20\n\nhttps://twitter.com/numomoart/status/1355563659385163776?s=20\n\nhttps://twitter.com/enaraxr/status/1355450773212172290?s=20", "timestamp": 1621154022, "digest": "kVKneiFoAnwbEVabds1Si7VqkeZPJbMXTDP31L34dKc", "contributor": "0xEB95ff72EAb9e8D8fdb545FE15587AcCF410b42E"}
{"id": "1dpctF4PaYe2IUO1eWG7SchJSHTtZbZhThO_itCNfpI", "title": "Gelato Interview by Bspeak! \n", "body": "*Gelato recently launched its v2.0 and announced the token $GEL. I've been watching the project since 2019 and thought would be a great infrastructure for smart contracts in general. This time, I had a chance to interview with the team. This was translated in Japanese and posted in my weekly newsletter [Bspeak!](https://bspeak.substack.com/). Anyway, enjoy the interview.*\n\n![](https://images.mirror-media.xyz/publication-images/5bf2da5f-33e9-4bac-a7a6-990e861ac28c.jpeg?height=560&width=990)\n　\n　\n\n***CoffeeTimes: Hello Gelato team🍦! Can you tell us what Gelato Network is in a nutshell?***\n\nGelato: [Gelato Network](https://www.gelato.network/) is an open marketplace to match developers’ demand for transaction automation with the supply of a decentralized network of bots. It empowers developers to build automated dapps and allows bot operators to earn revenue from running the infrastructure necessary for such automations. Further important members of Gelato’s ecosystem and community include the team that develops and distributes much of the technology needed for the marketplace. \n\nSoon, after Gelato’s native token - $GEL - will have been released, its holders will also play a crucial part in governing the network and shaping its success and path into the future.\n\n　\n　\n***CoffeeTimes: What made you start this project?***\nGelato: We started the project back in May 2019 after we received a grant from Gnosis Ecosystem Fund (GECO). \n\nref: [https://blog.gnosis.pm/gnosis-ecosystem-fund-update-ii-9bea803a97c8](https://blog.gnosis.pm/gnosis-ecosystem-fund-update-ii-9bea803a97c8?gi=84e40da1e1c9)\n\nInitially, we worked on automating certain aspects of Gnosis’s DutchX exchange back then. However, we quickly realized that the need for automating dapps is ubiquitous. Web2 users are completely accustomed to an automated User Experience thanks to centralized servers controlling a lot of your data. In Ethereum, and decentralized blockchains in general, this great user experience is very hard to replicate because here we explicitly do not want users to trade in custody over their data and funds to a centralized server for a better UX. This would sacrifice most of the benefits of the decentralized web. So in the summer of 2019 we set out to build a solution for developers and users alike that allows for a decentralized application layer with a slick automated user experience, without the need for users to give away control over their keys and funds - Gelato Network was born. \n\n\n![](https://images.mirror-media.xyz/publication-images/be0267e3-a57a-443e-a218-f7ad87d99454.jpeg?height=874&width=1310)\nLuis and Hilmar, 2021\n\n　\n　\n***CoffeeTimes: What is Sorbet Finance? Is it like a side project on top of Gelato?***\n\nGelato: Yes, [Sorbet Finance](https://www.sorbet.finance/) is its own project that makes use of the Gelato Network in its backend. In Sorbet’s case it uses the Gelato network to continually monitor prices on DEX and then execute a users’ limit orders once their specified desired price target is reached. All that is achieved while the users keep full control over their funds. Also Sorbet now features Dollar Cost Averaging, which allows users to automatically sell a portion of a token spread out in several chunks and time intervals, to decrease the slippage per trade. Cool features like Sorbet that use Gelato Network to automate some aspect of a dapp can be built by any developer. \n　\n　\n***CoffeeTimes: You have announced several collaborations. Can we expect any other collaborations in the close future?***\n\nGelato: Yes, for sure. We are in close talks with many of the famous and not-yet-famous projects out there on Ethereum, Polygon, BSC, and whatnot. Almost every DeFi developer needs automation and we’re here to help them get it. \n　\n　\n***CoffeeTimes: You recently have announced GEL tokens. What is the purpose of GEL tokens? If Executors bot act maliciously, it would lead to a crucial problem (front running or just harming dapp users). Does GEL token slashing prevent it enough?***\n\nGelato: $GEL tokens will be used to 1) incentivise, govern, and police network participants and 2) allocate network resources efficiently. \n\nBots who want to earn a revenue from providing their infrastructure services to the Gelato network will have to stake a lot of $GEL tokens to attain and retain this privilege. This will open the door for more complex use cases to be built on top of Gelato, which might require an element of trust into the bots that will execute their automations. For such use cases having the bots put up a bonded stake, which can be slashed if they act maliciously, is essential. However, it’s worth mentioning that there are also many use cases which can be implemented so that they are trustless by default and thus do not have to rely on such a staking and slashing mechanism. Furthermore, the $GEL token will also be used to positively incentivize all network participants, developers, bots, and users alike that bring traffic to the network. \n\nOne other major use of $GEL is to efficiently allocate network infrastructure resources to dapps and users that demand them. Ethereum and other chains usually are constrained resource environments. There are only so many transactions that can fit into a block. Therefore, in order to scale a decentralized network like Gelato, decisions regarding the timing priority of transactions will have to be made by dapp developers and ultimately the bots that send them to the network. To gain priority in this technological resource allocation mechanism, developers and end users will have the ability to also lock up $GEL to assign different weights to their transactions. As a result, bots are incentivized to allocate more resources to such staked dapps or users, who, like them, are also long $GEL via their boned stakes.\n　\n　\n***CoffeeTimes: About token distribution, how would you plan on it?***\nGelato: At the moment we cannot share details with the public yet other than that we plan to do a public sale for $GEL tokens early this summer. Stay tuned, we will announce more details soon on our Medium and Twitter accounts.\n　\n　\n***CoffeeTimes: Okay further question about GEL, allocation/tokenomics are already fixed?***\n\nGelato: We will announce more details about token allocation and tokenomics in an upcoming article. Right now this information is not yet public. \n　\n　\n***CoffeeTimes: How would the GelatoDAO become sustainable? I assume the protocol would take a fee based on transactions but can you elaborate the model?***\n\nGelato: The GelatoDAO will be governed by people that have a vested interest in governing and maintaining the Gelato Network. For example, dapp developers that make extensive use of Gelato for their automation needs are strongly incentivized to participate in important decision-making around things like what features should be prioritised by Gelato’s core team in upcoming releases, what fees bots can charge, and whether certain bots should be slashed and kicked from the network, if they misbehave. Therefore, there is an organic tendency for many network participants to participate in the DAO to steadily improve the welfare of the network purely out of rational self-interest. In the future, the DAO could also retain a small network fee, but since its membership will likely largely consist of network participants the ultimate fee payers will have significant control over this decision themselves.\n　\n　\n***CoffeeTimes: Gelato seems to have a great connection with Gnosis and other DAOs (TheLAO / MetaCartel Ventures), how did you start and deepen these relationships with them?***\n\nGelato: We partnered with MetaCartel early on in late 2019 when we applied for a grant from them and made it into their 3rd cohort.\n\nref: [https://medium.com/metacartel/metacartel-cohort-1-6336cdca05db](https://medium.com/metacartel/metacartel-cohort-1-6336cdca05db)\n\nEven though Peter Pan sat next to us in Berlin’s crypto co-working space Full Node from the start, we eventually really got to know him online. He was super helpful and interested in Gelato and really also helped us with closing our Seed Funding in late summer 2020. The LAO was also part of our Seed Round and we are in frequent contact with both members of the LAO, like Aaron and Pri, and members of MetaCartel, like Peter and Victor. They usually help us greatly with legal, strategic, or community-related questions. Being active in DAOs and just talking to their members is definitely a good thing every crypto entrepreneur should.\n　\n　\n***CoffeeTimes: Please tell us briefly about your future plans in the coming few months!***\n\nGelato: Uh boi, there is a lot to unpack here but let us be crisp. For this summer the plan is to: \n- ship, ship, ship: new automated features on Ethereum, Polygon, BSC, and Fantom. We want Sorbet’s limit orders to be on every AMM and we want more and more protocols to integrate Gelato for liquidation protection and automated transfers, withdraws, deposits and so on. \n- launch $GEL \n- launch the Gelato DAO and start involving $GEL holders in decision-making around which features to prioritise \n- Developer mining programs with $GEL to get more developers to build on Gelato \n\nDefinitely join our Telegram or Discord communities to stay up to date. I am sure there will be feature releases for you or as a developer you have the opportunity to participate in our developer mining program, which we will launch after the $GEL token sale. \n\n![](https://images.mirror-media.xyz/publication-images/5e66c1b3-7d34-441b-ae17-7c7cb98e5f3d.jpeg?height=594&width=623)\n\n\nRoadmap：[WhitePaper v1.0](https://aristaticfiles.s3.amazonaws.com/Gelato+Whitepaper+V1.0,+May+2021+(02).pdf)\n　\n　\n***CoffeeTimes: Can you give any words to the Japanese audience? Do you have any impressions on Japanese crypto scene? I think I saw a photo somewhere of when the team came to Tokyo***\n\nGelato: Gelato had a strong Japanese community right from the start. We are super thankful for that and we definitely want to connect more with them. If any Japanese developers want to automate smart contracts, please don’t hesitate to reach out. Unfortunately, we have not been to Tokyo yet. However, after COVID settles down we will definitely go. \n\nOur team is very multinational, we have members from Switzerland, US, Germany, France, China, Australia, and Egypt. However, we don’t have a Japanese team member yet. We are currently actively looking for frontend and backend developers with web3 experience, so if anybody in our Japanese community wants a job with us please apply here: https://angel.co/company/gelato-network! \n　\n　\n***(CoffeeTimes: By the way, why is the name Gelato? The bottom half of the logo also looks like Ethereum🍦)***\nGelato: Because everybody loves Gelato! \n　\n　\n***CoffeeTimes: Thank you for taking your time! Where can we learn more about Gelato?***\n\nGelato: \n🐦 [Twitter](https://twitter.com/gelatonetwork) | 💬 [Telegram](https://t.me/joinchat/HcTaOxJ0_FjU-r34vbvK8A) | 📺 [Discord](https://t.co/SY3zIfyalk?amp=1)\n🍦hi@gelato.digital\n🍦http://gelato.network/\n🍦[Gelato Whitepaper v1.0](https://bit.ly/3y8ccnw\n)\n\n\n\n", "timestamp": 1621171585, "digest": "krM9_r-1fGjtLWXt0uTQipnwQZHvu-k2Eq9xrXr_pP4", "contributor": "0x7853Eabb6cFa980eBfD27e3F77e69590EA53c0b7"}
{"id": "m-B4dtT9dCKg9YcOP0mmZYZ3quwyNE0XZdzDWcovwX0", "title": "Economics is Camp", "body": "The purpose of this essay is to identify a camp basis for economic theory—not to *reformulate* economics as camp, but to establish an understanding of economics that acknowledges that it's inherently campy. I come to understand economic theory and camp sensibility more holistically by examining their interaction. I seek to understand not only how economics can be understood as camp, but to understand what it means for something to be camp and how camp sensibility can be useful.\n\nI begin with a theory of camp: camp sensibility is ill-defined by language alone and relies on a primarily working (rather than definitional) knowledge of queer sociability and its humors. It is a sensibility and an aesthetic that is frivolously audacious and necessarily impertinent: it's a regurgitation of banalities that are performed with such exaggeration that they find value not in their content but in their drama. \n\nCamp behavior often reformulates mundanity and presents it as remarkable—it hyperbolizes the status quo until it seems subversive, innovative, or revolutionary. The camp aesthetic operates within a tension between the familiar and the alien: it renders unusual behaviors and methodologies navigable by applying them to familiar and accessible plots or concepts. In short, it takes something that seems natural and presents it in its most fabricated and unnatural form. To do something campy involves misunderstanding and overestimating the importance and seriousness of what you're doing.\n\nEconomics aims to focuses on human behavior and its repercussions as defined by economic assumptions. That is, it takes something that's intimately familiar—human behavior—and communicates it in a reduced form, focusing on and exaggerating certain tendencies such as self-interest. In true camp fashion, oversimplification actually leads to obfuscation and misunderstanding: the basis for the campiness of economic theory is its ignorance of nuance and its mathematically ostentatious presentation.\n\nAll it takes is a quick perusal of an introductory economics textbook or a few clicks on the Wikipedia page on microeconomics to understand the ostentatiousness of economic theory. In order to understand how mathematical representation in economics is camp, let's examine a simple and foundational concept in economics: preference theory. Take a look at this excerpt from [*Introduction to Choice Theory* by Levin and Milgrom:](https://web.stanford.edu/~jdlevin/Econ%20202/Choice%20Theory.pdf)\n\n![](https://images.mirror-media.xyz/publication-images/494f9b24-25aa-4818-961c-84c6d85340f7.png?height=998&width=1166)\n\nThe general concept being communicated by this proof is rather simple: if someone is evaluating a set of goods and is able to rank them all and then makes all good-selecting choices in accordance with their ranking, then their decision-making process can never be arbitrary. This is painfully obvious when stated in plain language, but hard for the average person to understand when stated as a mathematical proof. The issue at hand is not whether the proof is useful (for the record, I think it is), but whether it's camp. The primarily litmus test for understanding whether something is camp is to consider whether it's \"too much.\" For most of us, that proof is too much.\n\nRemember that a central tenet of camp is the reformulation of the mundane as remarkable. Here, the mathematical rigor employed in economics does exactly that: it takes a very obvious repercussion of a few assumptions about how people make choices and renders it inaccessible but notationally beautiful. The fixation of the economic thought here is not *what's* being said but *how* it's said. In [Susan Sontag's *Notes on Camp*](https://monoskop.org/images/5/59/Sontag_Susan_1964_Notes_on_Camp.pdf), she notes the following: \"[Camp] is the love of the exaggerated, the \"off,\" of things-being-what-they-are-not.\" It's difficult—perhaps impossible—to take that reading of camp, review the proof displayed above, and not conclude that it at very least conforms to her idea. The proof leads us to question the relationship between human behavior as we experience it and human behavior as it's presented by economics. Something about the assertion that all those symbols can tell us something about human behavior seems \"off.\"\n\nWhether ideas are afforded legitimacy and respect in the field of economics often relies on proofs like the one above. That is, economics not only sometimes embraces a camp aesthetic but actually *demands* it and delights in it. Camp is primarily a mode communication rather than a set of ideas, just as economics is primarily a methodology rather than a body of knowledge. The project of social sciences as a whole is roughly to understand humanity from a divorced, analytical perspective: to examine it rather than experience it. Economics—more than other fields—divorces itself from reality through the use of a mathematical language that is presented rather obnoxiously and struggles to capture nuance. As economics grows, it relies on its previous simplifications and exaggerates them, continuously campifying itself.\n\nThe most satisfyingly campy aspect of economics is its naivety. As economics continues to hyperbolize human behavior, it generally maintains that its project is important and serious. Economists won't tell you that economics assumptions and their repercussions are true, but they often underestimate how the ostentatiousness of their discipline impacts the way it's understood. The purpose of identifying the campiness of economic theory is not to criticize it or claim that it's wholly wrong—it's to properly qualify it. The campiness of economics is useful when it's understood: just as we don't make political decisions based solely or even primarily on a cabaret performance, it's nonsensical to assume the findings of economic theory and its ideological brethren are unquestionably true or even useful.\n\nIf we believe that economics demands mathematically campy aesthetics and finds value in its mathematical rigor, then perhaps we can identify how exactly camp is useful. To analyze and acknowledge camp is, to some extent, a betrayal of its nature as a purely aesthetic and artistic mode. Importantly, any application of camp aesthetics that *aims* to be politically or ideologically useful or enlightening is probably not truly camp. Economic theory (and perhaps just theory in general) is sort of an exploration of the question \"What would happen if we made a few basic assumptions and then *really* doubled down on them?\" More importantly, to those who are critical of its assumptions, it provides an opportunity to ask \"What can we learn about ourselves and about the world by purposely being a little bit ridiculous?\"\n\nIn many ways, academia is the project of going down a rabbit-hole and being a little ridiculous and obsessive. It's doing something truly arcane but not exactly understanding or acknowledging how divorced from reality it is. The fact that economics can be regarded as camp illuminates that purportedly unartistic or scientific endeavors have something to gain by taking themselves less seriously (or perhaps taking themselves seriously in a different way) and examining themselves as art. It also demonstrates that the realm of aesthetics and sensibility can be applied and made useful in seemingly unnatural or foreign spaces. Camp is largely understood as something that can be performed, and considering economics as a sort of communicative performance affords us a new perspective on how economics operates.\n\nThe classification of economics as camp demonstrates that the interpretive generosity of artists and culturists can be a powerful aid in coming to a holistic understanding of our world. To label something as camp is not intentionally antagonistic, but sympathetic and appreciative. It locates entertainment and humor where a more analytical approach may find only tragedy. Camp invites rather than condemns—appreciates rather than mocks. Camp sensibility finds value in the project of economics, but not the same value that economists might find. \n\nFor me, employing a camp sensibility to my understanding of economics allowed me to reformulate a harsh critique of economic theory and reveal intuitions about why I hold a deep appreciation for economics despite my criticisms. To adopt camp sensibility is to be empathetic and generous. Camp reinterprets cheesiness and misunderstanding as positive by divorcing them from judgement and evaluation and acknowledging an aesthetic appreciation from them. In that sense, coming to an understanding of economics as camp has laid the foundation for me to queer economics—to meet it where it is and to realize that even as criticize economics, I can always appreciate its art.\n\n\n*quasimatt is an anti-intellectual. [Connect with him on Twitter.](https://twitter.com/quasimatt)*", "timestamp": 1621173712, "digest": "4g_bByFwGTb4duNobyIKRFkuf1Zin7FXegFsBzJ85oI", "contributor": "0x64298A72F4E3e23387EFc409fc424a3f17356fC4"}
{"id": "OYAskvCUQyx7xZSOwxJvwVkaI0avleMjUJmTESjtUeA", "title": "Economics is Camp", "body": "The purpose of this essay is to identify a camp basis for economic theory—not to *reformulate* economics as camp, but to establish an understanding of economics that acknowledges that it's inherently campy. I come to understand economic theory and camp sensibility more holistically by examining their interaction. I seek to understand not only how economics can be understood as camp, but to reveal what it means for something to be camp and how camp sensibility can be useful.\n\nI begin with a theory of camp: camp sensibility is ill-defined by language alone and relies on a primarily working (rather than definitional) knowledge of queer sociability and its humors. It is a sensibility and an aesthetic that is frivolously audacious and necessarily impertinent: it's a regurgitation of banalities that are performed with such exaggeration that they find value not in their content but in their drama. \n\nCamp behavior often reformulates mundanity and presents it as remarkable—it hyperbolizes the status quo until it seems subversive, innovative, or revolutionary. The camp aesthetic operates within a tension between the familiar and the alien: it renders unusual behaviors and methodologies navigable by applying them to familiar and accessible plots or concepts. In short, it takes something that seems natural and presents it in its most fabricated and unnatural form. To do something campy involves misunderstanding and overestimating the importance and seriousness of what you're doing.\n\nEconomics aims to focuses on human behavior and its repercussions as defined by economic assumptions. That is, it takes something that's intimately familiar—human behavior—and communicates it in a reduced form, focusing on and exaggerating certain tendencies such as self-interest. In true camp fashion, oversimplification actually leads to obfuscation and misunderstanding: the basis for the campiness of economic theory is its ignorance of nuance and its mathematically ostentatious presentation.\n\nAll it takes is a quick perusal of an introductory economics textbook or a few clicks on the Wikipedia page on microeconomics to understand the ostentatiousness of economic theory. In order to understand how mathematical representation in economics is camp, let's examine a simple and foundational concept in economics: preference theory. Take a look at this excerpt from [*Introduction to Choice Theory* by Levin and Milgrom:](https://web.stanford.edu/~jdlevin/Econ%20202/Choice%20Theory.pdf)\n\n![](https://images.mirror-media.xyz/publication-images/494f9b24-25aa-4818-961c-84c6d85340f7.png?height=998&width=1166)\n\nThe general concept being communicated by this proof is rather simple: if someone is evaluating a set of goods and is able to rank them all and then makes all good-selecting choices in accordance with their ranking, then their decision-making process can never be arbitrary. This is painfully obvious when stated in plain language, but hard for the average person to understand when stated as a mathematical proof. The issue at hand is not whether the proof is useful (for the record, I think it is), but whether it's camp. The primarily litmus test for understanding whether something is camp is to consider whether it's \"too much.\" For most of us, that proof is too much.\n\nRemember that a central tenet of camp is the reformulation of the mundane as remarkable. Here, the mathematical rigor employed in economics does exactly that: it takes a very obvious repercussion of a few assumptions about how people make choices and renders it inaccessible but notationally beautiful. The fixation of the economic thought here is not *what's* being said but *how* it's said. In [Susan Sontag's *Notes on Camp*](https://monoskop.org/images/5/59/Sontag_Susan_1964_Notes_on_Camp.pdf), she notes the following: \"[Camp] is the love of the exaggerated, the \"off,\" of things-being-what-they-are-not.\" It's difficult—perhaps impossible—to take that reading of camp, review the proof displayed above, and not conclude that it at very least conforms to her idea. The proof leads us to question the relationship between human behavior as we experience it and human behavior as it's presented by economics. Something about the assertion that all those symbols can tell us something about human behavior seems \"off.\"\n\nWhether ideas are afforded legitimacy and respect in the field of economics often relies on proofs like the one above. That is, economics not only sometimes embraces a camp aesthetic but actually *demands* it and delights in it. Camp is primarily a mode communication rather than a set of ideas, just as economics is primarily a methodology rather than a body of knowledge. The project of social sciences as a whole is roughly to understand humanity from a divorced, analytical perspective: to examine it rather than experience it. Economics—more than other fields—divorces itself from reality through the use of a mathematical language that is presented rather obnoxiously and struggles to capture nuance. As economics grows, it relies on its previous simplifications and exaggerates them, continuously campifying itself.\n\nThe most satisfyingly campy aspect of economics is its naivety. As economics continues to hyperbolize human behavior, it generally maintains that its project is important and serious. Economists won't tell you that economics assumptions and their repercussions are true, but they often underestimate how the ostentatiousness of their discipline impacts the way it's understood. The purpose of identifying the campiness of economic theory is not to criticize it or claim that it's wholly wrong—it's to properly qualify it. The campiness of economics is useful when it's understood: just as we don't make political decisions based solely or even primarily on a cabaret performance, it's nonsensical to assume the findings of economic theory and its ideological brethren are unquestionably true or even useful.\n\nIf we believe that economics demands mathematically campy aesthetics and finds value in its mathematical rigor, then perhaps we can identify how exactly camp is useful. To analyze and acknowledge camp is, to some extent, a betrayal of its nature as a purely aesthetic and artistic mode. Importantly, any application of camp aesthetics that *aims* to be politically or ideologically useful or enlightening is probably not truly camp. Economic theory (and perhaps just theory in general) is sort of an exploration of the question \"What would happen if we made a few basic assumptions and then *really* doubled down on them?\" More importantly, to those who are critical of its assumptions, it provides an opportunity to ask \"What can we learn about ourselves and about the world by purposely being a little bit ridiculous?\"\n\nIn many ways, academia is the project of going down a rabbit-hole and being a little ridiculous and obsessive. It's doing something truly arcane but not exactly understanding or acknowledging how divorced from reality it is. The fact that economics can be regarded as camp illuminates that purportedly unartistic or scientific endeavors have something to gain by taking themselves less seriously (or perhaps taking themselves seriously in a different way) and examining themselves as art. It also demonstrates that the realm of aesthetics and sensibility can be applied and made useful in seemingly unnatural or foreign spaces. Camp is largely understood as something that can be performed, and considering economics as a sort of communicative performance affords us a new perspective on how economics operates.\n\nThe classification of economics as camp demonstrates that the interpretive generosity of artists and culturists can be a powerful aid in coming to a holistic understanding of our world. To label something as camp is not intentionally antagonistic, but sympathetic and appreciative. It locates entertainment and humor where a more analytical approach may find only tragedy. Camp invites rather than condemns—appreciates rather than mocks. Camp sensibility finds value in the project of economics, but not the same value that economists might find. \n\nFor me, employing a camp sensibility to my understanding of economics allowed me to reformulate a harsh critique of economic theory and reveal intuitions about why I hold a deep appreciation for economics despite my criticisms. To adopt camp sensibility is to be empathetic and generous. Camp reinterprets cheesiness and misunderstanding as positive by divorcing them from judgement and evaluation and acknowledging an aesthetic appreciation from them. In that sense, coming to an understanding of economics as camp has laid the foundation for me to queer economics—to meet it where it is and to realize that even as criticize economics, I can always appreciate its art.\n\n\n*quasimatt is an anti-intellectual. [Connect with him on Twitter.](https://twitter.com/quasimatt)*", "timestamp": 1621174159, "digest": "4g_bByFwGTb4duNobyIKRFkuf1Zin7FXegFsBzJ85oI", "contributor": "0x64298A72F4E3e23387EFc409fc424a3f17356fC4"}
{"id": "Y6MCx9kumZd-yqWehGKQH7qJ-j4RqEgZ_nneIX68fZg", "title": "Economics is Camp", "body": "The purpose of this essay is to identify a camp basis for economic theory—not to *reformulate* economics as camp, but to establish an understanding of economics that acknowledges that it's inherently campy. I come to understand economic theory and camp sensibility more holistically by examining their interaction. I seek to understand not only how economics can be understood as camp, but to reveal what it means for something to be camp and how camp sensibility can be useful.\n\nI begin with a theory of camp: camp sensibility is ill-defined by language alone and relies on a primarily working (rather than definitional) knowledge of queer sociability and its humors. It is a sensibility and an aesthetic that is frivolously audacious and necessarily impertinent: it's a regurgitation of banalities that are performed with such exaggeration that they find value not in their content but in their drama. \n\nCamp behavior often reformulates mundanity and presents it as remarkable—it hyperbolizes the status quo until it seems subversive, innovative, or revolutionary. The camp aesthetic operates within a tension between the familiar and the alien: it renders unusual behaviors and methodologies navigable by applying them to familiar and accessible plots or concepts. In short, it takes something that seems natural and presents it in its most fabricated and unnatural form. To do something campy involves misunderstanding and overestimating the importance and seriousness of what you're doing.\n\nEconomics aims to focuses on human behavior and its repercussions as defined by economic assumptions. That is, it takes something that's intimately familiar—human behavior—and communicates it in a reduced form, focusing on and exaggerating certain tendencies such as self-interest. In true camp fashion, oversimplification actually leads to obfuscation and misunderstanding: the basis for the campiness of economic theory is its ignorance of nuance and its mathematically ostentatious presentation.\n\nAll it takes is a quick perusal of an introductory economics textbook or a few clicks on the Wikipedia page on microeconomics to understand the ostentatiousness of economic theory. In order to understand how mathematical representation in economics is camp, let's examine a simple and foundational concept in economics: preference theory. Take a look at this excerpt from [*Introduction to Choice Theory* by Levin and Milgrom:](https://web.stanford.edu/~jdlevin/Econ%20202/Choice%20Theory.pdf)\n\n![](https://images.mirror-media.xyz/publication-images/494f9b24-25aa-4818-961c-84c6d85340f7.png?height=998&width=1166)\n\nThe general concept being communicated by this proof is rather simple: if someone is evaluating a set of goods and is able to rank them all and then makes all good-selecting choices in accordance with their ranking, then their decision-making process can never be arbitrary. This is painfully obvious when stated in plain language, but hard for the average person to understand when stated as a mathematical proof. The issue at hand is not whether the proof is useful (for the record, I think it is), but whether it's camp. The primarily litmus test for understanding whether something is camp is to consider whether it's \"too much.\" For most of us, that proof is too much.\n\nRemember that a central tenet of camp is the reformulation of the mundane as remarkable. Here, the mathematical rigor employed in economics does exactly that: it takes a very obvious repercussion of a few assumptions about how people make choices and renders it inaccessible but notationally beautiful. The fixation of the economic thought here is not *what's* being said but *how* it's said. In [Susan Sontag's *Notes on Camp*](https://monoskop.org/images/5/59/Sontag_Susan_1964_Notes_on_Camp.pdf), she notes the following: \"[Camp] is the love of the exaggerated, the \"off,\" of things-being-what-they-are-not.\" It's difficult—perhaps impossible—to take that reading of camp, review the proof displayed above, and not conclude that it at very least conforms to her idea. The proof leads us to question the relationship between human behavior as we experience it and human behavior as it's presented by economics. Something about the assertion that all those symbols can tell us something about human behavior seems \"off.\"\n\nWhether ideas are afforded legitimacy and respect in the field of economics often relies on proofs like the one above. That is, economics not only sometimes embraces a camp aesthetic but actually *demands* it and delights in it. Camp is primarily a mode communication rather than a set of ideas, just as economics is primarily a methodology rather than a body of knowledge. The project of social sciences as a whole is roughly to understand humanity from a divorced, analytical perspective: to examine it rather than experience it. Economics—more than other fields—divorces itself from reality through the use of a mathematical language that is presented rather obnoxiously and struggles to capture nuance. As economics grows, it relies on its previous simplifications and exaggerates them, continuously campifying itself.\n\nThe most satisfyingly campy aspect of economics is its naivety. As economics continues to hyperbolize human behavior, it generally maintains that its project is important and serious. Economists won't tell you that economics assumptions and their repercussions are true, but they often underestimate how the ostentatiousness of their discipline impacts the way it's understood. The purpose of identifying the campiness of economic theory is not to criticize it or claim that it's wholly wrong—it's to properly qualify it. The campiness of economics is useful when it's understood: just as we don't make political decisions based solely or even primarily on a cabaret performance, it's nonsensical to assume the findings of economic theory and its ideological brethren are unquestionably true or even useful.\n\nIf we believe that economics demands mathematically campy aesthetics and finds value in its mathematical rigor, then perhaps we can identify how exactly camp is useful. To analyze and acknowledge camp is, to some extent, a betrayal of its nature as a purely aesthetic and artistic mode. Importantly, any application of camp aesthetics that *aims* to be politically or ideologically useful or enlightening is probably not truly camp. Economic theory (and perhaps just theory in general) is sort of an exploration of the question \"What would happen if we made a few basic assumptions and then *really* doubled down on them?\" More importantly, to those who are critical of its assumptions, it provides an opportunity to ask \"What can we learn about ourselves and about the world by purposely being a little bit ridiculous?\"\n\nIn many ways, academia is the project of going down a rabbit-hole and being a little ridiculous and obsessive. It's doing something truly arcane but not exactly understanding or acknowledging how divorced from reality it is. The fact that economics can be regarded as camp illuminates that purportedly unartistic or scientific endeavors have something to gain by taking themselves less seriously (or perhaps taking themselves seriously in a different way) and examining themselves as art. It also demonstrates that the realm of aesthetics and sensibility can be applied and made useful in seemingly unnatural or foreign spaces. Camp is largely understood as something that can be performed, and considering economics as a sort of communicative performance affords us a new perspective on how economics operates.\n\nThe classification of economics as camp demonstrates that the interpretive generosity of artists and culturists can be a powerful aid in coming to a holistic understanding of our world. To label something as camp is not intentionally antagonistic, but sympathetic and appreciative. It locates entertainment and humor where a more analytical approach may find only tragedy. Camp invites rather than condemns—appreciates rather than mocks. Camp sensibility finds value in the project of economics, but not the same value that economists might find. \n\nFor me, employing a camp sensibility to my understanding of economics allowed me to reformulate a harsh critique of economic theory and reveal intuitions about why I hold a deep appreciation for economics despite my criticisms. To adopt camp sensibility is to be empathetic and generous. Camp reinterprets cheesiness and misunderstanding as positive by divorcing them from judgement and evaluation and acknowledging an aesthetic appreciation of them. In that sense, coming to an understanding of economics as camp has laid the foundation for me to queer economics—to meet it where it is and to realize that even as criticize economics, I can always appreciate its art.\n\n\n*quasimatt is an anti-intellectual. [Connect with him on Twitter.](https://twitter.com/quasimatt)*", "timestamp": 1621174749, "digest": "4g_bByFwGTb4duNobyIKRFkuf1Zin7FXegFsBzJ85oI", "contributor": "0x64298A72F4E3e23387EFc409fc424a3f17356fC4"}
{"id": "Rf0NtoDqSWSoIFXgRDjoGnph1bqBF_JSAr9f9Iv25vo", "title": "Economics is Camp", "body": "The purpose of this essay is to identify a camp basis for economic theory—not to *reformulate* economics as camp, but to establish an understanding of economics that acknowledges that it's inherently campy. I come to understand economic theory and camp sensibility more holistically by examining their interaction. I seek to understand not only how economics can be understood as camp, but to reveal what it means for something to be camp and how camp sensibility can be useful.\n\nI begin with a theory of camp: camp sensibility is ill-defined by language alone and relies on a primarily working (rather than definitional) knowledge of queer sociability and its humors. It is a sensibility and an aesthetic that is frivolously audacious and necessarily impertinent: it's a regurgitation of banalities that are performed with such exaggeration that they find value not in their content but in their drama. \n\nCamp behavior often reformulates mundanity and presents it as remarkable—it hyperbolizes the status quo until it seems subversive, innovative, or revolutionary. The camp aesthetic operates within a tension between the familiar and the alien: it renders unusual behaviors and methodologies navigable by applying them to familiar and accessible plots or concepts. In short, it takes something that seems natural and presents it in its most fabricated and unnatural form. To do something campy involves misunderstanding and overestimating the importance and seriousness of what you're doing.\n\nEconomics aims to focuses on human behavior and its repercussions as defined by economic assumptions. That is, it takes something that's intimately familiar—human behavior—and communicates it in a reduced form, focusing on and exaggerating certain tendencies such as self-interest. In true camp fashion, oversimplification actually leads to obfuscation and misunderstanding: the basis for the campiness of economic theory is its ignorance of nuance and its mathematically ostentatious presentation.\n\nAll it takes is a quick perusal of an introductory economics textbook or a few clicks on the Wikipedia page on microeconomics to understand the ostentatiousness of economic theory. In order to understand how mathematical representation in economics is camp, let's examine a simple and foundational concept in economics: preference theory. Take a look at this excerpt from [*Introduction to Choice Theory* by Levin and Milgrom:](https://web.stanford.edu/~jdlevin/Econ%20202/Choice%20Theory.pdf)\n\n![](https://images.mirror-media.xyz/publication-images/494f9b24-25aa-4818-961c-84c6d85340f7.png?height=998&width=1166)\n\nThe general concept being communicated by this proof is rather simple: if someone is evaluating a set of goods and is able to rank them all and then makes all good-selecting choices in accordance with their ranking, then their decision-making process can never be arbitrary. This is painfully obvious when stated in plain language, but hard for the average person to understand when stated as a mathematical proof. The issue at hand is not whether the proof is useful (for the record, I think it is), but whether it's camp. The primarily litmus test for understanding whether something is camp is to consider whether it's \"too much.\" For most of us, that proof is too much.\n\nRemember that a central tenet of camp is the reformulation of the mundane as remarkable. Here, the mathematical rigor employed in economics does exactly that: it takes a very obvious repercussion of a few assumptions about how people make choices and renders it inaccessible but notationally beautiful. The fixation of the economic thought here is not *what's* being said but *how* it's said. In [Susan Sontag's *Notes on Camp*](https://monoskop.org/images/5/59/Sontag_Susan_1964_Notes_on_Camp.pdf), she notes the following: \"[Camp] is the love of the exaggerated, the \"off,\" of things-being-what-they-are-not.\" It's difficult—perhaps impossible—to take that reading of camp, review the proof displayed above, and not conclude that it at very least conforms to her idea. The proof leads us to question the relationship between human behavior as we experience it and human behavior as it's presented by economics. Something about the assertion that all those symbols can tell us something about human behavior seems \"off.\"\n\nWhether ideas are afforded legitimacy and respect in the field of economics often relies on proofs like the one above. That is, economics not only sometimes embraces a camp aesthetic but actually *demands* it and delights in it. Camp is primarily a mode communication rather than a set of ideas, just as economics is primarily a methodology rather than a body of knowledge. The project of social sciences as a whole is roughly to understand humanity from a divorced, analytical perspective: to examine it rather than experience it. Economics—more than other fields—divorces itself from reality through the use of a mathematical language that is presented rather obnoxiously and struggles to capture nuance. As economics grows, it relies on its previous simplifications and exaggerates them, continuously campifying itself.\n\nThe most satisfyingly campy aspect of economics is its naivety. As economics continues to hyperbolize human behavior, it generally maintains that its project is important and serious. Economists won't tell you that economics assumptions and their repercussions are true, but they often underestimate how the ostentatiousness of their discipline impacts the way it's understood. The purpose of identifying the campiness of economic theory is not to criticize it or claim that it's wholly wrong—it's to properly qualify it. The campiness of economics is useful when it's understood: just as we don't make political decisions based solely or even primarily on a cabaret performance, it's nonsensical to assume the findings of economic theory and its ideological brethren are unquestionably true or even useful.\n\nIf we believe that economics demands mathematically campy aesthetics and finds value in its mathematical rigor, then perhaps we can identify how exactly camp is useful. To analyze and acknowledge camp is, to some extent, a betrayal of its nature as a purely aesthetic and artistic mode. Importantly, any application of camp aesthetics that *aims* to be politically or ideologically useful or enlightening is probably not truly camp. Economic theory (and perhaps just theory in general) is sort of an exploration of the question \"What would happen if we made a few basic assumptions and then *really* doubled down on them?\" More importantly, to those who are critical of its assumptions, it provides an opportunity to ask \"What can we learn about ourselves and about the world by purposely being a little bit ridiculous?\"\n\nIn many ways, academia is the project of going down a rabbit-hole and being a little ridiculous and obsessive. It's doing something truly arcane but not exactly understanding or acknowledging how divorced from reality it is. The fact that economics can be regarded as camp illuminates that purportedly unartistic or scientific endeavors have something to gain by taking themselves less seriously (or perhaps taking themselves seriously in a different way) and examining themselves as art. It also demonstrates that the realm of aesthetics and sensibility can be applied and made useful in seemingly unnatural or foreign spaces. Camp is largely understood as something that can be performed, and considering economics as a sort of communicative performance affords us a new perspective on how economics operates.\n\nThe classification of economics as camp demonstrates that the interpretive generosity of artists and culturists can be a powerful aid in coming to a holistic understanding of our world. To label something as camp is not intentionally antagonistic, but sympathetic and appreciative. It locates entertainment and humor where a more analytical approach may find only tragedy. Camp invites rather than condemns—appreciates rather than mocks. Camp sensibility finds value in the project of economics, but not the same value that economists might find. \n\nFor me, employing a camp sensibility to my understanding of economics allowed me to reformulate a harsh critique of economic theory and reveal intuitions about why I hold a deep appreciation for economics despite my criticisms. To adopt camp sensibility is to be empathetic and generous. Camp reinterprets cheesiness and misunderstanding as positive by divorcing them from judgement and evaluation and acknowledging an aesthetic appreciation of them. In that sense, coming to an understanding of economics as camp has laid the foundation for me to queer economics—to meet it where it is and to realize that even as I criticize economics, I can always appreciate its art.\n\n\n*quasimatt is an anti-intellectual. [Connect with him on Twitter.](https://twitter.com/quasimatt)*", "timestamp": 1621175293, "digest": "4g_bByFwGTb4duNobyIKRFkuf1Zin7FXegFsBzJ85oI", "contributor": "0x64298A72F4E3e23387EFc409fc424a3f17356fC4"}
{"id": "4YHsqqffobS7FhEpx_8WYpMx66c8IvfsnaQjZOKjZ6Y", "title": "Economics is Camp", "body": "The purpose of this essay is to identify a camp basis for economic theory—not to *reformulate* economics as camp, but to establish an understanding of economics that acknowledges that it's inherently campy. I come to understand economic theory and camp sensibility more holistically by examining their interaction. I seek to understand not only how economics can be understood as camp, but to reveal what it means for something to be camp and how camp sensibility can be useful.\n\nI begin with a theory of camp: camp sensibility is ill-defined by language alone and relies on a primarily working (rather than definitional) knowledge of queer sociability and its humors. It is a sensibility and an aesthetic that is frivolously audacious and necessarily impertinent: it's a regurgitation of banalities that are performed with such exaggeration that they find value not in their content but in their drama. \n\nCamp behavior often reformulates mundanity and presents it as remarkable—it hyperbolizes the status quo until it seems subversive, innovative, or revolutionary. The camp aesthetic operates within a tension between the familiar and the alien: it renders unusual behaviors and methodologies navigable by applying them to familiar and accessible plots or concepts. In short, it takes something that seems natural and presents it in its most fabricated and unnatural form. To do something campy involves misunderstanding and overestimating the importance and seriousness of what you're doing.\n\nEconomics aims to focuses on human behavior and its repercussions as defined by economic assumptions. That is, it takes something that's intimately familiar—human behavior—and communicates it in a reduced form, focusing on and exaggerating certain tendencies such as self-interest. In true camp fashion, oversimplification actually leads to obfuscation and misunderstanding: the basis for the campiness of economic theory is its ignorance of nuance and its mathematically ostentatious presentation.\n\nAll it takes is a quick perusal of an introductory economics textbook or a few clicks on the Wikipedia page on microeconomics to understand the ostentatiousness of economic theory. In order to understand how mathematical representation in economics is camp, let's examine a simple and foundational concept in economics: preference theory. Take a look at this excerpt from [*Introduction to Choice Theory* by Levin and Milgrom:](https://web.stanford.edu/~jdlevin/Econ%20202/Choice%20Theory.pdf)\n\n![](https://images.mirror-media.xyz/publication-images/494f9b24-25aa-4818-961c-84c6d85340f7.png?height=998&width=1166)\n\nThe general concept being communicated by this proof is rather simple: if someone is evaluating a set of goods and is able to rank them all and then makes all good-selecting choices in accordance with their ranking, then their decision-making process can never be arbitrary. This is painfully obvious when stated in plain language, but hard for the average person to understand when stated as a mathematical proof. The issue at hand is not whether the proof is useful (for the record, I think it is), but whether it's camp. The primarily litmus test for understanding whether something is camp is to consider whether it's \"too much.\" For most of us, that proof is too much.\n\nRemember that a central tenet of camp is the reformulation of the mundane as remarkable. Here, the mathematical rigor employed in economics does exactly that: it takes a very obvious repercussion of a few assumptions about how people make choices and renders it inaccessible but notationally beautiful. The fixation of the economic thought here is not *what's* being said but *how* it's said. In [Susan Sontag's *Notes on Camp*](https://monoskop.org/images/5/59/Sontag_Susan_1964_Notes_on_Camp.pdf), she notes the following: \"[Camp] is the love of the exaggerated, the \"off,\" of things-being-what-they-are-not.\" It's difficult—perhaps impossible—to take that reading of camp, review the proof displayed above, and not conclude that it at very least conforms to her idea. The proof leads us to question the relationship between human behavior as we experience it and human behavior as it's presented by economics. Something about the assertion that all those symbols can tell us something about human behavior seems \"off.\"\n\nWhether ideas are afforded legitimacy and respect in the field of economics often relies on proofs like the one above. That is, economics not only sometimes embraces a camp aesthetic but actually *demands* it and delights in it. Camp is primarily a mode communication rather than a set of ideas, just as economics is primarily a methodology rather than a body of knowledge. The project of social sciences as a whole is roughly to understand humanity from a divorced, analytical perspective: to examine it rather than experience it. Economics—more than other fields—divorces itself from reality through the use of a mathematical language that is presented rather obnoxiously and struggles to capture nuance. As economics grows, it relies on its previous simplifications and exaggerates them, continuously campifying itself.\n\nThe most satisfyingly campy aspect of economics is its naivety. As economics continues to hyperbolize human behavior, it generally maintains that its project is important and serious. Economists won't tell you that economics assumptions and their repercussions are true, but they often underestimate how the ostentatiousness of their discipline impacts the way it's understood. The purpose of identifying the campiness of economic theory is not to criticize it or claim that it's wholly wrong—it's to properly qualify it. The campiness of economics is useful when it's understood: just as we don't make political decisions based solely or even primarily on a cabaret performance, it's nonsensical to assume the findings of economic theory and its ideological brethren are unquestionably true or even useful.\n\nIf we believe that economics demands mathematically campy aesthetics and finds value in its mathematical rigor, then perhaps we can identify how exactly camp is useful. To analyze and acknowledge camp is, to some extent, a betrayal of its nature as a purely aesthetic and artistic mode. Importantly, any application of camp aesthetics that *aims* to be politically or ideologically useful or enlightening is probably not truly camp. Economic theory (and perhaps just theory in general) is sort of an exploration of the question \"What would happen if we made a few basic assumptions and then *really* doubled down on them?\" More importantly, to those who are critical of its assumptions, it provides an opportunity to ask \"What can we learn about ourselves and about the world by purposely being a little bit ridiculous?\"\n\nIn many ways, academia is the project of going down a rabbit-hole and being a little ridiculous and obsessive. It's doing something truly arcane but not exactly understanding or acknowledging how divorced from reality it is. The fact that economics can be regarded as camp illuminates that purportedly unartistic or scientific endeavors have something to gain by taking themselves less seriously (or perhaps taking themselves seriously in a different way) and examining themselves as art. It also demonstrates that the realm of aesthetics and sensibility can be applied and made useful in seemingly unnatural or foreign spaces. Camp is largely understood as something that can be performed, and considering economics as a sort of communicative performance affords us a new perspective on how economics operates.\n\nThe classification of economics as camp demonstrates that the interpretive generosity of artists and culturists can be a powerful aid in coming to a holistic understanding of our world. To label something as camp is not intentionally antagonistic, but sympathetic and appreciative. It locates entertainment and humor where a more analytical approach may find only tragedy. Camp invites rather than condemns—appreciates rather than mocks. Camp sensibility finds value in the project of economics, but not the same value that economists might find. \n\nApplying a camp sensibility to my understanding of economics allowed me to reformulate a harsh critique of economic theory and reveal intuitions about why I hold a deep appreciation for economics despite my criticisms. To adopt camp sensibility is to be empathetic and generous. Camp reinterprets cheesiness and misunderstanding as positive by divorcing them from judgement and evaluation and acknowledging an aesthetic appreciation of them. In that sense, coming to an understanding of economics as camp has laid the foundation for me to queer economics—to meet it where it is and to realize that even as I criticize economics, I can always appreciate its art.\n\n\n*quasimatt is an anti-intellectual. [Connect with him on Twitter.](https://twitter.com/quasimatt)*", "timestamp": 1621175926, "digest": "4g_bByFwGTb4duNobyIKRFkuf1Zin7FXegFsBzJ85oI", "contributor": "0x64298A72F4E3e23387EFc409fc424a3f17356fC4"}
{"id": "iggGdxbrY8IkkdNx6G_MN7RPGp2BLCOGucehkOgGueI", "title": "Economics is Camp", "body": "The purpose of this essay is to identify a camp basis for economic theory—not to *reformulate* economics as camp, but to establish an understanding of economics that acknowledges that it's inherently campy. I come to understand economic theory and camp sensibility more holistically by examining their interaction. I seek to understand not only how economics can be understood as camp, but to reveal what it means for something to be camp and how camp sensibility can be useful.\n\nI begin with a theory of camp: camp sensibility is ill-defined by language alone and relies on a primarily working (rather than definitional) knowledge of queer sociability and its humors. It is a sensibility and an aesthetic that is frivolously audacious and necessarily impertinent: it's a regurgitation of banalities that are performed with such exaggeration that they find value not in their content but in their drama. \n\nCamp behavior often reformulates mundanity and presents it as remarkable—it hyperbolizes the status quo until it seems subversive, innovative, or revolutionary. The camp aesthetic operates within a tension between the familiar and the alien: it renders unusual behaviors and methodologies navigable by applying them to familiar and accessible plots or concepts. In short, it takes something that seems natural and presents it in its most fabricated and unnatural form. To do something campy involves misunderstanding and overestimating the importance and seriousness of what you're doing.\n\nEconomics aims to focuses on human behavior and its repercussions as defined by economic assumptions. That is, it takes something that's intimately familiar—human behavior—and communicates it in a reduced form, focusing on and exaggerating certain tendencies such as self-interest. In true camp fashion, oversimplification actually leads to obfuscation and misunderstanding: the basis for the campiness of economic theory is its ignorance of nuance and its mathematically ostentatious presentation.\n\nAll it takes is a quick perusal of an introductory economics textbook or a few clicks on the Wikipedia page on microeconomics to understand the ostentatiousness of economic theory. In order to understand how mathematical representation in economics is camp, let's examine a simple and foundational concept in economics: preference theory. Take a look at this excerpt from [*Introduction to Choice Theory* by Levin and Milgrom:](https://web.stanford.edu/~jdlevin/Econ%20202/Choice%20Theory.pdf)\n\n![](https://images.mirror-media.xyz/publication-images/494f9b24-25aa-4818-961c-84c6d85340f7.png?height=998&width=1166)\n\nThe general concept being communicated by this proof is rather simple: if someone is evaluating a set of goods and is able to rank them all and then makes all good-selecting choices in accordance with their ranking, then their decision-making process can never be arbitrary. This is painfully obvious when stated in plain language, but hard for the average person to understand when stated as a mathematical proof. The issue at hand is not whether the proof is useful (for the record, I think it is), but whether it's camp. The primarily litmus test for understanding whether something is camp is to consider whether it's \"too much.\" For most of us, that proof is too much.\n\nRemember that a central tenet of camp is the reformulation of the mundane as remarkable. Here, the mathematical rigor employed in economics does exactly that: it takes a very obvious repercussion of a few assumptions about how people make choices and renders it inaccessible but notationally beautiful. The fixation of the economic thought here is not *what's* being said but *how* it's said. In [Susan Sontag's *Notes on Camp*](https://monoskop.org/images/5/59/Sontag_Susan_1964_Notes_on_Camp.pdf), she notes the following: \"[Camp] is the love of the exaggerated, the \"off,\" of things-being-what-they-are-not.\" It's difficult—perhaps impossible—to take that reading of camp, review the proof displayed above, and not conclude that it at very least conforms to her idea. The proof leads us to question the relationship between human behavior as we experience it and human behavior as it's presented by economics. Something about the assertion that all those symbols can tell us something about human behavior seems \"off.\"\n\nWhether ideas are afforded legitimacy and respect in the field of economics often relies on proofs like the one above. That is, economics not only sometimes embraces a camp aesthetic but actually *demands* it and delights in it. Camp is primarily a mode communication rather than a set of ideas, just as economics is primarily a methodology rather than a body of knowledge. The project of social sciences as a whole is roughly to understand humanity from a divorced, analytical perspective: to examine it rather than experience it. Economics—more than other fields—divorces itself from reality through the use of a mathematical language that is presented rather obnoxiously and struggles to capture nuance. As economics grows, it relies on its previous simplifications and exaggerates them, continuously campifying itself.\n\nThe most satisfyingly campy aspect of economics is its naivety. As economics continues to hyperbolize human behavior, it generally maintains that its project is important and serious. Economists won't tell you that economics assumptions and their repercussions are true, but they often underestimate how the ostentatiousness of their discipline impacts the way it's understood. The purpose of identifying the campiness of economic theory is not to criticize it or claim that it's wholly wrong—it's to properly qualify it. The campiness of economics is useful when it's understood: just as we don't make political decisions based solely or even primarily on a cabaret performance, it's nonsensical to assume the findings of economic theory and its ideological brethren are unquestionably true or even useful.\n\nIf we believe that economics demands mathematically campy aesthetics and finds value in its mathematical rigor, then perhaps we can identify how exactly camp is useful. To analyze and acknowledge camp is, to some extent, a betrayal of its nature as a purely aesthetic and artistic mode. Importantly, any application of camp aesthetics that *aims* to be politically or ideologically useful or enlightening is probably not truly camp. Economic theory (and perhaps just theory in general) is sort of an exploration of the question \"What would happen if we made a few basic assumptions and then *really* doubled down on them?\" More importantly, to those who are critical of its assumptions, it provides an opportunity to ask \"What can we learn about ourselves and about the world by purposely being a little bit ridiculous?\"\n\nIn many ways, academia is the project of going down a rabbit-hole and being a little ridiculous and obsessive. It's doing something truly arcane but not exactly understanding or acknowledging how divorced from reality it is. The fact that economics can be regarded as camp illuminates that purportedly unartistic or scientific endeavors have something to gain by taking themselves less seriously (or perhaps taking themselves seriously in a different way) and examining themselves as art. It also demonstrates that the realm of aesthetics and sensibility can be applied and made useful in seemingly unnatural or foreign spaces. Camp is largely understood as something that can be performed, and considering economics as a sort of communicative performance affords us a new perspective on how economics operates.\n\nThe classification of economics as camp demonstrates that the interpretive generosity of artists and culturists can be a powerful aid in coming to a holistic understanding of our world. To label something as camp is not intentionally antagonistic, but sympathetic and appreciative. It locates entertainment and humor where a more analytical approach may find only tragedy. Camp invites rather than condemns—appreciates rather than mocks. Camp sensibility finds value in the project of economics, but not the same value that economists might find. \n\nFor me, applying a camp sensibility to my understanding of economics allowed me to reformulate a harsh critique of economic theory and reveal intuitions about why I hold a deep appreciation for economics despite my criticisms. To adopt camp sensibility is to be empathetic and generous. Camp reinterprets cheesiness and misunderstanding as positive by divorcing them from judgement and evaluation and acknowledging an aesthetic appreciation of them. In that sense, coming to an understanding of economics as camp has laid the foundation for me to queer economics—to meet it where it is and to realize that even as I criticize economics, I can always appreciate its art.\n\n\n*quasimatt is an anti-intellectual. [Connect with him on Twitter.](https://twitter.com/quasimatt)*", "timestamp": 1621175912, "digest": "4g_bByFwGTb4duNobyIKRFkuf1Zin7FXegFsBzJ85oI", "contributor": "0x64298A72F4E3e23387EFc409fc424a3f17356fC4"}
{"id": "XbrJ2ByLg7NCqKtfMz3E0Wm72dCkSgYBMrPo6OyE2ZA", "title": "Economics is Camp", "body": "The purpose of this essay is to identify a camp basis for economic theory—not to *reformulate* economics as camp, but to establish an understanding of economics that acknowledges that it's inherently campy. I come to understand economic theory and camp sensibility more holistically by examining their interaction. I seek to identify not only how economics can be understood as camp, but to reveal what it means for something to be camp and how camp sensibility can be useful.\n\nI begin with a theory of camp: camp sensibility is ill-defined by language alone and relies on a primarily working (rather than definitional) knowledge of queer sociability and its humors. It is a sensibility and an aesthetic that is frivolously audacious and necessarily impertinent: it's a regurgitation of banalities that are performed with such exaggeration that they find value not in their content but in their drama. \n\nCamp behavior often reformulates mundanity and presents it as remarkable—it hyperbolizes the status quo until it seems subversive, innovative, or revolutionary. The camp aesthetic operates within a tension between the familiar and the alien: it renders unusual behaviors and methodologies navigable by applying them to familiar and accessible plots or concepts. In short, it takes something that seems natural and presents it in its most fabricated and unnatural form. To do something campy involves misunderstanding and overestimating the importance and seriousness of what you're doing.\n\nEconomics aims to focuses on human behavior and its repercussions as defined by economic assumptions. That is, it takes something that's intimately familiar—human behavior—and communicates it in a reduced form, focusing on and exaggerating certain tendencies such as self-interest. In true camp fashion, oversimplification actually leads to obfuscation and misunderstanding: the basis for the campiness of economic theory is its ignorance of nuance and its mathematically ostentatious presentation.\n\nAll it takes is a quick perusal of an introductory economics textbook or a few clicks on the Wikipedia page on microeconomics to understand the ostentatiousness of economic theory. In order to understand how mathematical representation in economics is camp, let's examine a simple and foundational concept in economics: preference theory. Take a look at this excerpt from [*Introduction to Choice Theory* by Levin and Milgrom:](https://web.stanford.edu/~jdlevin/Econ%20202/Choice%20Theory.pdf)\n\n![](https://images.mirror-media.xyz/publication-images/494f9b24-25aa-4818-961c-84c6d85340f7.png?height=998&width=1166)\n\nThe general concept being communicated by this proof is rather simple: if someone is evaluating a set of goods and is able to rank them all and then makes all good-selecting choices in accordance with their ranking, then their decision-making process can never be arbitrary. This is painfully obvious when stated in plain language, but hard for the average person to understand when stated as a mathematical proof. The issue at hand is not whether the proof is useful (for the record, I think it is), but whether it's camp. The primarily litmus test for understanding whether something is camp is to consider whether it's \"too much.\" For most of us, that proof is too much.\n\nRemember that a central tenet of camp is the reformulation of the mundane as remarkable. Here, the mathematical rigor employed in economics does exactly that: it takes a very obvious repercussion of a few assumptions about how people make choices and renders it inaccessible but notationally beautiful. The fixation of the economic thought here is not *what's* being said but *how* it's said. In [Susan Sontag's *Notes on Camp*](https://monoskop.org/images/5/59/Sontag_Susan_1964_Notes_on_Camp.pdf), she notes the following: \"[Camp] is the love of the exaggerated, the \"off,\" of things-being-what-they-are-not.\" It's difficult—perhaps impossible—to take that reading of camp, review the proof displayed above, and not conclude that it at very least conforms to her idea. The proof leads us to question the relationship between human behavior as we experience it and human behavior as it's presented by economics. Something about the assertion that all those symbols can tell us something about human behavior seems \"off.\"\n\nWhether ideas are afforded legitimacy and respect in the field of economics often relies on proofs like the one above. Thus, economics not only sometimes embraces a camp aesthetic but actually *demands* it and delights in it. Camp is primarily a mode communication rather than a set of ideas, just as economics is primarily a methodology rather than a body of knowledge. The project of social sciences as a whole is roughly to understand humanity from a divorced, analytical perspective: to examine it rather than experience it. Economics—more than other fields—divorces itself from reality through the use of a mathematical language that is presented rather obnoxiously and struggles to capture nuance. As economics grows, it relies on its previous simplifications and exaggerates them, continuously campifying itself.\n\nThe most satisfyingly campy aspect of economics is its naivety. As economics continues to hyperbolize human behavior, it generally maintains that its project is important and serious. Economists won't tell you that economic assumptions and their repercussions are true, but they often underestimate how the ostentatiousness of their discipline impacts the way it's understood. The purpose of identifying the campiness of economic theory is not to criticize it or claim that it's wholly wrong. The campiness of economics is useful when it's understood: just as we don't make political decisions based solely or even primarily on a cabaret performance, it's nonsensical to assume the findings of economic theory and its ideological brethren are unquestionably true or even useful.\n\nIf we believe that economics demands mathematically campy aesthetics and finds its value at least in part from mathematical rigor, then perhaps we can identify how exactly campiness is useful. To analyze and acknowledge camp is, to some extent, a betrayal of its nature as a purely aesthetic and artistic mode. Importantly, any application of camp aesthetics that *aims* to be politically or ideologically useful or enlightening is probably not truly camp. Economic theory (and perhaps just theory in general) is sort of an exploration of the question \"What would happen if we made a few basic assumptions and then *really* doubled down on them?\" More importantly, to those who are critical of its assumptions, it provides an opportunity to ask \"What can we learn about ourselves and about the world by purposely being a little bit ridiculous?\"\n\nIn many ways, academia is the project of going down a rabbit-hole and being a little ridiculous and obsessive. It's doing something truly arcane but not exactly understanding or acknowledging how divorced from reality it is. The fact that economics can be regarded as camp illuminates that purportedly unartistic or scientific endeavors have something to gain by taking themselves less seriously (or perhaps taking themselves seriously in a different way) and examining themselves as art. It also demonstrates that the realm of aesthetics and sensibility can be applied and made useful in seemingly unnatural or foreign spaces. Camp is largely understood as something that can be performed, and considering economics as a sort of communicative performance affords us a new perspective on how it operates.\n\nThe classification of economics as camp demonstrates that the interpretive generosity of artists and culturists can be a powerful aid in coming to a holistic understanding of our world. To label something as camp is not intentionally antagonistic, but sympathetic and appreciative. It locates entertainment and humor where a more analytical approach may find only tragedy. Camp invites rather than condemns—appreciates rather than mocks. Camp sensibility finds value in the project of economics, but not the same value that economists might find. \n\nApplying a camp sensibility to my understanding of economics allowed me to reformulate a harsh critique of economic theory and reveal intuitions about why I hold a deep appreciation for economics despite my criticisms. To adopt camp sensibility is to be empathetic and generous. Camp reinterprets cheesiness and misunderstanding as positive by divorcing them from judgement and evaluation and acknowledging an aesthetic appreciation of them. In that sense, coming to an understanding of economics as camp has laid the foundation for me to queer it—to meet it where it is and to realize that even as I criticize economics, I can always appreciate its art.\n\n\n*quasimatt is an anti-intellectual. [Connect with him on Twitter.](https://twitter.com/quasimatt)*", "timestamp": 1621181739, "digest": "4g_bByFwGTb4duNobyIKRFkuf1Zin7FXegFsBzJ85oI", "contributor": "0x64298A72F4E3e23387EFc409fc424a3f17356fC4"}
{"id": "mNh-m69vq3gZhGLo5jg5Z0RLBd5knCyQDTiBjqyyP-I", "title": "In Vitro Nostalgia: Minting Memories", "body": "### Non-Fungible Memory Tokens \n[NFMTs]\n\nMemories. What do they reveal about you? What do they remind you of? A forgotten time? The nostalgia of an experience since passed? \n\nhttps://twitter.com/enaraxr/status/1355450773212172290?s=20\n\nAs combed through the various voice recordings on my iPhone, I found a selection of memories from a secret party in Ishikawa Prefecture, Japan that I attended. I didn't immediately think to make them into NFTs. It wasn't until I had gone through the motions on Zora that the audio looped over and over that it clicked. This was the perfect experiment in documenting, sharing, and collecting memories.\n\nWhat could I reveal to the listener? Could they learn about me? And because we had all been deprived of events, could these moments hold a deeper meaning to the fleeting nature of socialization? Did we take for granted the ever innocuous social gathering? I'm not entirely sure. But these are questions that have continued to come into view the longer I've sat with those voice notes.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/178)\n\n \n\nJust close your eyes, think of yourself either as the observer of the scene, or part of the scene, and let your mind paint the picture of the environment. Imagine where the DJ is, where the characters are, what type of house are you in? The first of three notes in this trilogy called ***[\"Shīkurettopātī: One Night In Kurosakimachi\"](https://zora.co/sirsu/178)***, it's very serendipitous that my phone picked up both a conversation I'm having about crate-digging at one of the only remaining Tower Record stores in the world AND some amazing house music. The instrumentation starts to swell with a soulful synth as the conversation reaches a euphoric note as we make the resolve to buy records and acknowledge how awesome the moment is.\n\nThe remaining two notes, ***[\"Not Now, But In The Future\"](https://zora.co/sirsu/189)*** and ***[\"Chinese Omelette OST\"](https://zora.co/sirsu/188)*** create this unintended effect of feeling like a short film + soundtrack with your own visual dreamscape constructing a memory that’s unique to you despite the fact that the audio is not your lived experience.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/189)\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/188)\n\n*Chinese Omelette OST is the last remaining NFT of the Shīkurettopātī trilogy to be collected.*\n\nI've posted the NFTs in the order I believe to be the most chronologically accurate, although any DJ will tell you that there are many highs and lows in a set that when you *think* it's over, there is more around the corner! I'd be super curious to see what YOU see, more so than my own recollection of the space and the folks within it.\n\n\n---\n\n### Spatial Conversations\n\nIn the context of memories, archived works in many ways achieve a similar effect of nostalgia. While they may not draw specifically from real life as a form of `reporting-lived-experience-as-documentation`, works that pull on the thread of life can be memory-inducing. For me, one of those works is a live recording in 2014 of a freeform DJ set with my uni-mates after a day of getting unbelievably stoned called \"SYNESTHESIA\". \n\nYou might be wondering why it's called SYNESTHESIA. For me, and others who experience two or more sensory inputs involuntarily, DJing soundscapes puts me into a trance-like state of flow. I can see threads of light guiding me to my next note as if I'm being controlled. I really don't remember the act of playing only the fact that I've *played* a set. In a way, perhaps there is a narrative to it all that I cannot comprehend. Oddly enough, I've been watching a show called [The Nevers](https://www.hbo.com/the-nevers) which has a character who can sing but she cannot understand what she is actually communicating. Even stranger, only a certain group of people can hear it too. I haven't found a metaphor so closely aligned with my own personal experiences with music.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/1643)\n\nAs a treat to my uni-mates, and to break them into the NFT space, I decided to put \"SYNESTHESIA\" up for auction with a 1.5 ETH reserve on Zora, to show them one of the core principles that solidifies why crypto can lead to an equitable future. For being supporters of my experiments, I wanted to reward them a split from the proceeds of the sale of the 35-minute live session and tips collected from this essay.\n\nI believe redistribution at all levels should be explored. While there is nothing stopping me from gladly auctioning these NFTs without attribution, I am a firm believer in trying to capture the entire story involving my work. I am currently publishing an essay \"Creative Immortality\" that speaks to the inclusion of others as a necessary component to the preservation of work to enable the natural line of discovery to take place. \n\nAs creatives, we can never have enough inspiration. Attribution provides us with our next set of sources to draw from. And now, we can trace the value these inspirations give us and pay it forward through redistribution.   \n\n---\n\n### Special Thanks\n\nI want to give a special thanks to everyone involved in the creation of the Secret Party Trilogy and SYNESTHESIA. The split breakdown will derive from the sale of this essay, and both the Chinese Omelette OST + SYNESTHESIA NFMTs. Because SYNESTHESIA is auctioned through Zora's deployment of $BOUNTY and not on Mirror, 30% of the funds will be added as a tip to the split contract attached to this essay.\n\nSplit Recipients:\n\nSCAD Roomies\nW.T. Warmoth\nArmani Mayo\nPatrick O'Connor\n\nFusion Art Japan Residency\nStarnilas Oge\n\n$BOUNTY Holders (for your support in building the auction method)\n\nJacob Horne (for some reason you can read minds so thank you for pushing to get me to write this lol)\n\n", "timestamp": 1621191384, "digest": "kVKneiFoAnwbEVabds1Si7VqkeZPJbMXTDP31L34dKc", "contributor": "0xEB95ff72EAb9e8D8fdb545FE15587AcCF410b42E"}
{"id": "_8nHYPIrQjpFGggj35IMAGuV-Pb3u473N2ZCEvnnEjg", "title": "In Vitro Nostalgia: Minting Memories", "body": "### Non-Fungible Memory Tokens \n[NFMTs]\n\nMemories. What do they reveal about you? What do they remind you of? A forgotten time? The nostalgia of an experience since passed? \n\nhttps://twitter.com/enaraxr/status/1355450773212172290?s=20\n\nAs combed through the various voice recordings on my iPhone, I found a selection of memories from a secret party in Ishikawa Prefecture, Japan that I attended. I didn't immediately think to make them into NFTs. It wasn't until I had gone through the motions on Zora that the audio looped over and over that it clicked. This was the perfect experiment in documenting, sharing, and collecting memories.\n\nWhat could I reveal to the listener? Could they learn about me? And because we had all been deprived of events, could these moments hold a deeper meaning to the fleeting nature of socialization? Did we take for granted the ever innocuous social gathering? I'm not entirely sure. But these are questions that have continued to come into view the longer I've sat with those voice notes.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/178)\n\n \n\nJust close your eyes, think of yourself either as the observer of the scene, or part of the scene, and let your mind paint the picture of the environment. Imagine where the DJ is, where the characters are, what type of house are you in? The first of three notes in this trilogy called ***[\"Shīkurettopātī: One Night In Kurosakimachi\"](https://zora.co/sirsu/178)***, it's very serendipitous that my phone picked up both a conversation I'm having about crate-digging at one of the only remaining Tower Record stores in the world AND some amazing house music. The instrumentation starts to swell with a soulful synth as the conversation reaches a euphoric note as we make the resolve to buy records and acknowledge how awesome the moment is.\n\nThe remaining two notes, ***[\"Not Now, But In The Future\"](https://zora.co/sirsu/189)*** and ***[\"Chinese Omelette OST\"](https://zora.co/sirsu/188)*** create this unintended effect of feeling like a short film + soundtrack with your own visual dreamscape constructing a memory that’s unique to you despite the fact that the audio is not your lived experience.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/189)\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/188)\n\n*Chinese Omelette OST is the last remaining NFT of the Shīkurettopātī trilogy to be collected.*\n\nI've posted the NFTs in the order I believe to be the most chronologically accurate, although any DJ will tell you that there are many highs and lows in a set that when you *think* it's over, there is more around the corner! I'd be super curious to see what YOU see, more so than my own recollection of the space and the folks within it.\n\n\n---\n\n### Spatial Conversations\n\nIn the context of memories, archived works in many ways achieve a similar effect of nostalgia. While they may not draw specifically from real life as a form of `reporting-lived-experience-as-documentation`, works that pull on the thread of life can be memory-inducing. For me, one of those works is a live recording in 2014 of a freeform DJ set with my uni-mates after a day of getting unbelievably stoned called \"SYNESTHESIA\". \n\nYou might be wondering why it's called SYNESTHESIA. For me, and others who experience two or more sensory inputs involuntarily, DJing soundscapes puts me into a trance-like state of flow. I can see threads of light guiding me to my next note as if I'm being controlled. I really don't remember the act of playing only the fact that I've *played* a set. In a way, perhaps there is a narrative to it all that I cannot comprehend. Oddly enough, I've been watching a show called [The Nevers](https://www.hbo.com/the-nevers) which has a character who can sing but she cannot understand what she is actually communicating. Even stranger, only a certain group of people can hear it too. I haven't found a metaphor so closely aligned with my own personal experiences with music.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/1643)\n\nAs a treat to my uni-mates, and to break them into the NFT space, I decided to put \"SYNESTHESIA\" up for auction with a 1.5 ETH reserve on Zora, to show them one of the core principles that solidifies why crypto can lead to an equitable future. For being supporters of my experiments, I wanted to reward them a split from the proceeds of the sale of the 35-minute live session and tips collected from this essay.\n\nI believe redistribution at all levels should be explored. While there is nothing stopping me from gladly auctioning these NFTs without attribution, I am a firm believer in trying to capture the entire story involving my work. I am currently publishing an essay \"Creative Immortality\" that speaks to the inclusion of others as a necessary component to the preservation of work to enable the natural line of discovery to take place. \n\nAs creatives, we can never have enough inspiration. Attribution provides us with our next set of sources to draw from. And now, we can trace the value these inspirations give us and pay it forward through redistribution.   \n\n---\n\n### Special Thanks\n\nI want to give a special thanks to everyone involved in the creation of the Secret Party Trilogy and SYNESTHESIA. The split breakdown will derive from the sale of this essay, and both the Chinese Omelette OST + SYNESTHESIA NFMTs. Because SYNESTHESIA is auctioned through Zora's deployment of $BOUNTY and not on Mirror, 30% of the funds will be added as a tip to the split contract attached to this essay.\n\nSplit Recipients:\n\nSCAD Roomies\nW.T. Warmoth\nArmani Mayo\nPatrick O'Connor\n\nFusion Art Japan Residency\nStarnilas Oge\n\n$BOUNTY Holders (for your support in building the auction method)\n\nJacob Horne (for some reason you can read minds so thank you for pushing to get me to write this lol)\n\n", "timestamp": 1621191396, "digest": "kVKneiFoAnwbEVabds1Si7VqkeZPJbMXTDP31L34dKc", "contributor": "0xEB95ff72EAb9e8D8fdb545FE15587AcCF410b42E"}
{"id": "aFHrcZKIGNx8ZgluJGdxeu4Jt7zSnYtWTjBwwq9u7Qg", "title": "Guide → Auctions", "body": "Mirror supports auctioning off NFTs using reserve auctions. Reserve auctions are configured with two main parameters: the reserve price and the auction duration. Like other economic blocks on Mirror, your auction is deployed as a smart contract and can be embedded inside any Mirror entry.\n\n## How auctions work\n\nWhen a bid is placed that matches or exceeds your reserve price, the auction duration countdown begins. Let's imagine that Alice creates an auction with a reserve price of 1 ETH and a duration of 12 hours.\n\n1. Bob places a bid of 1 ETH.\n2. The clock starts counting down from 12 hours.\n3. Any bids placed within the last 15 minutes of the auction reset the clock to 15 minutes.\n4. A new bid must be 10% higher than the previous bid.\n5. The collector that is last to place a bid before the auction ends wins the NFT.\n\n## Launching an auction\n\n### **Pick an NFT**\n\nTo create an Auction, pick an NFT from the \"Select NFT\" dropdown. Any Zora NFTs that are owned by the wallet that controls your Mirror publication will be pre-populated in the dropdown.\n\n### **Route the funds**\n\nProceeds from the auction can be routed to any Ethereum address or smart contract. If you want to route the funds for yourself, put your Ethereum address here.\n\nAlternatively, funds can flow to other economic blocks on Mirror, such as Crowdfunds or Splits. To route the proceeds from the NFT auction to  your Crowdfund, put your Crowdfund address here. You can also share funds with multiple entities by routing it to a Split contract address.\n\n### **Set the limits**\n\nHow long should the auction run after the first bid? What should the reserve price be?\n\n### **Deploying**\n\nAfter you deploy the auction, you'll get an embed code that you can paste into your entry. Save the entry and share it so people can bid.", "timestamp": 1621192268, "digest": "SOjXoSv7OxQQmqXva3xqGEUwybVoAHj-HlSimSZ6XFQ", "contributor": "0x841fF85B6873d7bfB712C8f7A347C774355b6EC3"}
{"id": "ADwaXUdzEJl4rdL2LU1oMtARlpoUghPkvLVyQG4nUw8", "title": "In Vitro Nostalgia: Minting Memories", "body": "### Non-Fungible Memory Tokens \n[NFMTs]\n\nMemories. What do they reveal about you? What do they remind you of? A forgotten time? The nostalgia of an experience since passed? \n\nhttps://twitter.com/enaraxr/status/1355450773212172290?s=20\n\nAs combed through the various voice recordings on my iPhone, I found a selection of memories from a secret party in Ishikawa Prefecture, Japan that I attended. I didn't immediately think to make them into NFTs. It wasn't until I had gone through the motions on Zora that the audio looped over and over that it clicked. This was the perfect experiment in documenting, sharing, and collecting memories.\n\nWhat could I reveal to the listener? Could they learn about me? And because we had all been deprived of events, could these moments hold a deeper meaning to the fleeting nature of socialization? Did we take for granted the ever innocuous social gathering? I'm not sure. But these are questions that have continued to come into view the longer I've sat with these voice notes.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/178)\n\n \n\nClose your eyes, think of yourself either as the observer of the scene, or part of the scene, and let your mind paint the picture of the environment. Imagine where the DJ is, where the characters are, what type of house are you in? \n\nThe first of three notes in this trilogy called ***[\"Shīkurettopātī: One Night In Kurosakimachi\"](https://zora.co/sirsu/178)***, it's serendipitous that my phone picked up both a conversation I'm having about crate-digging at one of the only remaining Tower Record stores in the world *AND* amazing house music. The instrumentation starts to swell with a soulful synth as the conversation reaches a euphoric note as we make the resolve to buy records and acknowledge how awesome the moment is.\n\nThe remaining two notes, ***[\"Not Now, But In The Future\"](https://zora.co/sirsu/189)*** and ***[\"Chinese Omelette OST\"](https://zora.co/sirsu/188)*** create this unintended effect of feeling like a short film with your own visual dreamscape constructing a memory that’s unique to you despite the fact that the audio is not your lived experience.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/189)\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/188)\n\n*Chinese Omelette OST is the last remaining NFT of the Shīkurettopātī trilogy to be collected.*\n\nI've posted the NFTs in the order I believe to be the most chronologically accurate, although any DJ will tell you that there are many highs and lows in a set that when you *think* it's over, there is more around the corner! I'd be super curious to see what YOU see, more so than my own recollection of the space and the folks within it.\n\n\n---\n\n### Spatial Conversations\n\nIn the context of memories, archived works in many ways achieve a similar effect of nostalgia. While they may not draw from life as a form of `reporting-lived-experience-as-documentation`, works that pull on the thread of life can be memory-inducing. For me, one of those works is a live recording in 2014 of a freeform DJ set with my uni-mates after a day of getting unbelievably stoned called \"SYNESTHESIA\". \n\nYou might be wondering why it's called SYNESTHESIA. For me, and others who experience two or more sensory inputs involuntarily, DJing soundscapes puts me into a trance-like state of flow. I can see threads of light guiding me to my next note as if I'm being controlled. I really don't remember the act of playing only the fact that I've *played* a set. In a way, perhaps there is a narrative to it all that I cannot comprehend. Oddly enough, I've been watching a show called [The Nevers](https://www.hbo.com/the-nevers) which has a character who can sing but she cannot understand what she is actually communicating. Even stranger, only a certain group of people can hear it too. I haven't found a metaphor so closely aligned with my own personal experiences with music.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/1643)\n\nAs a treat to my uni-mates, and to break them into the NFT space, I decided to put \"SYNESTHESIA\" up for auction with a 1.5 ETH reserve on Zora, to show them one of the core principles that solidifies why crypto can lead to an equitable future. For being supporters of my experiments, I wanted to reward them a split from the proceeds of the sale of the 35-minute live session and tips collected from this essay.\n\nI believe redistribution at all levels should be explored. While there is nothing stopping me from gladly auctioning these NFTs without attribution, I am a firm believer in trying to capture the entire story involving my work. I am currently publishing an essay \"Creative Immortality\" that speaks to the inclusion of others as a necessary component to the preservation of work to enable the natural line of discovery to take place. \n\nAs creatives, we can never have enough inspiration. Attribution provides us with our next set of sources to draw from. And now, we can trace the value these inspirations give us and pay it forward through redistribution.   \n\n---\n\n### Special Thanks\n\nI want to give a special thanks to everyone involved in the creation of the Secret Party Trilogy and SYNESTHESIA. The split breakdown will derive from the sale of this essay, and both the Chinese Omelette OST + SYNESTHESIA NFMTs. Because SYNESTHESIA is auctioned through Zora's deployment of $BOUNTY and not on Mirror, 30% of the funds will be added as a tip to the split contract attached to this essay.\n\nSplit Recipients:\n\nSCAD Roomies\nW.T. Warmoth\nArmani Mayo\nPatrick O'Connor\n\nFusion Art Japan Residency\nStarnilas Oge\n\n$BOUNTY Holders (for your support in building the auction method)\n\nJacob Horne (for some reason you can read minds so thank you for pushing to get me to write this lol)\n\n", "timestamp": 1621193902, "digest": "kVKneiFoAnwbEVabds1Si7VqkeZPJbMXTDP31L34dKc", "contributor": "0xEB95ff72EAb9e8D8fdb545FE15587AcCF410b42E"}
{"id": "9bdTL5gSTl6FID-ONokqm_Dv9jd1UA1poy06fVHsfCQ", "title": "Gelato Interview by Bspeak! \n", "body": "*Gelato recently launched its v2.0 and announced the token $GEL. I've been watching the project since 2019 and thought would be a great infrastructure for smart contracts in general. This time, I had a chance to interview with the team. This was translated in Japanese and posted in my weekly newsletter [Bspeak!](https://bspeak.substack.com/). Anyway, enjoy the interview.*\n\n![](https://images.mirror-media.xyz/publication-images/5bf2da5f-33e9-4bac-a7a6-990e861ac28c.jpeg?height=560&width=990)\n　\n　\n\n***CoffeeTimes: Hello Gelato team🍦! Can you tell us what Gelato Network is in a nutshell?***\n\nGelato: [Gelato Network](https://www.gelato.network/) is an open marketplace to match developers’ demand for transaction automation with the supply of a decentralized network of bots. It empowers developers to build automated dapps and allows bot operators to earn revenue from running the infrastructure necessary for such automations. Further important members of Gelato’s ecosystem and community include the team that develops and distributes much of the technology needed for the marketplace. \n\nSoon, after Gelato’s native token - $GEL - will have been released, its holders will also play a crucial part in governing the network and shaping its success and path into the future.\n\n　\n　\n***CoffeeTimes: What made you start this project?***\nGelato: We started the project back in May 2019 after we received a grant from Gnosis Ecosystem Fund (GECO). \n\nref: [https://blog.gnosis.pm/gnosis-ecosystem-fund-update-ii-9bea803a97c8](https://blog.gnosis.pm/gnosis-ecosystem-fund-update-ii-9bea803a97c8?gi=84e40da1e1c9)\n\nInitially, we worked on automating certain aspects of Gnosis’s DutchX exchange back then. However, we quickly realized that the need for automating dapps is ubiquitous. Web2 users are completely accustomed to an automated User Experience thanks to centralized servers controlling a lot of your data. In Ethereum, and decentralized blockchains in general, this great user experience is very hard to replicate because here we explicitly do not want users to trade in custody over their data and funds to a centralized server for a better UX. This would sacrifice most of the benefits of the decentralized web. So in the summer of 2019 we set out to build a solution for developers and users alike that allows for a decentralized application layer with a slick automated user experience, without the need for users to give away control over their keys and funds - Gelato Network was born. \n\n\n![](https://images.mirror-media.xyz/publication-images/be0267e3-a57a-443e-a218-f7ad87d99454.jpeg?height=874&width=1310)\n\nLuis and Hilmar, 2021\n\n　\n　\n***CoffeeTimes: What is Sorbet Finance? Is it like a side project on top of Gelato?***\n\nGelato: Yes, [Sorbet Finance](https://www.sorbet.finance/) is its own project that makes use of the Gelato Network in its backend. In Sorbet’s case it uses the Gelato network to continually monitor prices on DEX and then execute a users’ limit orders once their specified desired price target is reached. All that is achieved while the users keep full control over their funds. Also Sorbet now features Dollar Cost Averaging, which allows users to automatically sell a portion of a token spread out in several chunks and time intervals, to decrease the slippage per trade. Cool features like Sorbet that use Gelato Network to automate some aspect of a dapp can be built by any developer. \n　\n　\n***CoffeeTimes: You have announced several collaborations. Can we expect any other collaborations in the close future?***\n\nGelato: Yes, for sure. We are in close talks with many of the famous and not-yet-famous projects out there on Ethereum, Polygon, BSC, and whatnot. Almost every DeFi developer needs automation and we’re here to help them get it. \n　\n　\n***CoffeeTimes: You recently have announced GEL tokens. What is the purpose of GEL tokens? If Executors bot act maliciously, it would lead to a crucial problem (front running or just harming dapp users). Does GEL token slashing prevent it enough?***\n\nGelato: $GEL tokens will be used to 1) incentivise, govern, and police network participants and 2) allocate network resources efficiently. \n\nBots who want to earn a revenue from providing their infrastructure services to the Gelato network will have to stake a lot of $GEL tokens to attain and retain this privilege. This will open the door for more complex use cases to be built on top of Gelato, which might require an element of trust into the bots that will execute their automations. For such use cases having the bots put up a bonded stake, which can be slashed if they act maliciously, is essential. However, it’s worth mentioning that there are also many use cases which can be implemented so that they are trustless by default and thus do not have to rely on such a staking and slashing mechanism. Furthermore, the $GEL token will also be used to positively incentivize all network participants, developers, bots, and users alike that bring traffic to the network. \n\nOne other major use of $GEL is to efficiently allocate network infrastructure resources to dapps and users that demand them. Ethereum and other chains usually are constrained resource environments. There are only so many transactions that can fit into a block. Therefore, in order to scale a decentralized network like Gelato, decisions regarding the timing priority of transactions will have to be made by dapp developers and ultimately the bots that send them to the network. To gain priority in this technological resource allocation mechanism, developers and end users will have the ability to also lock up $GEL to assign different weights to their transactions. As a result, bots are incentivized to allocate more resources to such staked dapps or users, who, like them, are also long $GEL via their boned stakes.\n　\n　\n***CoffeeTimes: About token distribution, how would you plan on it?***\nGelato: At the moment we cannot share details with the public yet other than that we plan to do a public sale for $GEL tokens early this summer. Stay tuned, we will announce more details soon on our Medium and Twitter accounts.\n　\n　\n***CoffeeTimes: Okay further question about GEL, allocation/tokenomics are already fixed?***\n\nGelato: We will announce more details about token allocation and tokenomics in an upcoming article. Right now this information is not yet public. \n　\n　\n***CoffeeTimes: How would the GelatoDAO become sustainable? I assume the protocol would take a fee based on transactions but can you elaborate the model?***\n\nGelato: The GelatoDAO will be governed by people that have a vested interest in governing and maintaining the Gelato Network. For example, dapp developers that make extensive use of Gelato for their automation needs are strongly incentivized to participate in important decision-making around things like what features should be prioritised by Gelato’s core team in upcoming releases, what fees bots can charge, and whether certain bots should be slashed and kicked from the network, if they misbehave. Therefore, there is an organic tendency for many network participants to participate in the DAO to steadily improve the welfare of the network purely out of rational self-interest. In the future, the DAO could also retain a small network fee, but since its membership will likely largely consist of network participants the ultimate fee payers will have significant control over this decision themselves.\n　\n　\n***CoffeeTimes: Gelato seems to have a great connection with Gnosis and other DAOs (TheLAO / MetaCartel Ventures), how did you start and deepen these relationships with them?***\n\nGelato: We partnered with MetaCartel early on in late 2019 when we applied for a grant from them and made it into their 3rd cohort.\n\nref: [https://medium.com/metacartel/metacartel-cohort-1-6336cdca05db](https://medium.com/metacartel/metacartel-cohort-1-6336cdca05db)\n\nEven though Peter Pan sat next to us in Berlin’s crypto co-working space Full Node from the start, we eventually really got to know him online. He was super helpful and interested in Gelato and really also helped us with closing our Seed Funding in late summer 2020. The LAO was also part of our Seed Round and we are in frequent contact with both members of the LAO, like Aaron and Pri, and members of MetaCartel, like Peter and Victor. They usually help us greatly with legal, strategic, or community-related questions. Being active in DAOs and just talking to their members is definitely a good thing every crypto entrepreneur should.\n　\n　\n***CoffeeTimes: Please tell us briefly about your future plans in the coming few months!***\n\nGelato: Uh boi, there is a lot to unpack here but let us be crisp. For this summer the plan is to: \n- ship, ship, ship: new automated features on Ethereum, Polygon, BSC, and Fantom. We want Sorbet’s limit orders to be on every AMM and we want more and more protocols to integrate Gelato for liquidation protection and automated transfers, withdraws, deposits and so on. \n- launch $GEL \n- launch the Gelato DAO and start involving $GEL holders in decision-making around which features to prioritise \n- Developer mining programs with $GEL to get more developers to build on Gelato \n\nDefinitely join our Telegram or Discord communities to stay up to date. I am sure there will be feature releases for you or as a developer you have the opportunity to participate in our developer mining program, which we will launch after the $GEL token sale. \n\n![](https://images.mirror-media.xyz/publication-images/5e66c1b3-7d34-441b-ae17-7c7cb98e5f3d.jpeg?height=594&width=623)\n\n\nRoadmap：[WhitePaper v1.0](https://aristaticfiles.s3.amazonaws.com/Gelato+Whitepaper+V1.0,+May+2021+(02).pdf)\n　\n　\n***CoffeeTimes: Can you give any words to the Japanese audience? Do you have any impressions on Japanese crypto scene? I think I saw a photo somewhere of when the team came to Tokyo***\n\nGelato: Gelato had a strong Japanese community right from the start. We are super thankful for that and we definitely want to connect more with them. If any Japanese developers want to automate smart contracts, please don’t hesitate to reach out. Unfortunately, we have not been to Tokyo yet. However, after COVID settles down we will definitely go. \n\nOur team is very multinational, we have members from Switzerland, US, Germany, France, China, Australia, and Egypt. However, we don’t have a Japanese team member yet. We are currently actively looking for frontend and backend developers with web3 experience, so if anybody in our Japanese community wants a job with us please apply here: https://angel.co/company/gelato-network! \n　\n　\n***(CoffeeTimes: By the way, why is the name Gelato? The bottom half of the logo also looks like Ethereum🍦)***\nGelato: Because everybody loves Gelato! \n　\n　\n***CoffeeTimes: Thank you for taking your time! Where can we learn more about Gelato?***\n\nGelato: \n🐦 [Twitter](https://twitter.com/gelatonetwork) | 💬 [Telegram](https://t.me/joinchat/HcTaOxJ0_FjU-r34vbvK8A) | 📺 [Discord](https://t.co/SY3zIfyalk?amp=1)\n🍦hi@gelato.digital\n🍦http://gelato.network/\n🍦[Gelato Whitepaper v1.0](https://bit.ly/3y8ccnw\n)\n\n\n\n", "timestamp": 1621206961, "digest": "krM9_r-1fGjtLWXt0uTQipnwQZHvu-k2Eq9xrXr_pP4", "contributor": "0x7853Eabb6cFa980eBfD27e3F77e69590EA53c0b7"}
{"id": "x8xDVo0fw28sYD4GFThepIiC7gfyqToO7oRnMGzCfEs", "title": "Gelato Interview by Bspeak! \n", "body": "*Gelato recently launched its v2.0 and announced the token $GEL. I've been watching the project since 2019 and thought would be a great infrastructure for smart contracts in general. This time, I had a chance to interview with the team. This was translated in Japanese and posted in my weekly newsletter [Bspeak!](https://bspeak.substack.com/). Anyway, enjoy the interview.*\n\n*This is not investment advice and informational purposes only.\n\n\n![](https://images.mirror-media.xyz/publication-images/5bf2da5f-33e9-4bac-a7a6-990e861ac28c.jpeg?height=560&width=990)\n　\n　\n\n***CoffeeTimes: Hello Gelato team🍦! Can you tell us what Gelato Network is in a nutshell?***\n\nGelato: [Gelato Network](https://www.gelato.network/) is an open marketplace to match developers’ demand for transaction automation with the supply of a decentralized network of bots. It empowers developers to build automated dapps and allows bot operators to earn revenue from running the infrastructure necessary for such automations. Further important members of Gelato’s ecosystem and community include the team that develops and distributes much of the technology needed for the marketplace. \n\nSoon, after Gelato’s native token - $GEL - will have been released, its holders will also play a crucial part in governing the network and shaping its success and path into the future.\n\n　\n　\n***CoffeeTimes: What made you start this project?***\nGelato: We started the project back in May 2019 after we received a grant from Gnosis Ecosystem Fund (GECO). \n\nref: [https://blog.gnosis.pm/gnosis-ecosystem-fund-update-ii-9bea803a97c8](https://blog.gnosis.pm/gnosis-ecosystem-fund-update-ii-9bea803a97c8?gi=84e40da1e1c9)\n\nInitially, we worked on automating certain aspects of Gnosis’s DutchX exchange back then. However, we quickly realized that the need for automating dapps is ubiquitous. Web2 users are completely accustomed to an automated User Experience thanks to centralized servers controlling a lot of your data. In Ethereum, and decentralized blockchains in general, this great user experience is very hard to replicate because here we explicitly do not want users to trade in custody over their data and funds to a centralized server for a better UX. This would sacrifice most of the benefits of the decentralized web. So in the summer of 2019 we set out to build a solution for developers and users alike that allows for a decentralized application layer with a slick automated user experience, without the need for users to give away control over their keys and funds - Gelato Network was born. \n\n\n![](https://images.mirror-media.xyz/publication-images/be0267e3-a57a-443e-a218-f7ad87d99454.jpeg?height=874&width=1310)\n\nLuis and Hilmar, 2021\n\n　\n　\n***CoffeeTimes: What is Sorbet Finance? Is it like a side project on top of Gelato?***\n\nGelato: Yes, [Sorbet Finance](https://www.sorbet.finance/) is its own project that makes use of the Gelato Network in its backend. In Sorbet’s case it uses the Gelato network to continually monitor prices on DEX and then execute a users’ limit orders once their specified desired price target is reached. All that is achieved while the users keep full control over their funds. Also Sorbet now features Dollar Cost Averaging, which allows users to automatically sell a portion of a token spread out in several chunks and time intervals, to decrease the slippage per trade. Cool features like Sorbet that use Gelato Network to automate some aspect of a dapp can be built by any developer. \n　\n　\n***CoffeeTimes: You have announced several collaborations. Can we expect any other collaborations in the close future?***\n\nGelato: Yes, for sure. We are in close talks with many of the famous and not-yet-famous projects out there on Ethereum, Polygon, BSC, and whatnot. Almost every DeFi developer needs automation and we’re here to help them get it. \n　\n　\n***CoffeeTimes: You recently have announced GEL tokens. What is the purpose of GEL tokens? If Executors bot act maliciously, it would lead to a crucial problem (front running or just harming dapp users). Does GEL token slashing prevent it enough?***\n\nGelato: $GEL tokens will be used to 1) incentivise, govern, and police network participants and 2) allocate network resources efficiently. \n\nBots who want to earn a revenue from providing their infrastructure services to the Gelato network will have to stake a lot of $GEL tokens to attain and retain this privilege. This will open the door for more complex use cases to be built on top of Gelato, which might require an element of trust into the bots that will execute their automations. For such use cases having the bots put up a bonded stake, which can be slashed if they act maliciously, is essential. However, it’s worth mentioning that there are also many use cases which can be implemented so that they are trustless by default and thus do not have to rely on such a staking and slashing mechanism. Furthermore, the $GEL token will also be used to positively incentivize all network participants, developers, bots, and users alike that bring traffic to the network. \n\nOne other major use of $GEL is to efficiently allocate network infrastructure resources to dapps and users that demand them. Ethereum and other chains usually are constrained resource environments. There are only so many transactions that can fit into a block. Therefore, in order to scale a decentralized network like Gelato, decisions regarding the timing priority of transactions will have to be made by dapp developers and ultimately the bots that send them to the network. To gain priority in this technological resource allocation mechanism, developers and end users will have the ability to also lock up $GEL to assign different weights to their transactions. As a result, bots are incentivized to allocate more resources to such staked dapps or users, who, like them, are also long $GEL via their boned stakes.\n　\n　\n***CoffeeTimes: About token distribution, how would you plan on it?***\nGelato: At the moment we cannot share details with the public yet other than that we plan to do a public sale for $GEL tokens early this summer. Stay tuned, we will announce more details soon on our Medium and Twitter accounts.\n　\n　\n***CoffeeTimes: Okay further question about GEL, allocation/tokenomics are already fixed?***\n\nGelato: We will announce more details about token allocation and tokenomics in an upcoming article. Right now this information is not yet public. \n　\n　\n***CoffeeTimes: How would the GelatoDAO become sustainable? I assume the protocol would take a fee based on transactions but can you elaborate the model?***\n\nGelato: The GelatoDAO will be governed by people that have a vested interest in governing and maintaining the Gelato Network. For example, dapp developers that make extensive use of Gelato for their automation needs are strongly incentivized to participate in important decision-making around things like what features should be prioritised by Gelato’s core team in upcoming releases, what fees bots can charge, and whether certain bots should be slashed and kicked from the network, if they misbehave. Therefore, there is an organic tendency for many network participants to participate in the DAO to steadily improve the welfare of the network purely out of rational self-interest. In the future, the DAO could also retain a small network fee, but since its membership will likely largely consist of network participants the ultimate fee payers will have significant control over this decision themselves.\n　\n　\n***CoffeeTimes: Gelato seems to have a great connection with Gnosis and other DAOs (TheLAO / MetaCartel Ventures), how did you start and deepen these relationships with them?***\n\nGelato: We partnered with MetaCartel early on in late 2019 when we applied for a grant from them and made it into their 3rd cohort.\n\nref: [https://medium.com/metacartel/metacartel-cohort-1-6336cdca05db](https://medium.com/metacartel/metacartel-cohort-1-6336cdca05db)\n\nEven though Peter Pan sat next to us in Berlin’s crypto co-working space Full Node from the start, we eventually really got to know him online. He was super helpful and interested in Gelato and really also helped us with closing our Seed Funding in late summer 2020. The LAO was also part of our Seed Round and we are in frequent contact with both members of the LAO, like Aaron and Pri, and members of MetaCartel, like Peter and Victor. They usually help us greatly with legal, strategic, or community-related questions. Being active in DAOs and just talking to their members is definitely a good thing every crypto entrepreneur should.\n　\n　\n***CoffeeTimes: Please tell us briefly about your future plans in the coming few months!***\n\nGelato: Uh boi, there is a lot to unpack here but let us be crisp. For this summer the plan is to: \n- ship, ship, ship: new automated features on Ethereum, Polygon, BSC, and Fantom. We want Sorbet’s limit orders to be on every AMM and we want more and more protocols to integrate Gelato for liquidation protection and automated transfers, withdraws, deposits and so on. \n- launch $GEL \n- launch the Gelato DAO and start involving $GEL holders in decision-making around which features to prioritise \n- Developer mining programs with $GEL to get more developers to build on Gelato \n\nDefinitely join our Telegram or Discord communities to stay up to date. I am sure there will be feature releases for you or as a developer you have the opportunity to participate in our developer mining program, which we will launch after the $GEL token sale. \n\n![](https://images.mirror-media.xyz/publication-images/5e66c1b3-7d34-441b-ae17-7c7cb98e5f3d.jpeg?height=594&width=623)\n\n\nRoadmap：[WhitePaper v1.0](https://aristaticfiles.s3.amazonaws.com/Gelato+Whitepaper+V1.0,+May+2021+(02).pdf)\n　\n　\n***CoffeeTimes: Can you give any words to the Japanese audience? Do you have any impressions on Japanese crypto scene? I think I saw a photo somewhere of when the team came to Tokyo***\n\nGelato: Gelato had a strong Japanese community right from the start. We are super thankful for that and we definitely want to connect more with them. If any Japanese developers want to automate smart contracts, please don’t hesitate to reach out. Unfortunately, we have not been to Tokyo yet. However, after COVID settles down we will definitely go. \n\nOur team is very multinational, we have members from Switzerland, US, Germany, France, China, Australia, and Egypt. However, we don’t have a Japanese team member yet. We are currently actively looking for frontend and backend developers with web3 experience, so if anybody in our Japanese community wants a job with us please apply here: https://angel.co/company/gelato-network! \n　\n　\n***(CoffeeTimes: By the way, why is the name Gelato? The bottom half of the logo also looks like Ethereum🍦)***\nGelato: Because everybody loves Gelato! \n　\n　\n***CoffeeTimes: Thank you for taking your time! Where can we learn more about Gelato?***\n\nGelato: \n🐦 [Twitter](https://twitter.com/gelatonetwork) | 💬 [Telegram](https://t.me/joinchat/HcTaOxJ0_FjU-r34vbvK8A) | 📺 [Discord](https://t.co/SY3zIfyalk?amp=1)\n🍦hi@gelato.digital\n🍦http://gelato.network/\n🍦[Gelato Whitepaper v1.0](https://bit.ly/3y8ccnw\n)\n\n\n\n", "timestamp": 1621207308, "digest": "krM9_r-1fGjtLWXt0uTQipnwQZHvu-k2Eq9xrXr_pP4", "contributor": "0x7853Eabb6cFa980eBfD27e3F77e69590EA53c0b7"}
{"id": "AcRW9oVfFAufqPFAAld-NGwTNkZaxNOZ6d-YNYOj2E0", "title": "Gelatoインタビュー/Uniswapグラントwave3", "body": "### Gelatoインタビュー\n\n先週Gelatoがトークン発行することを発表しました。2019年から良いプロジェクトだと思って見てましたが、今回インタビューをすることができましたのでぜひ読んでみてください。インタビュー原文である英語は [Mirror上](https://bspeak.mirror.xyz/) で公開します。\n\nインタビューの前に、Gelatoとは何かを簡単に説明しておきます。\n\n#### **概要**\n\nGelato Networkは、Ethereum上でスマートコントラクトの「実行」を自動化するプロトコルで、ボットのインフラです。\n\nGelatoを使うと、開発者が「自動化されたアプリ」を簡単に構築でき、インフラ構築や運用にも悩まされません。また監査済みコードの再利用が可能になる点も利点です。\n\nここでいう「自動化されたアプリ」とは、例えば\n\n*   DEX上で毎週 ETHを購入する\n*   毎週 自動でイールドファーミングのClaimを行う\n*   UniswapなどのAMMで指値注文を行う\n\nなどがあげられます。\n\nまたDeFiプロトコルで、ETH価格やCDP（負債ポジション）の担保率などの条件に基づいて、ユーザの代わりにトランザクションを作ることもできます。実際にInstadappsの連携によって、MakerDAO, Compound, Aaveなどの中からもっとも清算価格が良いものに自動で切り替える、ということもできます。\n\n参照：<https://medium.com/gelato-network/instadapp-turns-on-defi-automation-powered-by-gelato-network-c964a5a61791>\n\nどのような種類のコントラクトの自動実行をするかは、開発者の想像力次第で工夫できます。\n\n実際に、彼らがショーケースとして作っている [Sorbet Finance](https://www.sorbet.finance/order)では、Uniswap上で指値注文ができます。また最近では、DCA（ドルコスト平均法）による取引もできるようになっています（ちなみに約定されるとサプライズがあります）。\n\n#### **Uniswap v3 への応用**\n\n先日ローンチされたGelato v2は、Uniswap v3のようなプロトコルを補完するように作られているため、サードパーティがGelatoを使って開発できる余地が多くあります。\n\n例えば、手数料のプールへの再投資、LP NFTをラッピングしERC20への変換、LP価格帯の自動化なども考えられます。\n\n#### **GELトークン**\n\nそして今回GELトークンを発行し、DAO化していくことを発表しました。GELトークンの目的は2つあります。\n\n1.  ガバナンス\n2.  ステーキング&スラッシング\n\nGelato Network上のボット（Executorボット）にGELトークンをステークさせるようにインセンティブ付けし、悪いことをした際に没収（スラッシュ）することで、トランザクションを検閲したり、フロントランするような悪質な行為を防ぐ目的があります。\n\nGelato DAOはこれら全体の決定権を持ち、Executorボットの行動を監視する義務を持ちます。またこれによって将来的にはオフチェーンの条件に基づいて取引を実行するなどの機能を提供することもできます。\n\nトークンの配布や分配についてはまだ発表されていませんが、Gelatoは2020年9月に$1.2Mドルを調達しています。IOSG Ventures、 Galaxy Digital, Christopher Jentzsch, D1Ventures, Ming Ng、 MetaCartel Ventures、The LAO などが参加しています。\n\nそれでは以下、インタビューになります。\n\n　\n　\n#### **Gelatoインタビュー by Bspeak!**\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fd70fdb99-c369-4868-8894-ba441b8ede9e\\_990x560.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fd70fdb99-c369-4868-8894-ba441b8ede9e\\_990x560.png)\n\n***CoffeeTimes: Hello Gelato team!🍦 Gelato Networkとは何か、簡単に教えていただけますか？***\n\n創業者Hilmar: [Gelato Network](http://gelato.network/)は、トランザクションの自動化を求める開発者の需要と、ボットの分散型ネットワークの供給をマッチさせるためのオープンマーケットプレイスです。開発者は自動化されたDappsを構築することができ、ボット運営者はそのような自動化に必要なインフラを運営することで収益を得ることができます。さらに、Gelatoのエコシステムとコミュニティの重要なメンバーには、マーケットプレイスに必要な技術の多くを開発・配布しているチームも含まれています。\n\nまた、Gelatoのネイティブトークンである$GELがリリースされた後は、その保有者がネットワークの運営に重要な役割を果たし、その成功と将来への道筋を形作ることになります。\n\n***CoffeeTimes: ありがとうございます。元々このプロジェクトを始めたきっかけは何だったんですか？***\n\nHilmar: 私たちは、2019年5月にGnosis Ecosystem Fund（GECO）からの助成金を受けて、このプロジェクトを開始しました。\n\n参考： <https://blog.gnosis.pm/gnosis-ecosystem-fund-update-ii-9bea803a97c8>\n\n当初、私たちは当時のGnosisのDutchX取引所の、特定の側面を自動化することに取り組みました。しかし、すぐにdappsの自動化の必要性がどこにでもあることに気づきました。\n\nこれまでのWeb2ユーザーは、中央サーバーが多くのデータを管理しているおかげで実現できている「自動化されたユーザー体験」に完全に慣れています。\n\n一方、Ethereumや一般的な分散型ブロックチェーンでは、この素晴らしいユーザー体験を再現することは非常に困難です。というのも、より良いUXと引き換えに、データや資産の所有権を中央サーバーにわたすことをしたくないからです。\n\nこれでは、分散型ウェブのメリットのほとんどが犠牲になってしまいます。そこで2019年の夏、私たちは開発者とユーザーのために、自分の鍵や資金の管理を手放すことなく、洗練された自動化されたユーザー体験を備えた分散型アプリケーションレイヤーを実現するソリューション構築に着手し、Gelato Networkが誕生しました。\n\n[![2021年: LuisとHilmar](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fcdd32568-2cad-4878-89ce-02cfabf71dde\\_1200x801.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fcdd32568-2cad-4878-89ce-02cfabf71dde\\_1200x801.png)\n\n\n\n***CoffeeTimes: DEXの最適化から始まったんですね。それでは、Sorbet Financeとは何ですか？Gelato上の別プロジェクトですか？***\n\nHilmar: そうですね、[Sorbet Finance](https://www.sorbet.finance/)（シャーベット・ファイナンス）は、Gelatoネットワークをバックエンドに利用した独自のプロジェクトです。Sorbetの場合、Gelatoネットワークを使ってDEXの価格を常に監視し、ユーザーが指定した目標価格に達した時点でユーザーの指値注文を実行します。\n\nこのようにして、ユーザーは自分の資金を完全にコントロールすることができます。また、SorbetにはDollar Cost Averaging（ドル・コスト平均法）という機能があり、トークンの一部をいくつかの塊や時間間隔に分けて自動的に売却することで、取引ごとのスリッページを減らすことができます。Sorbetのように、Gelato Networkを使ってdappのある側面を自動化するクールな機能は、どの開発者でも作ることができます。\n\n***CoffeeTimes: いくつかのコラボレーションを発表していますね。近い将来、他のコラボレーションが期待できますか？***\n\nHilmar: はい、もちろんです。Ethereum、Polygon、BSCなど、有名なプロジェクトやまだ有名ではないプロジェクトの多くと緊密に連携しています。ほとんどすべてのDeFi開発者が自動化を必要としており、私たちはそれを手助けするためにここにいます。\n\n***CoffeTimes: 楽しみにしています。あと最近、GELトークンを発表しましたね。GELトークンの目的は何ですか？ もし、Gelato上のボットが悪意を持って行動すると、重大な問題につながると思いますが、GELトークンのスラッシングは、それを十分に防ぐことができますか？***\n\nHilmar: GELトークンは、\n\n1.  ネットワーク参加者をインセンティブ付けし、ガバナンスし、監視するため\n2.  ネットワークリソースの効率的な割り当てため\n\nに使用されます。\n\n１つ目から話しますね。\n\nGelato Networkにインフラサービスを提供して収益を得ようとするボットは、多くの$GELトークンをステークする必要があります。これにより、Gelatoの上に構築されるより複雑なユースケースへの扉が開かれることになります。そのようなユースケースでは、自動化を実行するボットに対するトラストが必要になるかもしれません。なので、このようなユースケースでは、ボットにトークンをステークさせ、悪意のある行動した場合に没収されるようにすることが不可欠です。\n\nそうはいっても、多くのユースケースでは、デフォルトでトラストレスになるように実装することができ、その結果このようなステークやスラッシングのメカニズムに頼る必要がないということは言及しておくべきでしょう。\n\nさらに$GELトークンは、ネットワークにトラフィックをもたらすすべてのネットワーク参加者、開発者、ボット、ユーザーなどに積極的なインセンティブを与えるためにも使用されます。\n\nGELのもう一つの用途は、ネットワークインフラのリソースを、ちゃんと必要とするdappsやユーザーに効率的に割り当てることです。Ethereumをはじめとするチェーンは、通常、リソースに制約があります。1つのブロックに収めることができるトランザクションの数は限られています。\n\nそのため、Gelatoのような分散型ネットワークをスケールアップするためには、「トランザクションのタイミングの優先順位に関する決定」は、dappの開発者やトランザクションを送信するボットが行わなければなりません。このリソース配分による優先順位決めのメカニズムで、高い順位を獲得するために、開発者とエンドユーザーは、$GELをロックできる機能があり、トランザクションに異なる重みを割り当てることができるようになります。\n\nその結果ボットは、トークンをロックした開発者やユーザーに、より多くのリソースを割り当てるというインセンティブ付けされることになります（結果としてスケールしやすくなります）。\n\n***CoffeeTimes: では（他の多くのプロジェクトと同様に）トークンの配布が大切だと思いますが、どのような計画をしていますか？***\n\nHilmar: 現時点では詳細をお伝えできませんが、今年の夏の初めに$GELトークンのパブリックセールを行う予定です。詳細につきましては、近日中にMediumおよびTwitterアカウントにて発表するので、”Stay tuned”, ご期待ください。\n\n***CoffeeTimes: そうですか。ではGELについて、配布割合やトークノミクス（ロックアップや供給スケジュール）はすでに決まっていますか？***\n\nHilmar: トークンのアロケーションとトークノミクスの詳細については、近日中に発表する予定ですが、現在はまだ公開されていません。\n\n***CoffeeTimes: ブログ記事で、DAOになることを読みました。GelatoDAOはどうやって持続可能になる予定ですか？トランザクションに応じてプロトコル手数料を取るのかと想定していますが、モデルについて教えてください。***\n\nHilmar: GelatoDAOは、Gelato Networkのガバナンスと維持することに利害を持つ人々によって管理されます。例えば、Gelatoを使って自動化をしている開発者は、Gelatoのコアチームが今後のリリースでどの機能を優先すべきか、ボットが請求できる手数料はいくらか、特定のボットが悪さをした場合にネットワークから切り離すべきかどうかなど、重要な意思決定に参加することに強いインセンティブがあります（変な決定だと困るので）。\n\nそのため多くの参加者は、純粋に合理的な自己利益のために、Gelatoを着実に成長させ、そのためにDAOに参加する、ということが自然になります。将来的には、DAOは少額のネットワーク手数料を保持することもできますが、そのメンバーシップの大部分はネットワーク参加者で構成される可能性が高いため、最終的な手数料支払い者はこの決定を自ら大きくコントロールすることになるでしょう。\n\n***CoffeeTimes: DAOといえば、Gelatoは、Gnosisや他のDAO（TheLAO / MetaCartel Ventures）と良い関係を築いているように見えるのですが、どのようにして連携を始めて、関係を深めていったのでしょうか？***\n\nHilmar: MetaCartelとは、2019年後半に彼らからの助成金を申請し、第三段（WaveⅢ）の枠に選ばれたことで、早い段階で提携しました。\n\n参考： <https://medium.com/metacartel/metacartel-cohort-1-6336cdca05db>\n\n[Peter Pan](https://twitter.com/pet3rpan\\_)（1kx、MetaCartel）とは、ベルリンのクリプト・コワーキングスペース「Full Node」で最初から私たちの隣に座っていたんですが、最終的にはオンラインで彼と知り合いになりました。\n\n彼はとても親切でGelatoに興味を持ってくれ、2020年夏の終わりにシード資金調達をクローズする際にも本当に助けてくれました。The LAOもシードラウンドに参加しており、AaronやPriといったLAOのメンバーや、PeterやVictorといったMetaCartelのメンバーとも頻繁に連絡を取り合っています。\n\n彼らはいつも、法的、戦略的、またはコミュニティに関する質問で私たちを大いに助けてくれます。DAOに積極的に参加し、メンバーと話をすることは、すべてのクリプト起業家がすべき良いことだと思います。\n\n***CoffeeTimes: 良いストーリーですね。では未来の話ですが、今後の数ヶ月に予定していることを簡単に教えていただけますか？***\n\nHilmar: わっ...たくさんありすぎるんですが、簡単に説明しましょう。この夏の計画は、以下の通りです。\n\n*   プロダクトの提供、プロダクトの提供、それとプロダクトの提供です：つまりEthereum、Polygon、BSC、Fantom等に新しい自動化機能を搭載することです。Sorbetの指値オーダーをすべてのAMMに搭載し、Gelatoを統合して清算保護や自動送金、出金、入金などを行うプロトコルをどんどん増やしていきたいと考えています。\n*   GELトークンのローンチ \n*   Gelato DAOを立ち上げ、どの機能を優先させるかを決めるために、$GELホルダーの参加を開始します。\n*   GELを使った開発者マイニングプログラムで、より多くの開発者にGelato上で構築してもらいます。\n\nぜひTelegramやDiscordのコミュニティに参加して、更新情報をゲットしてください。また開発者であれば、GELトークンセール後に開始される開発者マイニングプログラムに参加する機会もあります。\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fc5cada4a-112e-44d0-a5e3-e91c1c84c661\\_623x594.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fc5cada4a-112e-44d0-a5e3-e91c1c84c661\\_623x594.png)\n\nRoadmap：[WhitePaper v1.0](https://aristaticfiles.s3.amazonaws.com/Gelato+Whitepaper+V1.0,+May+2021+\\(02\\).pdf)\n\n***CoffeeTimes: 最後に日本語で読んでる人たちに向けて一言お願いします。日本のシーンについて何か印象に残っていることはありますか？チームが東京に来たときの写真をどこかで見たような気がします。***\n\nGelatoには、最初から強力な日本のコミュニティがありました。私たちはそのことにとても感謝していますし、もっとつながりたいと思っています。スマートコントラクトを自動化したいと考えている日本の開発者がいたら、遠慮なく連絡してください。\n\nあ、残念ながら、私たちはまだ東京に行ったことがありません。でも、COVIDが落ち着いたら、必ず行きますよ。\n\n私たちのチームは非常に多国籍で、スイス、アメリカ、ドイツ、フランス、中国、オーストラリア、エジプトのメンバーがいます。ただ、日本人のメンバーはまだいません。現在、web3の経験を持つフロントエンドとバックエンドの開発者を積極的に募集していますので、もし日本のコミュニティの中で私たちと一緒に仕事をしたいと思っている人がいたら、こちらから応募してください： <https://angel.co/company/gelato-network> !\n\n***(CoffeeTimes: ところで、なぜGelatoという名前なんですか？ロゴの下半分はEthereumにも見えますが 🍦)***\n\nHilmar: だって、みんなジェラートが好きなんだもん! \n\n***CoffeeTimes: お忙しい中ありがとうございました。Gelatoについてもっと知りたい場合はどこに行けばいいですか？***\n\nHilmar: \n\n🐦 [Twitter](https://twitter.com/gelatonetwork) | 💬 [Telegram](https://t.me/joinchat/HcTaOxJ0\\_FjU-r34vbvK8A) |🍦[Discord](https://t.co/SY3zIfyalk?amp=1)\n\n🍦Email: hi\\@gelato.digital\n\n🍦<http://gelato.network/>\n\n[Gelato Whitepaper v1.0](https://bit.ly/3y8ccnw)\n\n　\n　\n■ Last Week in Crypto\n\n１．<https://www.notion.so/UGP-Wave-3-V3-for-the-People-48a7cd1e72cc48f4baec815bd0b4bb56>\n\nUniswapが、10個のプロジェクトに対して合計で $448,300ドルのグラント（助成金）を提供しました。今回の選ばれたプロジェクトは以下になります。\n\n#### **ツール**\n\n・v3で自動取引の戦略やコントラクトを可能にするオープンソースpythonラッパー\\\n$20,000\n\n・L1 <> L2のインターロップ・スワップ\\*を可能にする [Nova Contract](https://docs.rari.capital/nova/) のOpen Zeppelin監査（Rari Capital）\n\n\\*コンポーザビリティとトラストレスという性質を保ったまま、L2からL1のコントラクトや流動性とやり取りができるようにする仕組み\n\n$52,000\n\n・UNIガバナンスのためのツールとUI（[John Palmer](https://twitter.com/john_c_palmer/)）\\\n$51,000\n\n・v3流動性マイニング・インセンティブ・コントラクトの作成と監査（[Omar Bohsali](https://github.com/omarish)）\n\n$30,000\n　\n　\n#### **ユーザビリティ**\n\n・[Rabbit Hole](https://rabbithole.gg/)\\\nUNI初心者に、v3に慣れるインセンティブを与える学習モジュール\\\n$20,000\n\n・Timothy Luke （UGP Headless Branding）\\\nUniswapグラントプログラムのブランディング施策\\\n$25,000\n　\n　\n#### **募集・チャレンジ**\n\n・v3アナリティクスのバウンティ（Flipside & Duneアナリティクス）\\\nFlipsideとDuneの両方で、v3アナリティクスのためのデータサイエンティストを探す\n\n$50,000\n\n・その他のインターネットコミュニティ調査\\\nEthereum財団との共同出資で、コミュニティの活性化、エンゲージメントのポイント、施策が失敗した場所などを調査。\n\n$16800\n　\n　\n#### **スポンサー**\n\n・UNIFest\\\nUNIコミュニティが共同で制作したバーチャルコンサート\\\n$18,500\n\n・Team Secretのスポンサー\\\nDAO初のEsportsチームのスポンサー\\\n$125,000\n\nとなります。Uniswap v3のローンチは最低限の機能でのローンチにすぎず、自動化や流動性マイニングコントラクトなどが整っていけば、さらに使われるようになりそうです。\n　\n　\n２．[UNI should become an oracle token](https://gov.uniswap.org/t/uni-should-become-an-oracle-token/11988)\n\nEthereum創業者のVitalik氏が、「UniswapのUNIトークンは、DeFiのためのオラクルトークンになるべき」とUniswapのフォーラムで提案しました。\n\nDAIなどのアルゴリズム型ステーブルコイン、合成資産、担保ローンなど、DeFiのいくつかの分野は価格オラクルに依存していて、UniswapとUNIはそのようなオラクルを提供するために取り組むべきだ、という内容です。\n\nオラクルで最も有名なChainlinkは、素晴らしいが、別の解決策の余地があると述べています。例えば、Chainlinkのインセンティブは、分散型オラクルであるAugurほどクリーンではなく、Chainlinkには誤ったデータを提供した参加者がペナルティを受けるような自動化されたメカニズムがないことを指摘し、より堅牢なデータを得るために、UniswapのオラクルをAugurやUMAのようなモデルにすることを提案しています。\n\nそして「インセンティブの最適化と攻撃コストの最大化に焦点を当てた、よりミニマムな代替手段でChainlinkを補完することが望ましい」とVitalikは述べています。\n\n#### **UNIがオラクルトークンとして適している理由**\n\nUNIは、時価総額も高く、分散型オラクルのトークンとして「最適なポジション」にあるとVitalikは述べています。\n\n分散型オラクルは、時価総額の大きいトークンをベースにしなければならない、とVitalikは言っていますが、これは攻撃コストを高くするためです。トークンの時価総額が高ければ、攻撃を仕掛けるために必要な量のトークンを手に入れることが極めて困難になり、攻撃によって得られる対価よりも、トークンを買い占めるコストが大きくなってしまい、攻撃することが合理的でなくなり→攻撃を未然に防げる（はず）ということです。\n\nDeFiオラクルのセキュリティが高まっていけば、より多くの合成資産がオンチェーンで取引されるようになり、Uniswapも使われればより手数料を得ることに繋がり、Uniswapコミュニティにもメリットがあるという認識です。まだあくまで提案段階で、フォーラムではUMA創業者なども含めて賛否両論の議論がされています。\n\nChainlinkのアンバサダーとして知られるChainLinkGodも意見を投稿していて、以下のようにコメントしています。\n\n> 「Chainlinkはステークとスラッシュによる追加のクリプトエコノミク的なセキュリティ案は現在検討中で、最近ホワイトペーパーが出たChainlink 2.0で実装される予定です。\n>\n> これらのアプローチは攻撃のコストを高めます。そのため、Chainlinkの価格フィードは、AaveやSynthetixなどの高価値のDeFiスマートコントラクトや、ReflexerやAmpleforthなどのアルゴリズム・ステーブルコインのセキュリティを確保するのに、すでに十分に適していると思います」\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F69332356-b3c6-47ec-a3a7-fc3bb7a5ad28\\_779x444.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F69332356-b3c6-47ec-a3a7-fc3bb7a5ad28\\_779x444.png)\n\nUniswap側は「このような実験は非常に奨励されており、この方向での投稿の傾向を見たいと思っています。」とグラントページに記載しています。\n　\n　\n３．[Here's how US exchanges have been deciding which cryptos are securities](https://www.theblockcrypto.com/linked/104515/crypto-ratings-council-publishes-rubric)\n\n[Crypto Rating Council](https://www.cryptoratingcouncil.com/)（CRC）は、暗号通貨が証券であるかどうかを鑑定するための[評価基準](https://assets.website-files.com/5d766f847039d787f8a99a02/609998f89636a3f99c8429c6\\_CRC%20Securities%20Law%20Framework.pdf)を公開しました。\n\nCrypto Rating Councilは、トークンが証券であるかどうかを判断する基準をまとめるために、クリプトの大手企業の多くを束ねる業界団体です。メンバーには、Coinbase、Anchorage、Kraken、Circleなどがいます。\n\nちなみにCRCのページに行くとわかりますが、これまでに27種類のトークンの評価が発表されています。しかしその方法を公開するのは今回が初めてです。 \n\nもともとCRCは、[2019年10月の発足](https://bspeak.substack.com/p/crypto-ratings-councileossexbravevpn0)し、公に向けた活動は最近なかったのですが、今回久しぶりに発表があったことになります。\n　\n　\n４．[Polkadot platform for DeFi derivatives lands $6.4 million in seed funding](https://www.theblockcrypto.com/linked/104623/polkadot-platform-for-defi-derivatives-lands-6-4-million-in-seed-funding)\n\n[dTrade](https://dtrade.org/)は、Polkadot上で構築される最初のデリバティブ取引所を目指し、Three Arrows Capital、DeFiance Capital、Polychain、ParaFi Capital、などから $6.4Mドルを調達しました。\n\nオンチェーンで決済するレバレッジ取引を可能にするとのことで、Edgewareのテストネットで稼働中であり、数ヵ月後には一般向けのテストネットも稼働する予定です。\n\nまたdTradeのネイティブDETトークンは6月に稼働する予定で、\n\n*   トークンの55％は、コミュニティ財源、流動性マイニング等\n*   残りの45%は、投資家、チーム、アドバイザー\n\nという大まかに半分がコミュニティ、半分がコアチームという割合のようです。\n\nまた保険マイニングも準備していて、USDCをステークしたユーザーに、DETトークンで報酬を与えると創業チームは述べています。これは [DerivaDEX](https://derivadex.com/) と同じ仕組みですが、デリバティブのDEXも今後競争が激しくなっていきそうです。\n\nこのラウンドには他に、Huobi、Mechanism Capital、Magic Ventures、Bixin Ventures、IOSG Ventures、Hypersphere Ventures、Fenbushi Capitalが参加しまました。\n\nさらに、Alameda Research、CMS Holdings、Wintermute、MGNR、PNYX、Kronos、Altonomy、LedgerPrimeが、dTradeでの流動性をサポートするようです。\n　\n　\n５．[DEX aggregator ParaSwap raises $3 million in new funding](https://www.theblockcrypto.com/linked/104308/decentralized-exchange-dex-aggregator-paraswap-seed-extension)\n\nDEXのアグリゲーターである[ParaSwap](https://paraswap.io/)は、シード延長ラウンドで $3Mドルを調達しました。\n\nBlockchain Capital、White Star Capital、DeFi Allianceがリードし、Yearn Financeの創業者であるAndre Cronje、Curve Financeの創業者であるMichael Egorov、Dune Analyticsの創業者であるFredrik Hagaが参加しました。\n\n新たな資本で、他のブロックチェーンやレイヤー2をサポートしていく予定で、Avalanche、Arbitrum、Fantomの各ブロックチェーンや、ZkSyncやOptimismなどのL2が含まれるとParaSwap創業者は述べています。\n\n今回、株式による調達なのか、SAFT（Simple Agreement for Future Tokens）の販売なのかは明らかになっていません。またParaSwapが独自トークンをローンチするかもまだ分かっていませんが、そのうちトークンを発行するのだと推測しています。\n　\n　\n６．[Diem leaves Switzerland for US, announces plan to work with Silvergate on dollar-backed stablecoin](https://www.theblockcrypto.com/linked/104696/diem-leaves-switzerland-for-us-announces-plan-to-work-with-silvergate-on-dollar-backed-stablecoin)\n\nDiem（元Libra）は、スイスの金融監視機関であるFINMAへの登録計画を断念し、米国に戻ることを発表しました。\n\nなかなかうまくいっていないように見えますが、この移転に加えて、米国金融犯罪執行ネットワーク（FinCEN）に登録し、待望の米ドル建てステーブルコインの発行体としてシルバーゲート銀行と提携したことも発表しました。CNBCでは、米国に戻ったあとの新本社がワシントンD.C.にあると報じています。\n　\n　\n７．[Thiel, Novogratz Back $10B Funding for Block.one’s New Crypto Exchange Subsidiary](https://www.coindesk.com/thiel-novogratz-back-10b-funding-for-block-ones-new-crypto-exchange-subsidiary)\n\nEOSブロックチェーンの開発元であるBlock.oneは、$10Bドルの資金調達をした新しい取引所Bullish Globalという子会社を発表しました。今年中にサービス開始を予定しています。\n\nPeter Thiel、Alan Howard、Mike Novogratz、Moore CapitalのLouis Bacon、Pacific Century GroupのRichard Li、Apeiron Investment GroupのChristian Angermayerなど、多数の著名な投資家が出資しています。また、日本の野村證券も投資家として名を連ねています。\n\nこれらの出資者が、$300Mドルのラウンドに参加し、残りはBlock.oneが$100Mドルの現金、16万4,000ビットコイン（約$9Bドル）、2,000万EOSトークン（約$200Mドル）の形で資金をいれています。またThiel、Howard、Li、Angermayerはアドバイザーとして参加しています。\n\nBullish Global はEOSチェーンをベースに、中央集権型と分散型の両方の取引所のメリットを提供するそうです。\n\nBlock oneは、「新しい自動マーケットメイキング、レンディング、ポートフォリオ管理ツールをユーザーに提供し、これまで伝統的な金融の既存プレイヤーが独占していた機能を提供するとともに、流動性をもたらす」と以下のようにコメントしています。\n\n> “The Bullish exchange will offer new automated market making, lending, and portfolio management tools to its users to deliver functionality that has previously been monopolized by incumbent players in traditional finance, while driving deeper liquidity to digital assets.”\n\n今回調達というよりは、ほとんどは取引所上で売買を可能にするため（マーケットメイクをするため）に暗号通貨を注入した、というほうが正しいとは思います。いずれにしても金額も大きく、何を計画しているのか気になります。\n　\n　\n８．[DAO Raises $7M to Acquire and Fractionalize NFT Collections](https://www.coindesk.com/dao-raises-7m-to-acquire-and-fractionalize-nft-collections)\n\nMulticoin Capitalや、世界一のYouTuberであるMr.Beastなどが、[JennyDAO](https://jennynft.io/)という新しいDAOに出資し、ローンチされました。その他にも、0xb1, IOSG Ventures, Moonrock Capital, Morningstar Ventures, Spartan Group, 3Commas, Vendetta Capital, Hillrise Ventures, Building Blocksなどが投資しています。\n\nこれでJennyDAOは$7Mを調達し、これらは分割されたレアなNFTを購入するために利用されます。これらは、[Unicly](https://www.unic.ly/)というプラットフォームで行われます。\n\nライトペーパー：<https://github.com/JennyMetaverse/Litepaper/blob/main/JENNY%20Token%20Litepaper.pdf>\n　\n　\n９．[Project Galaxy Completes Seed Round with Leading Investors](https://projectgalaxy.medium.com/project-galaxy-completes-seed-round-with-leading-investors-548ecaf4a30)\n\n[Galaxy](https://galaxy.eco/) というNFTプロジェクトが、シード資金調達を完了しました。\n\nこの投資は、Multicoin Capital、Divergence Ventures、Hard Yaka、Blockchain.com Ventures、IOSG、Draper Dragon、Multiplex Ventures、Fifth EraなどのVCや、著名なファウンダーが参加しています。\n\nプロジェクト側が、コミュニティの活動を高めたり、離脱を防止するために特典としてNFTを使うためのインフラを提供します。具体的には、オンチェーンデータを使って、NFTの作成、配布、ゲーム化をすることができるそうです。\n\nNFTが単なるコレクターズアイテムではなく、身分証明書や信用証明書として使うことができ、今後EthereumとBinanceスマートチェーン上のいくつかのプロジェクトが、Galaxy上で近々NFTキャンペーンを開始する予定になっています。\n　\n　\n１０．[Deribit founders lead $2.5 million round for decentralized referral network Attrace](https://www.theblockcrypto.com/post/104649/deribit-founders-funding-decentralized-referral-network-attrace)\n\nリファラルのシステムを開発している[Attrace](https://attrace.com/)は、$2.5Mドルを調達しました。Deribit創業者が主導し、Coinstone Capitalやその他の投資家が参加しました。\n\n2018年に設立されたAttraceは、アフィリエイトの中間業者を排除するべくプロジェクトを開始し、独自ブロックチェーンを構築していましたが、どのチェーンでも利用できるミドルウェアにピボットしています。\n\n今後2ヶ月以内にローンチされる予定で、ネイティブトークンであるATTRもその時にローンチされる予定です。テストネットを見てみると、NFTを紹介して買われるとコミッションがもらえるようなアプリを用意しているようです。\n　\n　\n１１．[Aurora launches on NEAR Protocol](https://near.org/blog/aurora-launches-near/)\n\n[Aurora](https://aurora.dev/)というプロジェクトがローンチしました。まだブリッジなどの機能は使えませんが、Ethereum開発者が、Ethereumと互換性を持ち、スケールする環境をすぐに使うことができます。\n\nAuroraはNEAR上で動作しているため、シャーディングなどのNEARの機能を活用しながら、以下の２つの要素で構成されています。\n\n*   SolidityとVyperスマートコントラクトのデプロイを可能にする開発環境\n*   Ethereum <> Auroraの間でトークンとデータの転送ができるAurora Bridge（NEARのRainbow Bridgeをベース）\n\nさらに、注目すべきは、Aurora内の基軸通貨（ネイティブ残高）をETHのままにしている点で、トランザクション手数料はETHになります。EthereumのL2の多くは、ネイティブトークンを取得する必要がありますが、AuroraはETHで利用することができます。これを実現するフローは以下のようになっています。\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4162fbd0-8d71-47f6-9627-1a351c3f1b9d\\_1200x717.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4162fbd0-8d71-47f6-9627-1a351c3f1b9d\\_1200x717.png)\n\nこの方法は、ユーザー側から見ると、ETHを支払うだけのように見えますが、実際に手数料に使用されるのはNEARトークンであり、代理となるノード（RPCノード）はユーザーとNEARブロックチェーンの間のリレー役として機能します。\n\n今年の夏には、AuroraDAOが形成され、そのDAOが決定すればトークンがローンチされる予定です。\n\n----\n以下の『Subscribe』を押すと毎週月曜6:30に届きます。ご登録ください☕\n\nぜひシェアお願いします🎉🎉\n\n----\n\n**☕ **Twitter：[@CoffeeTimesTW](https://twitter.com/CoffeeTimesTW)\n\n☕ メール：thecoffeetimes871\\@gmail.com\n\n**☕ **バックナンバー：\n\n\\#177 [Bspeak! 2021年5月10日号 Mirrorの新機能/ NFT鑑定 UpshotOne/ Uniswap v3 NFT](https://bspeak.substack.com/p/mirror-nft-upshotone-uniswap-v3-nft)\n\n\\#176 [Bspeak! 2021年5月3日号 Eth2.0マージ後のロードマップ/ Anomaのインターオペラビリティ](https://bspeak.substack.com/p/eth20-anoma)\n\n\\#175 [Bspeak! 2021年4月26日号 プライバシーアプリが動くAleo / Chainlink 2.0](https://bspeak.substack.com/p/aleo)\n\n\\#174 [Bspeak! 2021年4月19日号 Covalentの概要とトークンセール/ Uniswapの新グラントプログラム 等](https://bspeak.substack.com/p/covalent-uniswap-)\n\n\\#173 [Bspeak! 2021年4月12日号 FEIで起こっていること/ Parachain Lease Offering (PLO)](https://bspeak.substack.com/p/fei-parachain-lease-offering-plo)\n\n\\#172 [Bspeak! 2021年4月5日号 EPNSのAMA / Bakktアプリでできること](https://bspeak.substack.com/p/epns-ama)\n\n\\#171 [Bspeak! 2021年3月29日号 Uniswap v3で実現される機能 / Mina のローンチとセール](https://bspeak.substack.com/p/uniswap-v3-mina-)\n\n\\#170 [Bspeak! 2021年3月22日号 エンジェル投資を加速させるSyndicate Protocol / オンチェーン分析の真相](https://bspeak.substack.com/p/syndicate)\n\n\\#169 [Bspeak! 2021年3月15日号 流動性提供の自動リバランス / FEI のジェネシス・グループ](https://bspeak.substack.com/p/daohaus-fei-)\n\n\\# 168 [Bspeak! 2021年3月8日号 Ecoのビジネスモデル / NFT に投資するDAO](https://bspeak.substack.com/p/eco-nft-dao)\n\n\\# 167 [Bspeak! 2021年3月1日号 Mirrorのレース / Ethereum の EIP1559とは何か?](https://bspeak.substack.com/p/mirror-ethereum-eip-1559-)\n\n\\# 166 [Bspeak! 2021年2月22日号 クロスチェーン通信をシンプルにするAxelar Network / 価格ペグしない安定通貨 RAI](https://bspeak.substack.com/p/axelar-network-rai)\n\n\\#165 [Bspeak! 2021年2月15日号 成果に連動するエアドロップ手法/ クロスチェーンとブリッジ](https://bspeak.substack.com/p/-)\n\n\\#164 [Bspeak! 2021年2月8日号 デジタル空間のIDレイヤー「CeramicとIDX」/ SynFutures の特徴](https://bspeak.substack.com/p/ammsynfuturesidceramicidx)\n\n\\#163 [Bspeak! 2021年2月1日号マーケット付きNFTを作れるZoraプロトコル/DODOクラウドプーリングの新規性](https://bspeak.substack.com/p/nftzoradodo)\n\n\\#162 [Bspeak! 2021年1月25日号 MirrorのNFTクラウドファンディング / PowerIndex v2 の特徴](https://bspeak.substack.com/p/mirrornft-powerindex-v2-)\n\n\\#161 [Bspeak! 2021年1月18日号 Feiの価格安定の仕組み/Zapperはトークンを発行するか](https://bspeak.substack.com/p/fei)\n\n\\#160 [Bspeak! 2021年1月11日号 ステーブルコインの3つのリスク/ NFTXのローンチ](https://bspeak.substack.com/p/3-nftx)\n\n\\#159 [Bspeak! 2021年1月4日号NFT\\*DeFiゲームIlluvium / OpynのGamma protocol](https://bspeak.substack.com/p/nftdefiilluvium-opyngamma-protocol)\n\n\\#158 [Bspeak! 2020年12月28日号 1inchのトークンモデル/ Furucomboのトークン発行 - Bspeak! - 暗号通貨/ブロックチェーン](https://bspeak.substack.com/p/1inch-furucombo)\n\n\\#157 [Bspeak! 2020年12月21日号 Compoundの独自チェーンの内容/DeFiのクレジット・ネットワーク/ Tornade Cashのトークン](https://bspeak.substack.com/p/compounddefi-tornade-cash)\n\n\\#156 [Bspeak! 2020年12月14日 Ethereum通知プロトコルEPNS/ カストディに保険をかける](https://bspeak.substack.com/p/ethereum-)\n\n\\#155 [Bspeak! 2020年12月7日 uGAS先物トークンでヘッジする/ BadgerDAO / Mirror Protocol](https://bspeak.substack.com/p/ugas-badgerdao-mirror-protocol-)\n\n\\#154 [Bspeak! 2020年11月30日号 DeFiプロトコル初の合併/ ETH2の目標達成](https://bspeak.substack.com/p/defi-eth2)\n\n\\#153 [Bspeak! 2020年11月23日号 MaskのイニシャルTwitterオファリング / USDCを利用した国外援助](https://bspeak.substack.com/p/mask-network-usdc)\n\n\\#152 [Bspeak! 2020年11月16日号 API3はChainlinkキラーか？/ L2資産が担保の融資 Liquid L2](https://bspeak.substack.com/p/api3chainlink-l2-liquid-l2)\n\n\\#151 [Bspeak! 2020年11月9日号 Eth2へのステーキング/ Arbiswapでロールアップを使う/ GYSRの配布](https://bspeak.substack.com/p/eth2-arbiswap-gysr)\n\n\\#150 [Bspeak! 2020年11月2日号 Keep3rプロジェクト / トークン配布手法『パラドロップ』](https://bspeak.substack.com/p/keep3r-)\n\n\\#149 [Bspeak! 2020年10月26日号 Audiusの$AUDIOトークン / 固定金利のレンディング市場がローンチ](https://bspeak.substack.com/p/audius-)\n\n\\#148 [Bspeak! 2020年10月19日号 Bancorの新しいAMMデザイン/LidoによるETH2.0のステーキング対応](https://bspeak.substack.com/p/bancorammlidoeth20)\n\n\\#147 [Bspeak! 2020年10月12日号 ブロックチェーンのGoogle『The Graph』のトークン・エコノミクス](https://bspeak.substack.com/p/googlethe-graph)\n\n\\#146 [Bspeak! 2020年10月5日号 DFININYのトークンモデル / 新しい rally のトークン配布手法](https://bspeak.substack.com/p/dfininy-rally-)\n\n\\#145 [Bspeak! 2020年9月28日号 Flowが可能にするブロックチェーンアプリ/Buyback\\&Makeのモデル](https://bspeak.substack.com/p/flow-buyback-and-make)\n\n\\#144 [Bspeak! 2020年9月21日号 トークンの規格化 / Avalancheのローンチ / Uniswapの今後](https://bspeak.substack.com/p/-avalanche-uniswap)\n\n\\#143 [Bspeak! 2020年9月14日号 BitcoinをDeFiに持ち込む / Ethereumとの互換性をもたせる](https://bspeak.substack.com/p/bitcoindefi-ethereum)\n\n\\#142 [Bspeak! 2020年9月7日号 yETHが金利を最大化する仕組み/待望のDeFiの保険](https://bspeak.substack.com/p/yethdefi)\n\n\\#141 [Bspeak! 2020年8月31日号 Polkadotの「DOTトークン」はどう価値を獲得していくのか](https://bspeak.substack.com/p/polkadotdot)\n\n\\#140 [Bspeak! 2020年8月24日号『DODO』はUniswapキラーとなるか/ NEARのEthereumブリッジの仕組み](https://bspeak.substack.com/p/dodouniswap-nearethereum)\n\n\\#139 [Bspeak! 2020年8月17日号 イーロン・マスクが宇宙の金を採掘するが、Bitcoinの供給は変わらない / $YAM 等](https://bspeak.substack.com/p/bitcoin-679)\n\n\\#138 [Bspeak! 2020年8月10日号 Uniswapはトークン発行するか/NEARのトークンセール 等](https://bspeak.substack.com/p/uniswapnear-)\n\n\\#137 [Bspeak! 2020年8月3日号 FTXのデリバティブDEX『Serum』発表 等](https://bspeak.substack.com/p/ftxdexserum-)\n\n\\#136 [Bspeak! yUSDのリリースと流動性マイニング/ETH2.0のレビュー](https://bspeak.substack.com/p/yusdeth20)\n\n\\#135 [Bspeak! Republic上の利益シェアトークン/ CoinList Seedの開始](https://bspeak.substack.com/p/republic-coinlist-seed)\n\n\\#134 [Bspeak! Coinbaseはトークンを発行するのか/ Anchorによる安定金利の貯蓄DeFi](https://bspeak.substack.com/p/coinbase-anchordefi)\n\n\\#133 [Bspeak! 2020年 7月6日号 Matchaのローンチ / EIP1559がETHの価値を高める](https://bspeak.substack.com/p/0x-matcha-)\n\n\\#132 [Bspeak! 2020年6月29日号 Avalancheのトークンセール/ Handshakeドメインを名前解決するブラウザ](https://bspeak.substack.com/p/avalanche-handshake)\n\n\\#131 [Bspeak! 2020年6月22日号 Coinbaseロゼッタ発表のねらい / WBTC Cafeのローンチ](https://bspeak.substack.com/p/coinbase-wbtc-cafe)\n\n\\#130 [Bspeak! 2020年6月15日号 UMAの合成トークンETHBTCと初の清算](https://bspeak.substack.com/p/umaethbtc)\n\n\\#129 [Bspeak! 2020年6月8日号 TokenSetのソーシャルトレーダー/DeversiFi2.0のローンチ](https://bspeak.substack.com/p/tokensetdeversifi20)\n\n\\#128 [Bspeak! 2020年6月1日号 Libraのマネタイズ/プライムブローカーの競争激化](https://bspeak.substack.com/p/libra)\n\n\\#127 [Bspeak! 2020年5月25日号 BlockFiへの攻撃/Bakktのアップデート](https://bspeak.substack.com/p/blockfibakkt)\n\n\\#126 [Bspeak! 2020年5月18日号 ETH2.0テストネットSchlesi / PoSの自主規制ガイドライン](https://bspeak.substack.com/p/eth20schlesi-pos)\n\n\\#125 [Bspeak! 2020年5月11日号 Ethereumキラーの競争/Bittrexの取引所トークン](https://bspeak.substack.com/p/ethereumbittrex)\n\n\\#124 [Bspeak! 2020年5月4日号 ETHステーキングでKEEP報酬/UMAのInitial Uniswap Offereingの結果](https://bspeak.substack.com/p/ethkeepumainitial-uniswap-offereing)\n\n\\#123 [Bspeak! 2020年4月27日号 スマートコントラクトで10倍レバレッジのデリバティブを実現するdYdX / Coinbaseが提供するオラクル](https://bspeak.substack.com/p/10dydx-coinbase)\n\n\\#122 [Bspeak! 2020年4月20日号 Opynプットオプションの使い方/ Binanceスマートチェーン発表/ Microsponsorsをつかった商取引（Part2）](https://bspeak.substack.com/p/opyn-binance)\n\n\\#121 [Bspeak! 2020年4月13日号 Microsponsorsを使った商取引(Part1) / シカゴDeFiアライアンス](https://bspeak.substack.com/p/microsponsorspart1)\n\n\\#120 [Bspeak! 2020年4月6日号 Makerの分散化に向けた最終ステップ](https://bspeak.substack.com/p/maker)\n\n以降もSubstackページからご覧ください。\n", "timestamp": 1621207774, "digest": "mj8ChWWwyKR0gs9zLbkInACzND09hdUF-AHEkU5iajc", "contributor": "0x7853Eabb6cFa980eBfD27e3F77e69590EA53c0b7"}
{"id": "6czaKmd8rSE3H0-LPXCKYprGDFH43JYfps5KL4woDlk", "title": "Gelato Interview by Bspeak! \n", "body": "*Gelato recently launched its v2.0 and announced the token $GEL. I've been watching the project since 2019 and thought would be a great infrastructure for smart contracts in general. This time, I had a chance to interview the team. This was translated into Japanese and posted in my weekly newsletter [Bspeak!](https://bspeak.substack.com/). Anyway, enjoy the interview.*\n\n*This is not investment advice and informational purposes only.\n\n\n![](https://images.mirror-media.xyz/publication-images/5bf2da5f-33e9-4bac-a7a6-990e861ac28c.jpeg?height=560&width=990)\n　\n　\n\n***CoffeeTimes: Hello Gelato team🍦! Can you tell us what Gelato Network is in a nutshell?***\n\nGelato: [Gelato Network](https://www.gelato.network/) is an open marketplace to match developers’ demand for transaction automation with the supply of a decentralized network of bots. It empowers developers to build automated dapps and allows bot operators to earn revenue from running the infrastructure necessary for such automations. Further important members of Gelato’s ecosystem and community include the team that develops and distributes much of the technology needed for the marketplace. \n\nSoon, after Gelato’s native token - $GEL - will have been released, its holders will also play a crucial part in governing the network and shaping its success and path into the future.\n\n　\n　\n***CoffeeTimes: What made you start this project?***\nGelato: We started the project back in May 2019 after we received a grant from Gnosis Ecosystem Fund (GECO). \n\nref: [https://blog.gnosis.pm/gnosis-ecosystem-fund-update-ii-9bea803a97c8](https://blog.gnosis.pm/gnosis-ecosystem-fund-update-ii-9bea803a97c8?gi=84e40da1e1c9)\n\nInitially, we worked on automating certain aspects of Gnosis’s DutchX exchange back then. However, we quickly realized that the need for automating dapps is ubiquitous. Web2 users are completely accustomed to an automated User Experience thanks to centralized servers controlling a lot of your data. In Ethereum, and decentralized blockchains in general, this great user experience is very hard to replicate because here we explicitly do not want users to trade in custody over their data and funds to a centralized server for a better UX. This would sacrifice most of the benefits of the decentralized web. So in the summer of 2019 we set out to build a solution for developers and users alike that allows for a decentralized application layer with a slick automated user experience, without the need for users to give away control over their keys and funds - Gelato Network was born. \n\n\n![](https://images.mirror-media.xyz/publication-images/be0267e3-a57a-443e-a218-f7ad87d99454.jpeg?height=874&width=1310)\n\nLuis and Hilmar, 2021\n\n　\n　\n***CoffeeTimes: What is Sorbet Finance? Is it like a side project on top of Gelato?***\n\nGelato: Yes, [Sorbet Finance](https://www.sorbet.finance/) is its own project that makes use of the Gelato Network in its backend. In Sorbet’s case it uses the Gelato network to continually monitor prices on DEX and then execute a users’ limit orders once their specified desired price target is reached. All that is achieved while the users keep full control over their funds. Also Sorbet now features Dollar Cost Averaging, which allows users to automatically sell a portion of a token spread out in several chunks and time intervals, to decrease the slippage per trade. Cool features like Sorbet that use Gelato Network to automate some aspect of a dapp can be built by any developer. \n　\n　\n***CoffeeTimes: You have announced several collaborations. Can we expect any other collaborations in the close future?***\n\nGelato: Yes, for sure. We are in close talks with many of the famous and not-yet-famous projects out there on Ethereum, Polygon, BSC, and whatnot. Almost every DeFi developer needs automation and we’re here to help them get it. \n　\n　\n***CoffeeTimes: You recently have announced GEL tokens. What is the purpose of GEL tokens? If Executors bot act maliciously, it would lead to a crucial problem (front running or just harming dapp users). Does GEL token slashing prevent it enough?***\n\nGelato: $GEL tokens will be used to 1) incentivise, govern, and police network participants and 2) allocate network resources efficiently. \n\nBots who want to earn a revenue from providing their infrastructure services to the Gelato network will have to stake a lot of $GEL tokens to attain and retain this privilege. This will open the door for more complex use cases to be built on top of Gelato, which might require an element of trust into the bots that will execute their automations. For such use cases having the bots put up a bonded stake, which can be slashed if they act maliciously, is essential. However, it’s worth mentioning that there are also many use cases which can be implemented so that they are trustless by default and thus do not have to rely on such a staking and slashing mechanism. Furthermore, the $GEL token will also be used to positively incentivize all network participants, developers, bots, and users alike that bring traffic to the network. \n\nOne other major use of $GEL is to efficiently allocate network infrastructure resources to dapps and users that demand them. Ethereum and other chains usually are constrained resource environments. There are only so many transactions that can fit into a block. Therefore, in order to scale a decentralized network like Gelato, decisions regarding the timing priority of transactions will have to be made by dapp developers and ultimately the bots that send them to the network. To gain priority in this technological resource allocation mechanism, developers and end users will have the ability to also lock up $GEL to assign different weights to their transactions. As a result, bots are incentivized to allocate more resources to such staked dapps or users, who, like them, are also long $GEL via their boned stakes.\n　\n　\n***CoffeeTimes: About token distribution, how would you plan on it?***\nGelato: At the moment we cannot share details with the public yet other than that we plan to do a public sale for $GEL tokens early this summer. Stay tuned, we will announce more details soon on our Medium and Twitter accounts.\n　\n　\n***CoffeeTimes: Okay further question about GEL, allocation/tokenomics are already fixed?***\n\nGelato: We will announce more details about token allocation and tokenomics in an upcoming article. Right now this information is not yet public. \n　\n　\n***CoffeeTimes: How would the GelatoDAO become sustainable? I assume the protocol would take a fee based on transactions but can you elaborate the model?***\n\nGelato: The GelatoDAO will be governed by people that have a vested interest in governing and maintaining the Gelato Network. For example, dapp developers that make extensive use of Gelato for their automation needs are strongly incentivized to participate in important decision-making around things like what features should be prioritised by Gelato’s core team in upcoming releases, what fees bots can charge, and whether certain bots should be slashed and kicked from the network, if they misbehave. Therefore, there is an organic tendency for many network participants to participate in the DAO to steadily improve the welfare of the network purely out of rational self-interest. In the future, the DAO could also retain a small network fee, but since its membership will likely largely consist of network participants the ultimate fee payers will have significant control over this decision themselves.\n　\n　\n***CoffeeTimes: Gelato seems to have a great connection with Gnosis and other DAOs (TheLAO / MetaCartel Ventures), how did you start and deepen these relationships with them?***\n\nGelato: We partnered with MetaCartel early on in late 2019 when we applied for a grant from them and made it into their 3rd cohort.\n\nref: [https://medium.com/metacartel/metacartel-cohort-1-6336cdca05db](https://medium.com/metacartel/metacartel-cohort-1-6336cdca05db)\n\nEven though Peter Pan sat next to us in Berlin’s crypto co-working space Full Node from the start, we eventually really got to know him online. He was super helpful and interested in Gelato and really also helped us with closing our Seed Funding in late summer 2020. The LAO was also part of our Seed Round and we are in frequent contact with both members of the LAO, like Aaron and Pri, and members of MetaCartel, like Peter and Victor. They usually help us greatly with legal, strategic, or community-related questions. Being active in DAOs and just talking to their members is definitely a good thing every crypto entrepreneur should.\n　\n　\n***CoffeeTimes: Please tell us briefly about your future plans in the coming few months!***\n\nGelato: Uh boi, there is a lot to unpack here but let us be crisp. For this summer the plan is to: \n- ship, ship, ship: new automated features on Ethereum, Polygon, BSC, and Fantom. We want Sorbet’s limit orders to be on every AMM and we want more and more protocols to integrate Gelato for liquidation protection and automated transfers, withdraws, deposits and so on. \n- launch $GEL \n- launch the Gelato DAO and start involving $GEL holders in decision-making around which features to prioritise \n- Developer mining programs with $GEL to get more developers to build on Gelato \n\nDefinitely join our Telegram or Discord communities to stay up to date. I am sure there will be feature releases for you or as a developer you have the opportunity to participate in our developer mining program, which we will launch after the $GEL token sale. \n\n![](https://images.mirror-media.xyz/publication-images/5e66c1b3-7d34-441b-ae17-7c7cb98e5f3d.jpeg?height=594&width=623)\n\n\nRoadmap：[WhitePaper v1.0](https://aristaticfiles.s3.amazonaws.com/Gelato+Whitepaper+V1.0,+May+2021+(02).pdf)\n　\n　\n***CoffeeTimes: Can you give any words to the Japanese audience? Do you have any impressions on Japanese crypto scene? I think I saw a photo somewhere of when the team came to Tokyo***\n\nGelato: Gelato had a strong Japanese community right from the start. We are super thankful for that and we definitely want to connect more with them. If any Japanese developers want to automate smart contracts, please don’t hesitate to reach out. Unfortunately, we have not been to Tokyo yet. However, after COVID settles down we will definitely go. \n\nOur team is very multinational, we have members from Switzerland, US, Germany, France, China, Australia, and Egypt. However, we don’t have a Japanese team member yet. We are currently actively looking for frontend and backend developers with web3 experience, so if anybody in our Japanese community wants a job with us please apply here: https://angel.co/company/gelato-network! \n　\n　\n***(CoffeeTimes: By the way, why is the name Gelato? The bottom half of the logo also looks like Ethereum🍦)***\nGelato: Because everybody loves Gelato! \n　\n　\n***CoffeeTimes: Thank you for taking your time! Where can we learn more about Gelato?***\n\nGelato: \n🐦 [Twitter](https://twitter.com/gelatonetwork) | 💬 [Telegram](https://t.me/joinchat/HcTaOxJ0_FjU-r34vbvK8A) | 📺 [Discord](https://t.co/SY3zIfyalk?amp=1)\n🍦hi@gelato.digital\n🍦http://gelato.network/\n🍦[Gelato Whitepaper v1.0](https://bit.ly/3y8ccnw\n)\n\n\n\n", "timestamp": 1621208943, "digest": "krM9_r-1fGjtLWXt0uTQipnwQZHvu-k2Eq9xrXr_pP4", "contributor": "0x7853Eabb6cFa980eBfD27e3F77e69590EA53c0b7"}
{"id": "1ECqgjSk4KXN5jx4HjmEzUe0eaA6fCZk4wcCC9sqJWA", "title": "In Vitro Nostalgia: Minting Memories", "body": "### Non-Fungible Memory Tokens \n[NFMTs]\n\nMemories. What do they reveal about you? What do they remind you of? A forgotten time? The nostalgia of an experience since passed? \n\nhttps://twitter.com/enaraxr/status/1355450773212172290?s=20\n\nAs combed through the various voice recordings on my iPhone, I found a selection of memories from a secret party in Ishikawa Prefecture, Japan that I attended. I didn't immediately think to make them into NFTs. It wasn't until I had gone through the motions on Zora that the audio looped over and over that it clicked. This was the perfect experiment in documenting, sharing, and collecting memories.\n\nWhat could I reveal to the listener? Could they learn about me? And because we had all been deprived of events, could these moments hold a deeper meaning to the fleeting nature of socialization? Did we take for granted the ever innocuous social gathering? I'm not sure. But these are questions that have continued to come into view the longer I've sat with these voice notes.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/178)\n\n \n\nClose your eyes, think of yourself either as the observer of the scene, or part of the scene, and let your mind paint the picture of the environment. Imagine where the DJ is, where the characters are, what type of house are you in? \n\nThe first of three notes in this trilogy called ***[\"Shīkurettopātī: One Night In Kurosakimachi\"](https://zora.co/sirsu/178)***, it's serendipitous that my phone picked up both a conversation I'm having about crate-digging at one of the only remaining Tower Record stores in the world *AND* amazing house music. The instrumentation starts to swell with a soulful synth as the conversation reaches a euphoric note as we make the resolve to buy records and acknowledge how awesome the moment is.\n\nThe remaining two notes, ***[\"Not Now, But In The Future\"](https://zora.co/sirsu/189)*** and ***[\"Chinese Omelette OST\"](https://zora.co/sirsu/188)*** create this unintended effect of feeling like a short film with your own visual dreamscape constructing a memory that’s unique to you despite the fact that the audio is not your lived experience.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/189)\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/188)\n\n*Chinese Omelette OST is the last remaining NFT of the Shīkurettopātī trilogy to be collected.*\n\nI've posted the NFTs in the order I believe to be the most chronologically accurate, although any DJ will tell you that there are many highs and lows in a set that when you *think* it's over, there is more around the corner! I'd be super curious to see what YOU see, more so than my own recollection of the space and the folks within it.\n\n\n---\n\n### Spatial Conversations\n\nIn the context of memories, archived works in many ways achieve a similar effect of nostalgia. While they may not draw from life as a form of `reporting-lived-experience-as-documentation`, works that pull on the thread of life can be memory-inducing. For me, one of those works is a live recording in 2014 of a freeform DJ set with my uni-mates after a day of getting unbelievably stoned called \"SYNESTHESIA\". \n\nYou might be wondering why it's called SYNESTHESIA. For me, and others who experience two or more sensory inputs involuntarily, DJing soundscapes puts me into a trance-like state of flow. I can see threads of light guiding me to my next note as if I'm being controlled. I really don't remember the act of playing only the fact that I've *played* a set. In a way, perhaps there is a narrative to it all that I cannot comprehend. Oddly enough, I've been watching a show called [The Nevers](https://www.hbo.com/the-nevers) which has a character who can sing but she cannot understand what she is actually communicating. Even stranger, only a certain group of people can hear it too. I haven't found a metaphor so closely aligned with my own personal experiences with music.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/1643)\n\nAs a treat to my uni-mates, and to break them into the NFT space, I decided to put \"SYNESTHESIA\" up for auction with a 1.5 ETH reserve on Zora, to show them one of the core principles that solidifies why crypto can lead to an equitable future. For being supporters of my experiments, I wanted to reward them a split from the proceeds of the sale from the 35-minute live session and essay.\n\nI believe redistribution at all levels should be explored. While there is nothing stopping me from gladly auctioning these NFTs without attribution, I am a firm believer in trying to capture the entire story involving my work. I am currently publishing an essay \"Creative Immortality\" that speaks to the inclusion of others as a necessary component to the preservation of work enabling the natural line of discovery to take place. \n\nAs creatives, we can never have enough inspiration. Attribution provides us with our next set of sources to draw from. And now, we can trace the value these inspirations give us and pay it forward.   \n\n---\n\n### Special Thanks\n\nI want to give a special thanks to everyone involved in the creation of the Secret Party Trilogy and SYNESTHESIA. The split breakdown will derive from the sale of this essay, and both the Chinese Omelette OST + SYNESTHESIA NFMTs. Because SYNESTHESIA is auctioned through Zora's deployment of $BOUNTY and not on Mirror, 30% of the funds will be added as a tip to the split contract attached to this essay.\n\nSplit Recipients:\n\nSCAD Roomies (30%)\nW.T. Warmoth\nArmani Mayo\nPatrick O'Connor\n\nFusion Art Japan Residency (10%)\nStarnilas Oge\n\n$BOUNTY Holders (10%)\n\nJacob Horne (3%)\n*For some reason you can read minds so thank you for pushing to get me to write this lol*\n\n", "timestamp": 1621216186, "digest": "kVKneiFoAnwbEVabds1Si7VqkeZPJbMXTDP31L34dKc", "contributor": "0xEB95ff72EAb9e8D8fdb545FE15587AcCF410b42E"}
{"id": "aKMciZrsZVp0quwZSej1TK1sMxo2bb2uvH65gEDm9LA", "title": "In Vitro Nostalgia: Minting Memories", "body": "### Non-Fungible Memory Tokens \n[NFMTs]\n\nMemories. What do they reveal about you? What do they remind you of? A forgotten time? The nostalgia of an experience since passed? \n\nhttps://twitter.com/enaraxr/status/1355450773212172290?s=20\n\nAs combed through the various voice recordings on my iPhone, I found a selection of memories from a secret party in Ishikawa Prefecture, Japan. I didn't immediately think to make them into NFTs. It wasn't until I had gone through the motions on Zora and the audio looped repeatedly that it clicked. This was the perfect experiment in documenting, sharing, and collecting memories.\n\nWhat could I reveal to the listener? Could they learn about me? And because we had all been deprived of events, could these moments hold deeper meaning to the fleeting nature of socialization? Did we take for granted the ever innocuous social gathering? I'm not sure. But these are questions that have continued to come into view the longer I've sat with these voice notes.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/178)\n\n \n\nClose your eyes, think of yourself either as the observer of the scene, or part of the scene, and let your mind paint the picture of the environment. Imagine where the DJ is, where the characters are, what type of house are you in? \n\nThe first of three notes in this trilogy called ***[\"Shīkurettopātī: One Night In Kurosakimachi\"](https://zora.co/sirsu/178)***, it's serendipitous that my phone picked up both a conversation I'm having about crate-digging at one of the only remaining Tower Record stores in the world *AND* amazing house music. The instrumentation swells with soulful synths as the conversation reaches a euphoric note as we resolve ourselves to buy records acknowledging how awesome the moment is.\n\nThe remaining two notes, ***[\"Not Now, But In The Future\"](https://zora.co/sirsu/189)*** and ***[\"Chinese Omelette OST\"](https://zora.co/sirsu/188)*** create this unintended effect of feeling like a short film with your own visual dreamscape constructing a memory that’s unique to you despite the fact that the audio is not your lived experience.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/189)\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/188)\n\n*Chinese Omelette OST is the last remaining NFT of the Shīkurettopātī trilogy to be collected.*\n\nI've posted the NFTs in the order I believe to be the most chronologically accurate, although any DJ will tell you that there are many highs and lows in a set that when you *think* it's over, there is more around the corner! I'd be super curious to see what YOU see, more so than my own recollection of the space and the folks within it.\n\n\n---\n\n### Spatial Conversations\n\nIn the context of memories, archived works in many ways achieve a similar effect of nostalgia. While they may not draw from life as a form of `reporting-lived-experience-as-documentation`, works that pull on the thread of life can be memory-inducing. For me, one of those works is a live recording in 2014 of a freeform DJ set with my uni-mates after a day of getting unbelievably stoned called \"SYNESTHESIA\". \n\nYou might be wondering why it's called SYNESTHESIA. For me, and others who experience two or more sensory inputs involuntarily, DJing soundscapes puts me into a trance-like state of flow. I can see threads of light guiding me to my next note as if I'm being controlled. I really don't remember the act of playing only the fact that I've *played* a set. In a way, perhaps there is a narrative to it all that I cannot comprehend. Oddly enough, I've been watching a show called [The Nevers](https://www.hbo.com/the-nevers) which has a character who can sing but she cannot understand what she is actually communicating. Even stranger, only a certain group of people can hear it too. I haven't found a metaphor so closely aligned with my own personal experiences with music.\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/1643)\n\nAs a treat to my uni-mates, and to break them into the NFT space, I decided to put \"SYNESTHESIA\" up for auction with a 1.5 ETH reserve on Zora, to show them one of the core principles that solidifies why crypto can lead to an equitable future. For being supporters of my experiments, I wanted to reward them a split from the proceeds of the sale from the 35-minute live session and essay.\n\nI believe redistribution at all levels should be explored. While there is nothing stopping me from gladly auctioning these NFTs without attribution, I am a firm believer in trying to capture the entire story involving my work. I am currently publishing an essay \"Creative Immortality\" that speaks to the inclusion of others as a necessary component to the preservation of work enabling the natural line of discovery to take place. \n\nAs creatives, we can never have enough inspiration. Attribution provides us with our next set of sources to draw from. And now, we can trace the value these inspirations give us and pay it forward.   \n\n---\n\n### Special Thanks\n\nI want to give a special thanks to everyone involved in the creation of the Secret Party Trilogy and SYNESTHESIA. The split breakdown will derive from the sale of this essay, and both the Chinese Omelette OST + SYNESTHESIA NFMTs. Because SYNESTHESIA is auctioned through Zora's deployment of $BOUNTY and not on Mirror, 30% of the funds will be added as a tip to the split contract attached to this essay.\n\nSplit Recipients:\n\nSCAD Roomies (30%)\nW.T. Warmoth\nArmani Mayo\nPatrick O'Connor\n\nFusion Art Japan Residency (10%)\nStarnilas Oge\n\n$BOUNTY Holders (10%)\n\nJacob Horne (3%)\n*For some reason you can read minds so thank you for pushing to get me to write this lol*\n\n", "timestamp": 1621216398, "digest": "kVKneiFoAnwbEVabds1Si7VqkeZPJbMXTDP31L34dKc", "contributor": "0xEB95ff72EAb9e8D8fdb545FE15587AcCF410b42E"}
