{"id": "mcz8vl8PmCSy4PTHzhuvRBFaVdr9jIJSQEyMlNyWKYk", "title": "Packy test v3", "body": "[Split](split://0xB0Ca99d4d370e9E9e92dd5F8398C1D4Acd3BF554)\n\nA cool auction\n\n[Token #2410](auction://0x7c2668bd0d3c050703cecc956c11bd520c26f7d4?network=rinkeby&tokenId=2410)", "timestamp": 1618797008, "digest": "1FsTSCJuMJHcFTd0_N8Q6KTOdr7o9mm7pHW64Onkqx8", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0xb6d957c9c6045fb1d7ad382b8cced6a09c41ebd4d3909e861c37253af125c6de\"}"}
{"id": "3zmC3V5hiurFZYHh2D5l5xrZZjE5HRaeKY_mILINmQw", "title": "Packy test v3", "body": "[new splitter v3](split://0x2B046e14690b70306ee4eD8B5Cbdd08a81AeEbC5?network=rinkeby)\n\nA cool auction\n\n[Token #2410](auction://0x7c2668bd0d3c050703cecc956c11bd520c26f7d4?network=rinkeby&tokenId=2410)", "timestamp": 1618798753, "digest": "1FsTSCJuMJHcFTd0_N8Q6KTOdr7o9mm7pHW64Onkqx8", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0xb6d957c9c6045fb1d7ad382b8cced6a09c41ebd4d3909e861c37253af125c6de\"}"}
{"id": "DlCC7nAepmNzTJB6sdrQXsonlaBP2glPFFj6wQ_8DsM", "title": "Commercial Real Estate", "body": "With new Covid cases down 30% in the last two weeks and partially vaccinated people approaching 50%, NYC seems ready to start getting back to work.\n\nI have been going to the office several days a week for the last two weeks and will be there again today. As my USV colleagues get fully vaccinated, they are joining me and our office is starting to fill up.\n\nBut our Flatiron neighborhood still feels empty and there is not one good restaurant open for lunch during the week.\n\nAs we head back to work, what will the new normal be?\n\nThat is a huge question looming over the commercial real estate sector in NYC and around the country.\n\nAccording to [this NYT piece from last week](https://www.nytimes.com/2021/04/08/business/economy/office-buildings-remote-work.html), the vacancy rate in commercial office space in NYC is almost 20% and that number is north of 15% across the largest cities in the US. And in the face of these historically high vacancy rates, more new office buildings are coming to market increasing the supply of space.\n\nWe have surveyed our portfolio companies and we understand that many will reopen their offices this summer and fall, but most will not expect their employees to be back in the office five days a week. Some will not expect their employees to be in the office at all.\n\nI think this Jamie Dimon quote I read in the NYT piece is about right:\n\n> Jamie Dimon, chief executive of JPMorgan Chase, the largest private-sector employer in New York City, wrote in a letter to shareholders this week that remote work would “significantly reduce our need for real estate.” For every 100 employees, he said, his bank “may need seats for only 60 on average.”\n\nWe used to have 10,000 square feet in our old office that we left last month. We moved into 6,000 square feet and it feels like plenty. I think many/most companies will feel that way too.\n\nMany of our portfolio companies let their leases expire during the pandemic, as did we. And they are now thinking about what to do going forward. I have a few suggestions:\n\n1/ Take something temporary for the next year or two. Figure out what the new normal is before entering into a long term lease. This is what USV did. We took a nine month sublet to allow us to figure things out.\n\n2/ Shop around and be aggressive in your offers to sublet or lease space. Many landlords will not engage in your bottom fishing. But some will, particularly in the sublease market.\n\n3/ Avoid expensive office buildouts and focus on spaces that are extremely flexible. We have invested in [office and conference pods](https://www.hermanmiller.com/products/space-division/phone-booths-and-office-pods/framery-2q-office-pod/) in our sublet to reduce the need for expensive office buildouts. And the Gotham Gal and I made [an entire co-working space in Brooklyn with office pods](https://framework.nyc/).\n\n4/ Figure out how to integrate remote workers into your office environment. We have been investing a lot more in our conference rooms/video setups. I even suggested that we put some webcams in our office so our remote colleagues could see who is in the office at any time. I am not sure we will do that. Some feel it is creepy. But I think it’s a good idea.\n\n5/ Offer perks to encourage your employees to be in the office. We have been ordering in great food for everyone in the office the last few weeks and everyone seems to appreciate and enjoy that.\n\nI think occupancy expense will be a smaller percentage of our portfolio companies’ P\\&Ls in the future and those savings can be invested in our teams instead. That feels like a great trade and one that will lead to better companies and happier employees. And that is a very good thing.\n", "timestamp": 1618828247, "digest": "Spn6SRu2uC-hKJM3P2gMXiH5gNV25FvHGSa-RSeNXlM", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "J1l-y6fYFbwXtDWEf0CzdsO7IXzJUdWAZFrPD6tbl30", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. \n\n>When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with software engineer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. **The media associated with Solvency tokens are dynamic WebGL simulations.** These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given a specific input, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the [Arweave blockchain](https://www.arweave.org/).\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as [OpenSea](https://opensea.io/) or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that *ars lunga, vita brevis* was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n", "timestamp": 1618838760, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "uozBRb-iDnQyc6tDL6SNfRKSU4u9beuWcz-P2Ktresc", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. \n\n>When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with software engineer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. **The media associated with Solvency tokens are dynamic WebGL simulations.** These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given the same input hash, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the [Arweave blockchain](https://www.arweave.org/).\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as [OpenSea](https://opensea.io/) or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that *ars lunga, vita brevis* was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n", "timestamp": 1618838795, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "S58tPBgwv1-ZfSkBzAU-1eE6HssaUHOmVKgYPC4CseI", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. \n\n>When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with software engineer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. **The media associated with Solvency tokens are dynamic WebGL simulations.** These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given a specific input, so that the artwork will always render identically after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the [Arweave blockchain](https://www.arweave.org/).\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as [OpenSea](https://opensea.io/) or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that *ars lunga, vita brevis* was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n", "timestamp": 1618838825, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "A-5c3wSovgTFgJdhKMCqMu7dhvV9DnSLnMt3IgWK0og", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. \n\n>When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with software engineer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. **The media associated with Solvency tokens are dynamic WebGL simulations.** These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given the same input hash, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the [Arweave blockchain](https://www.arweave.org/).\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as [OpenSea](https://opensea.io/) or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that *ars lunga, vita brevis* was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n*Solvency will be open to the public on Thursday April 22nd at 12pm EST. To join the Discord for updates, [click here](https://discord.gg/BHXXzG3YR2)\n*", "timestamp": 1618839091, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "fv-RLCnd7JXs7hGeXa7SUbc2XduYvXkv401ghszoZ2U", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. \n\n>When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with software engineer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. **The media associated with Solvency tokens are dynamic WebGL simulations.** These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given the same input hash, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the [Arweave blockchain](https://www.arweave.org/).\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as [OpenSea](https://opensea.io/) or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that *ars lunga, vita brevis* was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n*Solvency will be open to the public on Thursday April 22nd at 12pm EST. To join the Discord for updates, [click here](https://discord.gg/BHXXzG3YR2)*", "timestamp": 1618839115, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "GrNTuQl40nfXhwjipmYqiQIPMSD4aPN3SLRNFQ8G5nU", "title": "A Line Retold By Crowdfunding", "body": "Today is the *exact* two year anniversary of my first step on a (long) walk. It was like any other walk—same as going from the couch to the kitchen—but this one began at the US/Mexico border and ended at the US/Canada border. It took 4 months to cover 2,650 miles on foot, and over that distance and duration my mind wandered, as it does, creating connections between life offline walking through landscape, and life online scrolling through… everything. However, where I expected there to be *differences*, there were surprising *similarities*. **This is a crowdfund to tell that story.**\n\n[PCT Map](https://wonderful-ritchie-5b55a6.netlify.app/map?display=iframe&size=large)\n\nTo do this I’m looking to raise **5 ETH**. **1/3** will go [Melanin Base Camp](https://www.melaninbasecamp.com/), a non-profit addressing representation, access and cultural identity within the outdoor industry and conservation. **1/3** will go to the [Pacific Crest Trail Association](https://www.pcta.org/), a non-profit focused on preserving and protecting the PCT. The remaining 1/3 will compensate me for the time spent organizing material, research, writing and publishing the work. The finished work will be minted as a NFT (carbon offset) and auctioned, with the value flowing [back to those who participated in the crowdfund](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ) and hold $WALK. This way of crowdfunding is looking to fundamentally change the way writers fund and sustain their work, and give a stake in the success to the backers.\n\n[Walk Crowdfund](crowdfund://0x6Bbee45ac65C706D4a701B0977aC9C5cdd448323?network=homestead&softCap=5)\n\n[Crowdfunds on Mirror](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n\n![](https://images.mirror-media.xyz/publication-images/4426dfd4-69aa-4485-8852-a2e3d83313e4.jpeg?height=900&width=1600&hide=true)\n\n## Who is this for?\n\nThere are plenty of stories about the Pacific Crest Trail told by those who have completed it (966 did in 2019.) This is one is different. I’m not planing to focus on specific details of the trail; *“I summited a mountain, then I got hungry, then I saw some trees.”* Those sorts of reports are fun, but there are existing accounts like that better than what I’m capable of.\n\nInstead, this will focus on drawing connections between the experience of the walk and other areas of personal knowledge and interest, treating the trail as a connecting path between the overlap. If you happen to have similar interests, this too may be interesting. Some of the themes will include:\n\n**❶ Environment**, both those online and offline, and the increasingly entangled liminal spaces in-between. There was a lot of time to consider biological interfaces (my legs) and technological (my phone.)\n\n**❷ Infrastructure**, and how touches us, even when we are in the “wilderness”, from global supply chains behind a Cliff Bar in my hand to GPS helping me locate the only trickle of water within 30 miles.  \n\n**❸ Distance, duration and repetition**. Moving through landscape at a biological pace versus infinite-scrolling the internet, and other non-obvious perceptual similarities.  \n\nIf you feel like you grew up on the internet and daydream about an extended priories of being offline, you may be into this. If you where outdoor clothing but spend all your time [staring at screens](https://www.instagram.com/organiclab.zip/?hl=en), you may be into this.\n\n[PCT Portraits](https://jondashkyle.s3.amazonaws.com/2021-pct/pct-loop.mp4?width=2048&height=1024&autoplay=true&loop=true&muted=true)\n\n## The published work\n\nThe published work will consist of an entry containing:\n\n**❶** Several discrete sections of narrative writing centered on the topics referenced above, interspersed with collage style interludes.  \n\n**❷** 3–5 video loops (0:30–4:00min) sourcing found imagery, photos taken on the trail, and interpretations of navigational diagrams and interfaces.  \n\n**❸** An archive of research and reference material assembled over the production of the work in the form of a `.zip`.  \n\n**❹** The final work will be posted in June/July, with incremental progress updates taking place along the way.\n\nSources of inspiration are [Uncommon Ground](https://www.amazon.com/Uncommon-Ground-Rethinking-Human-Nature/dp/0393315118) by William Cronon, [Making Time: Essays on the Nature of Los Angeles](https://www.amazon.com/gp/product/1593761333/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1593761333&linkCode=as2&tag=wlfox-20&linkId=d1862f801fdcf50321b81976221d2713) by William Fox, and the television show [Connections](https://www.youtube.com/watch?v=XetplHcM7aQ&ab_channel=DRS_Education) by James Burke. Similarly, I’m inspired and view these topics as shaped by non-literary work like [*A Line Made By Walking*](https://www.tate.org.uk/art/artworks/long-a-line-made-by-walking-p07149) by Richard Long, and other artistic gestures.\n\nUp until now, the most I’ve publicly shared about the walk was a brief mention in [my contribution](https://walkerart.org/magazine/series/the-year-according-to) to Walker Art Center “Year According To…” series. I also hosted a [life stream session for LOT 2046](https://www.youtube.com/watch?v=MRHxdxQS2jA) one afternoon, loosely centered around the walk.\n\n[Year According To](https://walkerart.org/magazine/2019-the-year-according-to-jon-kyle)\n\nThis will be the first time I’ve revisited the notes, photos, and videos generated while on the walk. It’s difficult to understate how formative an experience this was for me—it will inform everything that follows in ways both big and small.\n\nThe motivations for this crowdfund are quite simple:\n\n**❶** Some time has passed since the walk, and I’m now in a place where enough distance has been created to where I can revisit all the material I generated while on-trail.  \n\n**❷** I’d like to donate to non-profits which do important work in the making the outdoors more accessible to underrepresented groups, and the association which acts as custodian of the PCT.  \n\n**❸** As part of the team at [Mirror](https://mirror.xyz) I’d like to run a crowdfund for real. It’s always different when doing the real thing, and this will help shape my approach to design and interface as we make the tools available to more people. \n\n![](https://images.mirror-media.xyz/publication-images/f9ffca1d-dd22-40e8-b1fa-617aa63e7478.jpeg?height=957&width=2300&size=medium)\n\n## Who am I?\n\nI began unschooling in 5th grade while living in a small town, learning idiosyncratically without curriculum online. I had an interest in design, and began programming in Flash, a hybrid environment of design, animation, and interaction. When I was 19 I moved to Los Angeles to join the personal publishing platform [Cargo (Collective)](https://cargo.site/) as their first hire, where I remained for several years. I then created tools for decentralized publishing over p2p networks while working on commissioned cultural projects anywhere from small record labels to large academic institutions.\n\nMost recently I joined [Mirror](https://mirror.xyz) (the platform you are on) as the Head of Design/Product. You can learn more about me at [jon-kyle.com](https://jon-kyle.com/), and [follow me on Twitter](https://twitter.com/jondashkyle) for updates.", "timestamp": 1618839958, "digest": "LkeLK83xVSxh_F8xGoXPJsb5qPHaM2pLtr5d11IurA0", "contributor": "0xFf37A713c920F6e94043D10c1230e30B13F4d500"}
{"id": "H2MzHyBE6bZK-3GzWwoqmJ5J3kfrHjweyPBCnlm2qIc", "title": "A Line Retold By Crowdfunding", "body": "Today is the *exact* two year anniversary of my first step on a (long) walk I took. It was like any other walk—same as going from the couch to the kitchen—but this one began at the US/Mexico border and ended at the US/Canada border. It took 4 months to cover 2,650 miles on foot, and over that distance and duration my mind wandered, as it does, creating connections between life offline walking through landscape, and life online scrolling through… everything. However, where I expected there to be *differences*, there were surprising *similarities*. **This is a crowdfund to tell that story.**\n\n[PCT Map](https://wonderful-ritchie-5b55a6.netlify.app/map?display=iframe&size=large)\n\nTo do this I’m looking to raise **5 ETH**. **1/3** will go [Melanin Base Camp](https://www.melaninbasecamp.com/), a non-profit addressing representation, access and cultural identity within the outdoor industry and conservation. **1/3** will go to the [Pacific Crest Trail Association](https://www.pcta.org/), a non-profit focused on preserving and protecting the PCT. The remaining 1/3 will compensate me for the time spent organizing material, research, writing and publishing the work. The finished work will be minted as a NFT (carbon offset) and auctioned, with the value flowing [back to those who participated in the crowdfund](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ) and hold $WALK. This way of crowdfunding is looking to fundamentally change the way writers fund and sustain their work, and give a stake in the success to the backers.\n\n[Walk Crowdfund](crowdfund://0x6Bbee45ac65C706D4a701B0977aC9C5cdd448323?network=homestead&softCap=5)\n\n[Crowdfunds on Mirror](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n\n![](https://images.mirror-media.xyz/publication-images/4426dfd4-69aa-4485-8852-a2e3d83313e4.jpeg?height=900&width=1600&hide=true)\n\n## Who is this for?\n\nThere are plenty of stories about the Pacific Crest Trail told by those who have completed it (966 did in 2019.) This is one is different. I’m not planing to focus on specific details of the trail; *“I summited a mountain, then I got hungry, then I saw some trees.”* Those sorts of reports are fun, but there are existing accounts like that better than what I’m capable of.\n\nInstead, this will focus on drawing connections between the experience of the walk and other areas of personal knowledge and interest, treating the trail as a connecting path between the overlap. If you happen to have similar interests, this too may be interesting. Some of the themes will include:\n\n**❶ Environment**, both those online and offline, and the increasingly entangled liminal spaces in-between. There was a lot of time to consider biological interfaces (my legs) and technological (my phone.)\n\n**❷ Infrastructure**, and how touches us, even when we are in the “wilderness”, from global supply chains behind a Cliff Bar in my hand to GPS helping me locate the only trickle of water within 30 miles.  \n\n**❸ Distance, duration and repetition**. Moving through landscape at a biological pace versus infinite-scrolling the internet, and other non-obvious perceptual similarities.  \n\nIf you feel like you grew up on the internet and daydream about an extended priories of being offline, you may be into this. If you where outdoor clothing but spend all your time [staring at screens](https://www.instagram.com/organiclab.zip/?hl=en), you may be into this.\n\n[PCT Portraits](https://jondashkyle.s3.amazonaws.com/2021-pct/pct-loop.mp4?width=2048&height=1024&autoplay=true&loop=true&muted=true)\n\n## The published work\n\nThe published work will consist of an entry containing:\n\n**❶** Several discrete sections of narrative writing centered on the topics referenced above, interspersed with collage style interludes.  \n\n**❷** 3–5 video loops (0:30–4:00min) sourcing found imagery, photos taken on the trail, and interpretations of navigational diagrams and interfaces.  \n\n**❸** An archive of research and reference material assembled over the production of the work in the form of a `.zip`.  \n\n**❹** The final work will be posted in June/July, with incremental progress updates taking place along the way.\n\nSources of inspiration are [Uncommon Ground](https://www.amazon.com/Uncommon-Ground-Rethinking-Human-Nature/dp/0393315118) by William Cronon, [Making Time: Essays on the Nature of Los Angeles](https://www.amazon.com/gp/product/1593761333/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1593761333&linkCode=as2&tag=wlfox-20&linkId=d1862f801fdcf50321b81976221d2713) by William Fox, and the television show [Connections](https://www.youtube.com/watch?v=XetplHcM7aQ&ab_channel=DRS_Education) by James Burke. Similarly, I’m inspired and view these topics as shaped by non-literary work like [*A Line Made By Walking*](https://www.tate.org.uk/art/artworks/long-a-line-made-by-walking-p07149) by Richard Long, and other artistic gestures.\n\nUp until now, the most I’ve publicly shared about the walk was a brief mention in [my contribution](https://walkerart.org/magazine/series/the-year-according-to) to Walker Art Center “Year According To…” series. I also hosted a [life stream session for LOT 2046](https://www.youtube.com/watch?v=MRHxdxQS2jA) one afternoon, loosely centered around the walk.\n\n[Year According To](https://walkerart.org/magazine/2019-the-year-according-to-jon-kyle)\n\nThis will be the first time I’ve revisited the notes, photos, and videos generated while on the walk. It’s difficult to understate how formative an experience this was for me—it will inform everything that follows in ways both big and small.\n\nThe motivations for this crowdfund are quite simple:\n\n**❶** Some time has passed since the walk, and I’m now in a place where enough distance has been created to where I can revisit all the material I generated while on-trail.  \n\n**❷** I’d like to donate to non-profits which do important work in the making the outdoors more accessible to underrepresented groups, and the association which acts as custodian of the PCT.  \n\n**❸** As part of the team at [Mirror](https://mirror.xyz) I’d like to run a crowdfund for real. It’s always different when doing the real thing, and this will help shape my approach to design and interface as we make the tools available to more people. \n\n![](https://images.mirror-media.xyz/publication-images/f9ffca1d-dd22-40e8-b1fa-617aa63e7478.jpeg?height=957&width=2300&size=medium)\n\n## Who am I?\n\nI began unschooling in 5th grade while living in a small town, learning idiosyncratically without curriculum online. I had an interest in design, and began programming in Flash, a hybrid environment of design, animation, and interaction. When I was 19 I moved to Los Angeles to join the personal publishing platform [Cargo (Collective)](https://cargo.site/) as their first hire, where I remained for several years. I then created tools for decentralized publishing over p2p networks while working on commissioned cultural projects anywhere from small record labels to large academic institutions.\n\nMost recently I joined [Mirror](https://mirror.xyz) (the platform you are on) as the Head of Design/Product. You can learn more about me at [jon-kyle.com](https://jon-kyle.com/), and [follow me on Twitter](https://twitter.com/jondashkyle) for updates.", "timestamp": 1618839908, "digest": "LkeLK83xVSxh_F8xGoXPJsb5qPHaM2pLtr5d11IurA0", "contributor": "0xFf37A713c920F6e94043D10c1230e30B13F4d500"}
{"id": "omFxixPBE8yYi7urPsNlqgO4TgJf_NzB6FsCO1hKCu4", "title": "A Line Retold By Crowdfunding", "body": "Today is the *exact* two year anniversary of my first step on a (long) walk. It was like any other walk—same as going from the couch to the kitchen—but this one began at the US/Mexico border and ended at the US/Canada border. It took 4 months to cover 2,650 miles on foot, and over that distance and duration my mind wandered, as it does, creating connections between life offline walking through landscape, and life online scrolling through… everything. However, where I expected there to be *differences*, there were surprising *similarities*. **This is a crowdfund to tell that story.**\n\n[PCT Map](https://wonderful-ritchie-5b55a6.netlify.app/map?display=iframe&size=large)\n\nTo do this I’m looking to raise **5 ETH**. **1/3** will go [Melanin Base Camp](https://www.melaninbasecamp.com/), a non-profit addressing representation, access and cultural identity within the outdoor industry and conservation. **1/3** will go to the [Pacific Crest Trail Association](https://www.pcta.org/), a non-profit focused on preserving and protecting the PCT. The remaining 1/3 will compensate me for the time spent organizing material, research, writing and publishing the work. If the 5 ETH goal is reached I will also produce a 5:00–10:00min long collage video to compliment the work. The finished work will be minted as a NFT (carbon offset) and auctioned, with the value flowing [back to those who participated in the crowdfund](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ) and hold $WALK. This way of crowdfunding is looking to fundamentally change the way writers fund and sustain their work, and give a stake in the success to the backers.\n\n[Walk Crowdfund](crowdfund://0x6Bbee45ac65C706D4a701B0977aC9C5cdd448323?network=homestead&softCap=5)\n\n[Crowdfunds on Mirror](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n\n![](https://images.mirror-media.xyz/publication-images/4426dfd4-69aa-4485-8852-a2e3d83313e4.jpeg?height=900&width=1600&hide=true)\n\n## Who is this for?\n\nThere are plenty of stories about the Pacific Crest Trail told by those who have completed it (966 did in 2019.) This is one is different. I’m not planing to focus on specific details of the trail; *“I summited a mountain, then I got hungry, then I saw some trees.”* Those sorts of reports are fun, but there are existing accounts like that better than what I’m capable of.\n\nInstead, this will focus on drawing connections between the experience of the walk and other areas of personal knowledge and interest, treating the trail as a connecting path between the overlap. If you happen to have similar interests, this too may be interesting. Some of the themes will include:\n\n**❶ Environment**, both those online and offline, and the increasingly entangled liminal spaces in-between. There was a lot of time to consider biological interfaces (my legs) and technological (my phone.)\n\n**❷ Infrastructure**, and how touches us, even when we are in the “wilderness”, from global supply chains behind a Cliff Bar in my hand to GPS helping me locate the only trickle of water within 30 miles.  \n\n**❸ Distance, duration and repetition**. Moving through landscape at a biological pace versus infinite-scrolling the internet, and other non-obvious perceptual similarities.  \n\nIf you feel like you grew up on the internet and daydream about an extended priories of being offline, you may be into this. If you where outdoor clothing but spend all your time [staring at screens](https://www.instagram.com/organiclab.zip/?hl=en), you may be into this.\n\n[PCT Portraits](https://jondashkyle.s3.amazonaws.com/2021-pct/pct-loop.mp4?width=2048&height=1024&autoplay=true&loop=true&muted=true)\n\n## The published work\n\nThe published work will consist of an entry containing:\n\n**❶** Several discrete sections of narrative writing centered on the topics referenced above, interspersed with collage style interludes.  \n\n**❷** 3–5 video loops (0:30–4:00min) sourcing found imagery, photos taken on the trail, and interpretations of navigational diagrams and interfaces.  \n\n**❸** An archive of research and reference material assembled over the production of the work in the form of a `.zip`.  \n\n**❹** The final work will be posted in June/July, with incremental progress updates taking place along the way.\n\nSources of inspiration are [Uncommon Ground](https://www.amazon.com/Uncommon-Ground-Rethinking-Human-Nature/dp/0393315118) by William Cronon, [Making Time: Essays on the Nature of Los Angeles](https://www.amazon.com/gp/product/1593761333/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1593761333&linkCode=as2&tag=wlfox-20&linkId=d1862f801fdcf50321b81976221d2713) by William Fox, and the television show [Connections](https://www.youtube.com/watch?v=XetplHcM7aQ&ab_channel=DRS_Education) by James Burke. Similarly, I’m inspired and view these topics as shaped by non-literary work like [*A Line Made By Walking*](https://www.tate.org.uk/art/artworks/long-a-line-made-by-walking-p07149) by Richard Long, and other artistic gestures.\n\nUp until now, the most I’ve publicly shared about the walk was a brief mention in [my contribution](https://walkerart.org/magazine/series/the-year-according-to) to Walker Art Center “Year According To…” series. I also hosted a [life stream session for LOT 2046](https://www.youtube.com/watch?v=MRHxdxQS2jA) one afternoon, loosely centered around the walk.\n\n[Year According To](https://walkerart.org/magazine/2019-the-year-according-to-jon-kyle)\n\nThis will be the first time I’ve revisited the notes, photos, and videos generated while on the walk. It’s difficult to understate how formative an experience this was for me—it will inform everything that follows in ways both big and small.\n\nThe motivations for this crowdfund are quite simple:\n\n**❶** Some time has passed since the walk, and I’m now in a place where enough distance has been created to where I can revisit all the material I generated while on-trail.  \n\n**❷** I’d like to donate to non-profits which do important work in the making the outdoors more accessible to underrepresented groups, and the association which acts as custodian of the PCT.  \n\n**❸** As part of the team at [Mirror](https://mirror.xyz) I’d like to run a crowdfund for real. It’s always different when doing the real thing, and this will help shape my approach to design and interface as we make the tools available to more people. \n\n![](https://images.mirror-media.xyz/publication-images/f9ffca1d-dd22-40e8-b1fa-617aa63e7478.jpeg?height=957&width=2300&size=medium)\n\n## Who am I?\n\nI began unschooling in 5th grade while living in a small town, learning idiosyncratically without curriculum online. I had an interest in design, and began programming in Flash, a hybrid environment of design, animation, and interaction. When I was 19 I moved to Los Angeles to join the personal publishing platform [Cargo (Collective)](https://cargo.site/) as their first hire, where I remained for several years. I then created tools for decentralized publishing over p2p networks while working on commissioned cultural projects anywhere from small record labels to large academic institutions.\n\nMost recently I joined [Mirror](https://mirror.xyz) (the platform you are on) as the Head of Design/Product. You can learn more about me at [jon-kyle.com](https://jon-kyle.com/), and [follow me on Twitter](https://twitter.com/jondashkyle) for updates.", "timestamp": 1618840112, "digest": "LkeLK83xVSxh_F8xGoXPJsb5qPHaM2pLtr5d11IurA0", "contributor": "0xFf37A713c920F6e94043D10c1230e30B13F4d500"}
{"id": "vqS4Q73wXHMaq7Z5tidFLO4oFWS91MeOsw2YwlynNvc", "title": "A Line Retold By Crowdfunding", "body": "Today is the *exact* two year anniversary of my first step on a (long) walk. It was like any other walk—same as going from the couch to the kitchen—but this one began at the US/Mexico border and ended at the US/Canada border. It took 4 months to cover 2,650 miles on foot, and over that distance and duration my mind wandered, as it does, creating connections between life offline walking through landscape, and life online scrolling through… everything. However, where I expected there to be *differences*, there were surprising *similarities*. **This is a crowdfund to tell that story.**\n\n[PCT Map](https://wonderful-ritchie-5b55a6.netlify.app/map?display=iframe&size=large)\n\nTo do this I’m looking to raise **5 ETH**. **1/3** will go [Melanin Base Camp](https://www.melaninbasecamp.com/), a non-profit addressing representation, access and cultural identity within the outdoor industry and conservation. **1/3** will go to the [Pacific Crest Trail Association](https://www.pcta.org/), a non-profit focused on preserving and protecting the PCT. The remaining 1/3 will fund the time spent organizing material, research, writing and publishing the work. If the 5 ETH goal is reached I will also produce a 5:00–10:00min long collage video to compliment the work. The finished work will be minted as a NFT (carbon offset) and auctioned, with the value flowing [back to those who participated in the crowdfund](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ) and hold $WALK. This way of crowdfunding is looking to fundamentally change the way writers fund and sustain their work, and give a stake in the success to the backers.\n\n[Walk Crowdfund](crowdfund://0x6Bbee45ac65C706D4a701B0977aC9C5cdd448323?network=homestead&softCap=5)\n\n[Crowdfunds on Mirror](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n\n![](https://images.mirror-media.xyz/publication-images/4426dfd4-69aa-4485-8852-a2e3d83313e4.jpeg?height=900&width=1600&hide=true)\n\n## Who is this for?\n\nThere are plenty of stories about the Pacific Crest Trail told by those who have completed it (966 did in 2019.) This is one is different. I’m not planing to focus on specific details of the trail; *“I summited a mountain, then I got hungry, then I saw some trees.”* Those sorts of reports are fun, but there are existing accounts like that better than what I’m capable of.\n\nInstead, this will focus on drawing connections between the experience of the walk and other areas of personal knowledge and interest, treating the trail as a connecting path between the overlap. If you happen to have similar interests, this too may be interesting. Some of the themes will include:\n\n**❶ Environment**, both those online and offline, and the increasingly entangled liminal spaces in-between. There was a lot of time to consider biological interfaces (my legs) and technological (my phone.)\n\n**❷ Infrastructure**, and how touches us, even when we are in the “wilderness”, from global supply chains behind a Cliff Bar in my hand to GPS helping me locate the only trickle of water within 30 miles.  \n\n**❸ Distance, duration and repetition**. Moving through landscape at a biological pace versus infinite-scrolling the internet, and other non-obvious perceptual similarities.  \n\nIf you feel like you grew up on the internet and daydream about an extended priories of being offline, you may be into this. If you where outdoor clothing but spend all your time [staring at screens](https://www.instagram.com/organiclab.zip/?hl=en), you may be into this.\n\n[PCT Portraits](https://jondashkyle.s3.amazonaws.com/2021-pct/pct-loop.mp4?width=2048&height=1024&autoplay=true&loop=true&muted=true)\n\n## The published work\n\nThe published work will consist of an entry containing:\n\n**❶** Several discrete sections of narrative writing centered on the topics referenced above, interspersed with collage style interludes.  \n\n**❷** 3–5 video loops (0:30–4:00min) sourcing found imagery, photos taken on the trail, and interpretations of navigational diagrams and interfaces.  \n\n**❸** An archive of research and reference material assembled over the production of the work in the form of a `.zip`.  \n\n**❹** The final work will be posted in June/July, with incremental progress updates taking place along the way.\n\nSources of inspiration are [Uncommon Ground](https://www.amazon.com/Uncommon-Ground-Rethinking-Human-Nature/dp/0393315118) by William Cronon, [Making Time: Essays on the Nature of Los Angeles](https://www.amazon.com/gp/product/1593761333/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1593761333&linkCode=as2&tag=wlfox-20&linkId=d1862f801fdcf50321b81976221d2713) by William Fox, and the television show [Connections](https://www.youtube.com/watch?v=XetplHcM7aQ&ab_channel=DRS_Education) by James Burke. Similarly, I’m inspired and view these topics as shaped by non-literary work like [*A Line Made By Walking*](https://www.tate.org.uk/art/artworks/long-a-line-made-by-walking-p07149) by Richard Long, and other artistic gestures.\n\nUp until now, the most I’ve publicly shared about the walk was a brief mention in [my contribution](https://walkerart.org/magazine/series/the-year-according-to) to Walker Art Center “Year According To…” series. I also hosted a [life stream session for LOT 2046](https://www.youtube.com/watch?v=MRHxdxQS2jA) one afternoon, loosely centered around the walk.\n\n[Year According To](https://walkerart.org/magazine/2019-the-year-according-to-jon-kyle)\n\nThis will be the first time I’ve revisited the notes, photos, and videos generated while on the walk. It’s difficult to understate how formative an experience this was for me—it will inform everything that follows in ways both big and small.\n\nThe motivations for this crowdfund are quite simple:\n\n**❶** Some time has passed since the walk, and I’m now in a place where enough distance has been created to where I can revisit all the material I generated while on-trail.  \n\n**❷** I’d like to donate to non-profits which do important work in the making the outdoors more accessible to underrepresented groups, and the association which acts as custodian of the PCT.  \n\n**❸** As part of the team at [Mirror](https://mirror.xyz) I’d like to run a crowdfund for real. It’s always different when doing the real thing, and this will help shape my approach to design and interface as we make the tools available to more people. \n\n![](https://images.mirror-media.xyz/publication-images/f9ffca1d-dd22-40e8-b1fa-617aa63e7478.jpeg?height=957&width=2300&size=medium)\n\n## Who am I?\n\nI began unschooling in 5th grade while living in a small town, learning idiosyncratically without curriculum online. I had an interest in design, and began programming in Flash, a hybrid environment of design, animation, and interaction. When I was 19 I moved to Los Angeles to join the personal publishing platform [Cargo (Collective)](https://cargo.site/) as their first hire, where I remained for several years. I then created tools for decentralized publishing over p2p networks while working on commissioned cultural projects anywhere from small record labels to large academic institutions.\n\nMost recently I joined [Mirror](https://mirror.xyz) (the platform you are on) as the Head of Design/Product. You can learn more about me at [jon-kyle.com](https://jon-kyle.com/), and [follow me on Twitter](https://twitter.com/jondashkyle) for updates.", "timestamp": 1618840931, "digest": "LkeLK83xVSxh_F8xGoXPJsb5qPHaM2pLtr5d11IurA0", "contributor": "0xFf37A713c920F6e94043D10c1230e30B13F4d500"}
{"id": "C_7VvqSSBBLjQ-ROZ23qLo9HTkHCWfwbgctNfoAj5uw", "title": "Internet Renaissance Vibez", "body": "[Splits v2](split://0x35c80800210Aa944F16C25FbB788246640AE0Ab0?network=mainnet)\n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/81)\n\nThree years ago, I was about to graduate college and still had no idea what I wanted to do. I studied Finance but after a few internships, I realized I wasn’t meant to be in a cheap suit from JCPenny cranking out discounted cash flow models until midnight. At the time, a friend of mine had just finished a coding bootcamp and suggested I try learning to code.\n\nIt was my senior year so like any rational person, I decided to stop going to class so I could code all day (sorry mom). Over the next few months I picked up web development, built full-stack apps, and did so many [Leetcode](https://leetcode.com/) problems that you’d think it was a form of capital punishment. \n\nOnce I graduated, I bought a one-way ticket to San Francisco and stayed on a cozy air mattress in my friend’s living room. Over the next few months, I did some contract work for my friends at [Career Karma](http://careerkarma.com/) and eventually landed a job as a software engineer on the growth team at [Instacart](instacart.com).\n\nA little over a year later, I was looking to work at an early stage startup so I got in touch with a [DeFi](https://en.wikipedia.org/wiki/Decentralized_finance) startup called [Dharma](http://dharma.io/). I had no clue what DeFi was but it was using this crypto thing I vaguely remembered hearing about a while back. After speaking with the team about their vision for a decentralized bank, I was red pilled.\n\nI joined the team but started having imposter syndrome in my first meeting. They talked about counterfactuals, meta transactions, proxy contracts, on-chain this and off-chain that. After the meeting, I had a mini dictionary worth of terms to look up on Wikipedia that night. Then we got to lunch and the entire team passionately debated token economics, incentive structures, governance mechanisms, and all this other stuff I had no clue about. I quickly realized this crypto thing wasn’t just slightly different than existing systems. It was completely different.\n\nOne of my favorite things about crypto is that it’s not just a technology. It’s a philosophy. It’s a belief system. It’s a way of viewing the world. It’s about questioning conventional systems and not caring if everyone else thinks you’re batshit crazy.\n\nOver the next few months, I learned more about cryptonetworks and how they worked under the hood. I remember the “aha moment” when I wrote my first smart contract. With just a few lines of code and a private key, I was able to transfer an internet-native currency anywhere in the world in seconds. \n\nI didn’t have to sign up for Stripe. I didn’t have to use the Plaid API to connect a bank account. I didn’t have to check if TransferWise supported payments for a specific country. There was no centralized party. Just a peer-to-peer cryptonetwork called Ethereum. It was pretty damn mindblowing.\n\nAfter the first few weeks at Dharma, I was confident that DeFi and crypto were the future. But I also got the itch to work on some of my own ideas. I wanted to build software for creative people. Writers. Artists. Musicians. Online teachers. I strongly believe our world depends on these types of people having the tools they need to serve their communities as best they can.\n\nFrankly, I also thought it would take a couple years before the crypto industry had the infrastructure in place for a mainstream consumer app to be built.\n\n\nSo I ended up leaving Dharma to take some time off and explore a few startup ideas. But a couple months ago I read a [manifesto](https://cryptomedia.wtf/) by [Zora](https://zora.co/) that changed how I thought about crypto.\n\nIt described a world where crypto could be used to give any digital media file (eg an image, a song, an essay, digital art, etc.) property rights. It explained how cryptonetworks could turn digital media into liquid financial assets, secured through cryptography, and programmable through smart contracts.\n\nAlthough the individual ideas weren’t new, they were combined and articulated in a way that just made sense. And not just to me.\n\n[Digital artists](https://www.reuters.com/article/retail-trading-nfts/insight-how-a-10-second-video-clip-sold-for-6-6-million-idUKL8N2KV6X9), [athletes](https://www.cnbc.com/2021/02/28/230-million-dollars-spent-on-nba-top-shot.html), [social media influencers](https://cryptoslate.com/logan-paul-nfts-sell-3-5-million-worth-on-first-day-of-release/), [tech executives](https://scottbelsky.medium.com/the-furry-lisa-cryptoart-the-new-economy-of-digital-creativity-6cb2300ea081), [media executives](https://darkstar.mirror.xyz/srmoGiN_1pg_toQGzCupkjWFOaf8xi0mM60zYpn_pwI), and [journalists](https://twitter.com/CaseyNewton/status/1366554892035219462) that never took the crypto weirdos seriously, seem to be taking notice.\n\nBut let’s be real. Is this latest NFT craze a bubble? Probz. Yet, is there at least a kernel of value in the idea of ownership over creative work? I think so.\n\nSo where do we go from here?\n\nWell, there’s been a lot of talk about high transaction fees and lack of scalability in these systems. Although I do think these problems should and will get fixed, a lack of technical scalability is kinda the point.\n\nCryptonetworks trade off technical scalability for social scalability.\n\nFacebook is technically scalable because it’s a social network that processes millions of transactions per second. Meanwhile, Bitcoin is socially scalable because it’s a trillion dollar economic network without a centralized authority.\n\nCrypto isn’t just a technological revolution. It’s also a revolution in capital formation and human coordination. How creative projects are funded. How groups of people are incentivized. How organizations are structured.\n\nYears from now, when I’m old and senile, I believe we’ll look back at this period as an [Internet Renaissance](https://twitter.com/ourZORA/status/1343210395704541189) of sorts. \n\nA time where we dared to fight back against systems that have been designed for centuries to elevate certain groups and keep others disenfranchised.\n\nWho knows though. Maybe all this crypto stuff really is just an intellectual ideal that’ll never work in practice. Regardless, I think it’s at least worth trying.", "timestamp": 1618847671, "digest": "pl07RMWdJZktHUAn8hZ02YlO35-Ju49orPrhaRnn4Vo", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "MjPRx6enruTHxNd2ebLMdCTQ3Z9LMd5c5oU82gyrock", "title": "Introducing Songcamp and \"The Unlock\" NFT", "body": "**TL;DR: The music industry is broken. Instead of trying to fix it, let’s just try something a whole lot different. It all starts with [this](https://zora.co/songcamp/2863) NFT.**\n\nThe current music industry models condition us to believe certain untruths: that we must amass millions upon millions of streams a month to earn a decent living, that we must be one thing and build one brand identity and not stray from that, that we must spend an exorbitant amount of time and money finding our audience by paying for data that is siloed off by opaque intermediaries — data that is rightfully ours.  \n\nAll this and more adds up to the hamster wheel performance of the music business. \n\nAnd the worst part is it cuts creativity off. It sets illusory limits upon the limitless imagination of creative folks. \n\nWe need not earn millions of streams. We need not build one and only one version of ourselves. And we sure as hell do not need to commoditize our music and let it sit frozen on digital shelves that we don’t own. \n\n## Music + The New Internet = 💥\n\nThere are new avenues emerging that entirely circumvent these old models. They are young and nascent and not fully understood. We aren’t entirely sure how they work yet, or how most people are going to use them. \n\nBut we *do* know that they allow us to realize a truer value of digital things, which until now has been decided by a handful of centralized organizations. \n\nSo what we must do now is **experiment**. Songcamp is a place to run these experiments. \n\n## Experiment No. 1 → “The Unlock” \n\nOur first experiment is a songwriting camp that doesn’t end when the music is written, but extends out into the visual creation and release of said music. \n\nThe idea is to **collectively fund, create and distribute art**.\n\n### Here’s how it works:\n\n- 3 newly-formed groups of *music makers* are currently co-creating 3 songs from scratch\n\n- 1 team of *visual artists* is working on cover artwork for those records\n\n- and a team of *project operatives* is creating and executing a web3 distribution plan for said music \n\nThis is where you come in…\n\n## We are auctioning off a 1/1 NFT that *unlocks* this songcamp.\n\nPurchasing this piece ***unlocks*** this first songwriting camp for all involved. The funds received will go towards a) our distribution costs (gas fees etc.) and b) the visual team that created this artwork. \n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/2863)\n\n\n\nThis is a 1/1 cassette tape sleeve (known as a J-card) representing the first batch of music created at Songcamp. Artwork is by [Peace Node](https://twitter.com/peace_node) + [Gian Ferrer](https://twitter.com/belGIANgwaffles).\n\n### Auction Details\n\n- The auction will close on **Tuesday April 20th at 4pm ET**. \n- We’ve decided to bake in a “***no resale***” mechanic by setting the Creator Equity to 99%. This ensures that the collector is someone who wants to hold this NFT for a lifetime. It also allows us to build an on-chain community of supporters over time — **a community we intend to grow with and bring value to**. \n\n## What’s Next?\n\nWe will be sharing more details in the coming days/weeks as to how this music will be distributed. \n\nHopefully our next update will come from *songcamp.mirror.xyz* :)\n\nIn order to make that URL a reality, [vote for us](https://mirror.xyz/race?candidate=songcamp) on Wednesday’s $WRITE race. \n\nOh, and connect with us on [Twitter](https://twitter.com/songcampdotband) + [Discord](https://discord.gg/wHsJD2sTpc).", "timestamp": 1618856330, "digest": "QAMs9QuZ1Ij5FjaPuNjMbF9foYLPphVyyUSrJH7wB7w", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
{"id": "pegUuoOjvi1GlpvcmroBUdOGws3Lw2Xy6q8-FDXaCWk", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. \n\n>When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with software engineer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. **The media associated with Solvency tokens are dynamic WebGL simulations.** These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given the same input hash, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the [Arweave blockchain](https://www.arweave.org/).\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as [OpenSea](https://opensea.io/) or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that *ars lunga, vita brevis* was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n*Solvency will be open to the public on Thursday April 22nd. To join the Discord for updates, [click here](https://discord.gg/BHXXzG3YR2)*", "timestamp": 1618858723, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "BIsAEeRWq2XaXIRFD_COK8c14BGLHDa3n13YwEaWx2w", "title": "A Line Retold By Crowdfunding", "body": "Today is the *exact* two year anniversary of my first step on a (long) walk. It was like any other walk—same as going from the couch to the kitchen—but this one began at the US/Mexico border and ended at the US/Canada border. It took 4 months to cover 2,650 miles on foot, and over that distance and duration my mind wandered, as it does, creating connections between life offline walking through landscape, and life online scrolling through… everything. However, where I expected there to be *differences*, there were surprising *similarities*. **This is a crowdfund to tell that story.**\n\n[PCT Map](https://wonderful-ritchie-5b55a6.netlify.app/map?display=iframe&size=large)\n\nTo do this I’m looking to raise **5 ETH**. **1/3** will go [Melanin Base Camp](https://www.melaninbasecamp.com/), a non-profit addressing representation, access and cultural identity within the outdoor industry and conservation. **1/3** will go to the [Pacific Crest Trail Association](https://www.pcta.org/), a non-profit focused on preserving and protecting the PCT. The remaining 1/3 will fund the time spent organizing material, research, writing and publishing the work. If the 5 ETH goal is reached I will also produce a 5:00–10:00min long collage video to compliment the work. The finished work will be minted as a NFT (carbon offset) and auctioned, with the value flowing [back to those who participated in the crowdfund](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ) and hold $WALK. This way of crowdfunding is looking to fundamentally change the way writers fund and sustain their work, and give a stake in the success to the backers.\n\n[Walk Crowdfund](crowdfund://0x6Bbee45ac65C706D4a701B0977aC9C5cdd448323?network=homestead&softCap=5)\n\n*Note: Gas prices are currently quite high. This crowdfund isn’t going anywhere, so perhaps hold off until they come down. I’ll be providing [periodic updates over on Twitter](https://twitter.com/jondashkyle).\n\n[Crowdfunds on Mirror](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n\n![](https://images.mirror-media.xyz/publication-images/4426dfd4-69aa-4485-8852-a2e3d83313e4.jpeg?height=900&width=1600&hide=true)\n\n## Who is this for?\n\nThere are plenty of stories about the Pacific Crest Trail told by those who have completed it (966 did in 2019.) This is one is different. I’m not planing to focus on specific details of the trail; *“I summited a mountain, then I got hungry, then I saw some trees.”* Those sorts of reports are fun, but there are existing accounts like that better than what I’m capable of.\n\nInstead, this will focus on drawing connections between the experience of the walk and other areas of personal knowledge and interest, treating the trail as a connecting path between the overlap. If you happen to have similar interests, this too may be interesting. Some of the themes will include:\n\n**❶ Environment**, both those online and offline, and the increasingly entangled liminal spaces in-between. There was a lot of time to consider biological interfaces (my legs) and technological (my phone.)\n\n**❷ Infrastructure**, and how touches us, even when we are in the “wilderness”, from global supply chains behind a Cliff Bar in my hand to GPS helping me locate the only trickle of water within 30 miles.  \n\n**❸ Distance, duration and repetition**. Moving through landscape at a biological pace versus infinite-scrolling the internet, and other non-obvious perceptual similarities.  \n\nIf you feel like you grew up on the internet and daydream about an extended priories of being offline, you may be into this. If you where outdoor clothing but spend all your time [staring at screens](https://www.instagram.com/organiclab.zip/?hl=en), you may be into this.\n\n[PCT Portraits](https://jondashkyle.s3.amazonaws.com/2021-pct/pct-loop.mp4?width=2048&height=1024&autoplay=true&loop=true&muted=true)\n\n## The published work\n\nThe published work will consist of an entry containing:\n\n**❶** Several discrete sections of narrative writing centered on the topics referenced above, interspersed with collage style interludes.  \n\n**❷** 3–5 video loops (0:30–4:00min) sourcing found imagery, photos taken on the trail, and interpretations of navigational diagrams and interfaces.  \n\n**❸** An archive of research and reference material assembled over the production of the work in the form of a `.zip`.  \n\n**❹** The final work will be posted in June/July, with incremental progress updates taking place along the way.\n\nSources of inspiration are [Uncommon Ground](https://www.amazon.com/Uncommon-Ground-Rethinking-Human-Nature/dp/0393315118) by William Cronon, [Making Time: Essays on the Nature of Los Angeles](https://www.amazon.com/gp/product/1593761333/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1593761333&linkCode=as2&tag=wlfox-20&linkId=d1862f801fdcf50321b81976221d2713) by William Fox, and the television show [Connections](https://www.youtube.com/watch?v=XetplHcM7aQ&ab_channel=DRS_Education) by James Burke. Similarly, I’m inspired and view these topics as shaped by non-literary work like [*A Line Made By Walking*](https://www.tate.org.uk/art/artworks/long-a-line-made-by-walking-p07149) by Richard Long, and other artistic gestures.\n\nUp until now, the most I’ve publicly shared about the walk was a brief mention in [my contribution](https://walkerart.org/magazine/series/the-year-according-to) to Walker Art Center “Year According To…” series. I also hosted a [life stream session for LOT 2046](https://www.youtube.com/watch?v=MRHxdxQS2jA) one afternoon, loosely centered around the walk.\n\n[Year According To](https://walkerart.org/magazine/2019-the-year-according-to-jon-kyle)\n\nThis will be the first time I’ve revisited the notes, photos, and videos generated while on the walk. It’s difficult to understate how formative an experience this was for me—it will inform everything that follows in ways both big and small.\n\nThe motivations for this crowdfund are quite simple:\n\n**❶** Some time has passed since the walk, and I’m now in a place where enough distance has been created to where I can revisit all the material I generated while on-trail.  \n\n**❷** I’d like to donate to non-profits which do important work in the making the outdoors more accessible to underrepresented groups, and the association which acts as custodian of the PCT.  \n\n**❸** As part of the team at [Mirror](https://mirror.xyz) I’d like to run a crowdfund for real. It’s always different when doing the real thing, and this will help shape my approach to design and interface as we make the tools available to more people. \n\n![](https://images.mirror-media.xyz/publication-images/f9ffca1d-dd22-40e8-b1fa-617aa63e7478.jpeg?height=957&width=2300&size=medium)\n\n## Who am I?\n\nI began unschooling in 5th grade while living in a small town, learning idiosyncratically without curriculum online. I had an interest in design, and began programming in Flash, a hybrid environment of design, animation, and interaction. When I was 19 I moved to Los Angeles to join the personal publishing platform [Cargo (Collective)](https://cargo.site/) as their first hire, where I remained for several years. I then created tools for decentralized publishing over p2p networks while working on commissioned cultural projects anywhere from small record labels to large academic institutions.\n\nMost recently I joined [Mirror](https://mirror.xyz) (the platform you are on) as the Head of Design/Product. You can learn more about me at [jon-kyle.com](https://jon-kyle.com/), and [follow me on Twitter](https://twitter.com/jondashkyle) for updates.", "timestamp": 1618859768, "digest": "LkeLK83xVSxh_F8xGoXPJsb5qPHaM2pLtr5d11IurA0", "contributor": "0xFf37A713c920F6e94043D10c1230e30B13F4d500"}
{"id": "hRR3P-4D2qddbaKwTxx1Tdz8A9NltYroGNiHc6S7QO4", "title": "A Line Retold By Crowdfunding", "body": "Today is the *exact* two year anniversary of my first step on a (long) walk. It was like any other walk—same as going from the couch to the kitchen—but this one began at the US/Mexico border and ended at the US/Canada border. It took 4 months to cover 2,650 miles on foot, and over that distance and duration my mind wandered, as it does, creating connections between life offline walking through landscape, and life online scrolling through… everything. However, where I expected there to be *differences*, there were surprising *similarities*. **This is a crowdfund to tell that story.**\n\n[PCT Map](https://wonderful-ritchie-5b55a6.netlify.app/map?display=iframe&size=large)\n\nTo do this I’m looking to raise **5 ETH**. **1/3** will go [Melanin Base Camp](https://www.melaninbasecamp.com/), a non-profit addressing representation, access and cultural identity within the outdoor industry and conservation. **1/3** will go to the [Pacific Crest Trail Association](https://www.pcta.org/), a non-profit focused on preserving and protecting the PCT. The remaining 1/3 will fund the time spent organizing material, research, writing and publishing the work. If the 5 ETH goal is reached I will also produce a 5:00–10:00min long collage video to compliment the work. The finished work will be minted as a NFT (carbon offset) and auctioned, with the value flowing [back to those who participated in the crowdfund](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ) and hold $WALK. This way of crowdfunding is looking to fundamentally change the way writers fund and sustain their work, and give a stake in the success to the backers.\n\n[Walk Crowdfund](crowdfund://0x6Bbee45ac65C706D4a701B0977aC9C5cdd448323?network=homestead&softCap=5)\n\n*Note: Gas prices are currently quite high. This crowdfund isn’t going anywhere, so perhaps hold off until they come down. I’ll be providing [periodic updates on Twitter](https://twitter.com/jondashkyle).*\n\n[Crowdfunds on Mirror](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n\n![](https://images.mirror-media.xyz/publication-images/4426dfd4-69aa-4485-8852-a2e3d83313e4.jpeg?height=900&width=1600&hide=true)\n\n## Who is this for?\n\nThere are plenty of stories about the Pacific Crest Trail told by those who have completed it (966 did in 2019.) This is one is different. I’m not planing to focus on specific details of the trail; *“I summited a mountain, then I got hungry, then I saw some trees.”* Those sorts of reports are fun, but there are existing accounts like that better than what I’m capable of.\n\nInstead, this will focus on drawing connections between the experience of the walk and other areas of personal knowledge and interest, treating the trail as a connecting path between the overlap. If you happen to have similar interests, this too may be interesting. Some of the themes will include:\n\n**❶ Environment**, both those online and offline, and the increasingly entangled liminal spaces in-between. There was a lot of time to consider biological interfaces (my legs) and technological (my phone.)\n\n**❷ Infrastructure**, and how touches us, even when we are in the “wilderness”, from global supply chains behind a Cliff Bar in my hand to GPS helping me locate the only trickle of water within 30 miles.  \n\n**❸ Distance, duration and repetition**. Moving through landscape at a biological pace versus infinite-scrolling the internet, and other non-obvious perceptual similarities.  \n\nIf you feel like you grew up on the internet and daydream about an extended priories of being offline, you may be into this. If you where outdoor clothing but spend all your time [staring at screens](https://www.instagram.com/organiclab.zip/?hl=en), you may be into this.\n\n[PCT Portraits](https://jondashkyle.s3.amazonaws.com/2021-pct/pct-loop.mp4?width=2048&height=1024&autoplay=true&loop=true&muted=true)\n\n## The published work\n\nThe published work will consist of an entry containing:\n\n**❶** Several discrete sections of narrative writing centered on the topics referenced above, interspersed with collage style interludes.  \n\n**❷** 3–5 video loops (0:30–4:00min) sourcing found imagery, photos taken on the trail, and interpretations of navigational diagrams and interfaces.  \n\n**❸** An archive of research and reference material assembled over the production of the work in the form of a `.zip`.  \n\n**❹** The final work will be posted in June/July, with incremental progress updates taking place along the way.\n\nSources of inspiration are [Uncommon Ground](https://www.amazon.com/Uncommon-Ground-Rethinking-Human-Nature/dp/0393315118) by William Cronon, [Making Time: Essays on the Nature of Los Angeles](https://www.amazon.com/gp/product/1593761333/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1593761333&linkCode=as2&tag=wlfox-20&linkId=d1862f801fdcf50321b81976221d2713) by William Fox, and the television show [Connections](https://www.youtube.com/watch?v=XetplHcM7aQ&ab_channel=DRS_Education) by James Burke. Similarly, I’m inspired and view these topics as shaped by non-literary work like [*A Line Made By Walking*](https://www.tate.org.uk/art/artworks/long-a-line-made-by-walking-p07149) by Richard Long, and other artistic gestures.\n\nUp until now, the most I’ve publicly shared about the walk was a brief mention in [my contribution](https://walkerart.org/magazine/series/the-year-according-to) to Walker Art Center “Year According To…” series. I also hosted a [life stream session for LOT 2046](https://www.youtube.com/watch?v=MRHxdxQS2jA) one afternoon, loosely centered around the walk.\n\n[Year According To](https://walkerart.org/magazine/2019-the-year-according-to-jon-kyle)\n\nThis will be the first time I’ve revisited the notes, photos, and videos generated while on the walk. It’s difficult to understate how formative an experience this was for me—it will inform everything that follows in ways both big and small.\n\nThe motivations for this crowdfund are quite simple:\n\n**❶** Some time has passed since the walk, and I’m now in a place where enough distance has been created to where I can revisit all the material I generated while on-trail.  \n\n**❷** I’d like to donate to non-profits which do important work in the making the outdoors more accessible to underrepresented groups, and the association which acts as custodian of the PCT.  \n\n**❸** As part of the team at [Mirror](https://mirror.xyz) I’d like to run a crowdfund for real. It’s always different when doing the real thing, and this will help shape my approach to design and interface as we make the tools available to more people. \n\n![](https://images.mirror-media.xyz/publication-images/f9ffca1d-dd22-40e8-b1fa-617aa63e7478.jpeg?height=957&width=2300&size=medium)\n\n## Who am I?\n\nI began unschooling in 5th grade while living in a small town, learning idiosyncratically without curriculum online. I had an interest in design, and began programming in Flash, a hybrid environment of design, animation, and interaction. When I was 19 I moved to Los Angeles to join the personal publishing platform [Cargo (Collective)](https://cargo.site/) as their first hire, where I remained for several years. I then created tools for decentralized publishing over p2p networks while working on commissioned cultural projects anywhere from small record labels to large academic institutions.\n\nMost recently I joined [Mirror](https://mirror.xyz) (the platform you are on) as the Head of Design/Product. You can learn more about me at [jon-kyle.com](https://jon-kyle.com/), and [follow me on Twitter](https://twitter.com/jondashkyle) for updates.", "timestamp": 1618859808, "digest": "LkeLK83xVSxh_F8xGoXPJsb5qPHaM2pLtr5d11IurA0", "contributor": "0xFf37A713c920F6e94043D10c1230e30B13F4d500"}
{"id": "Iqqxq8ajMlobYZ8tLDVdpNIS4hV7pk6CZosVr_dOEM4", "title": "A Line Retold By Crowdfunding", "body": "Today is the *exact* two year anniversary of my first step on a (long) walk. It was like any other walk—same as going from the couch to the kitchen—but this one began at the US/Mexico border and ended at the US/Canada border. It took 4 months to cover 2,650 miles on foot, and over that distance and duration my mind wandered, as it does, creating connections between life offline walking through landscape, and life online scrolling through… everything. However, where I expected there to be *differences*, there were surprising *similarities*. **This is a crowdfund to tell that story.**\n\n[PCT Map](https://wonderful-ritchie-5b55a6.netlify.app/map?display=iframe&size=large)\n\nTo do this I’m looking to raise **5 ETH**. **1/3** will go [Melanin Base Camp](https://www.melaninbasecamp.com/), a non-profit addressing representation, access and cultural identity within the outdoor industry and conservation. **1/3** will go to the [Pacific Crest Trail Association](https://www.pcta.org/), a non-profit focused on preserving and protecting the PCT. The remaining 1/3 will fund the time spent organizing material, research, writing and publishing the work. If the 5 ETH goal is reached I will also produce a 5:00–10:00min long collage video to compliment the work. The finished work will be minted as a NFT (carbon offset) and auctioned, with the value flowing [back to those who participated in the crowdfund](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ) and hold $WALK. This way of crowdfunding is looking to fundamentally change the way writers fund and sustain their work, and give a stake in the success to the backers.\n\n[Walk Crowdfund](crowdfund://0x6Bbee45ac65C706D4a701B0977aC9C5cdd448323?network=homestead&softCap=5)\n\n*Note: Gas prices are currently quite high. This crowdfund isn’t going anywhere, so perhaps hold off until they come down. I’ll be providing [periodic updates on Twitter](https://twitter.com/jondashkyle).\n\n[Crowdfunds on Mirror](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n\n![](https://images.mirror-media.xyz/publication-images/4426dfd4-69aa-4485-8852-a2e3d83313e4.jpeg?height=900&width=1600&hide=true)\n\n## Who is this for?\n\nThere are plenty of stories about the Pacific Crest Trail told by those who have completed it (966 did in 2019.) This is one is different. I’m not planing to focus on specific details of the trail; *“I summited a mountain, then I got hungry, then I saw some trees.”* Those sorts of reports are fun, but there are existing accounts like that better than what I’m capable of.\n\nInstead, this will focus on drawing connections between the experience of the walk and other areas of personal knowledge and interest, treating the trail as a connecting path between the overlap. If you happen to have similar interests, this too may be interesting. Some of the themes will include:\n\n**❶ Environment**, both those online and offline, and the increasingly entangled liminal spaces in-between. There was a lot of time to consider biological interfaces (my legs) and technological (my phone.)\n\n**❷ Infrastructure**, and how touches us, even when we are in the “wilderness”, from global supply chains behind a Cliff Bar in my hand to GPS helping me locate the only trickle of water within 30 miles.  \n\n**❸ Distance, duration and repetition**. Moving through landscape at a biological pace versus infinite-scrolling the internet, and other non-obvious perceptual similarities.  \n\nIf you feel like you grew up on the internet and daydream about an extended priories of being offline, you may be into this. If you where outdoor clothing but spend all your time [staring at screens](https://www.instagram.com/organiclab.zip/?hl=en), you may be into this.\n\n[PCT Portraits](https://jondashkyle.s3.amazonaws.com/2021-pct/pct-loop.mp4?width=2048&height=1024&autoplay=true&loop=true&muted=true)\n\n## The published work\n\nThe published work will consist of an entry containing:\n\n**❶** Several discrete sections of narrative writing centered on the topics referenced above, interspersed with collage style interludes.  \n\n**❷** 3–5 video loops (0:30–4:00min) sourcing found imagery, photos taken on the trail, and interpretations of navigational diagrams and interfaces.  \n\n**❸** An archive of research and reference material assembled over the production of the work in the form of a `.zip`.  \n\n**❹** The final work will be posted in June/July, with incremental progress updates taking place along the way.\n\nSources of inspiration are [Uncommon Ground](https://www.amazon.com/Uncommon-Ground-Rethinking-Human-Nature/dp/0393315118) by William Cronon, [Making Time: Essays on the Nature of Los Angeles](https://www.amazon.com/gp/product/1593761333/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1593761333&linkCode=as2&tag=wlfox-20&linkId=d1862f801fdcf50321b81976221d2713) by William Fox, and the television show [Connections](https://www.youtube.com/watch?v=XetplHcM7aQ&ab_channel=DRS_Education) by James Burke. Similarly, I’m inspired and view these topics as shaped by non-literary work like [*A Line Made By Walking*](https://www.tate.org.uk/art/artworks/long-a-line-made-by-walking-p07149) by Richard Long, and other artistic gestures.\n\nUp until now, the most I’ve publicly shared about the walk was a brief mention in [my contribution](https://walkerart.org/magazine/series/the-year-according-to) to Walker Art Center “Year According To…” series. I also hosted a [life stream session for LOT 2046](https://www.youtube.com/watch?v=MRHxdxQS2jA) one afternoon, loosely centered around the walk.\n\n[Year According To](https://walkerart.org/magazine/2019-the-year-according-to-jon-kyle)\n\nThis will be the first time I’ve revisited the notes, photos, and videos generated while on the walk. It’s difficult to understate how formative an experience this was for me—it will inform everything that follows in ways both big and small.\n\nThe motivations for this crowdfund are quite simple:\n\n**❶** Some time has passed since the walk, and I’m now in a place where enough distance has been created to where I can revisit all the material I generated while on-trail.  \n\n**❷** I’d like to donate to non-profits which do important work in the making the outdoors more accessible to underrepresented groups, and the association which acts as custodian of the PCT.  \n\n**❸** As part of the team at [Mirror](https://mirror.xyz) I’d like to run a crowdfund for real. It’s always different when doing the real thing, and this will help shape my approach to design and interface as we make the tools available to more people. \n\n![](https://images.mirror-media.xyz/publication-images/f9ffca1d-dd22-40e8-b1fa-617aa63e7478.jpeg?height=957&width=2300&size=medium)\n\n## Who am I?\n\nI began unschooling in 5th grade while living in a small town, learning idiosyncratically without curriculum online. I had an interest in design, and began programming in Flash, a hybrid environment of design, animation, and interaction. When I was 19 I moved to Los Angeles to join the personal publishing platform [Cargo (Collective)](https://cargo.site/) as their first hire, where I remained for several years. I then created tools for decentralized publishing over p2p networks while working on commissioned cultural projects anywhere from small record labels to large academic institutions.\n\nMost recently I joined [Mirror](https://mirror.xyz) (the platform you are on) as the Head of Design/Product. You can learn more about me at [jon-kyle.com](https://jon-kyle.com/), and [follow me on Twitter](https://twitter.com/jondashkyle) for updates.", "timestamp": 1618859794, "digest": "LkeLK83xVSxh_F8xGoXPJsb5qPHaM2pLtr5d11IurA0", "contributor": "0xFf37A713c920F6e94043D10c1230e30B13F4d500"}
{"id": "MDAgH-kO6BIvAY9b52gTHOuozLwxLggBs7_clAFzuqY", "title": "A Line Retold By Crowdfunding", "body": "Today is the *exact* two year anniversary of my first step on a (long) walk. It was like any other walk—same as going from the couch to the kitchen—but this one began at the US/Mexico border and ended at the US/Canada border. It took 4 months to cover 2,650 miles on foot, and over that distance and duration my mind wandered, as it does, creating connections between life offline walking through landscape, and life online scrolling through… everything. However, where I expected there to be *differences*, there were surprising *similarities*. **This is a crowdfund to tell that story.**\n\n[PCT Map](https://wonderful-ritchie-5b55a6.netlify.app/map?display=iframe&size=large)\n\nTo do this I’m looking to raise **5 ETH**. **1/3** will go [Melanin Base Camp](https://www.melaninbasecamp.com/), a non-profit addressing representation, access and cultural identity within the outdoor industry and conservation. **1/3** will go to the [Pacific Crest Trail Association](https://www.pcta.org/), a non-profit focused on preserving and protecting the PCT. The remaining 1/3 will fund the time spent organizing material, research, writing and publishing the work. If the 5 ETH goal is reached I will also produce a 5:00–10:00min long collage video to compliment the work. The finished work will be minted as a NFT (carbon offset) and auctioned, with the value flowing [back to those who participated in the crowdfund](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ) and hold $WALK. This way of crowdfunding is looking to fundamentally change the way writers fund and sustain their work, and give a stake in the success to the backers.\n\n[Walk Crowdfund](crowdfund://0x6Bbee45ac65C706D4a701B0977aC9C5cdd448323?network=homestead&softCap=5)\n\n*Note: Gas prices are currently quite high. This crowdfund isn’t going anywhere, so no worries for holding off until they come down. I’ll be providing [updates on Twitter](https://twitter.com/jondashkyle).*\n\n[Crowdfunds on Mirror](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n\n![](https://images.mirror-media.xyz/publication-images/4426dfd4-69aa-4485-8852-a2e3d83313e4.jpeg?height=900&width=1600&hide=true)\n\n## Who is this for?\n\nThere are plenty of stories about the Pacific Crest Trail told by those who have completed it (966 did in 2019.) This is one is different. I’m not planing to focus on specific details of the trail; *“I summited a mountain, then I got hungry, then I saw some trees.”* Those sorts of reports are fun, but there are existing accounts like that better than what I’m capable of.\n\nInstead, this will focus on drawing connections between the experience of the walk and other areas of personal knowledge and interest, treating the trail as a connecting path between the overlap. If you happen to have similar interests, this too may be interesting. Some of the themes will include:\n\n**❶ Environment**, both those online and offline, and the increasingly entangled liminal spaces in-between. There was a lot of time to consider biological interfaces (my legs) and technological (my phone.)\n\n**❷ Infrastructure**, and how touches us, even when we are in the “wilderness”, from global supply chains behind a Cliff Bar in my hand to GPS helping me locate the only trickle of water within 30 miles.  \n\n**❸ Distance, duration and repetition**. Moving through landscape at a biological pace versus infinite-scrolling the internet, and other non-obvious perceptual similarities.  \n\nIf you feel like you grew up on the internet and daydream about an extended priories of being offline, you may be into this. If you where outdoor clothing but spend all your time [staring at screens](https://www.instagram.com/organiclab.zip/?hl=en), you may be into this.\n\n[PCT Portraits](https://jondashkyle.s3.amazonaws.com/2021-pct/pct-loop.mp4?width=2048&height=1024&autoplay=true&loop=true&muted=true)\n\n## The published work\n\nThe published work will consist of an entry containing:\n\n**❶** Several discrete sections of narrative writing centered on the topics referenced above, interspersed with collage style interludes.  \n\n**❷** 3–5 video loops (0:30–4:00min) sourcing found imagery, photos taken on the trail, and interpretations of navigational diagrams and interfaces.  \n\n**❸** An archive of research and reference material assembled over the production of the work in the form of a `.zip`.  \n\n**❹** The final work will be posted in June/July, with incremental progress updates taking place along the way.\n\nSources of inspiration are [Uncommon Ground](https://www.amazon.com/Uncommon-Ground-Rethinking-Human-Nature/dp/0393315118) by William Cronon, [Making Time: Essays on the Nature of Los Angeles](https://www.amazon.com/gp/product/1593761333/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1593761333&linkCode=as2&tag=wlfox-20&linkId=d1862f801fdcf50321b81976221d2713) by William Fox, and the television show [Connections](https://www.youtube.com/watch?v=XetplHcM7aQ&ab_channel=DRS_Education) by James Burke. Similarly, I’m inspired and view these topics as shaped by non-literary work like [*A Line Made By Walking*](https://www.tate.org.uk/art/artworks/long-a-line-made-by-walking-p07149) by Richard Long, and other artistic gestures.\n\nUp until now, the most I’ve publicly shared about the walk was a brief mention in [my contribution](https://walkerart.org/magazine/series/the-year-according-to) to Walker Art Center “Year According To…” series. I also hosted a [life stream session for LOT 2046](https://www.youtube.com/watch?v=MRHxdxQS2jA) one afternoon, loosely centered around the walk.\n\n[Year According To](https://walkerart.org/magazine/2019-the-year-according-to-jon-kyle)\n\nThis will be the first time I’ve revisited the notes, photos, and videos generated while on the walk. It’s difficult to understate how formative an experience this was for me—it will inform everything that follows in ways both big and small.\n\nThe motivations for this crowdfund are quite simple:\n\n**❶** Some time has passed since the walk, and I’m now in a place where enough distance has been created to where I can revisit all the material I generated while on-trail.  \n\n**❷** I’d like to donate to non-profits which do important work in the making the outdoors more accessible to underrepresented groups, and the association which acts as custodian of the PCT.  \n\n**❸** As part of the team at [Mirror](https://mirror.xyz) I’d like to run a crowdfund for real. It’s always different when doing the real thing, and this will help shape my approach to design and interface as we make the tools available to more people. \n\n![](https://images.mirror-media.xyz/publication-images/f9ffca1d-dd22-40e8-b1fa-617aa63e7478.jpeg?height=957&width=2300&size=medium)\n\n## Who am I?\n\nI began unschooling in 5th grade while living in a small town, learning idiosyncratically without curriculum online. I had an interest in design, and began programming in Flash, a hybrid environment of design, animation, and interaction. When I was 19 I moved to Los Angeles to join the personal publishing platform [Cargo (Collective)](https://cargo.site/) as their first hire, where I remained for several years. I then created tools for decentralized publishing over p2p networks while working on commissioned cultural projects anywhere from small record labels to large academic institutions.\n\nMost recently I joined [Mirror](https://mirror.xyz) (the platform you are on) as the Head of Design/Product. You can learn more about me at [jon-kyle.com](https://jon-kyle.com/), and [follow me on Twitter](https://twitter.com/jondashkyle) for updates.", "timestamp": 1618860005, "digest": "LkeLK83xVSxh_F8xGoXPJsb5qPHaM2pLtr5d11IurA0", "contributor": "0xFf37A713c920F6e94043D10c1230e30B13F4d500"}
{"id": "d-3GfxwJXZ9qdwxLuHdan7qZsWlIsk-VE-BFv9R02KM", "title": "Introducing Songcamp and \"The Unlock\" NFT", "body": "**TL;DR: The music industry is broken. Instead of trying to fix it, let’s just try something a whole lot different. It all starts with [this](https://zora.co/songcamp/2863) NFT.**\n\nThe current music industry models condition us to believe certain untruths: that we must amass millions upon millions of streams a month to earn a decent living, that we must be one thing and build one brand identity and not stray from that, that we must spend an exorbitant amount of time and money finding our audience by paying for data that is siloed off by opaque intermediaries — data that is rightfully ours.  \n\nAll this and more adds up to the hamster wheel performance of the music business. \n\nAnd the worst part is it cuts creativity off. It sets illusory limits upon the limitless imagination of creative folks. \n\nWe need not earn millions of streams. We need not build one and only one version of ourselves. And we sure as hell do not need to commoditize our music and let it sit frozen on digital shelves that we don’t own. \n\n## Music + The New Internet = 💥\n\nThere are new avenues emerging that entirely circumvent these old models. They are young and nascent and not fully understood. We aren’t entirely sure how they work yet, or how most people are going to use them. \n\nBut we *do* know that they allow us to realize a truer value of digital things, which until now has been decided by a handful of centralized organizations. \n\nSo what we must do now is **experiment**. Songcamp is a place to run these experiments. \n\n## Experiment No. 1 → “The Unlock” \n\nOur first experiment is a songwriting camp that doesn’t end when the music is written, but extends out into the visual creation and release of said music. \n\nThe idea is to **collectively fund, create and distribute art**.\n\n### Here’s how it works:\n\n- 3 newly-formed groups of *music makers* are currently co-creating 3 songs from scratch\n\n- 1 team of *visual artists* is working on cover artwork for those records\n\n- and a team of *project operatives* is creating and executing a web3 distribution plan for said music \n\nThis is where you come in…\n\n## We are auctioning off a 1/1 NFT that *unlocks* this songcamp.\n\nPurchasing this piece ***unlocks*** this first songwriting camp for all involved. The funds received will go towards a) our distribution costs (gas fees etc.) and b) the visual team that created this artwork. \n\n[NFT](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/2863)\n\n\n\nThis is a 1/1 cassette tape sleeve (known as a J-card) representing the first batch of music created at Songcamp. Artwork is by [Peace Node](https://twitter.com/peace_node) + [Gian Ferrer](https://twitter.com/belGIANgwaffles).\n\n### What The Collector Gets\n\n- This incredibly dope NFT, a badge of honor that says you unlocked the first songcamp\n- Your name (+ logo) included on the final songs’ cover artworks\n- Social media love + bragging rights as the named sponsor of this camp\n- On-chain recognition as the *first* supporter of Songcamp, with retroactive benefits (tbd) as the community grows \n\n### Auction Details\n\n- The auction will close on **Tuesday April 20th at 4pm ET**. \n- We’ve decided to bake in a “***no resale***” mechanic by setting the Creator Equity to 99%. This ensures that the collector is someone who wants to hold this NFT for a lifetime. It also allows us to build an on-chain community of supporters over time — **a community we intend to grow with and bring value to**. \n\n## What’s Next?\n\nWe will be sharing more details in the coming days/weeks as to how this music will be distributed. \n\nHopefully our next update will come from *songcamp.mirror.xyz* :)\n\nIn order to make that URL a reality, [vote for us](https://mirror.xyz/race?candidate=songcamp) on Wednesday’s $WRITE race. \n\nOh, and connect with us on [Twitter](https://twitter.com/songcampdotband) + [Discord](https://discord.gg/wHsJD2sTpc).", "timestamp": 1618871209, "digest": "QAMs9QuZ1Ij5FjaPuNjMbF9foYLPphVyyUSrJH7wB7w", "contributor": "0x5090c4Fead5Be112b643BC75d61bF42339675448"}
{"id": "Y9Ruh2BHPJ3aO8gdZfIAfbiTiD11DPfJs8Wfcp28P50", "title": "A Line Retold By Crowdfunding", "body": "Today is the *exact* two year anniversary of my first step on a (long) walk. It was like any other walk—same as going from the couch to the kitchen—but this one began at the US/Mexico border and ended at the US/Canada border. It took 4 months to cover 2,650 miles on foot, and over that distance and duration my mind wandered, as it does, creating connections between life offline walking through landscape, and life online scrolling through… everything. However, where I expected there to be *differences*, there were surprising *similarities*. **This is a crowdfund to tell that story.**\n\n[PCT Map](https://wonderful-ritchie-5b55a6.netlify.app/map?display=iframe&size=large)\n\nTo do this I’m looking to raise **5 ETH**. **1/3** will go [Melanin Base Camp](https://www.melaninbasecamp.com/), a non-profit addressing representation, access and cultural identity within the outdoor industry and conservation. **1/3** will go to the [Pacific Crest Trail Association](https://www.pcta.org/), a non-profit focused on preserving and protecting the PCT. The remaining 1/3 will fund the time spent organizing material, research, writing and publishing the work. If the 5 ETH goal is reached I will also produce a 5:00–10:00min long collage video to compliment the work. The finished work will be minted as a NFT (carbon offset) and auctioned, with the value flowing [back to those who participated in the crowdfund](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ) and hold $WALK. This way of crowdfunding is looking to fundamentally change the way writers fund and sustain their work, and give a stake in the success to the backers.\n\n[Walk Crowdfund](crowdfund://0x6Bbee45ac65C706D4a701B0977aC9C5cdd448323?network=homestead&softCap=5)\n\n[Crowdfunds on Mirror](https://dev.mirror.xyz/llJ_AboiDJwB_ZAFz-CXU7fL2p8v5Wz6MjfluLafewQ)\n\n![](https://images.mirror-media.xyz/publication-images/4426dfd4-69aa-4485-8852-a2e3d83313e4.jpeg?height=900&width=1600&hide=true)\n\n## Who is this for?\n\nThere are plenty of stories about the Pacific Crest Trail told by those who have completed it (966 did in 2019.) This is one is different. I’m not planing to focus on specific details of the trail; *“I summited a mountain, then I got hungry, then I saw some trees.”* Those sorts of reports are fun, but there are existing accounts like that better than what I’m capable of.\n\nInstead, this will focus on drawing connections between the experience of the walk and other areas of personal knowledge and interest, treating the trail as a connecting path between the overlap. If you happen to have similar interests, this too may be interesting. Some of the themes will include:\n\n**❶ Environment**, both those online and offline, and the increasingly entangled liminal spaces in-between. There was a lot of time to consider biological interfaces (my legs) and technological (my phone.)\n\n**❷ Infrastructure**, and how touches us, even when we are in the “wilderness”, from global supply chains behind a Cliff Bar in my hand to GPS helping me locate the only trickle of water within 30 miles.  \n\n**❸ Distance, duration and repetition**. Moving through landscape at a biological pace versus infinite-scrolling the internet, and other non-obvious perceptual similarities.  \n\nIf you feel like you grew up on the internet and daydream about an extended priories of being offline, you may be into this. If you where outdoor clothing but spend all your time [staring at screens](https://www.instagram.com/organiclab.zip/?hl=en), you may be into this.\n\n[PCT Portraits](https://jondashkyle.s3.amazonaws.com/2021-pct/pct-loop.mp4?width=2048&height=1024&autoplay=true&loop=true&muted=true)\n\n## The published work\n\nThe published work will consist of an entry containing:\n\n**❶** Several discrete sections of narrative writing centered on the topics referenced above, interspersed with collage style interludes.  \n\n**❷** 3–5 video loops (0:30–4:00min) sourcing found imagery, photos taken on the trail, and interpretations of navigational diagrams and interfaces.  \n\n**❸** An archive of research and reference material assembled over the production of the work in the form of a `.zip`.  \n\n**❹** The final work will be posted in June/July, with incremental progress updates taking place along the way.\n\nSources of inspiration are [Uncommon Ground](https://www.amazon.com/Uncommon-Ground-Rethinking-Human-Nature/dp/0393315118) by William Cronon, [Making Time: Essays on the Nature of Los Angeles](https://www.amazon.com/gp/product/1593761333/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1593761333&linkCode=as2&tag=wlfox-20&linkId=d1862f801fdcf50321b81976221d2713) by William Fox, and the television show [Connections](https://www.youtube.com/watch?v=XetplHcM7aQ&ab_channel=DRS_Education) by James Burke. Similarly, I’m inspired and view these topics as shaped by non-literary work like [*A Line Made By Walking*](https://www.tate.org.uk/art/artworks/long-a-line-made-by-walking-p07149) by Richard Long, and other artistic gestures.\n\nUp until now, the most I’ve publicly shared about the walk was a brief mention in [my contribution](https://walkerart.org/magazine/series/the-year-according-to) to Walker Art Center “Year According To…” series. I also hosted a [life stream session for LOT 2046](https://www.youtube.com/watch?v=MRHxdxQS2jA) one afternoon, loosely centered around the walk.\n\n[Year According To](https://walkerart.org/magazine/2019-the-year-according-to-jon-kyle)\n\nThis will be the first time I’ve revisited the notes, photos, and videos generated while on the walk. It’s difficult to understate how formative an experience this was for me—it will inform everything that follows in ways both big and small.\n\nThe motivations for this crowdfund are quite simple:\n\n**❶** Some time has passed since the walk, and I’m now in a place where enough distance has been created to where I can revisit all the material I generated while on-trail.  \n\n**❷** I’d like to donate to non-profits which do important work in the making the outdoors more accessible to underrepresented groups, and the association which acts as custodian of the PCT.  \n\n**❸** As part of the team at [Mirror](https://mirror.xyz) I’d like to run a crowdfund for real. It’s always different when doing the real thing, and this will help shape my approach to design and interface as we make the tools available to more people. \n\n![](https://images.mirror-media.xyz/publication-images/f9ffca1d-dd22-40e8-b1fa-617aa63e7478.jpeg?height=957&width=2300&size=medium)\n\n## Who am I?\n\nI began unschooling in 5th grade while living in a small town, learning idiosyncratically without curriculum online. I had an interest in design, and began programming in Flash, a hybrid environment of design, animation, and interaction. When I was 19 I moved to Los Angeles to join the personal publishing platform [Cargo (Collective)](https://cargo.site/) as their first hire, where I remained for several years. I then created tools for decentralized publishing over p2p networks while working on commissioned cultural projects anywhere from small record labels to large academic institutions.\n\nMost recently I joined [Mirror](https://mirror.xyz) (the platform you are on) as the Head of Design/Product. You can learn more about me at [jon-kyle.com](https://jon-kyle.com/), and [follow me on Twitter](https://twitter.com/jondashkyle) for updates.", "timestamp": 1618872681, "digest": "LkeLK83xVSxh_F8xGoXPJsb5qPHaM2pLtr5d11IurA0", "contributor": "0xFf37A713c920F6e94043D10c1230e30B13F4d500"}
{"id": "eRcDmUQ54HbKhVl0Swo_ZE2zViHBdn1LOLAQDJRuvGo", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. \n\n>When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/5?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with software engineer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. **The media associated with Solvency tokens are dynamic WebGL simulations.** These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given the same input hash, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the [Arweave blockchain](https://www.arweave.org/).\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as [OpenSea](https://opensea.io/) or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that *ars lunga, vita brevis* was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n*Solvency will be open to the public at 1pm EST on Thursday April 22nd. To join the Discord for updates, [click here](https://discord.gg/BHXXzG3YR2)*", "timestamp": 1618879054, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
{"id": "s_ZouqDygXlo82NKHHHRZ-QeUck6isZaLBAWy6Bf2RE", "title": "Solvency", "body": "The work of art is under constant redefinition. A powerful solvent, the NFT, has been applied to the work of art as we’ve known it so far. The reaction has begun. What form this new element will take is yet to be fully realized. One absolute remains: in time, all things dissolve.\n\nAs a digital artist this moment is liberating. A new path has opened up. NFTs offer a solution to the pitfalls of sharing work on places like Instagram, which has trapped artists inside a limbo of gamified feedback loops of likes, views, advertisements, and influence, while they struggle to convert fragmented attention into monetary value from brands, potential collaborators and employers. Now, we may have begun the shift toward a new model of the Internet, where genuine appreciation and fair compensation for digital art is possible.\n\nI've always been disappointed to see my real-time, generative work reduced to a video or still image. In its true form my work never exists in the same state twice, making the experience of viewing the work fluid and fleeting, and engaging the viewer’s attention in a way that a still image, or video cannot. So I have often felt confined by having to translate my work into a different medium than it was originally intended to be viewed.\n\nNFTs can only be viewed on the web. They are created as purely digital objects. The web itself is a rich ecosystem of technologies that can be chained together to create dynamic, interactive experiences. It makes sense that NFTs should leverage the power of the web, instead of being limited to still images or videos. The power of the blockchain has also opened up the potential for artworks to contain dynamic information about their own context, ownership, and variables from the external world.\n\nUnfortunately, the major platforms for viewing and collecting NFTs have limited capacity for displaying alternative types of work: they offer few options beyond image or video files. That limitation, along with my disappointment with the available tools, motivated me to create my own series of 1-of-1, generative, browser-based NFTs. \n\n>When you’re limited by other people’s tools, sometimes you must build your own.\n\n[Solvency #5](https://solvency.art/view/1?fullscreen=true&embed=true&display=iframe&size=large)\n\n[Solvency](https://solvency.art/) consists of four major components: the smart contract, the front-end code, the random seed, and the back-end. The smart contract determines the work’s mechanics. I collaborated with software engineer [Steve Klebanoff](https://twitter.com/steveklbnf) to produce a bespoke smart contract that handles the logic for minting each piece. \n\nEach piece in the series is simply a digital token. That is all an NFT collector ever technically owns. After a token is purchased, information from that transaction generates the work of art. Conventionally, image or video files are linked via metadata to this token within a smart contract. In theory, this metadata can contain any type of media, which means that NFTs are not limited to images and videos. **The media associated with Solvency tokens are dynamic WebGL simulations.** These simulations are feedback loops made of multiple shaders that render particles which drive the movement and form of layers of moving color and texture across the screen. The textures themselves were generated using a [GAN](https://en.wikipedia.org/wiki/Generative_adversarial_network) trained on 35mm photographs I’ve taken over the last few years. I grouped these generated images into categories like ‘Flowers’ or ‘City.’ I also hand-selected certain combinations of values that generate particle formations within the simulation such as ‘Veins’ or ‘Smoke.’ The result is that each artwork is unique, with a wide potential for aesthetic variation, but sharing properties that produce a thematic series.\n\nIn the Solvency smart contract, a pseudo-random function generates a hash associated for each minted token, which is used to seed a deterministic random number generator. Deterministic simply means that these randomly generated values will always be the same, given the same input hash, so that the artwork will always render in the same way after it has been created. The values generated by the random number generator control the parameters of the simulation, as well as the selection of image textures that drive the color and composition of the piece. Some tokens contain combinations of textures and forms that occur less frequently than others. The piece doesn't exist until it's minted. Because of the random distribution of attributes there’s no guarantee that a certain rare attribute will exist in any of the pieces after they’ve all been minted. The smart contract points to an Arweave hash that represents a permanent copy of the front-end viewer hosted on the [Arweave blockchain](https://www.arweave.org/).\n\nIn addition to the main WebGL artwork, I opted to render each piece into video and image formats, because collectors should be able to see their artwork on the parts of the web that don’t support the real-time WebGL version, such as [OpenSea](https://opensea.io/) or mobile devices. One of the challenges of Solvency was to create a backend that could automatically render artwork that had never existed before being minted. I needed to add automation to avoid manually rendering videos for all of the artworks. To do this required a significant amount of experimentation, given that the tools for rendering video on the web, especially from WebGL, are limited. Many moving parts had to be connected to create a seamless data flow between automated processes. Detailed technical discussion of the backend goes outside of the scope of this essay.\n\nThe artwork is stored on an HTTP server, and “permanently” on the Arweave blockchain. When you access the front end website at solvency.art, you're viewing a version of the work hosted on Vercel’s servers. Each piece directly links out to a streamlined version of the website, hosted on Arweave, which will render the exact same version of any Solvency piece given its token hash seed. In the case of the Arweave website, all scripts and textures are hosted on Arweave’s blockchain. If solvency.art ever went down, all pieces could still be viewed on Arweave.\n\nFor technology to improve, it must simultaneously break itself. Software becomes outmoded, deprecated, or vulnerable to security threats. Hardware becomes more performant, capable, and incompatible with older tools. It's nearly impossible to permanently archive a website (most rarely last more than 2 or 3 years) but we can try our best to conserve them for as long as possible. Digital artists will never have complete control over the software they use. Even the lowest level software depends on third parties beyond the artist’s control—packages, libraries, browsers, operating systems, compilers.\n\nBy creating an NFT built inside of a WebGL canvas, I'm making assumptions: that WebGL will continue to exist as a browser-based API, that computers will be able to run the code, and that the code is future-proof. I’m also assuming that both the Arweave and Ethereum blockchains will persist.\n\nAll works of art are built on assumptions, having to do with the potential endurance of media, e.g. canvas, paper, videotape, plastic. Artists have typically not put the concern about the longevity of materials first in their thoughts, convinced that *ars lunga, vita brevis* was sufficient reason to pitch something into the sea of time, in hopes that it would last a long time, if not ‘forever.’ It would be interesting to calculate the sheer number of works of art disappeared, deteriorated, lost to the elements, and rendered null by time—NFTs will be no exception. Art museums and collectors, armed with their expert restorers and conservators, are forever fighting against the material destinies of their collections. Often modern works, enabled by certain technological breakthroughs, become the hardest to maintain.\n\nBy fighting to preserve something, whether it be a digital file, a building, a painting, a state of being, we are fighting against the natural tendency of all organized collections of matter to move toward chaos - the tendency of entropy. Entropy is the fundamental law of the universe that measures disorder and uncertainty within any given system. Generative art and entropy run in parallel. How to create something that is at once dynamic yet never-ending, visually enticing at any given moment yet always in a state of flux, an ever-changing image, always rearranging and redrawing itself? To do so it is necessary to embrace the tendency of systems to dissolve, and move toward chaos—towards an equilibrium that can't be reversed. There is no 'undo' button in a time-based feedback loop, only the present moment and the next one. This condition of entropy is fundamental to both the tools, and the aesthetic language with which Solvency is built.\n\n*Solvency will be open to the public at 1pm EST on Thursday April 22nd. To join the Discord for updates, [click here](https://discord.gg/BHXXzG3YR2)*", "timestamp": 1618879086, "digest": "f9lBm0HBbiMDVuF5d7kZKnJbz7YxhahC4_aNZr5lVHA", "contributor": "0x751fF169Fa139ab1a90a4aCb2180bbf7531e34F1"}
