{"id": "rrx2S0cNleniPyPmttCvliakw7CBIo4eCKfvyAr0-Dw", "title": "Nuclear Energy", "body": "When I was in my early 20s, I had a conversation with my dad. I told him I was against nuclear power because it was dangerous and because it created radioactive waste that we had no idea how to safely dispose of. He replied that there certainly were problems with nuclear energy but that they paled in comparison to those of burning fossil fuels. This was before greenhouse gases and climate change were front and center in my mind and the minds of most people. I was not convinced by my dad’s argument.\n\nForty years later, my dad is no longer with us, but his words ring loudly in my ears. I have come full circle on nuclear energy and now see it as way more attractive than most other forms of generating energy.\n\nThere are two ways of making energy with atoms. We can split atoms to generate energy and that is called [Fission](https://en.wikipedia.org/wiki/Nuclear_fission). Or we can combine atoms to generate energy and that is called [Fusion](https://en.wikipedia.org/wiki/Nuclear_fusion).\n\nWe have understood how to make nuclear reactors that generate energy with fission for 80 years now. But these fission reactors have two unsolved issues. In rare situations they can get out of control and melt down. We have seen that at Three Mile Island, Chernobyl, Fukushima, and a few others. While rare, these have been scary events that have shaken confidence in the safety of nuclear reactors in the public eye. Fission reactors also create radioactive waste that we have not yet found a good way to dispose of and that nuclear waste has slowly been building up around the world.\n\nWe don’t yet understand how to make nuclear reactors that generate energy with fusion in a sustainable way, although there has been a lot of exciting technological progress on fusion over the last few decades. I believe fusion is not an if, but a when.\n\nAs we electrify more and more of our energy use, we will need ever more electricity and most students of energy consumption do not believe we can fully electrify our lives with renewable energy (solar, wind, hydro, etc). I’ve heard people say there is a 30-40% gap between what we need and what we can generate with renewables.\n\nAt this time, nuclear is the best way to close that gap.\n\nAt USV, we believe that fixing fission and making fusion work are technological and engineering problems that can be solved with sufficient creativity and capital.\n\nIn fission, that means figuring out how to make reactors that are not prone to catastrophic meltdown and figuring out how to use/consume the radioactive waste that fission generates. There are a number of promising technologies that are attempting to do these things.\n\nIn fusion, that means figuring out how to make a reactor that generates more energy than it is given. The progress on that dimension is promising but we are nowhere near where we need to be and more creativity and capital will be needed to solve the fusion puzzle.\n\n[Our climate fund is focused on both mitigating the climate crisis and adapting to it. ](https://www.usv.com/writing/2021/01/usv-climate-fund/)Solving these technological problems with fission and fusion is an important part of mitigating the climate crisis and we are talking to teams working on both approaches.\n\nI am excited to do that and believe my dad would be too.\n", "timestamp": 1619703562, "digest": "R9CNsKNjz_s27ApXU1WeR3te8pprK_T6fulEr1M0npE", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "7-WgTo0M1Udg10sXnNUvAQh-HmGdp3vp6iq0tX9FMrM", "title": "Testing the Splitstream for funding through attribution with NFTs", "body": "We have proposed a novel model for funding open innovation called the SplitStream. In addition to describing the model, we are also testing it live on a piece of open innovation in progress. Specifically we are auctioning off an NFT of an Independent Data Analysis from [our test of Seth's Appetite Theory](https://s.mirror.xyz/vKZToDiv68BGnKx6HjUqYHKnJOI5IpU95dbrETU5Seg). The two professors of statistics who ran the independent data analysis, Harry Crane and Ryan Martin, have produced an elegant violin plot of the results to be auctioned off. You can see (and bid on!) this auction directly below this paragraph, but you are welcome to [keep reading beyond if you'd like to better understand the SplitStream](https://iqjji6peiwztatemcrpcyet5lnpuphcivt2hmtirjpqqjmbfppha.arweave.net/RBKUeeRFszBMjBReLBJ9W19HnEis9HZNEUvhBLAle84) and, thus, where the proceeds will be going.\n\n[Token #2837](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=2837)\n\n# The SplitStream\n\nYou might know the quote “If I have seen further, it is from standing on the shoulders of giants”. You might also know that it’s from Isaac Newton, a giant if there ever was one. So in science, giants tend to look down and see other giants. Citations, when they work, map those dependencies backwards through time.\n\nCitations on citations.\n\nGiants all the way down.\n\nIf you send funds through these citations, you get a cascade. A stream of splits. A SplitStream.\n\nThe SplitStream is a system in which portions of an NFT sale may flow to some or all of the works the NFT cites, with those cited works then sending some of their funds further along to the works they cite, and so on.\n\nHere’s what it looks like:\n\n![](https://images.mirror-media.xyz/publication-images/74a36177-7d70-4742-b15d-1cda5a8725f3.jpeg?height=684&width=592)\n\nIndependent Analysis is a really valuable thing, and it is a cutting edge Open Science best practice. Thus we value Professors Crane and Martin's contributions greatly and have requested that they keep 50% of the NFT sale from the auction above. They have also agreed to test the SplitStream and for the purposes of this incentive test, their analysis “cites” two NFTs:\n\n- The NFT of the Open Science Test of Seth’s Appetite Theory (currently owned by Molecule)\n- The NFT of this Essay Outlining the Protocol (owned by Planck)\n\nPlanck will then split our proceeds further to what we are citing:\n\n-Mirror because we are using their amazing platform and tech.\n-This Artwork is Always on Sale, suggested by Simon De La Rouvier as the proper target for the citation of his shared idea of Harberger taxes for NFT ownership (which is an important aspect of our protocol.)\n\nWe encourage the recipients of these proceeds, if they are at all substantial, to split back to those they would cite. Let's also note that this is a simple test of the mechanism and certainly does not represent the full range of actual citations we would use.\n", "timestamp": 1619708707, "digest": "HejUlxbCD_F5fmvX8vR5VINruV-21huDTOUGMdnSAL8", "contributor": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6"}
{"id": "D9ORyquZMo-FO8z0bUck892ktvnl5NhNjg8mPHEBo88", "title": "The ugliest live show promo image ever made", "body": "![](https://images.mirror-media.xyz/publication-images/5fd5119c-60aa-4915-9214-1d5643241956.jpeg?height=600&width=1200)\n\n", "timestamp": 1619721073, "digest": "765M7rdmg8_5tfLvYH_AEtq40otI5Sn5zGNwq6o6oQE", "contributor": "0x2920A3192613d8c42f21b64873dc0Ddfcbf018D4", "nft": "{\"nftTransactionHash\": \"0x08ef3d402753c57ee8b28a27e721d2b3a73950afbe3b9132cd7a1500d777cff2\"}"}
{"id": "FKJm_Lb1ho-NJSmf32mLqpBipezC3PG0ic1hh6OQhp4", "title": "The ugliest live show promo image ever made", "body": "![](https://images.mirror-media.xyz/publication-images/5fd5119c-60aa-4915-9214-1d5643241956.jpeg?height=600&width=1200)\n\n[Token #2971](auction://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7?network=mainnet&tokenId=2971)", "timestamp": 1619722067, "digest": "765M7rdmg8_5tfLvYH_AEtq40otI5Sn5zGNwq6o6oQE", "contributor": "0x2920A3192613d8c42f21b64873dc0Ddfcbf018D4", "nft": "{\"nftTransactionHash\": \"0x08ef3d402753c57ee8b28a27e721d2b3a73950afbe3b9132cd7a1500d777cff2\"}"}
{"id": "f6Iw0ty4h5v6vkmVY1nZlIFS12-OlyD0xnrpUQ4ukBw", "title": "Introducing Boardroom", "body": "*Originally [published](https://governance.substack.com/p/introducing-boardroom) on Boardroom's [Substack](https://governance.substack.com/) on July 30th, 2020*\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0b277451-67a6-4266-8aa8-e2b5f0dc6c66\\_1296x492.gif)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0b277451-67a6-4266-8aa8-e2b5f0dc6c66\\_1296x492.gif)\n\nOver the past months, a number of projects have started experimenting with the incentivization of liquidity provision and governance participation. This has provided the Ethereum community and wider industry a unique opportunity to earn governance tokens via novel token distribution methods.\n\n> Liquidity Mining allows users to lock their assets inside different DeFi protocols and receive governance tokens as a reward.\n\nEven though governance tokens aren’t novel to the ecosystem, the recent trend has resulted in an explosion of them and has exacerbated their distribution. This, in turn, has enabled a growingly diverse set of stakeholders to participate in network decision-making after having used the protocol and earned the right to do so.\n\nIn many of these instances, these governance mechanisms allow for the **delegation** of those earned governance rights (disassociating power and ownership) and have led to the creation of a nascent but growing market for delegates vying for votes of confidence from token holders to increase their influence on the protocol, not completely unlike validators in much larger Proof of Stake protocols.\n\n**So… what happens next?**\n\n### Introducing Boardroom\n\n**Boardroom** is an integrated governance and communications management portal providing an easy and flexible solution for stakeholders to exchange a wealth of governance information, insight, and participation tools.\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F747b14c1-b932-485c-9745-62eda915e3b7\\_960x540.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F747b14c1-b932-485c-9745-62eda915e3b7\\_960x540.png)\n\nThe goal of the portal is to enable token holders, issuers, and protocol politicians (delegates) to understand the governance processes they hold influence in and allow them to frictionlessly participate across different protocols.\n\nThe lack of structured discourse and deliberation forums have hindered the subsequent governance and decision-making processes. Telegram, Slack, Twitter, etc... are plagued with spam and cannot be used as community signaling tools. Despite their efforts to explore fair ownership and power, it is difficult for founding teams to gauge whether their project facilitates a diverse stakeholder pool.\n\nThere is often miscommunication, misalignment, and minimal feedback between stakeholders. Seemingly \"informed\" decisions are still siloed, centralized, and carried out behind closed doors. We envision Boardroom as an infrastructure layer that can facilitate stakeholder identification, communication, discourse, and voting tools that help projects properly manage their governance in the long run.\n\n### Portal Features and Roadmap\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6559c889-7e91-4c12-9401-5bf6a0a681e8\\_960x374.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6559c889-7e91-4c12-9401-5bf6a0a681e8\\_960x374.png)[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6e9d4bc7-2f78-4540-b6ed-b625b64c186f\\_960x540.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6e9d4bc7-2f78-4540-b6ed-b625b64c186f\\_960x540.png)\n\n### Request for Feedback - [Boardroom Alpha](https://tryboardroom.com/)\n\nAfter receiving very [early support from the MetaCartel community](https://forum.metacartel.org/t/dao-proposal-boardroom/729) 👏💙 we’re ecstatic to announce that we’ll be releasing an Alpha of the Boardroom Portal on **August 6th**.\n\nCommunity-driven approaches to product development have been instrumental in the exponential growth of the DAO and DeFi ecosystems - we’re hoping that feedback and contributions from the very same stakeholders that are entrenched in the day to day of DeFi and Web3 projects will increase the usefulness of this product exponentially.\n\n> With that said, we’d love for you to sign up for early access at [tryboardroom.com](https://tryboardroom.com/).\n\n### Boardroom SDK\n\nIn addition to the governance management portal, we’ll be building the Boardroom SDK in the coming months. We’re hoping it will provide crucial middleware for the immensely fragmented crypto governance and communications ecosystem. As we see brokers, like exchanges, wallets, and custodians scramble to offer governance data and voting capabilities to their users, we expect they’ll run into some major roadblocks:\n\n**The infrastructure is haphazard**\n\n*   Protocols are all different and dynamic\n*   Governance data and applications are disconnected\n*   Protocol teams will offer hundreds of different APIs and data connectors\n\n**The pain is high and maintenance is costly**\n\n*   Every single integration is manual, limiting scale\n*   Painful for apps, developers, and users\n*   The information overflow centralizes decisionmaking power\n\nThe SDK provides a single solution that, with a few lines of code, allows developers to display cross-protocol standardized data and participation modules for users while they retain their native brand or application UX.\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fee701c01-6d8f-457b-a9eb-7d577e433a81\\_960x277.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fee701c01-6d8f-457b-a9eb-7d577e433a81\\_960x277.png)\n\n*A Standardized Governance SDK: Connect your Native UI with a Few Lines of Code*\n\nWe believe that wallets, exchanges, aggregators, validators, should have simple and comprehensive access to standardized governance data, features, and components, across a diversity of protocols, without having to sacrifice convenience - we’re lucky to be working with some of the most prominent projects and forward-thinking teams in the industry and hope that the others will reach out as we design this tool for them. Please reach out with any comments or feedback - my social handle is @kevinknielsen everywhere!", "timestamp": 1619732375, "digest": "uU8CIg3jyNncopHHKEO_qaQzP4cPsrFc8d92meCPAQk", "contributor": "0xb1676B5Ab63F01F154bb9938F5e8999d9Da5444B"}
{"id": "fXcZBKYsDuRO5SepRN1uCOTYlENJNrz65QNr8AIfWoM", "title": "Boardroom raises $2M to help stakeholder-owned platforms scale in governance participation", "body": "*Originally [published](https://governance.substack.com/p/boardroom-raises-2m-to-help-stakeholder) on Boardroom's [Substack](https://governance.substack.com/) on Oct 13th, 2020*\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F429853c5-5d94-4eb5-bead-5e38c1e6fe8e\\_2480x520.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F429853c5-5d94-4eb5-bead-5e38c1e6fe8e\\_2480x520.png)\n\nThe [Boardroom](https://boardroom.info/) team is excited to announce that it has raised $2.2 million in funding to build a comprehensive platform aimed at reducing the complexities of crypto governance interactions. The investment was led by [Standard Crypto](http://standardcrypto.vc/), with participation from [Variant](https://variant.fund/), [CoinFund](https://coinfund.io/), [IDEO CoLab Ventures](https://www.ideocolab.com/ventures/), [Framework Ventures](https://framework.ventures/), and [Slow Ventures](http://www.slow.co/).\n\nThe team is also proud to partner with [MetaCartel Ventures](https://metacartel.xyz/), [Divergence](https://www.div.vc/), [The LAO](http://thelao.io/), [Stani Kulechov](https://twitter.com/StaniKulechov) (Aave), [Kain Warwick](https://twitter.com/kaiynne) and [Jordan Momtazi](https://twitter.com/hjmomtazi) (Synthetix), [Tarun Chitra](https://twitter.com/tarunchitra) (Gauntlet), [Spencer Noon](https://twitter.com/spencernoon) (DTC), [Bollinger Investment Group](https://www.bollinger.xyz/), and Free Company.\n\nWe deem the support from the aforementioned proven builders, operators, and leaders in the space as an incredibly important milestone that will contribute to the success of the Boardroom product.\n\n> *\"We are seeing an accelerating volume of protocols interested in public governance enter the market each month. We are extremely excited about what Boardroom is building in this space, helping to consolidate governance protocol interaction and bringing decentralized governance to the next level of adoption.\" - **Jake Brukhman, CoinFund***\n\n### Our Purpose\n\nWe believe crypto networks will uproot traditional management and ownership structures. They have already demonstrated a powerful new economic model for building software applications, wherein users build and operate products and services they use every day. In exchange for their contributions, many of these platforms reward users with a direct ownership stake which aligns their success with that of the platform.\n\nWith this ownership comes a responsibility to steward governance, communication, and engagement to ensure a powerful alignment between diverse owners.\n\n> #### *Boardroom’s mission is to enable stakeholder-owned platforms to scale while upholding the interests of all their constituencies.*\n\n#### Professionalizing Digital Governance Tools and Services\n\nThe management of protocols is becoming increasingly complex as activities involving large numbers of contributors require a division of labour. Delegation of governance power to specialized proxies will allow networks to benefit from efficient insights. Therefore, it becomes necessary to properly inform end-users about the potential effects of their decisions and the relative merits of competing paths forward. The Boardroom Hub simplifies and structures such information and facilitates participation across diverse protocols. It provides scalable tools and services for high-value digital stakeholder interactions.\n\n#### Aggregating Fragmented Data and Distribution Channels\n\nExperimentation with novel distribution mechanisms has led a growingly diverse set of stakeholders participating in network decision making. These interactions are seldom similar in nature, and the varying processes and interfaces can sometimes create miscommunication, misalignment, and minimal feedback between stakeholders. As the frequency of decisions and the number of information channels keep rising, the Boardroom SDK provides builders with simple and comprehensive access to standardized governance data, features, and components, across protocols, integrated into any native UI - no user should ever have to sacrifice convenience to participate.\n\n#### Simplifying the Implementation of Governance Frameworks\n\nDecentralized networks with governance models that are poorly defined, overly complex, and resource-intensive tend to be at a long-term disadvantage relative to competing networks that optimize for procedural clarity, simplicity, and smart automation with emergency safeguards. As projects adopt novel open-source governance frameworks, Boardroom will simplify implementation by leveraging standardized processes from ideation to deployment.\n\n**Our team hopes to unlock the rights of stakeholders whose voices have been obfuscated by a multitude of interfaces resulting in fragmented experiences.**\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff9c06b5e-8647-4e40-90b3-47c765e8731b\\_993x580.jpeg)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff9c06b5e-8647-4e40-90b3-47c765e8731b\\_993x580.jpeg)\n\n*We first pitched Boardroom at ETH San Francisco in 2018 as [Kora](https://devpost.com/software/kora-vji6xw)*\n\n### From Hackathon to Company\n\nWhat started as a hackathon project turned into an idea that YJ and myself would carry into roles at [TQ Tezos](https://tqtezos.com/) and [Parity](https://www.parity.io/), where we built governance and ecosystem tooling for layer one projects over the last few years. We soon realized that for projects at the application layer to adopt governance systems at scale, it would be important to abstract complexities using proven governance tooling and services. \n\nThe indexing and standardization of data and user experiences would not only benefit the platform users but equally as important, it would benefit project teams as they look to structure decision making to be representative of true system stakeholders.\n\nFour months ago we built an [MVP](https://forum.metacartel.org/t/dao-proposal-boardroom/729). Bolstered by the unbridled support of the [MetaCartel Community](https://www.metacartel.org/), IDEO’s DeFi Residency, and Divergence Ventures we put our heads down and started working on the product. We’re confident that these stakeholder-led experiments and new models for platform ownership will become the frameworks for future corporate, protocol, and ecosystem governance, and we’ll be there to support them along the way.\n\n### Looking Forward\n\nWe encourage any team thinking about or building governance systems and UX to reach out, we’d love to have a conversation. As more complex delegative and proxy models emerge we are keen to engage with stakeholders that view themselves as parties likely to engage in frequent governance votes, as well as with projects building interfaces aiming to feature and support governance information and capabilities. \n\nWe also welcome all governance participants to provide feedback on our [Boardroom Hub](http://app.boardroom.info/) alpha and join our [Discord](https://discord.com/invite/QFBgg2) #Feedback channel. We look forward to engaging in community discussion!\n\n#### And We Are [Hiring](https://angel.co/company/boardroom-1/jobs)!\n\nWe are energized to tackle the next phase of our product roadmap and are actively looking to build our team. Joining us will enable you to have a substantial impact on our success and have extensive ownership over the product. We are thoughtful about code quality, testing, and architecture, and value positive energy, continuous learning, and clear communication. We are also committed to building an inclusive environment for people from every background. If you are compelled by our vision [we would love to talk to you](https://angel.co/company/boardroom-1/jobs). \n\nPlease message us on [Discord](https://discord.gg/QFBgg2) or check out our [current job postings](https://angel.co/company/boardroom-1/jobs/962621-senior-frontend-engineer) to learn more about the team. \n\n#### **About Boardroom**\n\nBoardroom is an integrated governance management platform improving distributed decision making across crypto networks with tools and services for high-value digital stakeholder interactions. Our mission is to enable stakeholder-owned platforms to scale while upholding the interests of all their constituencies.\n\n[Share](https://governance.substack.com/p/boardroom-raises-2m-to-help-stakeholder?\\&utm_source=substack\\&utm_medium=email\\&utm_content=share\\&action=share)\n", "timestamp": 1619732604, "digest": "tOkcjJCkOhChpKoq8ies14hXJeGW93E2tRya73_qh_I", "contributor": "0xb1676B5Ab63F01F154bb9938F5e8999d9Da5444B"}
{"id": "n3jFpYpSTGGiWTi-U2KfrFrrXnWWfWnGAUJc7F5JFsA", "title": "Mercenaries at the Gate", "body": "*Originally [published](https://governance.substack.com/p/mercenaries-at-the-gate) on Boardroom's [Substack](https://governance.substack.com/) on July 7th, 2020*\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F9ded907c-91b2-4570-8789-152dc0cb090d\\_1333x664.png)](https://raidguild.org/)\n\nThe last few years have brought an immense wave of talent into the crypto ecosystem, but given the distributed and somewhat anarchical nature of the industry, that talent hasn’t always been effectively allocated. An evolving trend in the Ethereum/DAO world, however, is giving us a glimpse into the potential future of freelance work:\n\n## Shaky Foundations\n\n**Projects, Protocols, and Teams**\n\nProtocol teams have experimented with myriad capital deployment structures while making efforts not to centralize decision making - all with the common goal of encouraging the development of infrastructure, tooling, and applications on their protocols.\n\nFrom DAOs to grant programs, there has been no lack of creativity. Unfortunately, these experiments have evolved into complex structures, and over and over again we can observe a lack of follow-through in the development of useful products: no matter how much money they throw towards development, the problem is largely rooted in the **lack of available and qualified talent. **These teams are the most financially well endowed open source projects in history but are struggling to recruit, given most talent is being locked up in individual projects or service providers.\n\nIt would be beneficial for projects to have access to **unbound talent **that can deliver as much value as a full-time employee, as well as talent experienced in building across protocols to take advantage of **shared knowledge**. Today, there is little learning happening between siloed project teams despite opportunities for synergies and collaboration - how many service providers work across all layers of the web3 stack?\n\n**Contributors**\n\nThe primary option for talented contributors who wish to work broadly across space is contracting, but this is difficult to scale. The flexibility of contract work is unfortunately hindered by the admin, sourcing, and operational overhead that individual freelancers incur with every single gig. It is challenging for key contributors to fully participate in the upside of what they are delivering (without putting their own capital at risk), and even though contributors want to work in an open, decentralized, and collaborative manner, many opt for the full-time route.\n\nOne could imagine a system to bridge top talent with top projects in a multi-protocol and multidisciplinary way, with a focus on shipping in the form of code, products, partnerships, educational initiatives, contracts, or content. The former consultant in me sees this as a multi-protocol, “decentralized”, consulting firm/service provider working across protocol development, product, UX, community, marketing, ecosystem development, developer relations, and developer experience.\n\nThis entity could collect revenues from:\n\n*   Contracts with protocol projects\n*   Winning bounty programs put forth by projects\n*   Applying for grants\n*   An investment fund that takes a stake in projects\n\n## **Freelance DAOs**\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F9ded907c-91b2-4570-8789-152dc0cb090d\\_1333x664.png)](https://raidguild.org/)\n\nThankfully, DAOs are now more present than ever. Citing Raid Guild as an example, communities are establishing distributed organizations to coordinate freelance work using an efficient framework. These flat organizational structures follow rules and processes established in [practical handbooks](https://handbook.raidguild.org/docs/overview), are guided by a [founding manifesto](https://raidguild.org/#manifesto), create economies of scale through shared infrastructure, but still, retain enough flexibility to allow contractors to focus on very specific and diverse web3 projects or consultations.\n\nThe processes established and ratified by simple DAO infrastructure can act as the glue that holds a multitude of contributors to the same standards and rules. In a way, it seems like these communities are slowly turning the [theory of the firm on its head ](https://medium.com/messaricrypto/cryptonetworks-and-the-theory-of-the-firm-a11961a41f7c)by greatly reducing external transaction costs with flexible contractors on a project-specific basis. \n\n## **Free Company**\n\nAll this reminded me of [an article](https://medium.com/@jillcarlson/free-company-49b129461b3c) published by Jill Carlson over two years ago, discussing how we could achieve effective coordination and economies of scale in open, decentralized development ecosystems:\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F749fc554-be3d-464f-848d-71677f0a020d\\_1008x620.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F749fc554-be3d-464f-848d-71677f0a020d\\_1008x620.png)\n\n> *A Free Company can fill a gap in the market right now, bringing talent together with promising protocol projects. It would be both multi-protocol and multidisciplinary, something no other service provider can currently claim… a Free Company would allow contributors to work in the manner they want: broadly, without non-competes, collaborating across projects and disciplines.*\n\n[![](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff05cd9b6-c1d2-4aff-bd17-c0ab33b5863a\\_996x586.png)](https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff05cd9b6-c1d2-4aff-bd17-c0ab33b5863a\\_996x586.png)\n\nContributors could be given a stake in what they are shipping and can share in the upside of a protocol’s success. **A replicable freelance DAO structure could be a powerful solution enabling this vision**, so long as we give enough thought to how much of its governance and direction is worth keeping on-chain.\n\n## **More Things to Think About**\n\nIf we do foresee these mercenary DAOs servicing diverse markets and projects, there are still a lot of questions that remain unanswered. Here are some of the more obvious things that come to mind, sourced from an [Aragon Forum discussion](https://forum.aragon.org/t/free-company-multi-disciplinary-multi-protocol-contribution/174/2):\n\n*   **Measuring/Quantifying Contribution: **How do you measure labour and output from contributors? In a multidisciplinary environment, shipping will take many forms and could become quite subjective.\n*   **Contributor Reputation and Trust: **How do you design a reputation system that accurately captures the history of valuable contributions?\n*   **Governance Processes: **Can anyone join the DAO, or do contributors need to apply? When do you reach diseconomies of scale? How and who coordinates broader strategy, branding, access, and direction?\n*   **Resource Allocation/Shared Infrastructure: **Would there be any resources shared by contributors, and how would those resources be allocated? How are contract terms drafted, negotiated, closed? How are contributors paid?\n\nFeel free to leave comments on that thread or here! A huge thanks to** **[Cooper Turley](https://twitter.com/Cooopahtroopa), Chief Editor at [DeFi Rate](https://defirate.com/)** **for the feedback **🙏 \n\nIf you enjoyed the article, share the **❤️ **by sharing this newsletter post!\n\n[Share](https://governance.substack.com/p/mercenaries-at-the-gate?\\&utm_source=substack\\&utm_medium=email\\&utm_content=share\\&action=share)\n\nStateless is a newsletter aiming to decipher the complex world of distributed network governance, politics, and power.\n", "timestamp": 1619732840, "digest": "PADReNXWesGZ58OXDm80yBOZLzXCfo7N1IhnV31HUAc", "contributor": "0xb1676B5Ab63F01F154bb9938F5e8999d9Da5444B"}
{"id": "_52clxdJTylG5196bjdq3KSVzqqonAS4JlKCZpHpeCA", "title": "The Governance of DAO Infrastructure", "body": "*Originally [published](https://governance.substack.com/p/the-governance-of-dao-infrastructure) on Boardroom's [Substack](https://governance.substack.com/) on August 25th, 2020*\n\nThis week we’re featuring a guest post from [Felix Machart](https://twitter.com/felix_macht), a summary of his longer report on [“The State of Blockchain Governance”](https://65eocu3ftlpiygeym3g5kply6zy2dtdjyrhbm4m26cb6bt3msyla.arweave.net/90jhU2Wa3owYmGbN1T149nGhzGnEThZxmvCD4M9slhY) drafted alongside [Jascha Samadi](https://twitter.com/JaschaSamadi). This is a timely article delving into the intricacies of stakeholder governance as many of the prominent DeFi and cryptocurrency teams experiment with novel ownership models.\n\n[![Image for post](https://cdn.substack.com/image/fetch/w\\_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F2e0ca505-895f-4d34-9573-61591634b90f\\_1808x972.png)](https://65eocu3ftlpiygeym3g5kply6zy2dtdjyrhbm4m26cb6bt3msyla.arweave.net/90jhU2Wa3owYmGbN1T149nGhzGnEThZxmvCD4M9slhY)\n\nDAO communities so far have been experimenting with various systems to govern the infrastructure, from informal to formal processes, from loosely coupled off-chain to tightly coupled on-chain systems. There is no doubt that voting plays an important role in gauging community sentiment and to condense individual preferences into a picture that reflects the aggregate. The main questions are, 1) which stakeholders are entitled to vote (to the largest extent token-holders in permissionless systems, as “1-person-1-vote” has so far been either reliant on centralized KYC or not sybil resistant) and 2) how tightly coupled is the result of the vote with a protocol change.\n\n#### *Stakeholder lock-in as a measure of interest alignment & legitimacy of governance rights*\n\n[Agency theory ](https://www.investopedia.com/terms/a/agencytheory.asp)commands that the providers of specialized inputs should be in charge of governance, which has traditionally been providers of physical capital/investors, as they are locked-in with their investments (sunk costs — inputs are not useful otherwise or it is costly to make them so). In the knowledge age and digital sphere it is increasingly specialized knowledge, data, and the use of standards, but also capital that is being invested, staked, or locked-up for extended amounts of time to contribute to network security and value creation that represents those specialized inputs or sunk costs. Thus, systems taking into account broader stakeholder groups are highly desirable.\n\n#### *Stakeholder representation vs. scalability of decision making*\n\nThere are large differences in participation rates in voting, due to differences in community size and composition and differences in voting systems as well as quorum requirements. Direct democratic approaches suffer from low participation as decision-making involves cognitive costs, so some amount of representation by councils, boards, and/or through liquid democracy might be necessary in many cases in order to enable effective decision making (e.g. voting power delegation in [Compound](https://compound.finance/governance)). Liquid democracy structures are blending the best of representative and direct democracy, allowing anyone to directly vote on an issue if she feels to be well informed or there is a strong opinion, as well as allowing for delegating one’s voice to a representative (like a liquid management board or protocol politicians). Thus, voters who are rationally ignorant might have enough incentive to at least delegate, while the cognitive load of deciding on a matter is outsourced to the delegate (which increases turnout). Voters who are motivated to decide for themselves can still do so, which increases decentralized input.\n\nThere have been votes that were able to be influenced by large individual voters, which becomes easier as there is low participation. [Adaptive quorum](https://wiki.polkadot.network/docs/en/learn-governance) biasing, introduced by Polkadot is an interesting approach to autonomously protect against low turn-out votes having a result that does not reflect the whole. Making an elected board decide like in[ Nexus Mutual](https://nexusmutual.io/) and let them be overridden by a sufficient threshold of voters is also a pragmatic way of leaving uncontroversial and day-to-day decisions to agents that focus on the matter while keeping the option of decentralized direct decision-making. One could argue Nexus Mutual does not represent a true DAO as it has elements of centralization and lacks true autonomy and permissionless-ness (limiting the influence of individual voters to 5% by KYC). However, also other projects show centralized and permissioned aspects, highlighting the fact that decentralization is multi-faceted as well as a spectrum and not absolute.\n\nFinally, token/vote distribution (incl. the level of participation and decentralization of full-nodes in layer 1 DAOs such as Ethereum) is the most crucial factor in determining the extent to which power is decentralized and communities ought to target and select long-term, mission-aligned and knowledgeable members and investors (time-locking for voting can be a feasible proxy for long-term alignment).\n\n#### *Ultimately, governance is about social consensus*\n\nIn the end, social consensus is what defines a crypto network. The option to fork is the most crucial instrument of last resort to force decision-makers to take stakeholders into account, while effective governance gathers maximum stakeholder voice in order to avoid exit.\n\n[Read the full article here](https://medium.com/greenfield-one/the-state-of-blockchain-governance-governance-by-and-of-blockchains-f6418c46077)\n\nIf you enjoyed this short feature, share the ❤️ by [subscribing](https://governance.substack.com/) to our newsletter!", "timestamp": 1619733746, "digest": "oTHV4RVTFMOfOsiZzArQ1CdSgPVXGSitVwdsvYwcyhc", "contributor": "0xb1676B5Ab63F01F154bb9938F5e8999d9Da5444B"}
{"id": "fSvXnIQ3pUwms1sCimmVZU7_-Mn7S7s49Ul6KFmsoMM", "title": "A New Frontier", "body": "Growing up in the 90s, our first family computer was a Compaq Presario. It was a chunky desktop PC with speakers that attached to the monitor like oversized ears and a translucent purple faceplate on the tower that popped open to store CDs. \n\nIt was glorious.\n\n![My beloved Compaq Presario](https://images.mirror-media.xyz/publication-images/783a0557-c2dd-4cec-bfc0-aa85e73e4815.jpeg?height=1048&width=1920)\n\nThat computer changed my life — and so did a piece of software that came with it called Microsoft Encarta.\n\nEncarta was an encyclopedia digitized, Wikipedia before Wikipedia, and opening it revealed countless entries about important world events and historical figures. These entries took the form of videos and multimedia presentations that gave the user access to the world's knowledge in a way that was more vibrant and alive than paragraphs of text on a paper page could ever be. The experience was magical from the first moment: When you put the disc in the CD drive, a start screen would pop up with a variety of images and faces all interconnected: An astronaut, the Mona Lisa, Abraham Lincoln, Nelson Mandela. Then, choral music would begin to play and voices would speak in succession…\n\n[Encarta intro](https://twitter.com/DrewCoffman/status/1387888935724937217?s=20)\n\nAs a child, I was so inspired by these words and these faces. They filled me with a sense of optimism that made me excited to use Encarta, but more than that, excited to use the *computer*! I innately felt that this technology was allowing me to engage with the world and its lessons in a meaningful way. That CD let an 11-year boy sitting on his parent’s computer encounter the great icons of history and be inspired by them in a way that *hadn’t been possible before*. Unlike a book or documentary where the narrative is linear in nature, Encarta let me learn by creating my own path.\n\nEncarta was ‘just’ a rudimentary encyclopedia, but it held a version of the digital age that I’m still yearning for. It feels representative of a version of technology that was eternally hopeful, putting the world’s knowledge in our hands and challenging us to look to it as we make decisions for the future.\n\nThis feels, on the whole, much different from today's technology. \n\nWhere Encarta had an unbridled sense of optimism, today’s social network dominated internet too often seems to bring out our darkest motivations, centering itself around a kind of pessimism that gives way to outright hostility — and beyond that, it *simply no longer feels possible to create your own path the way it once did*.\n\nOur technology needs to evolve, but evolution is hard. \n\nTo learn a little about why that is, we can look back at how we created pathways through the physical world. There are lessons to be learned by looking at the foundations of the land we live on.\n\nMany of the cities that we live in have similar origin stories, and they sound something like this: One pioneer decided to move onto a piece of land and take a risk. Then, someone would move nearby and take a risk on another plot of land. Then another. Then another. \n\n![1870s-era homestead](https://images.mirror-media.xyz/publication-images/b1d43215-5af4-4458-9932-139a8ff31a27.jpeg?height=541&width=1024)\n\nNext, those people would have children. They would expand their homes to make room for their growing families. More people would move nearby, and as both the families and the community grew, so too would the town. Each person provided something — resources, utilities, a helping hand. Each person took risk after risk, bet after bet, and the towns expanded or evolved in response, eventually turning into the spaces many of us live in today.\n\nThat transformation from ‘one pioneer’s homestead’ to ‘sprawling urban cityscape’ happened slowly. It was *evolution by addition* as the area organically grew larger and larger to meet the needs of more and more citizens.\n\nYet, somewhere along the way a new method of developing the physical world came into existence, and it goes like this: A real estate developer takes a giant loan and buys a large amount of property. Homes are built, all at once, in a cookie-cutter fashion. The homes are then sold, one by one, and the neighborhood is complete.\n\n![2010s-era subdivision](https://images.mirror-media.xyz/publication-images/4defc3f7-4def-46bb-b1cd-bccc6acabac6.jpeg?height=541&width=1024)\n\nThat’s it! There’s no *adding* on to the community in a meaningful way. No new land can be purchased and built upon. There’s no *evolving* the neighborhood. It’s ‘finished’ — which means that the only paths forward are stagnation, staying just as it is, or decline, falling into disrepair.\n\nOur society has grown accustomed to not only our *physical* spaces existing in this finished state, but our *digital* spaces as well — and that’s a problem. \n\nToday’s internet has felt like a suburb for some time now; with the monoliths providing us with our platforms and networks buying up land and selling it to us in a cookie-cutter fashion — and just as the suburbs from the late 90s and early 2000s are now falling into stagnation or decline, so too is the suburb that is ‘Web 2.0’.\n\nThe good news is that there’s a new digital frontier opening up. The world of web3 is providing space for us to find new soil, to take a stake on a piece of land and make something new, and to once again *create our own paths forward*. \n\nNow is the time to reclaim the optimism from the early days of the web as we take risks to create a future we’re proud of.\n\nAnd it's early days yet.", "timestamp": 1619736849, "digest": "-p6EVGFaQuvY8cECK-HEP6zF_tbitIn94qHT6VUb2LU", "contributor": "0xc7A0D765C3aF6E2710bA05A56c5E2cA190C2E11e"}
{"id": "g1t6V6eLhSiRnwnINSNxXeram8p4tnO_0M50nByDP-s", "title": "Creating a Path Forward in a New Frontier", "body": "Growing up in the 90s, our first family computer was a Compaq Presario. It was a chunky desktop PC with speakers that attached to the monitor like oversized ears and a translucent purple faceplate on the tower that popped open to store CDs. \n\nIt was glorious.\n\n![My beloved Compaq Presario](https://images.mirror-media.xyz/publication-images/783a0557-c2dd-4cec-bfc0-aa85e73e4815.jpeg?height=1048&width=1920)\n\nThat computer changed my life — and so did a piece of software that came with it called Microsoft Encarta.\n\nEncarta was an encyclopedia digitized, Wikipedia before Wikipedia, and opening it revealed countless entries about important world events and historical figures. These entries took the form of videos and multimedia presentations that gave the user access to the world's knowledge in a way that was more vibrant and alive than paragraphs of text on a paper page could ever be. The experience was magical from the first moment: When you put the disc in the CD drive, a start screen would pop up with a variety of images and faces all interconnected: An astronaut, the Mona Lisa, Abraham Lincoln, Nelson Mandela. Then, choral music would begin to play and voices would speak in succession…\n\n[Encarta intro](https://twitter.com/DrewCoffman/status/1387888935724937217?s=20)\n\nAs a child, I was so inspired by these words and these faces. They filled me with a sense of optimism that made me excited to use Encarta, but more than that, excited to use the *computer*! I innately felt that this technology was allowing me to engage with the world and its lessons in a meaningful way. That CD let an 11-year boy sitting on his parent’s computer encounter the great icons of history and be inspired by them in a way that *hadn’t been possible before*. Unlike a book or documentary where the narrative is linear in nature, Encarta let me learn by creating my own path.\n\nEncarta was ‘just’ a rudimentary encyclopedia, but it held a version of the digital age that I’m still yearning for. It feels representative of a version of technology that was eternally hopeful, putting the world’s knowledge in our hands and challenging us to look to it as we make decisions for the future.\n\nThis feels, on the whole, much different from today's technology. \n\nWhere Encarta had an unbridled sense of optimism, today’s social network dominated internet too often seems to bring out our darkest motivations, centering itself around a kind of pessimism that gives way to outright hostility — and beyond that, it *simply no longer feels possible to create your own path the way it once did*.\n\nOur technology needs to evolve, but evolution is hard. \n\nTo learn a little about why that is, we can look back at how we created pathways through the physical world. There are lessons to be learned by looking at the foundations of the land we live on.\n\nMany of the cities that we live in have similar origin stories, and they sound something like this: One pioneer decided to move onto a piece of land and take a risk. Then, someone would move nearby and take a risk on another plot of land. Then another. Then another. \n\n![1870s-era homestead](https://images.mirror-media.xyz/publication-images/b1d43215-5af4-4458-9932-139a8ff31a27.jpeg?height=541&width=1024)\n\nNext, those people would have children. They would expand their homes to make room for their growing families. More people would move nearby, and as both the families and the community grew, so too would the town. Each person provided something — resources, utilities, a helping hand. Each person took risk after risk, bet after bet, and the towns expanded or evolved in response, eventually turning into the spaces many of us live in today.\n\nThat transformation from ‘one pioneer’s homestead’ to ‘sprawling urban cityscape’ happened slowly. It was *evolution by addition* as the area organically grew larger and larger to meet the needs of more and more citizens.\n\nYet, somewhere along the way a new method of developing the physical world came into existence, and it goes like this: A real estate developer takes a giant loan and buys a large amount of property. Homes are built, all at once, in a cookie-cutter fashion. The homes are then sold, one by one, and the neighborhood is complete.\n\n![2010s-era subdivision](https://images.mirror-media.xyz/publication-images/4defc3f7-4def-46bb-b1cd-bccc6acabac6.jpeg?height=541&width=1024)\n\nThat’s it! There’s no *adding* on to the community in a meaningful way. No new land can be purchased and built upon. There’s no *evolving* the neighborhood. It’s ‘finished’ — which means that the only paths forward are stagnation, staying just as it is, or decline, falling into disrepair.\n\nOur society has grown accustomed to not only our *physical* spaces existing in this finished state, but our *digital* spaces as well — and that’s a problem. \n\nToday’s internet has felt like a suburb for some time now; with the monoliths providing us with our platforms and networks buying up land and selling it to us in a cookie-cutter fashion — and just as the suburbs from the late 90s and early 2000s are now falling into stagnation or decline, so too is the suburb that is ‘Web 2.0’.\n\nThe good news is that there’s a new digital frontier opening up. The world of web3 is providing space for us to find new soil, to take a stake on a piece of land and make something new, and to once again *create our own paths forward*. \n\nNow is the time to reclaim the optimism from the early days of the web as we take risks to create a future we’re proud of.\n\nAnd it's early days yet.", "timestamp": 1619736742, "digest": "-p6EVGFaQuvY8cECK-HEP6zF_tbitIn94qHT6VUb2LU", "contributor": "0xc7A0D765C3aF6E2710bA05A56c5E2cA190C2E11e"}
{"id": "0qqLLPiEyA2Dsm48j6NAyRaz0xjKt-isAcb5DFRprOQ", "title": "test", "body": "test\n\n[Funzies](crowdfund://0xa901f97bf228EC96e7c24843fe3D457985632266?network=rinkeby)", "timestamp": 1619737462, "digest": "oQ8xql8YyJPA8V018lgdVmYSMWiatbxC_L4BdwWM6lI", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c"}
{"id": "JRDPB1Uk3ZCw6ZLvLK94okW6xPi1LUWXoWJQYqNQjM0", "title": "Packy test v3", "body": "[Token #1332](auction://0x7c2668bd0d3c050703cecc956c11bd520c26f7d4?network=rinkeby&tokenId=1332)", "timestamp": 1619738142, "digest": "1FsTSCJuMJHcFTd0_N8Q6KTOdr7o9mm7pHW64Onkqx8", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0xb6d957c9c6045fb1d7ad382b8cced6a09c41ebd4d3909e861c37253af125c6de\"}"}
{"id": "n_KNZXvOs68VcEVX3MfziJlObK1rQ1KSl-FWMHgA1ws", "title": "Packy test v3", "body": "[Token #1346](auction://0x7c2668bd0d3c050703cecc956c11bd520c26f7d4?network=rinkeby&tokenId=1346)", "timestamp": 1619738315, "digest": "1FsTSCJuMJHcFTd0_N8Q6KTOdr7o9mm7pHW64Onkqx8", "contributor": "0x942cBEa64876Ff0b2e23c0712B37Dc0091804e9c", "nft": "{\"nftTransactionHash\": \"0xb6d957c9c6045fb1d7ad382b8cced6a09c41ebd4d3909e861c37253af125c6de\"}"}
{"id": "AExyKwkLWUuLnMz6wBHa3_WcHtPoD1rcpGQcyHUgso8", "title": "Funding Friday: Beach Lovers: A NYC Summer Love Story", "body": "One of the many things I love about Kickstarter is when a friend backs a project, I am alerted. My friend Kirk went on a binge yesterday and backed a half dozen photo book projects and I followed him on that binge.\n\nI thought I’d blog about one of the projects we backed today.\n\nNYC is many things, and one of them is a beach town. In the summer, the beaches of south Brooklyn and Queens (Rockaway) fill up with NYers of all ages and ethnicities. It is like the subway, a total melting pot.\n\n[This photo book project](https://www.kickstarter.com/projects/beachlovers/beach-lovers-a-nyc-summer-love-story) celebrates those beaches and the couples who fill them up in the summer months.\n\nYou can see the video [here](https://www.kickstarter.com/projects/beachlovers/beach-lovers-a-nyc-summer-love-story).\n", "timestamp": 1619780412, "digest": "R__-xW5JCMIc8Bmw0-6OC1YRXjKeSfxt-2ZA3wPYLu0", "contributor": "0xB8332710AB60A1B2e8FE6D775d83524C9E0cE136"}
{"id": "U-HvdybCTFZ40QkOVfhf9HlaclXaMBjk16K4MWeVLeo", "title": "PILLS Story Mode", "body": "\n\n![](https://images.mirror-media.xyz/publication-images/8f422e2b-8874-4db4-a12c-a9eff4965121.png?height=2048&width=2880&size=large)\n\n## Ethereum contains an entire world of pseudonymous characters, obscure memes, mindbending projects, arcane mechanics and epic historical events rich in storytelling potential.\n\n### Within this seed is an original narrative universe waiting to emerge.\n<br /><br /><br /><br />\nPILLS Story Mode is a narrative wrapper around Ethereum. A “Cinematic Universe” ready to unfold on-chain. Unlike popular, large-scale narrative universes of the past - Dune, the MCU, Star Wars, Warcraft, Lord of the Rings, Discworld, Warhammer, etc. - The *PILLS Cinematic Universe* is co-created by its community. Over time, you'll populate it with characters, creatures, artifacts and locations, shape how the project evolves, and ultimately possess collective ownership over it, too. \n\nWith Story Mode, PILLS is setting out to create a valuable, long-term, community-owned project with endless narrative potential that can support anyone who helps contribute to it.\n\nStory Mode Alpha begins today.\n\n\n# Vision\n### What might PILLS Story Mode look like? \n![](https://images.mirror-media.xyz/publication-images/1f2d3b80-07be-46d0-a8b6-98681e3b3b60.png?height=2400&width=3000&size=medium)\n##### *The Yield Lord Andre ● A major character*\n\n**Imagine** a mix of [Cave of Qud’s](https://www.cavesofqud.com/) massive worldbuilding, a Miyazaki-animated version of Akira and the multi-layered gameplay of [Dwarf Fortress](https://www.bay12games.com/dwarves/) featuring community-created characters, all wrapped up in lightweight MMORPG mechanics.\n \n**Imagine** a collection of competing \"Quest Masters\" elected by the community to design and run interactive on-chain quests that expand the narrative and world in new directions. \n\n**Imagine** an augmented reality layered over Ethereum, in which the actions of the players within the narrative world have a tangible effect outside of it.\n\n**Imagine** generative character creation and player-run factions competing to canonize their own ideologies and funded by their own intra-group currencies within a wider economy.\n\n**Imagine** major characters collectively owned and controlled by DAOs using a mix of governance models.\n\n**Imagine** a narrative storehouse: Story Mode's entire collection of people, artifacts, locations, histories, and events - that any community member has the right to develop, explore and earn royalties on.\n\nThis is an intentionally outlandish vision. A mind-expanding exercise to help us consider how the crypto mechanisms at our disposal can create something previously impossible.\n\n# A Narrative Foundation\nFor the past three months we've been creating a stable foundation for PILLS Story Mode. The descriptions behind [specific pills](https://www.pills.forsale/pills) and the art [we've shared on Twitter](https://www.twitter.com/pillheadddd) all hint at key aspects of this world - its characters, storylines, tensions, and more.\n\nA small, tight-knit team is best adapted to developing the consistent vision necessary to create a coherent world.* Yet we believe this must be balanced with a community that possesses an equal voice in the creative development of the universe.\n\nWe're starting with two methods for empowering creative community contributions: **Character Creation** and **Quests**.\n\n## Character Creation\n\n### Major Characters\nEach major character in the PILLS universe has an incomplete \"origin story\". PILL holders can \"fill in the blanks\" by voting to resolve the mystery of the character's origins - the puzzle of their backstory, motivations and allegiences. The choices with the most votes are the canonized into the lore of the universe, forming the basis for the character's starting position and subsequent stories.\n\n\nSome origin stories can be voted on by anyone [in possession of any pill](https://www.pills.forsale/pills). Some require you to hold a specific pill.\n\nThe first major character to go through Character Creation is The Unigod. Tomorrow, on May 1st [anyone holding a Unipill](https://www.pills.forsale/unipill) is able to vote. Got one? [Visit the Unigod snapshot page](https://snapshot.org/#/unigod.storymode.eth/).\n\n![](https://images.mirror-media.xyz/publication-images/9dbdd076-6aed-4f59-813a-172f1e8c0e9e.jpeg?height=2232&width=3200&size=medium)\n##### *The Unigod ● A major character*\n\n\n### Minor Characters\nYou can begin exploring the [Story Mode site](https://storymode.pills.forsale) and plotting out your own character, today. As the Narrative Foundation expands, there'll be more material to guide you.\n\nWe've just begun sketching out our on-chain character creation system, and will share development updates in time.\n\n\n## Quests\nIn *Story Mode*, quests are interactive, on-chain experiences currently setup by the Core Creative Team and directed by the community. How a quest unfolds is solely up to the participants, although the core team - playing as NPCs - might prompt, cajole, or sow dissent along the way.\n\nQuests might dramatically collapse, reach a coherent narrative conclusion, or simply fade out..... only to be suddenly brought back to life from out of nowhere.\n\nWhat unfolds during the quest is then recorded into the lore of the universe, ready to be used as the catalyst for new stories. Some quests will be accessible to anyone. Others will have pre-requisites to participate. Unique rewards may also be available to participants depending on how and where a quest concludes.\n\n### Our proto-quest, The Shadowpakt\n\n![](https://images.mirror-media.xyz/publication-images/54b90330-25c8-4732-8758-b3e9970fb7be.jpeg?height=2250&width=4000)\n##### *Members of The Shadowpakt*\n\nOur first prototype quest is [The Shadowpakt](https://www.pills.forsale/quests/shadowpakt) which launched successfully last week. It has confused some, amused more and been [derided as a scam by Pak](https://twitter.com/muratpak/status/1384568323132825601) who is completely oblivious to its role and function in our universe.\n\n![](https://images.mirror-media.xyz/publication-images/530fc4d0-be18-4dc7-9fb9-fec2744beeaf.jpeg?height=462&width=1180)\n\n\nIn the quest, [The Shadowpakt](https://www.pills.forsale/quests/shadowpakt) is a DAO that exists to realize the will of a major PILLS character - *The Shadowpak* - an inverse version of Pak, \"made of burnt NFTs and $ASH\". It seeks to create and maintain The Cycle - a process in which all of Pak's artworks are acquired and held hostage, or burnt for $ASH and replaced by derivative pieces. How the *Pakt* collectively decides to achieve this goal will be at their discretion. \n\n![](https://images.mirror-media.xyz/publication-images/8a8144b4-57c4-4c61-a07f-4755d275a0e2.png?height=1150&width=1200)\n##### *The Shadowpak ● A major character*\n\n---\n\n# What's next?\n\nStory Mode Alpha is a first step, focused on creating and testing the infrastructure needed to enable a thriving, community-directed narrative universe. During *Alpha*, we're:\n\n**Improving community support**\nThe launch of Story Mode gives more opportunity for community involvement in the project's development. We need better systems in place to make this easier.\n\n**Developing a new v2 contract**\nOur new, modular contract suite has the flexibility to support different distribution methods, novel redemption mechanisms and new functionality like pill upgrades.\n\n**Launching the Story Mode site**\nWe've developed [a new, custom site](https://storymode.pills.forsale) to store the canonical creative material from the PILLS Cinematic Universe. \nEverything on the site will be available to the community to use and develop, under a permissive license decided upon with the community.\n\n**Building the Story Mode's \"Narrative Foundation\"**\nWe're actively developing the characters, artifacts and locations we've shortlisted to comprise this *Narrative Foundation*. Expect to see them published to the [the Story Mode site](https://storymode.pills.forsale).\n\n**Expanding PILL utility**\nToday, anyone in possession of a PILL can vote in Character Creation and participate in project governance. New utility will be developed over time.\n\n**Developing our \"Quest System\"**\nAs we learn how to structure and run on-chain quests, we want to collaborate with community members to develop and test a consistent, repeatable *Quest System*.\n\n**Onboarding Quest Masters**\nAs we better understand the viability of our quest system, we want to actively help community members design, launch, and manage their own quests within the PILLS universe.\n\n---\n\n# Help create a universe\nThis vast space contains millions of blocks of history with undiscovered pockets of life resting upon ancient mechanisms that keep everything turning. Much remains unknown. [Let's discover what's out there, together](https://discord.gg/UaK2RKycBa).\n\n\n### Are you a project, protocol, community or DAO on Ethereum?\nWe're actively narrativizing everything and everyone on Ethereum and weaving them into the PILLS universe. If you're interested in learning what we have planned for you, want to sponsor a quest to explore the universe with us, or support our creative community, [just DM Pillhead](https//www.twitter.com/pillheadddd)\n\n---\n\n## You can also:\n\n→ [Join the discord](https://discord.gg/UaK2RKycBa)\n\n→ [Keep up to date on Twitter](https://www.twitter.com/pillheadddd)\n\n→ [Learn more about the PILLS universe\n](https://storymode.pills.forsale)\n\n→ [Collect some PILLS on the secondary market](https://opensea.io/assets/pills)", "timestamp": 1619794491, "digest": "K4o9PkOtOmzaoSjbd1Wq1eA4kwX3cn1V-sGrcnl0c2g", "contributor": "0x0f1C01d98AE190Ad2739a6075B21C2343d8b412e"}
{"id": "ue251e9rvbtJLdV3uzqkmH2sitfVztx2RSbshgHwY3A", "title": "PILLS Story Mode", "body": "\n\n![](https://images.mirror-media.xyz/publication-images/8f422e2b-8874-4db4-a12c-a9eff4965121.png?height=2048&width=2880&size=large)\n\n## Ethereum contains an entire world of pseudonymous characters, obscure memes, mindbending projects, arcane mechanics and epic historical events rich in storytelling potential.\n\n### Within this seed is an original narrative universe waiting to emerge.\n<br /><br /><br /><br />\nPILLS Story Mode is a narrative wrapper around Ethereum. A “Cinematic Universe” ready to unfold on-chain. Unlike popular, large-scale narrative universes of the past - Dune, the MCU, Star Wars, Warcraft, Lord of the Rings, Discworld, Warhammer, etc. - The *PILLS Cinematic Universe* is co-created by its community. Over time, you'll populate it with characters, creatures, artifacts and locations, shape how the project evolves, and ultimately possess collective ownership over it, too. \n\nWith Story Mode, PILLS is setting out to create a valuable, long-term, community-owned project with endless narrative potential that can support anyone who helps contribute to it.\n\nStory Mode Alpha begins today.\n\n\n# Vision\n### What might PILLS Story Mode look like? \n![](https://images.mirror-media.xyz/publication-images/1f2d3b80-07be-46d0-a8b6-98681e3b3b60.png?height=2400&width=3000&size=medium)\n##### *The Yield Lord Andre ● A major character*\n\n**Imagine** a mix of [Cave of Qud’s](https://www.cavesofqud.com/) massive worldbuilding, a Miyazaki-animated version of Akira and the multi-layered gameplay of [Dwarf Fortress](https://www.bay12games.com/dwarves/) featuring community-created characters, all wrapped up in lightweight MMORPG mechanics.\n \n**Imagine** a collection of competing \"Quest Masters\" elected by the community to design and run interactive on-chain quests that expand the narrative and world in new directions. \n\n**Imagine** an augmented reality layered over Ethereum, in which the actions of the players within the narrative world have a tangible effect outside of it.\n\n**Imagine** generative character creation and player-run factions competing to canonize their own ideologies and funded by their own intra-group currencies within a wider economy.\n\n**Imagine** major characters collectively owned and controlled by DAOs using a mix of governance models.\n\n**Imagine** a narrative storehouse: Story Mode's entire collection of people, artifacts, locations, histories, and events - that any community member has the right to develop, explore and earn royalties on.\n\nThis is an intentionally outlandish vision. A mind-expanding exercise to help us consider how the crypto mechanisms at our disposal can create something previously impossible.\n\n# A Narrative Foundation\nFor the past three months we've been creating a stable foundation for PILLS Story Mode. The descriptions behind [specific pills](https://www.pills.forsale/pills) and the art [we've shared on Twitter](https://www.twitter.com/pillheadddd) all hint at key aspects of this world - its characters, storylines, tensions, and more.\n\nA small, tight-knit team is best adapted to developing the consistent vision necessary to create a coherent world.* Yet we believe this must be balanced with a community that possesses an equal voice in the creative development of the universe.\n\nWe're starting with two methods for empowering creative community contributions: **Character Creation** and **Quests**.\n\n## Character Creation\n\n### Major Characters\nEach major character in the PILLS universe has an incomplete \"origin story\". PILL holders can \"fill in the blanks\" by voting to resolve the mystery of the character's origins - the puzzle of their backstory, motivations and allegiences. The choices with the most votes are the canonized into the lore of the universe, forming the basis for the character's starting position and subsequent stories.\n\n\nSome origin stories can be voted on by anyone [in possession of any pill](https://www.pills.forsale/pills). Some require you to hold a specific pill.\n\nThe first major character to go through Character Creation is The Unigod. Tomorrow, on May 1st [anyone holding a Unipill](https://www.pills.forsale/unipill) is able to vote. Got one? [Visit the Unigod snapshot page](https://snapshot.org/#/unigod.storymode.eth/).\n\n![](https://images.mirror-media.xyz/publication-images/9dbdd076-6aed-4f59-813a-172f1e8c0e9e.jpeg?height=2232&width=3200&size=medium)\n##### *The Unigod ● A major character*\n\n\n### Minor Characters\nYou can begin exploring the [Story Mode site](https://storymode.pills.forsale) and plotting out your own character, today. As the Narrative Foundation expands, there'll be more material to guide you.\n\nWe've just begun sketching out our on-chain character creation system, and will share development updates in time.\n\n\n## Quests\nIn *Story Mode*, quests are interactive, on-chain experiences currently setup by the Core Creative Team and directed by the community. How a quest unfolds is solely up to the participants, although the core team - playing as NPCs - might prompt, cajole, or sow dissent along the way.\n\nQuests might dramatically collapse, reach a coherent narrative conclusion, or simply fade out..... only to be suddenly brought back to life from out of nowhere.\n\nWhat unfolds during the quest is then recorded into the lore of the universe, ready to be used as the catalyst for new stories. Some quests will be accessible to anyone. Others will have pre-requisites to participate. Unique rewards may also be available to participants depending on how and where a quest concludes.\n\n### Our proto-quest, The Shadowpakt\n\n![](https://images.mirror-media.xyz/publication-images/54b90330-25c8-4732-8758-b3e9970fb7be.jpeg?height=2250&width=4000)\n##### *Members of The Shadowpakt*\n\nOur first prototype quest is [The Shadowpakt](https://www.pills.forsale/quests/shadowpakt) which launched successfully last week. It has confused some, amused more and been [derided as a scam by Pak](https://twitter.com/muratpak/status/1384568323132825601) who is completely oblivious to its role and function in our universe.\n\n![](https://images.mirror-media.xyz/publication-images/530fc4d0-be18-4dc7-9fb9-fec2744beeaf.jpeg?height=462&width=1180)\n\n\nIn the quest, [The Shadowpakt](https://www.pills.forsale/quests/shadowpakt) is a DAO that exists to realize the will of a major PILLS character - *The Shadowpak* - an inverse version of Pak, \"made of burnt NFTs and $ASH\". It seeks to create and maintain The Cycle - a process in which all of Pak's artworks are acquired and held hostage, or burnt for $ASH and replaced by derivative pieces. How the *Pakt* collectively decides to achieve this goal will be at their discretion. [You can learn more about the meta-level quest details here](https://pills.mirror.xyz/wvERkEwq-0QjWgsQ0IL_d-ieRJWc5vogeKx_VSEdJKE).\n\n![](https://images.mirror-media.xyz/publication-images/8a8144b4-57c4-4c61-a07f-4755d275a0e2.png?height=1150&width=1200)\n##### *The Shadowpak ● A major character*\n\n---\n\n# What's next?\n\nStory Mode Alpha is a first step, focused on creating and testing the infrastructure needed to enable a thriving, community-directed narrative universe. During *Alpha*, we're:\n\n**Improving community support**\nThe launch of Story Mode gives more opportunity for community involvement in the project's development. We need better systems in place to make this easier.\n\n**Developing a new v2 contract**\nOur new, modular contract suite has the flexibility to support different distribution methods, novel redemption mechanisms and new functionality like pill upgrades.\n\n**Launching the Story Mode site**\nWe've developed [a new, custom site](https://storymode.pills.forsale) to store the canonical creative material from the PILLS Cinematic Universe. \nEverything on the site will be available to the community to use and develop, under a permissive license decided upon with the community.\n\n**Building the Story Mode's \"Narrative Foundation\"**\nWe're actively developing the characters, artifacts and locations we've shortlisted to comprise this *Narrative Foundation*. Expect to see them published to the [the Story Mode site](https://storymode.pills.forsale).\n\n**Expanding PILL utility**\nToday, anyone in possession of a PILL can vote in Character Creation and participate in project governance. New utility will be developed over time.\n\n**Developing our \"Quest System\"**\nAs we learn how to structure and run on-chain quests, we want to collaborate with community members to develop and test a consistent, repeatable *Quest System*.\n\n**Onboarding Quest Masters**\nAs we better understand the viability of our quest system, we want to actively help community members design, launch, and manage their own quests within the PILLS universe.\n\n---\n\n# Help create a universe\nThis vast space contains millions of blocks of history with undiscovered pockets of life resting upon ancient mechanisms that keep everything turning. Much remains unknown. [Let's discover what's out there, together](https://discord.gg/UaK2RKycBa).\n\n\n### Are you a project, protocol, community or DAO on Ethereum?\nWe're actively narrativizing everything and everyone on Ethereum and weaving them into the PILLS universe. If you're interested in learning what we have planned for you, want to sponsor a quest to explore the universe with us, or support our creative community, [just DM Pillhead](https//www.twitter.com/pillheadddd)\n\n---\n\n## You can also:\n\n→ [Join the discord](https://discord.gg/UaK2RKycBa)\n\n→ [Keep up to date on Twitter](https://www.twitter.com/pillheadddd)\n\n→ [Learn more about the PILLS universe\n](https://storymode.pills.forsale)\n\n→ [Collect some PILLS on the secondary market](https://opensea.io/assets/pills)", "timestamp": 1619795060, "digest": "K4o9PkOtOmzaoSjbd1Wq1eA4kwX3cn1V-sGrcnl0c2g", "contributor": "0x0f1C01d98AE190Ad2739a6075B21C2343d8b412e"}
{"id": "Y5xfCHv79XpLUjlwLev-DO1UWiCl9GLrWuNBrUQJ07Y", "title": "The Shadowpakt", "body": "\n![](https://images.mirror-media.xyz/publication-images/54b90330-25c8-4732-8758-b3e9970fb7be.jpeg?height=2250&width=4000&size=large)\n##### *Members of The Shadowpakt*\n\n### [The Shadowpakt](https://www.pills.forsale/quests/shadowpakt) is the first, prototype quest in the PILLS universe.\n\nIn this quest, an entity known as *[The Shadowpak](https://www.twitter.com/theshadowpak)* has materialized in Chainspace, seeking to initiate and sustain *The Cycle:* A process of finding, acquiring, hoarding and/or burning PAK pieces for the $ASH token, and then replacing them with Shadowpak derivitives.\n\n## The Cycle\n\n01. Raise ETH\n02. Buy PAKs\n03. Burn PAKs\n04. Earn $ASH\n05. Remake PAKs\n06. As Shadowpaks\n07. Sell Shadowpaks\n08. Earn ETH\n09. Buy PAKs\n10. Burn Paks\n11. Repeat\n\n![](https://images.mirror-media.xyz/publication-images/8a8144b4-57c4-4c61-a07f-4755d275a0e2.png?height=1150&width=1200&size=medium)\n##### *The Shadowpak ● A major character*\n\nThe Shadowpak has begun initiating willing members into *The Shadowpakt*, a DAO intended to initiate and maintain *The Cycle*. What will they decide to do?\n\n- Collect and burn as many of Pak's \"cubes\" as possible?\n\n- Acquire PAK pieces, hold them \"hostage\" and then release Shadowpak-equivalents in their place?\n\n- Fork and vampire attack the $ASH token?\n\n\nWill the members of the Pakt act selflessly, without reward? Or seek to profit from their actions? Will they decide to restrict membership? Or open it up? Could they try and engage with PAK itself? \n\nThese are a handful of the many questions and open paths available to the Shadowpakt quest participants.\n\n## Become initiated\n\nInterested in joining the Pakt? The Shadowpak currently seeks one of the following for entry:\n\n1. [Purchase a Shadowpak pill for 1ETH](https://www.pills.forsale/shadowpak)\n2. Trade 2 cubes\n3. Or trade 1 cube and 0.5ETH\n\nOnce acquired, DM `Shadowpak` in the [PILLS discord](https://discord.gg/UaK2RKycBa) to begin the initiation.\n\n\n**Remember:** All funds raised go directly into a shared treasury owned and governed collectively by the Shadowpakt membership via [Snapshot](https://snapshot.org/#/shadowpakt.storymode.eth/).\n\n---\n\n# FAQ\n\n## What are PILLS?\nPILLS are crypto-collectibles containing a character, artifact, entity or object from the PILLS universe. \n\n## What is \"PILLS Story Mode\"\n\nIn *PILLS Story Mode*, we're co-creating an entire narrative universe on-chain in collaboration with our core creative team, the PILLS community and different projects and protocols on Ethereum. You can read more about it [here](https://pills.mirror.xyz/K4o9PkOtOmzaoSjbd1Wq1eA4kwX3cn1V-sGrcnl0c2g).\n\n\n## What are quests?\nQuests are interactive on-chain experiences setup to explore and develop characters, locations and factions in the PILLS universe. \n\nCurrently, each quest narrative is designed by the Core Creative Team, with quest participants then determining how the quest ultimately unfolds.\n\nThe outcome of each quest and the decisions made by the quest participants shape the lore of the universe and are recorded in the canonical [Story Mode site](https://storymode.pills.forsale).\n\n\n## Why quests?\nQuests enable a [call-and-response](https://en.wikipedia.org/wiki/Call_and_response_(music)) collaboration between the Core Creative Team and quest participants. It lets us empower the community to shape the narrative universe **and** maintain narrative consistency at the same time.\n\n\nThe collaborative and open-ended nature of the quest format also offers a more accessible and engaging approach to narrative development than seeking traditional creative writing submissions from the community.\n\nPlus being on-chain means we can experiment with composing different projects and protocols together - often in new ways - to create different types of \"gameplay\".\n\n## Can I help run quests?\nYes! We're actively looking to collaborate with community members interested in becoming \"Quest Masters\" to come up with compelling quests that explore different parts of the universe. [Just join the discord](https://discord.gg/UaK2RKycBa) and raise your hand in the #quests channel.\n\n## Where can I learn more?\n\n→ [Discover the PILLS universe\n](https://storymode.pills.forsale)\n\n→ [Join the PILLPORTAL discord](https://discord.gg/UaK2RKycBa)\n\n→ [Stay up to date on Twitter](https://www.twitter.com/pillheadddd)\n\n→ [Purchase a Shadowpak pill and join the Shadowpakt](https://www.pills.forsale/shadowpak)\n\n\n", "timestamp": 1619794990, "digest": "wvERkEwq-0QjWgsQ0IL_d-ieRJWc5vogeKx_VSEdJKE", "contributor": "0x0f1C01d98AE190Ad2739a6075B21C2343d8b412e"}
